{"title":"La.Rivolta.Delle.Ex.2009.iTALiAN.LD.TS.XviD-SiLENT[Ultima Fronti","uid":4986300,"size":728029184,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0006542313e7db3641e248512be0a635584ae648&amp;dn=La.Rivolta.Delle.Ex.2009.iTALiAN.LD.TS.XviD-SiLENT%5BUltima+Fronti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"confe90","files":1,"time":1246724271,"description":"La Rivolta delle Ex (2009)\n.::Locandina::.\n\n[IMG]http://img219.imageshack.us/img219/6560/larivoltadelleex.jpg[/img]\n\n\n.::Scheda::.\n\nTitolo originale: Ghosts of Girlfriends Past\nNazione: U.S.A.\nAnno: 2009\nGenere: Commedia, Romantico\nDurata: 98'\nRegia: Mark Waters\n\nProduzione: New Line Cinema\nDistribuzione: Warner Bros.\nData di uscita: 03 Luglio 2009 (cinema)\n\n\n.::Cast::.\n\nMatthew McConaughey, Jennifer Garner, Michael Douglas, Breckin Meyer, Lacey Chabert, Robert Forster, Anne Archer, Emma Stone, Noureen DeWulf, Amanda Walsh, Rachel Boston, Erin Wyatt\n\n\n.::Trama::.\n\nUn fotografo di moda di successo, Connor Mead, ÃƒÂ© una persona molto sicura di sÃƒÂ© ed ÃƒÂ© noto per essere un infallibile play-boy. Durante la festa per le nozze del fratello minore, perÃƒÂ², verrÃƒÂ  perseguitato dai fantasmi delle sue ex. Questi strani fatti, faranno maturare in lui una strana sensazione e la volontÃƒÂ  di tornare indietro sui suoi passi...[/b]\n\n\n.::Recensione::.\n\nConnor Mead ÃƒÂ¨ un fotografo famoso, popolare ed estremamente donnaiolo che lavora nel campo della moda. In occasione delle nozze del fratello minore si reca nella magione di famiglia. Questo ritorno al passato diventa un'occasione per rivedere la propria vita, grazie all'apparizione di tre spettri che in una notte cercano di condurre Connor sulla retta via. Il titolo originale, &quot;I fantasmi delle ex passate&quot;, ÃƒÂ¨ ancora piÃƒÂ¹ esplicito nel suo richiamo al &quot;Canto di Natale&quot; di Dickens, forse uno dei testi piÃƒÂ¹ saccheggiati, dal cinema alla televisione, degli ultimi settant'anni. Numerosi esempi corrono alla mente, dalla &quot;Vita ÃƒÂ¨ meravigliosa&quot; di Capra fino a al classico episodio tematico dei &quot;Simpson&quot;. La citazione del classico dickensiano ormai si appoggia su una base cosÃƒÂ¬ consolidata nell'immaginario collettivo da essere quasi rassicurante per pubblico e produttori. Si puÃƒÂ² dire che il &quot;Canto di Natale&quot; sia una specie di format: giÃƒÂ  solo l'aspetto degli spettri o la rappresentazione della vita del protagonista sono sufficienti ad attirare la curiositÃƒÂ  degli spettatori.\n\nNel caso della &quot;Rivolta delle ex&quot; il tipo di &quot;malattia&quot; che Connor Mead deve curare non ÃƒÂ¨ perÃƒÂ² l'incapacitÃƒÂ  di amare gli esseri umani, ma gli esseri femminili in particolare. Il protagonista dovrÃƒÂ  imparar ad amare quelle donne (o in particolare quella donna, Jennifer Garner) fino a quel momento usati come oggetti nella classica tradizione - o verrebbe da dire: macchietta- maschilista.\nSembra quasi emblematico che i due ruoli maschili piÃƒÂ¹ forti siano ricoperti da due attori molto famosi come donnaioli, dentro e al di fuori del set, come Matthew McConaughey e Micheal Douglas. In effetti gran parte del film si poggia sull'effetto Micheal Douglas, l'unico attore dotato di un minimo di carisma e di quell'autoironia atta a rendere il film piÃƒÂ¹ leggero. Il resto della formula della Rivolta ÃƒÂ¨ dato soprattutto dal giÃƒÂ  citato &quot;format&quot;, ormai piÃƒÂ¹ famoso della favola di cappuccetto rosso. Unico altro ingrediente del film sono le doti da seduttore di McConaughey, il cui personaggio dall'inizio alla conclusione non riesce a pensare ad altro che alla conquista e al successivo abbandono di donne sempre nuove.\n\nLa redenzione di questo ibrido fra Scrooge e Don Giovanni ÃƒÂ¨ naturalmente inevitabile e zuccherosa oltre ogni limite, tuttavia qualche risata viene strappata nei punti giusti, e qualche piccola trovata riesce a dare una scossetta al piattume generale che altrimenti affliggerebbe senza speranza questa pellicola.\nSicuramente non ÃƒÂ¨ uno dei peggiori film che abbia interpretato McConaughey, che forse sta iniziando a scegliere le proprie parti in maniera piÃƒÂ¹ oculata. Certo, aspettarsi nel prossimo futuro la sua migliore interpretazione sembra alquanto azzardato, ma nella vita non si sa mai.\n\nLa frase: &quot;Quello che non sarÃƒÂ  per il tuo bene sarÃƒÂ  per il mio divertimento!&quot;.\n\n\n.::Trailer::.\n\n\n\n.::Voto A/V::.\n\nAudio 8.0\nVideo 6.5\n","torrent":{"xt":"urn:btih:0006542313e7db3641e248512be0a635584ae648","amp;dn":"La.Rivolta.Delle.Ex.2009.iTALiAN.LD.TS.XviD-SiLENT%5BUltima+Fronti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0006542313e7db3641e248512be0a635584ae648","infoHashBuffer":{"type":"Buffer","data":[0,6,84,35,19,231,219,54,65,226,72,81,43,224,166,53,88,74,230,72]},"announce":[],"urlList":[]}}