{"title":"Image Line FL Studio XXL v9.0.1 (UNION Release) [RH]","uid":5174222,"size":197760293,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:00f2ffe0ef9316f13a7dc2270a2869b43833e11f&amp;dn=Image+Line+FL+Studio+XXL+v9.0.1+%28UNION+Release%29+%5BRH%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RobbingHood","files":1,"time":1258866393,"description":"\n\n\n   .-._______                                                         _______.-.\n--( )_)______)    Image Line FL Studio XXL v9.0.1 (UNION Release)    (______(_( )--\n (    ()___)                                                           (___()    )\n      ()__)                                                             (__()\n-(___()_)                                                                 (_()___)-\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n SPONSORED LINK                    SPONSORED LINK                   SPONSORED LINK\n ^^^^^^^^^^^^^^                    ^^^^^^^^^^^^^^                   ^^^^^^^^^^^^^^\n&lt;---------------------------------------------------------------------------------&gt;\n\nFL Studio Support Website for all FL Studio Products &amp; all FL Studio Cracks:   &lt;a href=&quot;\nhttp://www.flstudio.com/documents/support.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.flstudio.com/documents/support.html&lt;/a&gt;\n\nNOTE: Please do not forget to leave behind as much information as possible  \nabout where the product is from and about your personal identification data. \nYou'll then be contacted as soon as possible by the FL Studio Support Team! \n\n\nThank you for choosing FL Studio,\n\nThe FL Studio Support Team\n\n&lt;---------------------------------------------------------------------------------&gt;\n&lt;---------------------------------------------------------------------------------&gt;\n\n\n\n                  Image Line FL Studio XXL v9.0.1 (UNION Release)\n\n\n\nVSTi included:\n\n- Hardcore.dll \n- PoiZone.dll \n- Sakura.dll \n- Sawer.dll \n- Toxic Biohazard.dll\n\n\nFL Studio, formerly known as FruityLoops, is a full-featured, open architecture, \nmusic production environment capable of audio recording, composing, sequencing \nand mixing, for the creation of professional quality music. FL Studio can be used \nas a scratchpad for your ideas or to produce completely mastered tracks ready for \npublication. FL Studio will play any sample, VSTi, DXi or Buzz plugin fed into it \nand also comes with its own generators (softsynths) and effects (filters). \nYou'll be creating wav, mp3, midi songs, or loops only minutes after launching it. \n\nFL Studio is a Digital Audio Workstation (DAW) for Windows PCs (also available \nforIntel Mac/Bootcamp) and is a complete software music production environment, \nrepresenting the culmination of more than 10 years of sustained and focused \ndevelopment. FL9 is the fastest way from your brain to your speakers.\n\nFL Studio utilizes MIDI and DirectSound (internal mixing), 16-bit 44KHz stereo \noutput, and 32-bit floating-point internal mixing. You'll also get support for \nVST plug-ins, as well as individual panning, volume, pitch, mix, resonance, and \ncutoff on each note.\n\nFL Studio is a full-featured sequencer perfectly suited for creation of complex \nsongs and realistic drum loops, with 32 bit internal mixing and advanced MIDI \nsupport. The resulting song or loop can be exported to a WAV/MP3 file and all \nMIDI events can be exported to a standard MIDI file.\n\nFruity Loops Studio is a pattern based sequencer meaning you can create your songs \nin pieces (patterns) using the Step Sequencer and the Piano Roll view and then \nweld those pieces together using the Playlist window (the Playlist also supports \nfull-feature). Then you can add a wide range of effects to your instruments \n(reverb, phaser, flanger etc.) and route the resulting mixer tracks in any way \nyou like to create complex mixing chains with ease.\n\nThe FL Studio philosophy is creative freedom. \n\n\n\nHere are some key features of FL Studio:\n\n* Internal 32 bit floating point mixing, up to 96kHz stereo.\n* Supports DirectSound and ASIO enabled sound cards for audio output.\n* Ability to function as a VSTi, DXi and a ReWire client.\n* Ability to host ReWire clients itself.\n* Realtime linear interpolation &amp; sophisticated interpolation algorithms at \n  rendering time.\n* Open architecture allowing third-party instruments (enhanced proprietary \n  FL instruments standard, VSTi and DXi2) and effects (enhanced proprietary \n  FL effects standard, VST, VST2 and DirectX).\n* A full set of high-precision mastering and special effects filters: reverb, \n  compressor, procedural equalizer, distortion, phaser, flanger, bass boost, \n  delay line and other.\n* Advanced sequencing methods allowing quick entering of realistic drum loops \n  (step sequencing grid) and composing complex instrumentals (advanced piano roll, \n  arpeggiator, keyboard tracking, real-time gate).\n* Unique note properties morphing ability (pitch, cutoff, resonance, panning).\n* Advanced mixer: 68 mixer tracks (64 insert and 4 send tracks) supporting up to \n  8 filters each; mixer tracks rerouting for creating of complex mixer chains; \n  track recording with ASIO input support (for recording MIDI, vocals etc.); \n  integrated procedural equalizer, volume and panning for each mixer track.\n* Integrated instruments: Sampler, TS404 (the popular bassline engine), 3xOSC \n  (subsynth), Plucked! (plucked strings), MIDI Out, DX10 (FM synth), Scratcher \n  (turntable emulator), WaveTraveller (wave bend synth), Wasp (demo), SimSynth \n  Live (demo), and more.\n* Advanced playlist &amp; full-featured audio tracks.\n* Live recording of control movements &amp; integrated automation events editor.\n* Easy MIDI remote controlling of most parameters (VST plugins supported as well).\n* Procedural control over parameters by using special controller plugins.\n* Click removal &amp; volume ramping to avoid pops.\n* Imports *.WAV, *.SYN (SimSynth 1 &amp; 2), *.DS (DrumSynth) files, with effects \n  applied.\n* Imports MIDI sequences and controller events.\n* Exports audio to 16Bit or 32Bit *.WAV file, *.MP3.\n* Can export MIDI notes &amp; controller events to a standard MIDI file.\n\n\nAdditions:\n\n* Added 'Sidechain to this track only' option in mixer.\n* Added 'Create submix to' option in mixer.\n* Added 'Override generic link...' to knob popup menu.\n* Slightly improved Sytrus rendering quality.\n* Double-clicking a playlist track edits its mostly used clip.\n* Speeded up refresh of multidirectional playlist scrolling.\n* Wrapper: added option to disable threaded processing for a specific \n  plugin, applies to any new instance of that plugin\n* FPC: added random triggering of overlapping layers\n* FPC: added DW program file import\n* DirectWave: added trigger groups\n* DirectWave: searches for samples in subfolder with the program's name \n  when loading a .dwp\n* FPC: pad menu now shows banks in separate columns instead of submenus\n* FPC: updated DW import\n* FPC: use improved randomization method\n* DirectWave: increased max size of zone and program name to 128\n* DirectWave: implemented new save/restore routine, unified across FL/VST \n  and dwp/dwb\n* Downloader: options window is now integrated in content library window\n* Downloader: clicking an cd/category will open or close it (no double-click \n  necessary)\n\n\nBugfixes:\n\n* Fixed minor bug when right-clicking mini piano roll view for immediate \n  jump in some cases.\n* Fixed minor browser bug.\n* Kb preview now works better as notes are released when selecting another channel.\n* Changed priority stuff when background rendering.\n* Fixed bug loading old projects with internal controllers in sends.\n* Fixed crash in Edison's scratching tool.\n* Fixed possible hang when using remote control with smoothing enabled.\n* FPC: fixed issue cutting preview voices\n* Wrapper: don't respond to &quot;update display&quot; messages during saving\n* Wrapper: input names were sometimes shortened\n* Wrapper: fixed deadlock when i/o changed\n* Fixed little Delphi memory leak.\n* Fixed crash in Fruity Stereo Shaper when both delay and phase were in use.\n* Wrapper: rewrote small part of DX plugin initialization\n* Wrapper: fixed loading old DX plugin state if plugin wasn't found\n* FPC: pad volume wheel resets to 100% instead of 0%\n* FPC: mute button now works correctly if there are multiple pads triggered \n  by the same semitone\n* FPC: deleting a layer would delete two instead of one\n* Downloader: custom download location wasn't used in some situations\n* Video Player: fixed &quot;Ignore tempo changes&quot;\n* DirectWave: fixed crash in VST sampling because of buffer overflow\n* DirectWave: read sample position offset fields from sf2 file (start, end, \n  loop start, loop end)\n* DirectWave: fixed zone voice count display\n* DirectWave: fixed visual representation of programs in library if their \n  names were too long\n\n\n\nMinimum System Requirements\n\n- 2Ghz AMD or Intel Pentium 3 compatible CPU with full SSE1 support\n  (or) Intel Mac with Bootcamp (running XP or Vista) \n- Windows 7, Vista, XP &amp; 2000 (32 &amp; 64 bit)\n- 512 MB RAM \n- 500 MB Free harddisk space \n- Windows-compatible soundcard with DirectSound drivers. ASIO drivers \n  are required for audio recording (FL installer comes with generic \n  Asio4All drivers)\n \n\n\nMore info: &lt;a href=&quot;\nhttp://flstudio.image-line.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flstudio.image-line.com/&lt;/a&gt;\n\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n&lt;---------------------------------------------------------------------------------&gt;\n\n\n\n&gt;&gt;&gt;When using TPB please read these important notes: \n****************************************************\n\n01- AV software may warn about keygens, patches, cracks etc because of their \n    capabilities and signatures (generating codes, etc). Sometimes also they're \n    added to the virus/spyware database and will be detected as malware. If not \n    trusting keygens, patches, cracks etc don't use them.\n\n02- To avoid AV software removing/blocking clean cracks etc: exclude the crack \n    or folder from being auto-protected &amp; auto-scanned by the AV software.\n\n03- If AV software removed a clean crack usually it can be restored \n    (if it's not in Quarantaine then look at History or something similar).\n\n04- To avoid risks when using cracks also Sandboxie can be used to test them:\n   &lt;a href=&quot; http://www.sandboxie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sandboxie.com/&lt;/a&gt;\n   &lt;a href=&quot; http://thepiratebay.se/torrent/4918844/Sandboxie_v3.38___Keys_[RH]&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/4918844/Sandboxie_v3.38___Keys_[RH]&lt;/a&gt;\n\n05- Before running .exe-files, keygens, patches, cracks etc always check first \n    if they can be unpacked. Often some thirth party added a virus to the \n    original file, repacked it, and uploaded it again.\n\n06- Letting AV software software sending scan results to their companies \n    can cause keygens, patches, cracks etc being added to their virus-database.\n\n07- Firewalls which are set to automatically decide for connections will allow \n    connections for lots of apps &amp; MALWARE!. To avoid so firewalls should be set \n    to decide yourself which connection to allow or not.\n\n08- Clicking on unknown links can coz malware being silently installed on a pc!\n\n09- Usually (new) torrents with extreme many downloads &amp; seeders in a short time \n    are very suspicious! Torrents with a SKULL-logo are trusted.\n\n10- Some (frustrated) people use multiple accounts and post lots of FAKE comments \n    and/or files trying to spread confusion. Usually they NEVER seriously reply \n    on comments and don't have any torrent, or to look reliable just a few.\n\n11- In general often there are more fake &amp; negative comments than reliable &amp; \n    positive comments.\n\n12- In some countries uploading/downloading copyright-protected material is \n    forbidden, but showing some appreciation to reliable uploaders is not.\n\n13- Posting FAKE comments &amp; uploads on TPB can result in getting banned from TPB!\n\n\nFor reporting bad or suspicious torrents:  &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nFor visiting &quot;TPB's Most Ridiculous Comments&quot;:  &lt;a href=&quot;\nhttp://forum.suprbay.org/showthread.php?tid=24699&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/showthread.php?tid=24699&lt;/a&gt;\n\nFor visiting my account*:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/RobbingHood/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RobbingHood/&lt;/a&gt;\n\n*All torrents scanned with:\n1- Norton Internet Security  \n2- Avast! Antivirus AV Pro  \n3- AVG Antivirus Pro   \n4- Kaspersky AV Pro  \n5- NOD32 AV  \n\nAlso scanned with reputed antispyware software. Reported malware \ndetected by other anti-malware software probably are false positives!\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n\n\nTo the &quot;United Reliable The Pirate Bay Users&quot;,\n\nNowadays a lot of TPB members abuse their TPB membership by intenionally posting \nfake comments &amp; files. Their meaning is just to spread confusion and try to \nfrustrate TPB and it's users. And less downloaders = less seeders = less \ndownloadspeed etc etc. \n\nIt's in the benefit of TPB and all reliable users to warn each other about people \nwho intenionally keep posting fake comments &amp; files. It's an easy answer against \nthose who intenionally keep posting fake comments &amp; files, which is a never \nending issue. \n\nWhen reporting errors or false positives just keep in mind that what goes up for \none does not always goes up for another. That's for both the working of an app \nand about false positives! Remember: whatever is said, say it constructive! \nLet's just try to help each other and TPB by thinking about what's said &amp; posted. \nThings are all up to you, the &quot;United Reliable The Pirate Bay Users&quot;!\n\n\nEnjoy The Pirate Bay\n                                         \n* Status torrent at November, 22 2009 - 03.45 CET: clean, tested &amp; working.","torrent":{"xt":"urn:btih:00f2ffe0ef9316f13a7dc2270a2869b43833e11f","amp;dn":"Image+Line+FL+Studio+XXL+v9.0.1+%28UNION+Release%29+%5BRH%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00f2ffe0ef9316f13a7dc2270a2869b43833e11f","infoHashBuffer":{"type":"Buffer","data":[0,242,255,224,239,147,22,241,58,125,194,39,10,40,105,180,56,51,225,31]},"announce":[],"urlList":[]}}