{"title":"KeyScrambler 2.8.0","uid":6425975,"size":1413545,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:00fd84596ca9452f5eac14ad0d650a62f07f1eae&amp;dn=KeyScrambler+2.8.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1306472003,"description":"KeyScrambler 2.8.0\n\nKeyScrambler encrypts your keystrokes deep in the kernel, foiling keylogging attacks with scrambled, undecipherable data.\n\nThis advanced method of keystroke protection defeats both known and unknown keyloggers.\n\nThe friendly interface displays realtime encrypted stream of keystrokes so you see when and how KeyScrambler is working.\n\nStrengthens where defenses are the weakest in your traditional anti-virus, anti-malware programs and PC security.\n\nCompare Editions\nA free browser add-on, KeyScrambler Personal protects all your inputs in IE, Firefox, and Flock. KeyScrambler Pro and Premium are paid programs that protect a wide array of apps.\n\nHow It Works\nKeyScrambler encrypts your keystrokes at the keyboard driver level and decrypts them at the destination application, giving keyloggers &quot;scrambled,&quot; useless keys to record.\n\nFor Online Games\nBoth KeyScrambler Pro and Premium protect your player's IDs, passwords and digital assets in over two dozen online games.\n\nFor Business\nRead how and why KeyScrambler is important for your business. KeyScrambler Premium protects critical systems and reduces risks of information theft at the workplace.\n\nFeatures\nKeyScrambler defeats known and unknown keyloggers; also protects Chinese, Japanese, and Korean inputs; is compatible with other security programs, tokens and smart cards; and requires no user effort.\n\nHow To\nThe user-friendly interface allows you to do things on KeyScrambler for a more comfortable, personalized fit.\n\nHome Page - http://www.qfxsoftware.com/\n\n","torrent":{"xt":"urn:btih:00fd84596ca9452f5eac14ad0d650a62f07f1eae","amp;dn":"KeyScrambler+2.8.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00fd84596ca9452f5eac14ad0d650a62f07f1eae","infoHashBuffer":{"type":"Buffer","data":[0,253,132,89,108,169,69,47,94,172,20,173,13,101,10,98,240,127,30,174]},"announce":[],"urlList":[]}}