{"title":"Corbin Fisher - - - Cade Fucks Mason [Part 2] ((MictrmbL))","uid":4999410,"size":169598090,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:01361f3043f642eb7515a0ea671297c78b9823bc&amp;dn=Corbin+Fisher+-+-+-+Cade+Fucks+Mason+%5BPart+2%5D+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mictrmbl","files":27,"time":1247441621,"description":"From the vaults of Corbin Fisher:\n\nCade's got a dick that was made to fuck. It's long, it's thick, and it's attached to a muscular stud who's got the strength and stamina to pound away, giving the lucky person on the receiving end of that fuck an overwhelming workout. When Cade came down here for his very first solo shoot and I was filming him rub one out and stroke that rod, I was giddy at the thought of seeing him bury that dick deep in to one of CF's other young men.\n\nAfter becoming quite the sensation here on CF when he gave Logan a royal fucking and then progressed through bottoming for Damon and Kyle, Mason was at the top of the list of candidates to take on Cade's big piece of meat. He was hot as hell to watch, and I'd been getting tons of feedback from you guys asking to see Mason bottom some more. Why not make progressing up the cock size ladder part of the CF education curriculum and have Mason bottom out for Cade's monster meat?\n\nThe only problem with my plan was I'd yet to even get Cade to accept the idea of fucking another guy. I was determined to make it happen, though, and spent a fair amount of time talking to him after his solo shoot and on the phone after he was back home in Boston about it. Eventually the idea of feeling a tight ass wrapped around his dick won him over (I guess most girls he'd tried to give it to up the butt were scared away once they saw his cock!), and it was on!\n\nMason didn't know what he was in for when he agreed to do this scene, but as the cameras started rolling and the guys went at it, he sure as heck wasn't complaining! You can see in the video that his dick is board stiff before his clothes even come off! Both guys were so worked up and horny that they went at it pretty hard, with tons of kissing and muscle worship, some hot swordplay with their big dicks (because we all know Mason's got quite the tool to work with also!). In fact, Mason got so in to it he almost choked himself on Cade's dick while sucking that thick meat. And if Mason's mouth was getting stretched to the limit by Cade's dick, imagine what his ass was in for!\n\nIn fact, once Cade got Mason in to position and started sliding that dick home, you can tell it was quite the challenge for Mason. This was by far the biggest we've paired Mason with, and the noises Mason makes while getting fucked let you know he's feeling every single bit of it inside him. Once Mason got accustomed it, though, all bets were off, and Cade started drilling Mason deep! I was scrambling around the room making sure I got some hot close up shots of that big dick stretching Mason's ass and the amazing sight before me!\n\nAs intense as the entire scene leading up to it is, it's only fitting the cumshots were also intense! Mason takes Cade's thick load in his mouth, then continues to suck and lick the thick meat that'd just fucked him silly well after Cade shot!\n\nAnd for those of you who wrote us to let us know how much you loved the behind the scenes material we'd included with the &quot;Cory Fucks Kurt&quot; video, we left some on with this video as well, showing you the guys after they've both shot their wads and recover from the wild scene!","torrent":{"xt":"urn:btih:01361f3043f642eb7515a0ea671297c78b9823bc","amp;dn":"Corbin+Fisher+-+-+-+Cade+Fucks+Mason+%5BPart+2%5D+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01361f3043f642eb7515a0ea671297c78b9823bc","infoHashBuffer":{"type":"Buffer","data":[1,54,31,48,67,246,66,235,117,21,160,234,103,18,151,199,139,152,35,188]},"announce":[],"urlList":[]}}