{"title":"Hole - Violet.mpg","uid":5103089,"size":69709828,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:015a688a0a668b5bcedd733e31e986670f6e25b6&amp;dn=Hole+-+Violet.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"claudeq","files":-1,"time":1254150605,"description":"&quot;Violet&quot; is a song by the American rock band Hole, fronted by Courtney Love. It was the third single to be released from their second album, Live Through This, following &quot;Doll Parts&quot; which was released in 1994. This song was released after an extensive touring period by the band, throughout 1994 and 1995.\n\n&quot;Violet&quot; is a song reputedly about Billy Corgan with whom Courtney had a relationship in the early nineties. Courtney introduced the song on the Jools Holland show in 1995 as &quot;This song's about a jerk, I hexed him and now he's losing his hair,&quot; which might refer to Corgan's hair loss. Lyrics such as 'When they get, what they want, then they never want it again', and 'Go on, take everything, take everything, I want you to', portray the end of a bitter relationship. In any event, Corgan and Love subsequently came to enjoy cordial relations. However there is some evidence that the song alludes to Courtney's days as a stripper. Courtney herself has on occasion made reference to the violet lights in a strip club she used to work in. The video itself is also set in a seedy strip club, and Love herself dances on a pole, adding further speculation as to what the song is really about.\n\nThe songwriting credits on record goes collectively to Hole, though BMI's website shows that &quot;Violet&quot; was written only by Eric Erlandson and lyrics by Love. &quot;He Hit Me (It Felt Like A Kiss)&quot; is originally written by Carole King and Gerry Goffin, and was first recorded by producer Phil Spector in the 1960s\n\n\n\nEnjoy","torrent":{"xt":"urn:btih:015a688a0a668b5bcedd733e31e986670f6e25b6","amp;dn":"Hole+-+Violet.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"015a688a0a668b5bcedd733e31e986670f6e25b6","infoHashBuffer":{"type":"Buffer","data":[1,90,104,138,10,102,139,91,206,221,115,62,49,233,134,103,15,110,37,182]},"announce":[],"urlList":[]}}