{"title":"Auto Cross Racing","uid":5162840,"size":47832171,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0205abace6725f894d2fc115775e9bb003807c29&amp;dn=Auto+Cross+Racing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sabpedro","files":2,"time":1258243548,"description":"Auto Cross Racing is a racing car game, viewed from above the cars for Windows PC Computers.\nThe aim of the game is to unlock each successive track by finishing in the top 3 places of the previous race.\nYou'll be able to race for the championship trophy on the last track once all the previous 9 tracks are unlocked.\nCash is earned as each race is completed and new cars will become available for purchase as each new track is unlocked.\nEach successive car having superior performance than the previous.\nIn order to stand a fighting chance against the increasing levels of difficulty of the AI cars and tracks, you will need to upgrade your car at regular intervals.\n\nFeatures:\n-Advanced Pacejka based car physics allowing for controlled skids, powerslides and drifting.\n-Unlock new tracks and cars by winning races.\n-Earn cash by winning races and purchase any of the 20 available cars.\n-User controlled in game difficulty settings.\n-20 AI controlled opponents to race against often allowing for multiple pile ups.\n-Different road surfaces ranging from tarmac, mud, snow and ice to desert.\n-10 different tracks, containing multiple routes, so choosing the best route is vital in shaving seconds off your lap times.\n-Nitro boost in order to accelerate past your opponent's.\n-Each car has its own unique sound effects.\n-Real-time car damage.\n-In game pitstops for both ai and player cars, allowing for repairs and nitro top ups.\n-Toggable in game mini map.\n-Choose the number of laps to race. 1 - 99.\n-6 camera types ( fixed and rotational ) with variable height adjustment and auto zoom.\n-Play your own in game music by placing your favorite music files into the in game MUSIC folder ( mp3, wav ).\n-Variable detail levels allowing for 3 different screen resolutions (1024 x 768) (800 x 600) (640 x 480) , 16 / 32 color depth -Display as well as fullscreen and windowed modes.\n-Redefinable Keys and Joystick support.\n-Save game feature.\n\nSystem Requirements:\n-1Ghz processor\n-DirectX V7.0 or higher and compatible graphics card.\n-72mb hard drive space for the demo.\n-113mb hard drive space for the Full Game.\n-Windows 95/98/ME/2000/XP/Vista/7\n","torrent":{"xt":"urn:btih:0205abace6725f894d2fc115775e9bb003807c29","amp;dn":"Auto+Cross+Racing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0205abace6725f894d2fc115775e9bb003807c29","infoHashBuffer":{"type":"Buffer","data":[2,5,171,172,230,114,95,137,77,47,193,21,119,94,155,176,3,128,124,41]},"announce":[],"urlList":[]}}