{"title":"Marti Brom - Not For Nothin' 2010 (flac)","uid":6438179,"size":282248729,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:021fe7c13e99d2563d11e9a325ba47e8dd7a4658&amp;dn=Marti+Brom+-+Not+For+Nothin%5C%27+2010+%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barber9","files":-1,"time":1306869919,"description":"Marti Brom's vision is to bring back a hillbilly glamour to country and rockabilly music. Ask me and I'll tell you she's has already done that. Besides her more than just pretty looks, Marti also has the most beautiful singing voice I've heard in ages, without any doubt! The ultimate mix of Patsy Cline and Charline Arther with a rockabilly beat. I get shivers down my spine everytime I hear her voice echoing through my livingroom, no matter what record of hers I'm spinning. \nMarti was born and bred in St. Louis, Missouri. She spent her summers in the bayous of South Louisiana with her grandparents. Today, she applies her bluesy St. Louis voice and sensibilities to the hillbilly purist aesthetics found in Austin, Texas to create a raucous but sultry rockabilly music. Her vision is to bring back a hillbilly glamour to country and rockabilly music.  (Dan Johnson)\n\nMarti Brom, a performer internationally acclaimed for her hard-driving rockabilly and sultry traditional country vocals, collaborated on this album with premier Washington DC area musicians, songwriters and Grammy-winning producer Peter Bonta to create a hard hitting tip of the hat to the rich legacy of roots rock, hard-core country, rock n roll, and rockabilly music of our nation's capital region. (amazon.com)\n\n\n 1. Finders Keepers\n 2. Get A Little Goner\n 3. Mascara Tears\n 4. Not For Nothin'\n 5. Forbidden Fruit\n 6. Something Blue\n 7. Never No More\n 8. Sweet Baby of Mine\n 9. Blues Keep Calling\n10. Sweet Thang\n11. Write Me In Care of the Blues\n12. Feelin' Right Tonight\n13. I Get the Blues When It Rains\n14. A Fool Such As I\n15. Spook House\n","torrent":{"xt":"urn:btih:021fe7c13e99d2563d11e9a325ba47e8dd7a4658","amp;dn":"Marti+Brom+-+Not+For+Nothin%5C%27+2010+%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"021fe7c13e99d2563d11e9a325ba47e8dd7a4658","infoHashBuffer":{"type":"Buffer","data":[2,31,231,193,62,153,210,86,61,17,233,163,37,186,71,232,221,122,70,88]},"announce":[],"urlList":[]}}