{"title":"CBC Doc Zone-Up Against the Wall (2009).WS-PDTV.XviD.Ekolb","uid":5172356,"size":366167964,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0376466733fc5fe93ec055ae03a94577ba6be8b4&amp;dn=CBC+Doc+Zone-Up+Against+the+Wall+%282009%29.WS-PDTV.XviD.Ekolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Ekolb","files":2,"time":1258760854,"description":"Up Against the Wall\nThursday November 19, 2009 at 8 pm on CBC-TV\n\nTwenty years ago, the world watched, spellbound, as the Berlin Wall came down. In the hopeful euphoria that followed, it seemed as if walls would be a thing of the past. Coinciding with the arrival of economic globalization, it looked like people and goods would finally be able to move freely across borders worldwide.\n\nBut then 9/11 happened and, as they say, &quot;everything changed&quot;. In the post-9/11 world, &quot;national security&quot; became the watchword, and it soon became clear that walls ? and sophisticated new, hi-tech versions at that - were back with a vengeance. In fact, they were proliferating all around the world, with over a dozen new walls going up since the Berlin Wall came down.\n\nUp Against the Wall, produced by Gail McIntyre, and written and directed by documentary filmmaker Eileen Thalenberg, looks at this growing phenomenon of new wall-building, focusing on three hot spots around the world, where extremely controversial walls have gone up. Thalenberg travels along the huge expanse (and expense!) of the 'Tortilla Wall' that the United States is constructing along its border with Mexico. She also explores both sides of the elaborate wall and fence system Israel has built between itself and the West Bank.\n\nAnd, finally, Thalenberg journeys to the autonomous Spanish cities of Ceuta and Melilla on the coast of Morocco. The walls surrounding those little-known European enclaves in Africa give us a glimpse into the new &quot;Fortress Europe&quot;. With those walls blocking entry into Europe, desperate Africans risk their lives crossing the Mediterranean Sea in flimsy boats provided by human traffickers. As Thalenberg reveals, they often wind up, by the thousands, in detention camps across Europe. Most are eventually sent home.\n\nThe fall of the Berlin Wall was an act of freedom, symbolizing the triumph of democracy over totalitarianism. &quot;The great irony,&quot; says Thalenberg, &quot;is that the three new walls we focus on in the film were all constructed by democracies. What we found repeatedly was that walls have a stated agenda and a hidden one. Walls are often built in the name of national security, but the real reason is to keep people out, though, of course, nobody much wants to say that.&quot;\n\nIn a traumatized post 9/11 world, a wall is an easy sell. It gives the impression that something is being done to protect people. In fact, walls are an expression of what is most primitive in us all ? the fear of &quot;the other&quot;.\n\n&quot;In the short term a wall may address some of those problems,&quot; says Thalenberg. &quot;But we found that in the longer term, in each case, there were unexpected, sometimes alarming impacts. Very often the wall made things worse.&quot;\n\nUp Against the Wall poses the questions: Do walls, in fact, work? What are the real costs both in financial and human terms? How do walls affect people living on both sides? The film also explores the themes of borders, sovereignty, migration and human rights.\n\nThe experience of making the film turned out to be one of the most difficult of Thalenberg's career for personal reasons. &quot;I started my own life in a refugee camp with my parents, and here I was filming in refugee and detention camps. At a camp in Sicily we met an Ethiopian father holding his little girl in his arms and as I stood looking at them I thought, 'That was me and my father all those years ago.'&quot;\n\nUp Against the Wall is produced by Stormy Night Productions III and 6663036 Canada Inc. in association with the Canadian Broadcasting Corporation.\n\nFormat            : AVI\nLength            : 349 MiB for 44mn 6s 79ms\n\nCodec             : XviD\nSource            : PDTV\nLanguage          : English CA\nSubtitles         : None\nGenre             : Documentary\n\nVideo #0          : MPEG-4 Visual at 970 Kbps\nAspect            : 576 x 336 (1.714) at 29.970 fps\n\nAudio #0          : MPEG Audio at 123 Kbps\nInfos             : 2 channels, 48.0 KHz\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:0376466733fc5fe93ec055ae03a94577ba6be8b4","amp;dn":"CBC+Doc+Zone-Up+Against+the+Wall+%282009%29.WS-PDTV.XviD.Ekolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0376466733fc5fe93ec055ae03a94577ba6be8b4","infoHashBuffer":{"type":"Buffer","data":[3,118,70,103,51,252,95,233,62,192,85,174,3,169,69,119,186,107,232,180]},"announce":[],"urlList":[]}}