{"title":"Hit The Saddle [1937] @ .avi","uid":4997612,"size":457423388,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:03dc88847ac99e46e443f898631a3238021e2dba&amp;dn=Hit+The+Saddle+%5B1937%5D+%40+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"alien99","files":1,"time":1247352931,"description":"I did a search of my normal sites and got no hits on this so thought i would share it\n\nRepublic Studios made quite a few Three Mesquiteers adventures, with a whole host of cowboy stars, including Bob Steele, Tim McCoy, Tom Tyler, Ray Hatton, and believe it or not, even John Wayne following his Lone Star film days. Livingston, Corrigan and Terhune seem to have appeared in most of them as a trio, though they did trade off with others as necessary. \n \tRay Corrigan\t ... \tTucson Smith\n\tMax Terhune\t... \tLullaby Joslin\n\tRita Hayworth\t... \tRita (as Rita Cansino)\n\tJ.P. McGowan\t... \tRance McGowan\n\tEd Cassidy\t... \tSheriff Miller (as Edward Cassidy\n\nThe Three Mesquiteers nearly come to an end over Rita Hayworth and a horse. Depends on your point of view as to who caused more ruckus.\n\nFirst there's the horse, a beautiful wild animal called the pinto stallion. He leads a herd of wild horses which are now protected by law by the government. Some dastardly villains want to shoot the wild ones like The Misfits for dog food. They train a black horse and paint him to look like the pinto so he can start stirring up the other rancher's horses. On one raid, the sheriff is trampled to death by the ersatz pinto. Robert Livingston believes in the horse's innocence, but Ray Corrigan and Max Terhune want him done in and Corrigan's the sheriff.\n\nAnd then there's the matter of Rita Hayworth or as she was known at this point in her career, Rita Cansino. Rita and Livingston want to get married. The other two Mesquiteers have no use for her and think she's a goldigger. This part of the plot may have been the basis for the Gunga Din story that RKO did two years later.\n\nSo who does Livingston wind up with, Rita or the pinto stallion? For that you have to view this film of The Three Mesquiteers series. \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0029004/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0029004/&lt;/a&gt;\n\nUser Rating:   7.9/10  only 53 votes  but surprises me that high for a old oater even tho i enjoy them\n","torrent":{"xt":"urn:btih:03dc88847ac99e46e443f898631a3238021e2dba","amp;dn":"Hit+The+Saddle+%5B1937%5D+%40+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03dc88847ac99e46e443f898631a3238021e2dba","infoHashBuffer":{"type":"Buffer","data":[3,220,136,132,122,201,158,70,228,67,248,152,99,26,50,56,2,30,45,186]},"announce":[],"urlList":[]}}