{"title":"El Doctor 2006","uid":4993412,"size":188619878,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0479cce5ed2db244cf14ab996893c3549b0dff7d&amp;dn=El+Doctor+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1247159480,"description":"An Underground Comic Book Come Alive, 29 April 2007\n10/10\nAuthor: Tiskit Tothead (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;4b3f232e3f243f232e2a2f380b322a23242465282426&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;) from Too-Stoned, Arizona\n\nHey everybody! Clean out your favorite pipe and stuff it good, because Suzan Pitt has a new animated short out, and you all know what that means! Another chance to take your THC hovercraft across another Pitt wonderscape, that is if you ever made it back alive from Asparagus. Makes a Tiskit think that maybe there is such a thing as a Ten Leave film, even though there are only nine leaves on the stem, according to the picture on my lighter. Now, me and my red hot wife, Taskit, have always described Suzan Pitt's work at parties as underground comic books put on film. Never has this been more true than in her latest work, El Doctor. This work, another Pitt lung-buster, brings to live the head swimming mixture of Chester Brown's Yummy Fur with Los Hernandez Bros' Loves and Rockets, but it's in color! Just take yourself back to the 90s and picture yourself on the sofa, Honey Bear bong spilled on the carpet, reading alternative comics when they suddenly come to life and chase you round the living room. That's El Doctor. Suzan Pitt said that the film is inspired by the cultural institution of miracles in Mexico, which is taken much more seriously than in the states, where miracles are mostly free concert tickets. Miracles include a little girl who sprouts flowers, where the doctor says he wishes he had an ounce of what that little girl has. You and me both, doctor! Poor doctor. He getting all drunk on that soul killing liquor, and you know what that means. Major hassling by gargoyles, that's what. The gargoyle says something so funny that Taskit spilled her Flaming Palm Tree on ice all over the floor. Then comes the miracle of the confused intestines, just draw in deep for that one. The sexual content just increases the underground comic book comparison, as the horse sex sequence recalls Dori Seda's groundbreaking work and the mutant litter of babies sequence gives you the same impact as the best work of Julie Doucet. Plenty of material to keep those rolling papers busy, you bet! Makes a Tiskit wonder why Ralph Bakshi and Chuck Swenson have been the only dudes so far to put feature length underground animation on screen. Suzan Pitt would be the perfect director to adapt any of the above cartoonists' work into a feature length movie. With her history and hand drawn techniques, she'd be a shoo in for a best animated feature Oscar, the perfect prestige piece for any Studio. Hey Chester Brown fans, how about that long talked about but never delivered Ed the Happy Clown movie, except with Bush's head instead of Reagan's on the end of Ed's shaft? Nine Leaves: Atomic. A perfect drug movie. Like going to another planet on your couch. ","torrent":{"xt":"urn:btih:0479cce5ed2db244cf14ab996893c3549b0dff7d","amp;dn":"El+Doctor+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0479cce5ed2db244cf14ab996893c3549b0dff7d","infoHashBuffer":{"type":"Buffer","data":[4,121,204,229,237,45,178,68,207,20,171,153,104,147,195,84,155,13,255,125]},"announce":[],"urlList":[]}}