{"title":"Coast.to.Coast.AM.July.06.2009-komie","uid":4989939,"size":55731319,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:047b76140ac461a8cd1f9c67f8536e5f8e76f921&amp;dn=Coast.to.Coast.AM.July.06.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":4,"time":1246986057,"description":"Reconnective Healing\n\n\n\nDate:\n07-06-09\n\nHost:\nGeorge Noory\n\nGuests:\nDr. Eric Pearl, Loren Coleman\n\n\nDr. Eric Pearl spoke about his technique called reconnective healing, a kind of &quot;hands off healing,&quot; which involves simply holding his hands near a patient. The unique method works by reconnecting strings or strands, and tapping into a healing spectrum that's composed of energy, light, and information, he said.\n\nProtection methods taught by many healers can actually hold the healing process back, Pearl maintained. There is no such thing as evil, only darkness when we're not seeing the light, he added. At the speed of light, entropy reverses itself, and Pearl suggested that health challenges were brought about by temporarily forgetting that we are that light. He sees the reconnective techniques as being about more than just healing physical problems-- it's also related to humanity's evolution, with DNA restructuring from two strands into a twelve-stranded system.\n\nPearl said he's now trained over 60,000 practitioners in reconnective healing around the world. In the U.S., he'll be conducting seminars in Los Angeles in September.\nJohn Keel Remembered\n\nFirst hour guest, cryptozoologist Loren Coleman talked about researcher John Keel, who passed away on July 3rd. He noted that Keel came to believe that the source for a lot of paranormal activity such as Mothman and UFOs, was demonic in nature. Keel theorized that demonic beings, which he referred to as &quot;ultradimensionals,&quot; created illusions to cloud the minds of humans. For more, see the article below.\nWebsite(s):\n# thereconnection.com\n# lorencoleman.com\nBook(s):\n# The Reconnection: Heal Others, Heal Yourself\n# Mothman and Other Curious Encounters\n","torrent":{"xt":"urn:btih:047b76140ac461a8cd1f9c67f8536e5f8e76f921","amp;dn":"Coast.to.Coast.AM.July.06.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"047b76140ac461a8cd1f9c67f8536e5f8e76f921","infoHashBuffer":{"type":"Buffer","data":[4,123,118,20,10,196,97,168,205,31,156,103,248,83,110,95,142,118,249,33]},"announce":[],"urlList":[]}}