{"title":"Saxon - Live To Rock","uid":5001962,"size":204697604,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:06309455f96b375cea20c9e7b3fac4e7e0149dce&amp;dn=Saxon+-+Live+To+Rock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247567426,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nInto the Labyrinth is the 18th studio album by British heavy metal band Saxon, which was released on 9th January, 2009. The album was made in between Saxon tours in 2008 and written by the band in England and at Biff Byford's house in France. The first single &quot;Live to Rock&quot; was released on 17 October 2008.\n\nA proper physical fourteenth track is featured on the Japanese CD pressing, released on Feb, 3rd 2009. Prior to Feb 3rd, the track was only sold as a compressed/lower bit rate download.\n\nFans will be familiar with the song &quot;Coming Home&quot; from the electric version on Saxon's Killing Ground album.\n\nIn November 2008, it was officially announced that the band would hold the 'Riff King' competition, where fans could play a solo for their single 'Live to Rock'.\n\nSaxon are an English heavy metal band, formed in 1976 in Barnsley, Yorkshire. As leading lights in the New Wave of British Heavy Metal they had huge success in the 1980s with 8 UK Top 40 albums including 4 UK Top 10 albums. Saxon also had numerous singles in the Top 20 singles chart. Between 1980 and 1987 Saxon established themselves as one of Europe's biggest metal acts, they also had success in Japan and in the USA. In Japan, the single &quot;Motorcycle Man&quot; stayed in the charts for over 5 months. They still tour heavily and regularly. Their latest tour is their largest in the UK since the late 1980s. Saxon have sold more than 10 million albums worldwide and heavily influenced bands such as Metallica, Megadeth, Sodom and Running Wild.\n\nThere is another incarnation of Saxon featuring two former band members who hold the legal rights to the name - &quot;Oliver/Dawson Saxon&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:06309455f96b375cea20c9e7b3fac4e7e0149dce","amp;dn":"Saxon+-+Live+To+Rock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06309455f96b375cea20c9e7b3fac4e7e0149dce","infoHashBuffer":{"type":"Buffer","data":[6,48,148,85,249,107,55,92,234,32,201,231,179,250,196,231,224,20,157,206]},"announce":[],"urlList":[]}}