{"title":"uTorrent 2.0 Beta (build 17427)","uid":5183186,"size":314160,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:066c828fcefa307f4fac4f90d27796e8069a84b7&amp;dn=uTorrent+2.0+Beta+%28build+17427%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1259343749,"description":"Copied from Ã‚ÂµTorrent Homepage:\n\n\nWhat Is Ã‚ÂµTorrent?\n\n\nMicro-Sized Yet Feature Filled\n\nÃ‚ÂµTorrent is the world's most popular BitTorrent client.\nMost of the features present in other BitTorrent clients are present in Ã‚ÂµTorrent, including bandwidth prioritization, scheduling, RSS auto-downloading and Mainline DHT (compatible with BitComet). Additionally, Ã‚ÂµTorrent supports the Protocol Encryption joint specification (compatible with Azureus 2.4.0.0 and above, BitComet 0.63 and above) and peer exchange.\n\n\nResource-Friendly\n\nÃ‚ÂµTorrent was written with efficiency in mind.\nUnlike many torrent clients, it does not hog valuable system resources - typically using less than 6MB of memory, allowing you to use the computer as if it weren't there at all. Additionally, the program itself is contained within a single executable less than 220 KB in size.\n\n\nSkinnable and Localized\n\nVarious icon, toolbar graphic and status icon replacements are available, and creating your own is very simple. Ã‚ÂµTorrent also has support for localization, and with a language file present, will automatically switch to your system language. If your language isn't available, you can easily add your own, or edit other existing translations to improve them!\n\n\nActively Developed and Improved\n\nThe development team puts in a lot of time working on features and making things more user-friendly. Releases only come out when they're ready, with no schedule pressures, so the few bugs that appear are quickly addressed and fixed.\n\n\nChangelog:\n\n\n1.9 is now 2.0, and we've hit beta!\n\nRelease Notes:\n\n\nWe've added UDP tracker support!\n\n\nuTP has been improved significantly over the previous alpha, with many bugs fixed and performance improvements. It's no longer hidden in Advanced settings.\n\n\nThe setup dialog has been overhauled to make it much easier to use and with a built-in speed test. It's still not quite complete yet, but this will give you a good taste of what we're up to with it!\n\n\nA new transfer cap feature has been added to track bandwidth usage, along with graphs to show your usage.\n\n\n\nFeature Overview:\n\nUDP trackers are a different protocol for tracker communication that uses significantly less processing power on the tracker end.\nIt's important for us to support this because trackers have limited resources, so this should allow them to support many more users with their current hardware and not crash under the load.\n\nuTP is an alternative communication method for BitTorrent traffic that allows the client to automatically regulate its bandwidth usage to avoid adversely impacting your internet connection. This will allow you or other users on the network to download their torrents but still allow others on the network to function with little difference. This does not require any additional setup.\nIn addition, uTP in this version has added its own form of STUN, a method of getting incoming connections without direct connectivity to the Internet.\nThis allows Ã‚ÂµTorrent to punch holes through routers and firewalls to increase connectivity and improve speeds. It is even possible to connect two firewalled peers through uTP's NAT traversal feature.\n\nThe transfer cap settings were added in response to various users who have ISP-mandated caps on how much data they can download/upload in a month.\nNow you can track your usage in MB (with a handy graph to visualize it) and even configure Ã‚ÂµTorrent to stop torrenting once the limits are exceeded.\nCurrently, you can configure the time interval, the data cap and whether it should stop based on only download, upload, or both combined.\nAs a privacy notice, this traffic data is not sent back to us or anyone. \n\n\n\n2009-11-25: Version 2.0 Beta (buid 17427)\n\n\nFix: Fixed rare crash when using magnet links\n\nFix: Fixed crash when super seeding a torrent without metadata\n\nFix: Fixed handling of a uTP edge-case\n\n\nChange: Complete upload-only extension support\n\n\n\n\n2009-11-18: Version 2.0 Beta (buid 17341)\n\n\nFix: Various GUI crash bugs\n\nFix: Accept magnet links through add-url webUI\n\n\n\n\n2009-11-12: Version 2.0 Beta (buid 17273)\n\n\nFix: More strict https connection state management for halfopen accounting.\n\n\nFix: Problem during install toolbar offer\n\n\nChange: Relaxed the requirements on bencoded integers to parse some broken torrents\n\n\n\n\n2009-11-06: Version 2.0 Beta (buid 17188)\n\n\nChange: Added checks for heap corruption that caused crash in uTP\n\nChange: Improved stability by making all executable pages not writable\n\n\nFix: Fixed stack overflow when copying peer list\n\nFix: Fixed allocation regression in connection to peers\n\n\n\n\n2009-11-03: Version 2.0 Beta (buid 17127)\n\n\nChange: Enable multiple instances of the client to run on multi-user machines (e.g. fast user switching)\n\n\nFix: Fixed uTP crash in edge condition\n\nFix: Fixed crash when icmp.dll wouldn't contain the expected functions\n\nFix: Fixed crash when closing add torrent dialog while dragging a column\n\n\nChange: The Speed guide will now reject ports listed in bt.no_connect_to_services_list\n\nChange: Add an upgrade message if a buggy version of nvLsp is detected\n\n\nFix: Don't take the total number of connections into account when connecting to trackers\n\n\nChange: Increase default transfer cap to 250 GB/month\n\n\nFix: Accounting of halfopen https connections would cause uT to stop making new connections\n\n\nChange: Made the DHT compatible with future extensions\n\n\nFix: Sometimes the &amp;ip= parameter sent to trackers would be incorrect\n\nFix: Correctly order bencoded dict items in extension handshake message\n\nFix: Fixed holepunch error handling and support detection\n\nFix: Check invalid ports and IPs in the DNS resolver to avoid using them\n\n\n\n\n2009-10-12: Version 2.0 Beta (build 16850)\n\n\nChange: Revert change where asserts are active in release builds\n\n\n\n\n2009-10-10: Version 2.0 Beta (build 16835)\n\n\nFix: Various polishing on the setup guide\n\nFix: Potential crash related to TLS not being initialized\n\n\nChange: Disable installer for Wine\n\nChange: Balance CDNs to download updates\n\n\nFix: Fixes bug where magnet links wouldn't work if PEX was disabled\n\nFix: Potential crash in network code\n\nFix: More crashes when using magnet links\n\n\n\n\n\n2009-09-25: Version 2.0 Beta (build 16666)\n\n\nFix: Port settings saved in Setup guide\n\n\nChange: Updated helpfile code to be forward compatible with changes\n\n\nFix: Fixed torrent creation bug\n\nFix: Fixed crash introduced in last build\n\nFix: Fixed rare crash when parsing messages\n\n\n\n\n2009-09-24: Version 2.0 Beta (build 16625)\n\n\nChange: UI improvements in setup guide\n\n\nFix: More setup guide crash fixes\n\nFix: Fixed rare holepunch crash\n\n\nChange: Collect stats on holepunch performance\n\n\n\n\n2009-09-17: Version 2.0 Beta (build 16546)\n\n\nFix: Fixed crashes in setup guide\n\nFix: Graying out custom toolbars with transparency\n\n\nChange: Disable Ask for unsupported 64-bit Windows\n\n\n\n\n\n2009-09-14: Version 2.0 Beta (build 16515)\n\n\nFix: Fixed crash in setup guide\n\nFix: Fixed UDP-tracker crash when dns resolution would fail\n\n\nChange: Use user-supplied port in Setup Guide, save auto-portmap prefs.\n\nChange: Added European Servers in Setup Guide\n\nChange: New Icons in Setup Guide\n\n\nFix: Improper mutex accounting in hang detector\n\nFix: Crash when creating torrents\n\n\n\n\n\n2009-09-09: Version 2.0 Beta (build 16407)\n\n\nFix: Fixed handling of invalid udp tracker responses\n\n\n\n\n2009-09-04: Version 2.0 Beta (build 16394)\n\n\nFix: Bugs where have messages would not be remebered for magnet link downloads\n\nFix: Buffer overrun vulnerability\n\n\nChange: Conservative network locking in installer\n\n\nFix: Rare crash in low level network read and write\n\nFix: Fixed crash in udp tracker connection with unresponsive DNS\n\nFix: Improved out-of-memory error handling in disk thread\n\nFix: Installer crash after download\n\n\nFeature: Stop setup guide tests without exiting dialog\n\n\nFix: Crash when peers disconnect from a magnet-link torrent right as we received the metadata\n\nFix: Fixes bug where magnet links wouldn't work if PEX was disabled\n\n\nFeature: Added ability to re-run setup tests\n\n\nFix: Fix crash when using magnet links and a peer is failing at a particular point\n\nFix: Fixed negative allocation in RequestChunks() for web seeds\n\n\nChange: Updated bandwidth presets in Setup guide\n\n\nFix: Fix startup race condition between network and disk I/O thread\n\n\nChange: Optimization added to speed up torrent creation\n\n\n\n\n2009-08-20: Version 2.0 Beta (build 16222)\n\n\nFeature: Added versioned help files.\n\n\nFix: Setup guide fixes\n\nFix: Installer with UAC\n\nFix: Allow UDP trackers in the first tier when creating torrents\n\nFix: UDP Tracker retries three times instead of two\n\nFix: potential crash in installer\n\nFix: Crashes when removing labels\n\nFix: Selection of labels over 256 characters in length\n\nFix: Multiple HTTP download crashes\n\nFix: Http seed fix for multifile torrents\n\nFix: uTP connections that are upload rate limited will not have their max window size grow indefinitely\n\nFix: Vista and Windows 7 FW rules are created for all profiles\n\n\n\n\n\n2009-08-10: Version 2.0 Beta (build 16126)\n\n\nFix: Tracker requests are not invalid anymore\n\n\n\n\n2009-08-04: Version 2.0 Beta (build 16081)\n\n\nChange: Disable toolbar offers for Wine installs\n\n\nFeature: New Setup guide &amp; Speedtest.\n\n\nChange: Uninstaller is added to all user profiles\n\n\nFix: Crash when assigning new label to torrents from RSS\n\n\nChange: Incomplete downloads sort after completed downloads if sorting by &quot;Completed On&quot;\n\n\nFeature: Add Moldova to peer flags\n\n\nChange: Added upnp host cache to speed up upnp nat resolution on misbehaving routers\n\n\nFix: Maintain category list selection on update for some edge cases\n\n\nChange: If selected, install start menu and desktop shortcuts to all users instead of only current user\n\n\nFeature: Grayscale disabled toolbar buttons\n\n\nFix: Fixed uTP selective ack bug (would cause connections to stall and time out)\n\nFix: Fixed uTP fast re-send bug (would sometimes re-send packets that shouldn't be re-sent)\n\nChange: Prompt to take associations in installer only if any others exist\n\n\nFix: Buffer overrun vulnerability in create torrent dialog\n\nFix: uTP recovers faster after timeout\n\n\nFeature: uTP supports window sizes smaller than the packet size\n\n\nChange: Reduced uTP overhead slightly by ramping up packet sizes at lower rates\n\n\nFeature: Enable and disable toolbar buttons according to selected torrents\n\n\nChange: UAC must be completed to install in Vista or higher\n\n\nFix: Memory leaks in main window, protocol associations, settings dialog, general tab\n\n\nChange: Tweaks to Ask toolbar offer\n\n\nFeature: UDP tracker support\n\n\nFix: Only change run on startup if installer is shown\n\n\nChange: Added support for 3:rd party applications to more easily be configured to access the uTorrent web UI, i.e. to pair the applications\n\nFix: Make &quot;alternate upload rate when seeding&quot; apply when the seeding is set by the scheduler\n\nFix: Align &quot;Web Seeds&quot; in torrent creation dialog\n\nFix: Translated strings in uninstaller\n\nFix: Http seeds would not reconnect after stopping and starting torrent\n\nFix: Http seed for multifile torrents\n\nFix: Regression in 15562 that caused frequent crashes\n\n\nFeature: New installer with EULA, file association\n\n\nFix: uTP issue on low-latency high-throughput networks\n\nFix: Copying long filenames to clipboard no longer results in garbage or crash\n\nFix: Fixed web seed support for multi-file torrents\n\n\nChange: Torrent whose &quot;Force Recheck&quot; is greyed out will not recheck when asked through multi-torrent selections\n\nFix: When adding torrents through URLs via commandline, we would always open the add torrent dialog\n\nFix: Handle multi file torrents with web seed urls that incorrectly don't end with a slash\n\nFix: Make sure web seed urls end with a slash for multifile torrents\n\nFix: Setup Vista firewall\n\nFix: Remove settings on Vista during un-installation\n\n\nFeature: New &quot;Transfer Cap&quot; pane in Preferences\n\nFeature: uTP can be enabled or disabled using &quot;Enable bandwidth management&quot; checkbox in Preferences\n\n\nFix: Check at startup for incompatible versions of NVIDIA nForce firewall.\n\n\nED2K Link:\ned2k://|file|utorrent-2.0-beta-17427.upx.exe|314160|34FB8C970F252DEC93E00C6FDC6152F5|h=GUW27TNCJ6LCIMSCQVOJ4BVHZGJBY7A3|/","torrent":{"xt":"urn:btih:066c828fcefa307f4fac4f90d27796e8069a84b7","amp;dn":"uTorrent+2.0+Beta+%28build+17427%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"066c828fcefa307f4fac4f90d27796e8069a84b7","infoHashBuffer":{"type":"Buffer","data":[6,108,130,143,206,250,48,127,79,172,79,144,210,119,150,232,6,154,132,183]},"announce":[],"urlList":[]}}