{"title":"Sospiri - Cecilia Bartoli","uid":6395674,"size":197684404,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0696128f19f86da8451ab32e4bd5d9e480e746ad&amp;dn=Sospiri+-+Cecilia+Bartoli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dolphin70","files":22,"time":1305513939,"description":"Format: Musepack\n\n&quot;Sospiri&quot; contains favorite arias by Mozart and Handel, bel canto jewels by Bellini and Rossini and treasures by Vivaldi as well as music which Cecilia Bartoli has &quot;rediscovered&quot; on her recent record-breaking solo albums. \n\nThe Deluxe Edition includes a previously unreleased aria and world-premiere recording of Vinci's Cervo in bosco, one of the greatest castrati's ever, Farinelli's, calling card arias. Also included is a new interpretation of Rosina's aria Una voce poco fa, from Il Barbiere di Siviglia - the dazzling aria of young love, the role in which Cecilia Bartoli first shot to international stardom. She infuses this new interpretation with all her knowledge of the baroque and classical tradition on which Rossini's music was founded, her experience of period practice and critical reading of the manuscripts, together with a playfulness and variety of colors which she has acquired over the years. On this track recorded during the Maria sessions Cecilia Bartoli is accompanied by a fantastic period practice orchestra, Orchestra La Scintilla.\n\n","torrent":{"xt":"urn:btih:0696128f19f86da8451ab32e4bd5d9e480e746ad","amp;dn":"Sospiri+-+Cecilia+Bartoli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0696128f19f86da8451ab32e4bd5d9e480e746ad","infoHashBuffer":{"type":"Buffer","data":[6,150,18,143,25,248,109,168,69,26,179,46,75,213,217,228,128,231,70,173]},"announce":[],"urlList":[]}}