{"title":"Just for Laughs-The Best Of JFL Show #4 (2008) CBC [PDTV]~Ekolb","uid":5017865,"size":365961263,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:06d1d7ef172cafd67de661533bf358a7dd5ead58&amp;dn=Just+for+Laughs-The+Best+Of+JFL+Show+%234+%282008%29+CBC+%5BPDTV%5D%7EEkolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ekolb","files":2,"time":1248306979,"description":"The Best of JFL 2008 Show #4\n\nHow can we go wrong when a show starts with Ron James? It's all gravy after that, and I mean top-notch steakhouse gravy. And you should know that Elivra Kurt is well on her way to becoming an excellent key-cutter.\n\nRon James: the Canadian comedy icon, a prototype for manic, physical, polysyllabic comedy, with numerous sold out tours behind him.\n\nTodd Glass: You know who he kind of looks like? Ach, I'll save it. Watch.\n\nArj Barker: the absolute best joke about Pluto's planetary status (and I have heard ALL the jokes about Pluto's planetary status, trust me).\n\nDai Henwood: a television comedy star in New Zealand, Dai has all his pop culture references down pat, and rivals our next performer in hair and stature...\n\nElvira Kurt: delves into new parenthood and conflicts in relationships, barely concealing her frustration.\n\nBob Arno: one would assume that the key to being a pickpocket is that your victims DO NOT KNOW about the pickpocket, but Bob doesn't care. He'll get your stuff (wallet, mobile phone, tie, suspenders, belt...) and you'll laugh while he does it.\n\nGreg Giraldo: possibly the funniest angry comic this side of Lewis Black. A favourite among the Festival talent scouts; watch and see why.\n\nSelfish favourite moment: Todd Glass thinking twice about asking for directions to a watermelon Festival is the very definition of an awkward moment.","torrent":{"xt":"urn:btih:06d1d7ef172cafd67de661533bf358a7dd5ead58","amp;dn":"Just+for+Laughs-The+Best+Of+JFL+Show+%234+%282008%29+CBC+%5BPDTV%5D%7EEkolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06d1d7ef172cafd67de661533bf358a7dd5ead58","infoHashBuffer":{"type":"Buffer","data":[6,209,215,239,23,44,175,214,125,230,97,83,59,243,88,167,221,94,173,88]},"announce":[],"urlList":[]}}