{"title":"Coast to Coast AM - Oct 26 2009 - Astrology &amp; Consumer Trends","uid":5137826,"size":55862988,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:06e68f93e45b277598b3beb1c106ed12d16e044a&amp;dn=Coast+to+Coast+AM+-+Oct+26+2009+-+Astrology+%26+Consumer+Trends&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":-1,"time":1256648832,"description":"Astrology &amp; Consumer Trends\n\nDate: 10-26-09\nHost: George Noory\nGuests: Steven Weiss, John Zaffis\n\nMarketing and research consultant Steven Mark Weiss discussed how he uses astrology to understand demographic and societal changes, as well as cultural phenomena like food trends. In his work he uses the planet Jupiter, which spends a year in each astrological sign, to look for cycles or trends that return every 12 years. For instance, he noted how that the electronic toy Tamagotchi (a 'virutal pet' that required near constant monitoring) was very popular in 1997, and now products like the iPhone are frequently in a person's hand.\n\nWeiss shared his research into which types of food have an inherent appeal to specific astrological signs:\n\n- Gemini-- like doing things fast and quick, so they may frequent fast food places.\n- Aries-- are drawn to temperature extremes, such as grilled meats and ice-cold drinks. They also like to be the first to try new places.\n- Taurus-- appreciate the cow, whether beef or dairy. They take their time and savor high quality.\n- Cancer-- like comfort foods, and place importance on taste.\n- Leo-- enjoy food at parties and celebrations, like champagne and birthday cake.\n- Libra-- like food combinations such as burger &amp; fries or soup &amp; sandwich, as they have an affinity for balancing different elements.\n- Virgo-- are healthy eaters, and focus on nutritional content.\n- Scorpio-- enjoy red foods like strawberries and chili peppers, and like to make sure their money is well spent.\n- Sagittarius-- are adventure-minded and like to try different things.\n- Capricorn-- eat with practicality in mind, and treasure Mom's cooking.\n- Aquarius-- can become excited about particular foods, and learn all they can about them. They also like food at public places such as the ballpark.\nPisces-- can retain deep and personal associations about different food items.\n\nWeiss recently served as a consultant for Dominos, helping them create a sandwich suggestion list based on these preferences.\n\nNoting the importance of Neptune moving into Pisces (the sign that it rules) in 2012, he suggested this could set the stage for a new cycle filled with unpredictable or mysterious events. He also spoke about &quot;the Transformers,&quot; the generation born between 1984 - 1995. Many of these kids are now in college, and are actively creating trends, and doing things to acquire cultural power, he said.\n\nThe 'Witch Case'\n\nLast hour guest, paranormal investigator John Zaffis spoke about the &quot;Witch Case,&quot; a recent investigation that involved a possessed grandmother. The woman, who was heavily involved in ritual and spells, may have been affected by spirits in her home, which bordered on an old insane asylum, he detailed. She eventually tried to burn the house down, setting a fire in the attic.\n\nWebsite(s):\nstevenmarkweiss.com\nblog.stevenmarkweiss.com\njohnzaffis.com\njohnzaffisparanormalmuseum\n\nBook(s):\nSigns of Success: The Remarkable Power of Business Astrology\nShadows of the Dark\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:06e68f93e45b277598b3beb1c106ed12d16e044a","amp;dn":"Coast+to+Coast+AM+-+Oct+26+2009+-+Astrology+%26+Consumer+Trends","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06e68f93e45b277598b3beb1c106ed12d16e044a","infoHashBuffer":{"type":"Buffer","data":[6,230,143,147,228,91,39,117,152,179,190,177,193,6,237,18,209,110,4,74]},"announce":[],"urlList":[]}}