{"title":"Coast.to.Coast.AM.July.08.2009-komie","uid":4993642,"size":55577976,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0765cdf6c42e2cc17aa0e9088e988aa084d5054b&amp;dn=Coast.to.Coast.AM.July.08.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"komie","files":5,"time":1247168024,"description":"Remote Viewing Program\n\n\n\nDate:\n07-08-09\n\nHost:\nGeorge Noory\n\nGuests:\nRussell Targ, Anthony H. Davidson\n\n\nWriter and physicist Russell Targ discussed his role as co-founder of a remote viewing/ESP research program for the CIA at the Stanford Research Institute (SRI) during the Cold War. The remote viewing program at SRI did yield significant intelligence, he noted. For instance, one remote viewer drew pictures of a Soviet weapons laboratory, and described a particle beam weapon under construction. Four years later, this information was verified by US spy satellites. We also found a crashed Soviet reconnaissance plane, and a kidnapped General, he said. Yet in 1995, after 23 years, the viable program was dismantled by Robert Gates, then head of the CIA, who declared that the Cold War was over and this type of intel was no longer needed.\n\nOne of the secrets to successful remote viewing is being able to quiet the mind, and then draw what pops into your awareness, Targ explained. Skilled remote viewers like Ingo Swann were even able to see things off planet-- he drew rings around the planet Jupiter, and Mercury's magnetic field, before either were confirmed in 1974. Such experiences point to a field of non-local awareness that we can tap into.\n\nRemote viewing can also be used to make money, said Targ, who recalled an investment team he was part of in the 1980s, that correctly predicted silver commodities 11 out of 12 weeks. Recently, some of Ed Dames' remote viewing students showed monetary gains from sports betting, he added.\n\nProperties of Luck\n\nFirst hour guest, Anthony H. Davidson (book link) talked about the properties of luck. He explained how people have a &quot;diversified luck portfolio,&quot; with short term assets (gambling, games, collecting) and long term (relationships, health, career). While everyone has some degree of luck, some are lucky in just certain areas of their lives. Intuition and instincts play a role in luck, he said, such as knowing when &quot;you're on a roll&quot; or knowing when to step back.\nWebsite(s):\n# espresearch.com\nBook(s):\n# Do You See What I See?: Memoirs of a Blind Biker\n# The End of Suffering: Fearless Living in Troubled Times\n# Limitless Mind\n# Luck: Understanding Luck and Improving the Odds\n","torrent":{"xt":"urn:btih:0765cdf6c42e2cc17aa0e9088e988aa084d5054b","amp;dn":"Coast.to.Coast.AM.July.08.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0765cdf6c42e2cc17aa0e9088e988aa084d5054b","infoHashBuffer":{"type":"Buffer","data":[7,101,205,246,196,46,44,193,122,160,233,8,142,152,138,160,132,213,5,75]},"announce":[],"urlList":[]}}