{"title":"W.A.S.P. - I Wanna Be Somebody","uid":5149984,"size":131856388,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:079c9f323eb1da50b08fa893d432c603030456fa&amp;dn=W.A.S.P.+-+I+Wanna+Be+Somebody&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1257466085,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nW.A.S.P. is the debut eponymous album by W.A.S.P., released August 17, 1984. The album has been known under three different names. The spine of the vinyl release has Winged Assassins printed on it. Cassette releases of the album had the first track of the album, I Wanna Be Somebody printed in bold letters, as was common for albums named after the first track. The album is now usually referred to as W.A.S.P..\n\nThe Song &quot;Sleeping (In the Fire)&quot; has been covered by Tiamat, &quot;Hellion&quot; by Children of Bodom, &quot;L.O.V.E. Machine&quot; by Fallen Man in 2007, Lullacry and Fozzy, &quot;I Wanna Be Somebody&quot; by Sentenced, Catamenia, Witchery, and Gates of Ishtar, and &quot;The Torture Never Stops&quot; by death metal supergroup Torture Division. The song &quot;School Daze&quot; has been noted to be an adaption of Alice Cooper's &quot;School's Out.&quot;\n\nOn its original release, iconic track &quot;Animal (F*** Like A Beast)&quot; was removed after record company objections. It was released on an independent label in the UK as a single, then re-instated for the 1998 reissue. Songs are written and composed by Lawless, except &quot;Tormentor&quot; by Lawless &amp; Holmes and &quot;The Flame&quot; by Lawless, Holmes &amp; J. Marquez.\n\nTheir song &quot;I Wanna Be Somebody&quot; achieved much success that it was ranked #84 on VH1's list of the top 100 hard rock songs.\n\nW.A.S.P. is an American heavy metal band formed in 1982. They emerged from the same Los Angeles scene that spawned MÃƒÂ¶tley CrÃƒÂ¼e, Ratt, Quiet Riot and others. The band's popularity peaked in the 1980s, yet they continue to record and tour, making them one of the most enduring of the West Coast heavy metal bands. W.A.S.P. gained notoriety for their shock rock themed image, lyrics and live performances. They have sold over 12 million albums.\n\nThe band were a prominent target in the mid-1980s of the Parents Music Resource Center (PMRC) led by Tipper Gore, wife of then-Senator Al Gore (D-TN), an organization that pushed for warning labels on recorded music. The band immortalized its fight with the PMRC on the song &quot;Harder, Faster&quot; from their 1987 live album, Live...In the Raw.\n\nBlackie Lawless remains the only member from the original line-up. They released their most recent album in October 2009, entitled Babylon.\n\nIn October 2007, W.A.S.P. embarked on The Crimson Idol Tour, to celebrate that album's 15th anniversary. It is the first time that the album, often regarded to be among the band's finest work, was to be played in full from start to finish. The tour kicked off in Greece, in Thessaloniki at the Principal Club Theater on October 26, 2007. It was also announced that this tour would be W.A.S.P.'s last tour for some time. However, the band already confirmed some European festival appearances for summer 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:079c9f323eb1da50b08fa893d432c603030456fa","amp;dn":"W.A.S.P.+-+I+Wanna+Be+Somebody","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"079c9f323eb1da50b08fa893d432c603030456fa","infoHashBuffer":{"type":"Buffer","data":[7,156,159,50,62,177,218,80,176,143,168,147,212,50,198,3,3,4,86,250]},"announce":[],"urlList":[]}}