{"title":"Jesse McCartney feat. T-Pain - Body Language","uid":5172794,"size":130861060,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:079fe420a0b65060044cc324a4e30a7089806458&amp;dn=Jesse+McCartney+feat.+T-Pain+-+Body+Language&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258789856,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Body Language&quot; is Jesse McCartney's fourth single from his album Departure and his second single from Departure: Recharged.\n\nIt was released as a remix featuring T-Pain. The remix is almost similar to the track of the album except for certain parts of the song which is sung by T-Pain. It has been officially announced by Jesse McCartney during his tour that this would be his next single during this summer as a follow up to the successful hit &quot;Leavin'&quot; which was released last summer apart from &quot;It's Over&quot; and &quot;How Do You Sleep?&quot;. No official confirmed date has been released by Jesse McCartney about when this single would hit radio airwaves but it is rumoured to be released during mid-August. The official music video can already be found on&quot;Body Language&quot; consist of a line of lyric adopted from &quot;Leavin'&quot;, Jesse McCartney's most successful single to date as a mark of similarities between the two tracks. The catchy line &quot;The thing you got behind you is amazing&quot; were exactly the same in both the singles. &quot;Body Language&quot; was also a blend of few different languages in the form of short phrases and words such as parlez vous francais?, konnichiwa and chica. All three of the phrase and word is repeated during the chorus and is French, Japanese and Spanish respectively. This was a first of its kind for Jesse McCartney alongside his other tracks on Departure: Recharged. The music video was released on September 8, 2009.\n\n&quot;Body Language&quot; has sold approximately 150,000 digital copies as of Oct. 21, 2009. It also debuted on the Billboard Hot 100 at #84. It fell off the next week, but re-entered at #71 and has reached a peak of #35.\n\nDeparture is the fourth studio album by American pop singer Jesse McCartney, released on May 20, 2008. The album has sold 260,000 copies in the U.S. as of February 9, 2009. The album was re-released on April 7, 2009 under the name Departure: Recharged.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:079fe420a0b65060044cc324a4e30a7089806458","amp;dn":"Jesse+McCartney+feat.+T-Pain+-+Body+Language","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"079fe420a0b65060044cc324a4e30a7089806458","infoHashBuffer":{"type":"Buffer","data":[7,159,228,32,160,182,80,96,4,76,195,36,164,227,10,112,137,128,100,88]},"announce":[],"urlList":[]}}