{"title":"Hostage [DVDRip][Spanish]","uid":6433622,"size":1677398558,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07e4dace342737867a3a1a0086e3cec30bb61a8f&amp;dn=Hostage+%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"virana","files":-1,"time":1306751232,"description":"Hostage [DVDrip]\n\nFicha tecnica:\n\nDirecciÃƒÂ³n: Florent Siri.\nPaÃƒÂ­ses: USA y Alemania.\nAÃƒÂ±o: 2005.\nDuraciÃƒÂ³n: 110 min.\nGÃƒÂ©nero: AcciÃƒÂ³n.\nInterpretaciÃƒÂ³n: Bruce Willis (Jeff Talley), Kevin Pollak (Walter Smith), Jimmy Bennett (Tommy Smith), Michelle Horn (Jennifer Smith), Ben Foster (Mars Krupchek), Jonathan Tucker (Dennis Kelly), Marshall Allman (Kevin Kelly), Serena Scott Thomas (Jane Talley), Rumer Willis (Amanda), Kim Coates (El vigilante), Robert Knepper (Will).\nGuiÃƒÂ³n: Doug Richardson; basado en la novela de Robert Crais.\nProducciÃƒÂ³n: Bruce Willis, Arnold Rifkin, Mark Gordon y Bob Yari.\nMÃƒÂºsica: Alexandre Desplat.\nFotografÃƒÂ­a: Giovanni Fiore Coltellacci.\nMontaje: Olivier Gajan y Richar J.P. Byard.\nDiseÃƒÂ±o de producciÃƒÂ³n: Larry Fulton.\nDirecciÃƒÂ³n artÃƒÂ­stica: Keith P. Cunningham.\nVestuario: Elisabetta Beraldo.\nEstreno en USA: 11 Marzo 2005.\nEstreno en EspaÃƒÂ±a: 28 Octubre 2005.\n\nSinopsis:\n\nDestrozado por una situaciÃƒÂ³n con rehenes que se saldÃƒÂ³ con la muerte de una joven madre y su hijo, Jeff Talley (Bruce Willis), negociador de la policÃƒÂ­a de Los Angeles (LAPD), abandona la ciudad para ocupar un cargo de menor entidad como jefe de policÃƒÂ­a de la ciudad de Bristo Camino, en el condado de Ventura. Tres adolescentes vigilan el hogar de una familia con miras a robarles el automÃƒÂ³vil, pero escogen la casa equivocada en el dÃƒÂ­a equivocado. Los tres se ven atrapados en un recinto multimillonario en las afueras de la ciudad que es propiedad de un contable corrupto. Aterrorizados, los adolescentes toman como rehenes a los miembros de la familia, situando a Talley exactamente en el tipo de circunstancia que jamÃƒÂ¡s hubiera querido afrontar de nuevo. Gustoso, Talley no tarda en delegar su autoridad sobre el caso al Departamento del sheriff del Condado de Ventura, para abandonar la escena acto seguido. Sin embargo, en el interior del recinto se halla informaciÃƒÂ³n digital del mÃƒÂ¡ximo interÃƒÂ©s para unos misteriosos delincuentes y la operaciÃƒÂ³n que tienen entre manos. No se detendrÃƒÂ¡n ante nada para recuperar lo que consideran suyo, aunque implique tomar como rehenes a los miembros de la familia de Talley. Ello harÃƒÂ¡ que ÃƒÂ©ste se vea obligado a retomar el mando que habÃƒÂ­a abandonado. Esta situaciÃƒÂ³n tan delicada va a transformarse rÃƒÂ¡pidamente en otra mucho mÃƒÂ¡s imprevisible y horrorosa de lo que Talley jamÃƒÂ¡s hubiera imaginado.\n\nRipeo:\nPrograma: DVD fab 7.0 dos pasadas.\nCodec: DX50 - DivX 5.x/6.x\nBitrate de la Imagen: 1600 Kb/s\nAudio: AC3 - 448 kb/s\nTamaÃƒÂ±o: 1.67 Gb","torrent":{"xt":"urn:btih:07e4dace342737867a3a1a0086e3cec30bb61a8f","amp;dn":"Hostage+%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07e4dace342737867a3a1a0086e3cec30bb61a8f","infoHashBuffer":{"type":"Buffer","data":[7,228,218,206,52,39,55,134,122,58,26,0,134,227,206,195,11,182,26,143]},"announce":[],"urlList":[]}}