{"title":"BetterZip 1.8.1 incl. patcher","uid":4987403,"size":4862610,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:08d0f1449718a8f6e20dbecde70bacc12924310f&amp;dn=BetterZip+1.8.1+incl.+patcher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pelleke","files":1,"time":1246817727,"description":"B E T T E R Z I P   1 . 8 . 1\n\nExtract Only Files You Really Need\n\nIf you only need a few files or folders from a larger archive, you don't have to extract the whole thing and remove all the unneeded files. Simply drag the files you need from the BetterZip window to any Finder window or the desktop.\nOpen Archives Without Extracting\n\nBetterZip can open archives without first extracting them which is fast, really fast. Then search for a file with the search box like in iTunes. BetterZip can open and extract archives with the most common formats: ZIP, SIT, TAR, GZip, BZip2, RAR, 7-Zip, CPIO, ARJ, LZH/LHA, JAR, WAR, CAB, ISO, CHM, RPM, DEB, NSIS, BIN, HQX, DD.\n\nCreate Archives\n\nSimply drag files and folders from your hard drives, disks, or network places into your new zip file. You no longer have to copy all the files into a temporary folder first. When you are ready save the archive and everything is packed together. The supported formats are ZIP, TAR, GZip and BZip2 compressed TAR, 7-ZIP, and RAR (using the external RAR commandline tool). Large archives can be split.\nProtect Your Data\n\nBetterZip can protect your data with a password and create WinZipÃ‚Â® compatible AES-256 encrypted archives. 7-zip and rar archives can also be protected with strong data encryption.\nUpdate Archives\n\nAdd new or updated files to existing archives. Remove any file or folder from the archive, or even move files around inside the archive as if it were a normal folder.\nMake Archives Compatible\n\nStrip Mac specific files and resource forks from archives for best compatibility with systems like Windows or Linux.\nBetterZip Speaks Eight Languages\n\nBesides the English version BetterZip includes German, French, Italian, Japanese, Chinese, Spanish, and Russian localizations, each with a complete translation of the documentation.\n\n===\nInstallation instructions:\nDrag app to Applications folder, then use included patcher to patch it.","torrent":{"xt":"urn:btih:08d0f1449718a8f6e20dbecde70bacc12924310f","amp;dn":"BetterZip+1.8.1+incl.+patcher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08d0f1449718a8f6e20dbecde70bacc12924310f","infoHashBuffer":{"type":"Buffer","data":[8,208,241,68,151,24,168,246,226,13,190,205,231,11,172,193,41,36,49,15]},"announce":[],"urlList":[]}}