{"title":"Michael Jackson - Bad (Version 2)","uid":4987950,"size":152784900,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:08dec76b454747ad2dad4dd05a3da6de9340f502&amp;dn=Michael+Jackson+-+Bad+%28Version+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1246869449,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video is the short version.\n\n\n\n&quot;Bad&quot; was a 1987 hit recording by American singer Michael Jackson. The song was the second of five Billboard Hot 100 number-one hit singles from the album Bad, and was his seventh number-one single overall.\n\nThe song was originally intended as a duet with longtime rival Prince. Quincy Jones, in an interview included in the special edition of Bad, said that Prince told Jackson and him that he had not wanted to participate because &quot;it would be a hit without (him)&quot;.\n\nIn his 1988 autobiography Moonwalk, Jackson wrote: &quot;'Bad' is a song about the street. It's about this kid from a bad neighborhood who gets to go away to a private school. He comes back to the old neighborhood when he's on a break from school and the kids from the neighborhood start giving him trouble. He sings, 'I'm bad, you're bad, who's bad, who's the best?' He's saying when you're strong and good, then you're bad.&quot;\n\nIn 2006, the single, as well as the video, was re-released as part of the Visionary - The Video Singles package.\n\n&quot;Bad&quot; was the second consecutive #1 single from Jackson's Bad album, after &quot;I Just Can't Stop Loving You&quot;. &quot;Bad&quot; appeared on the U.S. Billboard Hot 100 singles chart the week of September 19, 1987, the same week &quot;I Just Can't Stop Loving You&quot; advanced to the #1 spot. Like its predecessor, &quot;Bad&quot; soared to the #1 spot, this time within six weeks, arriving at #1 the week of October 24, 1987. &quot;Bad&quot; remained in the top spot for two consecutive weeks, keeping Madonna's &quot;Causing a Commotion&quot; out of the number-one spot.\n\nBad is the seventh studio album by American recording artist Michael Jackson. It was released on August 31, 1987 by Epic/CBS Records. The record was released nearly five years after his previous studio album. Twenty years after its release, the album has sold over 30 million copies worldwide, and shipped 8 million units in the United States. Bad is the first, and currently only, album ever to feature five Billboard Hot 100 #1 singles.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:08dec76b454747ad2dad4dd05a3da6de9340f502","amp;dn":"Michael+Jackson+-+Bad+%28Version+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08dec76b454747ad2dad4dd05a3da6de9340f502","infoHashBuffer":{"type":"Buffer","data":[8,222,199,107,69,71,71,173,45,173,77,208,90,61,166,222,147,64,245,2]},"announce":[],"urlList":[]}}