{"title":"Cobra Starship - Good Girls Go Bad","uid":5004133,"size":125497348,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:09200ba597617d2cb33bc435a51442847e31eb69&amp;dn=Cobra+Starship+-+Good+Girls+Go+Bad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247656681,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Good Girls Go Bad&quot; is a song recorded by American pop punk band Cobra Starship which features guest vocals from Gossip Girl star Leighton Meester. It is the first single released from their upcoming third studio album titled Hot Mess. The song was released digitally through iTunes on May 11, 2009. On May 8, 2009, &quot;Good Girls Go Bad&quot; made its radio debut on KIIS-FM with Ryan Seacrest's show. The song was produced by American Idol judge Kara DioGuardi and Kevin Rudolf.\n\nA music video for the song was shot on May 3, 2009 in New York City and premiered on Monday, June 29, 2009. Leighton shot the clip while she was in town for the 2009 Costume Institute Gala. The concept of the video is that Meester runs an underground speakeasy, complete with shelves of booze, gambling tables and a dance floor. The band is in charge of the above-ground deli that acts as a front operation to hide the debauchery within. To gain access to the illegal club, patrons must order the correct sandwich and proceed down a staircase. Meester and Victoria Asher, the band's keytarist, exchange several texts messages while in the club concerning a package hidden in the DJ's booth. Meester retrieves the package and shortly after, the club is raided by police. At the end of the video, it is revealed that Asher and Meester were undercover agents involved in a sting operation.\n\nCobra Starship is an American pop punk band created by former Midtown bassist/lead vocalist Gabe Saporta. The members consist of lead vocalist Saporta, guitarist Ryland Blackinton, bassist Alex Suarez, Nate Novarro on drums and Victoria Asher on keytar, all of whom provide backing vocals. The band is classed generally as pop punk with the electronic/synth sounds of alternative dance and synthpop.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:09200ba597617d2cb33bc435a51442847e31eb69","amp;dn":"Cobra+Starship+-+Good+Girls+Go+Bad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09200ba597617d2cb33bc435a51442847e31eb69","infoHashBuffer":{"type":"Buffer","data":[9,32,11,165,151,97,125,44,179,59,196,53,165,20,66,132,126,49,235,105]},"announce":[],"urlList":[]}}