{"title":"Entropy - The Last Question EP (2009)","uid":4988978,"size":43477777,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:099c05e2e8d7b28c22819feb04f2c33143e65cac&amp;dn=Entropy+-+The+Last+Question+EP+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"qpMM","files":9,"time":1246930381,"description":"Entropy - The Last Question EP (2009)\n\n&quot;While writing a lot of technical death metal, Entropy never completely abandoned their black metal origins; they also incorporate elements of other genres such as folk metal and funeral doom metal, leading to a very diverse sound incorporating the various influences of the three core members. Lyrics by Ben and Jerrod deal with war, rebellion, religion, mythology, history and protecting the environment, with an overall theme of decay, and entropy.&quot;\n\nEntropy is a small band from Lexington, KY with a lot of promising talent. If you support them, please consider buying the EP or checking them out online: &lt;a href=&quot;\nhttp://www.riotousrecordsusa.com/entropy.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.riotousrecordsusa.com/entropy.html&lt;/a&gt;\nhttp://www.metal-archives.com/band.php?id=116733\nhttp://www.facebook.com/pages/Entropy/42430501820\n\n========================================\n\nSo be buried in the crypt of your pride,\nAnd decay with society's lies,\nDrown in the darkest of depths that our sea can provide,\nI'll be watching, wondering how you survive.\n\nThey mean nothing when free will exists,\nOnly Rebels make a difference\nThey mean nothing when free will exists,\nOnly Rebels make a difference\nRebellion is Freedom\nFree yourself\n\nThey mean nothing\nNothing at all\n\n-&quot;Rebellion&quot;, Entropy\n\n========================================\n\nAshes From The Furnace - 80%\nWritten by Kruhl on May 13th, 2009\n\nThis release is far better than the last release from this band because it seems to have some continuity in that all the songs don't seem to be random works of whatever thrown onto a disk. The songs on this are good compositionally but the quality is very lacking in all departments. Seriously... Varg could outdo them.\n\nThe problem starts with the guitar tone (Josh's at least). It has a lot of treble crammed into it and not enough substance. It's screechy and generally hard to listen to. The bass drum was another problem. It lacks any of the sound qualities that a bass drum should have. It doesn't sound thuddy enough. Better than a triggered bass drum though. That's for damn sure. The vocal performance was decent. It was good in most spots but not so good in others.\n\nAs far as song composition goes, this release was fantastic. The songs are well-structured (they don't get boring and stay the same) and they flow well. My favorite track off of the EP has to be Eclipse. It was very dark and doomy and incredibly well-written. The song uses a lunar eclipse as a metaphor for the end of the universe which is brilliant and the music brings down the mood from their killer cover of Pull the Plug (by Death). The other songs were good but Eclipse just shines among them.\n\nThis release is definitely worth the dollar that you'll use to be able to download it off the Riotous Records website. Or, if you see Entropy in person, they'll probably just give you one... if they have any left.\n\nThis is good for fans of Behemoth, Death, Nile, Evoken and Dethklok.\n\n========================================","torrent":{"xt":"urn:btih:099c05e2e8d7b28c22819feb04f2c33143e65cac","amp;dn":"Entropy+-+The+Last+Question+EP+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"099c05e2e8d7b28c22819feb04f2c33143e65cac","infoHashBuffer":{"type":"Buffer","data":[9,156,5,226,232,215,178,140,34,129,159,235,4,242,195,49,67,230,92,172]},"announce":[],"urlList":[]}}