{"title":"500-Days-of-Summer.2009.DVDrip[vice]","uid":5146658,"size":463619519,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:09ece3e7caa4431439d85b41d8de6e3681c26bf0&amp;dn=500-Days-of-Summer.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vicerock","files":-1,"time":1257296445,"description":"500 DAYS OF SUMMER 2009 DVDrip\n\n\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nruntime 01:35:04\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCast\n\n* Joseph Gordon-Levitt as Tom Hansen, a trained architect who works as a writer at a greeting card company; Tom is a romantic who believes in true love\n* Zooey Deschanel as Summer Finn, assistant to Tom's boss and romantic interest of Tom\n* ChloÃƒÂ« Moretz as Rachel Hansen, Tom's sister\n* Geoffrey Arend as McKenzie, Tom's co-worker at the greeting card company\n* Matthew Gray Gubler as Paul, a friend of Tom\n* Clark Gregg as Vance, Tom's boss\n* Minka Kelly as Autumn\n* Patricia Belcher as Millie\nPlot\n\nThe film is presented in a nonlinear narrative; this summary is a linear version of the events of the film.\n\nOn January 8, Tom Hansen (Joseph Gordon-Levitt) meets Summer Finn (Zooey Deschanel), the new assistant to his boss (Clark Gregg). Tom trained as an architect but works as a writer at a greeting card company, living in Los Angeles.\n\nOne month later, following a karaoke night, Tom's co-worker, McKenzie (Geoffrey Arend), lets slip that Tom is attracted to Summer. Over the next few months Summer and Tom grow closer, despite Summer making it clear to Tom that she does not believe in true love, and does not want a boyfriend.\n\nTom shows Summer his favorite spot in the city, which looks out over a number of buildings he likes, although the view is spoiled by car parks. After a few weeks dating, Tom gets into a fight with a guy chatting up Summer, and they have their first argument.\n\nOn day 290, Summer and Tom split up after they see The Graduate, a film which Tom thinks shows true love. Tom does not take the break up well and Tom's friends call his younger sister, Rachel (ChloÃƒÂ« Moretz), to calm him down.\n\nSummer quits the greeting card company and Tom's boss moves him to consolations, as his depression is not suitable for happier events.\n\nMonths later Summer and Tom attend the wedding of a co-worker, they dance at the wedding and Summer catches the bouquet. They sit next to each other on the journey home and Summer invites Tom to a party at her apartment for the Friday. Tom attends the party and sees that Summer is wearing an engagement ring. Realizing what is being celebrated, he leaves the party.\n\nTom enters a deep depression, only leaving the house for alcohol and junk food. After a few days, he returns to work drunk and quits his job. He sets about re-applying himself to architecture, makes a list of firms, and begins to attend interviews.\n\nOn day 488, he meets Summer at his favorite spot and they reconcile; he wishes her well. Twelve days later, on Wednesday, May 23, he attends a job interview and meets a girl (Minka Kelly), who is also applying for the same job. Before entering the interview, he makes a date to have coffee with her afterward. He asks her for her name, and she replies, &quot;Autumn.&quot;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1022603/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1022603/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:09ece3e7caa4431439d85b41d8de6e3681c26bf0","amp;dn":"500-Days-of-Summer.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09ece3e7caa4431439d85b41d8de6e3681c26bf0","infoHashBuffer":{"type":"Buffer","data":[9,236,227,231,202,164,67,20,57,216,91,65,216,222,110,54,129,194,107,240]},"announce":[],"urlList":[]}}