{"title":"La.Ragazza.Che.Giocava.Con.Il.Fuoco.2009.iTALiAN.LD.TS.XviD-SiLE","uid":5185684,"size":1454338048,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0a4683d5a02ef5b7537019257a50dac2ccd1238c&amp;dn=La.Ragazza.Che.Giocava.Con.Il.Fuoco.2009.iTALiAN.LD.TS.XviD-SiLE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OverNight","files":2,"time":1259450812,"description":"La ragazza che giocava con il fuoco\n\nTitolo originale:  Flickan som lekte med elden \nNazione:  Svezia \nAnno:  2009 \nGenere:  Thriller \nDurata:    \nRegia:  Daniel Alfredson \nSito ufficiale:  www.laragazzachegiocavaconilfuoco.it \n\n \nCast:  Noomi Rapace, Michael Nyqvist, Lena Endre, Georgi Staykov, Sofia Ledarp, Micke Spreitz, Per Oscarsson, Paolo Roberto \nProduzione:  Nordisk Film, Sveriges Television, Yellow Bird Films, ZDF Enterprises \nDistribuzione:  Bim Distribuzione \nData di uscita:  25 Settembre 2009 (cinema) \n\nTrama:\nDue giornalisti della rivista Millenium vengono brutalmente assassinati proprio quando stanno per pubblicare clamorose rivelazioni sul mercato del sesso in Svezia. E sull'arma del delitto ci sono le impronte di Lisbeth Salander (Noomi Rapace), una ragazza che ha alle spalle una storia di comportamenti violenti, considerata pericolosa. Ora Lisbeth ÃƒÂ¨ ricercata. Ma sembra che nessuno riesca a trovarla. Intanto, il direttore della rivista, Mikael Blomqvist (Michael Nyqvist), non crede a quello che dicono i notiziari: conoscendo Lisbeth, sa che diventa violenta quando ha paura, e cerca in tutti i modi di arrivare a lei prima della polizia. Mentre indaga per ricomporre la trama di un complicato puzzle, Blomqvist si trova a fare i conti con alcuni spietati criminali, tra cui lo spaventoso &quot;gigante biondo&quot; armato di motosega - un omone che non sente il dolore fisico. Nel corso delle sue indagini, Blomqvist scopre anche alcuni tragici e dolorosi eventi della vita di Lisbeth: internata in un istituto psichiatrico a 12 anni e dichiarata incapace a 18, la giovane ÃƒÂ¨ il prodotto di un sistema ingiusto e corrotto. Ma piÃƒÂ¹ che una vittima impotente, Lisbeth ÃƒÂ¨ l'angelo vendicatore che si abbatte su chi le ha fatto del male con una collera terrificante nella sua intensitÃƒÂ , ma prodigiosa nei risultati.\n","torrent":{"xt":"urn:btih:0a4683d5a02ef5b7537019257a50dac2ccd1238c","amp;dn":"La.Ragazza.Che.Giocava.Con.Il.Fuoco.2009.iTALiAN.LD.TS.XviD-SiLE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a4683d5a02ef5b7537019257a50dac2ccd1238c","infoHashBuffer":{"type":"Buffer","data":[10,70,131,213,160,46,245,183,83,112,25,37,122,80,218,194,204,209,35,140]},"announce":[],"urlList":[]}}