{"title":"Thousands of Kurds take to the streets in Syria","uid":6340701,"size":27519022,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:0a675a4e7a34fd45bbaf963d77772ab323be3947&amp;dn=Thousands+of+Kurds+take+to+the+streets+in+Syria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zwddrnl","files":4,"time":1303606171,"description":"We need you! To help the people of Syria.\n\nBecause the Syrian people want freedom, democracy for all of Syria, freedom of expression, the release of political prisoners, for political parties to be allowed and a free media. We want a stop to the killings in Damascus, Daraa, Lattakia, Douma, Tartous, Izra and Homs. Without that we are slaves.\n\nDo you know how  to use a search engine?  You can help!  Read on ...\n\nWe need your help preserving a record of the events in Syria, often at risk of their lives. Help us preserve and spread the story of the people of Syria.  It must not be forgotten.\n\nThis torrent contains videos From The Syrian revolution.\nPlease download and help seed these torrents.\n\n\nWhen you find more video, copy the link and post it on this pad http://www.anonpad.org/XSuSSwF4s1. We will rip it for a next torrent. Dont worry about posting duplicates, we will sort them out when we set up the torrent. Please Include a description and a date if possible, and label videos as (warning: graphic)\n\nBE AWARE - ASSUME THAT MOST VIDEO HERE IS UNSETTLING, GRAPHIC\nNOT ALL VIDEOS HAVE BEEN LABELED AS GRAPHIC.  WATCH AT YOUR DISCRETION. QUITE FRANKLY, YOU WILL BE  HAPPIER IN IGNORANCE, BUT IS THAT A GOOD THING?","torrent":{"xt":"urn:btih:0a675a4e7a34fd45bbaf963d77772ab323be3947","amp;dn":"Thousands+of+Kurds+take+to+the+streets+in+Syria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a675a4e7a34fd45bbaf963d77772ab323be3947","infoHashBuffer":{"type":"Buffer","data":[10,103,90,78,122,52,253,69,187,175,150,61,119,119,42,179,35,190,57,71]},"announce":[],"urlList":[]}}