{"title":"Ultimate Sessions","uid":6346489,"size":577348745,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0aa07c81cf05e8b78d98251c5d95651dfdb9de48&amp;dn=Ultimate+Sessions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"patjepg","files":1,"time":1303851139,"description":"A rare nexus of optimal swell, marquee surfers and skilled, dedicated surf cinematographers created a vast library of surfing's greatest moments over the last three decades.\n\nDirector Ira Opper and writer Matt Warshaw have painstakingly sifted the best of the best -- from &quot;Cosmic Children&quot; to &quot;September Sessions&quot; -- to bring you a premium no filler blend of touchstone moments, genuine humor, eye opening surf action and authentic surf culture. Witness Uluwatu ridden for the first time in Alby Falzon's 1971 watershed &quot;Morning of the Earth.&quot; See Shaun Tomson and Mark Richards' epic tube duel at Off the Wall in Bill Delaney's 1978 &quot;Free Ride.&quot;\n\nPeer into the future with Kelly Slater's Indonesian performances in Jack Johnson's &quot;September Sessions.&quot; As well, featured footage includes: Scott Dittrich's Fluid Drive, Steve Soderberg's Ocean Fever, Scott Dittrich's Amazing Surf Stories and Sonny Millers' Searching for Curren.\n\nAthletes:\n\nRobert August, Mike Hynson, Jeff Hakman, Steve Cooney, Rusty Miller, Michael Peterson, Peter Townend, Keith Paull, Wayne Bartholomew, Paul Nielson, J Riddle, George Trafton, Shaun Tomson, Sam Hawk, Gerry Lopez, Mark Richards, Buttons Kaluhiokalani, Dane Kealoha, Randall Kim, Tom Curren, Kelly Slater, Ross Williams, Shane Dorian, Brad Gerlach, Rob Machado, Luke Egan\n","torrent":{"xt":"urn:btih:0aa07c81cf05e8b78d98251c5d95651dfdb9de48","amp;dn":"Ultimate+Sessions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aa07c81cf05e8b78d98251c5d95651dfdb9de48","infoHashBuffer":{"type":"Buffer","data":[10,160,124,129,207,5,232,183,141,152,37,28,93,149,101,29,253,185,222,72]},"announce":[],"urlList":[]}}