{"title":"[SoM]Spy [DvdRip-Divx-Ita-Mp3]","uid":5011905,"size":726893518,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0aea2b1b82f132b613d18dd062a594f19fce3e53&amp;dn=%5BSoM%5DSpy+%5BDvdRip-Divx-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mitimex","files":1,"time":1248033195,"description":"\n\nSamantha Caine fa l'insegnante nella scuola di una cittadina di provincia, e tutti sanno che soffre d'amnesia. Viene aiutata da Mick, detective privato in difficoltÃƒÂ , a ricercare il proprio passato. I due vengono a trovarsi nel bel mezzo di una cospirazione ordita da settori deviati del servizo segreto americano e da un famigerato trafficante d'armi. CosÃƒÂ¬ viene a galla che Samantha non ÃƒÂ¨ stata sempre la mamma semplice e tranquilla che si ÃƒÂ¨ sempre creduto. In passato si chiamava Charly Baltimore ed era un'agente segreto di alto livello coinvolta in affari poco puliti del governo. I ricordi lentamente riaffiorano, e Samantha deve ora convivere con Charly. Mick la aiuta a rimettere insieme i fatti vissuti anni prima, ma intanto il suo recupero di memoria viene segnalato, e la ragazza ÃƒÂ¨ fatta bersaglio di attentati, mentre il malvagio Timothy sta preparando un micidiale attentato di terrorismo urbano. Timothy rapisce la figlioletta di Charly, pensando cosÃƒÂ¬ di poter ricattare la madre. Solo dopo molti pericoli e gravissimi rischi, Charly e Mick riescono a sventare la minaccia e a riportare la tranquillitÃƒÂ .","torrent":{"xt":"urn:btih:0aea2b1b82f132b613d18dd062a594f19fce3e53","amp;dn":"%5BSoM%5DSpy+%5BDvdRip-Divx-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aea2b1b82f132b613d18dd062a594f19fce3e53","infoHashBuffer":{"type":"Buffer","data":[10,234,43,27,130,241,50,182,19,209,141,208,98,165,148,241,159,206,62,83]},"announce":[],"urlList":[]}}