{"title":"Lush - For Love","uid":5139502,"size":127694852,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0b4b68a97776578def5cbe7967bba607977fe520&amp;dn=Lush+-+For+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1256793275,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nLush were an English alternative rock band, formed in 1987 and disbanded in 1996. They were one of the first bands to attract the &quot;shoegazing&quot; label, later moving towards Britpop.\n\nSpooky is the debut album of British shoegazing act Lush, produced by Robin Guthrie of Cocteau Twins. The album follows the band's debut mini-album Scar, several EP releases, and the compilation album Gala. Spooky reached the British Top Ten and topped the national indie charts. The album produced three singles, &quot;Nothing Natural,&quot; &quot;For Love,&quot; and &quot;Superblast!&quot;\n\nThe band's profile was raised by extensive touring, including an appearance at the Glastonbury Festival and tours of Japan and the United States (with Ride). Lush's first full-length album of completely new material was Spooky, released in January 1992. Again produced by Guthrie, Spooky featured a sound very similar to Guthrie's band Cocteau Twins, with walls of sound and a great deal of guitar effects. Reviews were mixed and critics of the album hold that Guthrie's production brought the sound away from the band's original creative vision; although the album sold well, reaching number 7 in the UK Albums Chart. The album was preceded by the band's first UK top 40 single, &quot;For Love.&quot;\n\nThe band formed in 1987, initially named The Baby Machines, with a line-up of Meriel Barham (vocals), Emma Anderson (guitar), Miki Berenyi (guitar), Steve Rippon (bass), and Chris Acland (drums). Anderson and Berenyi had been friends since the early 1980s, and published the Alphabet Soup fanzine together. In 1986 Anderson joined The Rover Girls as bassist and Berenyi joined The Bugs as guitarist; neither band lasted long, and in 1987 they joined Barham and Acland in The Baby Machines. Rippon joined shortly thereafter, and the band members decided on a change of name to Lush, making their live debut at the Camden Falcon on March 6, 1988. Barham was fired, with the rest of the band deciding she lacked commitment (she later joined Pale Saints). Anderson and Berenyi then took on lead vocal duties.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0b4b68a97776578def5cbe7967bba607977fe520","amp;dn":"Lush+-+For+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b4b68a97776578def5cbe7967bba607977fe520","infoHashBuffer":{"type":"Buffer","data":[11,75,104,169,119,118,87,141,239,92,190,121,103,187,166,7,151,127,229,32]},"announce":[],"urlList":[]}}