{"title":"B.B.  King - Singin' The Blues (1956)","uid":5107603,"size":53726913,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0bc642a925b44fec2858cd20b3583bbc914185bf&amp;dn=B.B.++King+-+Singin%5C%27+The+Blues+%281956%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":-1,"time":1254498034,"description":"His reign as King of the Blues has been as long as that of any monarch on earth. Yet B.B. King continues to wear his crown well. At age 76, he is still light on his feet, singing and playing the blues with relentless passion. Time has no apparent effect on B.B., other than to make him more popular, more cherished, more relevant than ever. Don't look for him in some kind of semi-retirement; look for him out on the road, playing for people, popping up in a myriad of T.V. commercials, or laying down tracks for his next album. B.B. King is as alive as the music he plays, and a grateful world can't get enough of him. \n\nFor more than half a century, Riley B. King - better known as B.B. King - has defined the blues for a worldwide audience. Since he started recording in the 1940s, he has released over fifty albums, many of them classics. He was born September 16, 1925, on a plantation in Itta Bena, Mississippi, near Indianola. In his youth, he played on street corners for dimes, and would sometimes play in as many as four towns a night. In 1947, he hitchhiked to Memphis, TN, to pursue his music career. Memphis was where every important musician of the South gravitated, and which supported a large musical community where every style of African American music could be found. B.B. stayed with his cousin Bukka White, one of the most celebrated blues performers of his time, who schooled B.B. further in the art of the blues.\n\nB.B.'s first big break came in 1948 when he performed on Sonny Boy Williamson's radio program on KWEM out of West Memphis. This led to steady engagements at the Sixteenth Avenue Grill in West Memphis, and later to a ten-minute spot on black-staffed and managed Memphis radio station WDIA. &quot;King's Spot,&quot; became so popular, it was expanded and became the &quot;Sepia Swing Club.&quot; Soon B.B. needed a catchy radio name. What started out as Beale Street Blues Boy was shortened to Blues Boy King, and eventually B.B. King.\nIn the mid-1950s, while B.B. was performing at a dance in Twist, Arkansas, a few fans became unruly. Two men got into a fight and knocked over a kerosene stove, setting fire to the hall. B.B. raced outdoors to safety with everyone else, then realized that he left his beloved $30 acoustic guitar inside, so he rushed back inside the burning building to retrieve it, narrowly escaping death. When he later found out that the fight had been over a woman named Lucille, he decided to give the name to his guitar to remind him never to do a crazy thing like fight over a woman. Ever since, each one of B.B.'s trademark Gibson guitars has been called Lucille. \n\nSoon after his number one hit, &quot;Three O'Clock Blues,&quot; B.B. began touring nationally. In 1956, B.B. and his band played an astonishing 342 one-night stands. From the chitlin circuit with its small-town cafes, juke joints, and country dance halls to rock palaces, symphony concert halls, universities, resort hotels and amphitheaters, nationally and internationally, B.B. has become the most renowned blues musician of the past 40 years. \n\n\n1. Please Love Me \n2. You Upset Me Baby \n3. Everyday I Have the Blues \n4. Bad Luck \n5. 3 O'Clock Blues \n6. Blind Love \n7. Woke Up This Morning \n8. You Know I Love You \n9. Sweet Little Angel \n10. Ten Long Years \n11. Did You Ever Love a Woman \n12. Crying Won't Help You\n\n\nmp3   192kbps\n\nThis is B.B. King!\n\n\nI don't want any of you coming in to tell me\nthat you thought you were downloading a\nGuy Mitchell album.   Savvy?","torrent":{"xt":"urn:btih:0bc642a925b44fec2858cd20b3583bbc914185bf","amp;dn":"B.B.++King+-+Singin%5C%27+The+Blues+%281956%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bc642a925b44fec2858cd20b3583bbc914185bf","infoHashBuffer":{"type":"Buffer","data":[11,198,66,169,37,180,79,236,40,88,205,32,179,88,59,188,145,65,133,191]},"announce":[],"urlList":[]}}