{"title":"Rope (1948) Jimmy Stewart (multisubs)","uid":5145520,"size":552469466,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0bc7e5886d2d59717b560e539304354e0e0e3771&amp;dn=Rope+%281948%29+Jimmy+Stewart+%28multisubs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mrizzo2","files":-1,"time":1257242353,"description":"movie review posted at moviesbyrizzo.info :\n\nRope is an important movie especially for those in France in particular. Since\nthe French have the most profound reputation in the qualities of sensitive and\nwarm engagement, it is, even here, a look at cold personalities that lurk\nunderneath those that have a false claim to being superior in that they\nconsider themselves intellectually inclined instead. Those that lack human\nfeeling, and think they have the gift of articulation when in fact they are\nbantering with what is clearly inane use of language lacking in all validity\nfrom a moral or logical perspective in true fact. The movie provides a closer\nlook at the pseudo intellectual, a geekish personality of sorts whose thoughts\nare fixated on psychotic needs and desires and who demonstrates that he is\naltogether inane in his sense of virtue and rationality in fact. Style can\nnever substitute for substance.\n\nSomeone that so much lacks not only normal human emotion but instead harbors\nthe degree of psychosis that would lead to murder, is not someone that should\nconsider that he is in fact somewhat brilliant at being &quot;superior civilized&quot; as\nin fact our character in this movie appears to think of himself.\n\nIn the end, it is what people say, and do, and indeed, mostly how they feel on\nvital basic issues that matter more than the pretense of a charlatan in the\nstyle of a sophist from Socratic era language playing at the game of\n&quot;rationally superior&quot;. Those that live by the sword shall die by the sword is\nthe old adage and in this respect such personalities as in this movie are in\nfact an irrational, unsustainable phenomenon and will certainly only give way\nto a Hobbesian reality in time if allowed to persist and prevail in our midst,\ncertainly. If someone appears intelligent to you, perhaps you are being fooled\nby his manner rather than by what he really is. Watch and listen closely, then\nstay &quot;en guarde&quot;!\n\nMichael Rizzo Chessman\n\nOptional subtitles: German and French embedded while external SRTs\nincluded for Dutch, Portuguese, English, Romanian, Spanish, Italian\nand Swedish.","torrent":{"xt":"urn:btih:0bc7e5886d2d59717b560e539304354e0e0e3771","amp;dn":"Rope+%281948%29+Jimmy+Stewart+%28multisubs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bc7e5886d2d59717b560e539304354e0e0e3771","infoHashBuffer":{"type":"Buffer","data":[11,199,229,136,109,45,89,113,123,86,14,83,147,4,53,78,14,14,55,113]},"announce":[],"urlList":[]}}