{"title":"International Terrorism Since 1945 - e01 - Early Israeli Terrori","uid":4991328,"size":204435456,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:0c704a6d63880faa52d8a8482f6cd3e02d395f1f&amp;dn=International+Terrorism+Since+1945+-+e01+-+Early+Israeli+Terrori&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"crux26","files":1,"time":1247060200,"description":"International Terrorism Since 1945\nInternational Terrorism Since 1945 is a television documentary series, shown on UKTV History from 5 January 2009.\nNarrated by Robert Powell, it is shown in half-hour episodes at 5 pm and 5.30pm.\n\nEpisode 1: Early Israeli Terrorism\n\n\nOn 22 July 1946, a Zionist group Irgun, bombed the King David Hotel in Jerusalem, British Mandate of Palestine, killing 91 people.\n\nEpisode 2: The Al-Qaeda Menace\n\nOn 11 September 2001, international Islamist group Al-Qaeda hijacked four passenger planes, and deliberately flew two of them into the World Trade Center, one into The Pentagon, and crashed the other in a field in Pennsylvania, killing 2,998 people. It took 105 minutes for both World Trade Center towers to collapse\n\nEpisode 3: IRA\n\nA brief history of Irish Republican terrorism.\n\nEpisode 4: Fatah/Hamas\n\nPalestinian terrorism, including events in Munich, in September 1972, when militant group Black September kidnapped and murdered 11 Israeli sportspeople.\n\nEpisode 5: PLO\n\nThe hijacking of three passenger planes, in September 1970, by the PLO, accompanied by demands for the release of imprisoned Palestinians.\n\nEpisode 6: ETA, Spain\n\nThe murder of Luis Carrero Blanco. On 20 December 1973, the Prime Minister of Spain was assassinated with a car bomb, by communist group ETA.\n\nEpisode 7: The Moluccan Separatists\n\nSouth Moluccans hijacked a train in the Netherlands on 23 May 1977, demanding independence for their homeland.\n\nEpisode 8: The Baader-Meinhof Gang\n\nTerrorist acts committed by far-left group Baader Meinhof Gang / Red Army Faction in Germany in the 1970s and 1980s.\n\nEpisode 9: EOKA\n\nEOKA's attacks on police stations, government offices and military installations on Cyprus in the 1950s.\n\nEpisode 10: Nasser and Egyptian Terrorism\n\nThe history of Egyptian terrorism, including the 17 November 1997, murder of 59 foreign tourists, three police officers and a tour guide by Egyptian group al-Gama'a al-Islamiyya.\n\nEpisode 11: Colonel Gaddafi and Libya\n\nOn 21 December 1988, Libya bombed transatlantic Pan Am flight 103 over the small Scottish town of Lockerbie.\n\nEpisode 12: Algeria and the OAS\n\nThe group OAS committed a series of attacks, killing hundreds, in an attempt to keep Algeria governed by France.\n\nEpisode 13: The SLA and Patty Hearst\n\nIn 1974, left-wing group the Symbionese Liberation Army kidnapped heiress Patty Hearst, exerting pressure on her to make them join in their violent activities.\n\nEpisode 14: The Weathermen\n\nMilitant student group The Weathermen carried out a series of bombings in the United States from 1969 - 1977.\n\nEpisode 15: The Oklahoma Bomber\n\nOn 19 April 1995, Timothy McVeigh bombed the Alfred P. Murrah Federal Building in Oklahoma City, killing 168 people.\n\nEpisode 16: The Ku Klux Klan\n\nA history of attacks carried out by white, right-wing Christian group KKK.\n\nEpisode17: Japanese Sarin Cult\n\nEpisode18: The Mahdi Army\n\nEpisode19: Che Guevara\n\nEpisode20: Fidel Castro\n\nEpisode21: Somali Warlords\n\nEpisode22: The Taliban\n\nEpisode23: The Tamil Tigers\n\nWhy is it that one terrorist group fails, while another prospers and develops?\nWith the use of rare archive footage, expert testimony and 3D graphics, this incisive series seeks to answer those questions, and many more.","torrent":{"xt":"urn:btih:0c704a6d63880faa52d8a8482f6cd3e02d395f1f","amp;dn":"International+Terrorism+Since+1945+-+e01+-+Early+Israeli+Terrori","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c704a6d63880faa52d8a8482f6cd3e02d395f1f","infoHashBuffer":{"type":"Buffer","data":[12,112,74,109,99,136,15,170,82,216,168,72,47,108,211,224,45,57,95,31]},"announce":[],"urlList":[]}}