{"title":"orphan 2009 (eckyboo)","uid":5167096,"size":839952384,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0ec97fe37c08095135c65d575c511e493a1639f5&amp;dn=orphan+2009+%28eckyboo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eckyboo1","files":1,"time":1258471748,"description":"Kate and John Coleman are rebuilding their marriage after a troubled relationship,\nsince Kate had drinking problem but is under therapy with Dr.\n\nBrowning and has been sober for one year.\n\nHer addiction cost her job; a serious accident with their deaf-dumb daughter Maxine; and the abortion of their stillborn baby Jessica and John had a love affair ten years ago.\n\n\nThey decide to adopt a child and when they meet the nine year-old Russian girl Esther at the St.\n\nMarina Orphanage, they immediately fall in love for the well-educated orphan. Max becomes close to Esther while her reluctant brother Daniel does not welcome his newcomer stepsister. \n\nSooner Kate feels that Esther is manipulative and has some disturbance and she believes it could be hormone or borderline personality disorder but John refuses to listen to his wife and the wounds in their marriage reopen. Kate calls Sister Abigail in the orphanage and the sister advises Kate that Esther had been involved in many troubles in the past. \n\nWhen Sister Abigail visits Kate, Esther kills her with a hammer and is witnessed by the scared Max. When Kate goes further in the investigation of the past of Esther, she contacts the Saarne Institute, a mental hospital in Estonia, and discovers that the girl is not who she tells she is. Written by Claudio Carvalho, Rio de Janeiro, Brazil \n\n\npls seed after download and keep the torrent alive!!!!!!!!!!!!!!!\n\n\n                           \n\n\n\n                           peace","torrent":{"xt":"urn:btih:0ec97fe37c08095135c65d575c511e493a1639f5","amp;dn":"orphan+2009+%28eckyboo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ec97fe37c08095135c65d575c511e493a1639f5","infoHashBuffer":{"type":"Buffer","data":[14,201,127,227,124,8,9,81,53,198,93,87,92,81,30,73,58,22,57,245]},"announce":[],"urlList":[]}}