{"title":"PHOTOSHOP.TOP.SECRET.DVD.3(Murlok)","uid":6449290,"size":3825694460,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0feb71f813791e9beb5f9cd0c70dc8b5eb3a8474&amp;dn=PHOTOSHOP.TOP.SECRET.DVD.3%28Murlok%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Murlok","files":480,"time":1307365843,"description":" Photoshop Top Secret 3 | 3.56 GB\nGenre: Graphics &amp; Design\n\nPhotoshop Top Secret is an Extreme Training Course that teaches you, step by step, how to create cutting-edge graphics and special effects with Adobe Photoshop. This student-friendly home study course consists of four DVD-ROMs with over 16 gigabytes of video tutorials and project files. You can look, learn, practice, and master these advanced techniques wherever you may be, without the need for expensive classes or tutors.\n\n\nDVD 3 Videos :\n\nFlying out of Bounds - Create the classic &quot;out of bounds&quot; effect with a very cool masking trick.\n\nReaching out of Bounds - Creating the illusion of arms and hands reaching out of a picture frame.\n\nChocolate Milk Frog - How to make a frog covered in chocolate.\n\nCovered with Wax - Choose an object and cover it with melting wax.\n\nGrunge Look - Create a unique grunge background that can be used for almost anything.\n\nSquare Fruit - Play with mother nature by changing the shape of fruit.\n\nInvisible Man - How to make a person vanish from their clothing.\n\nMetal Collage - How to create a Robot with pieces of a Photo and then place it into another world.\n\nMorphing Creatures - Morph animals and reptiles together to create interesting creatures.\n\nUsing Layer Comps - How to create multiple layouts in one Photoshop file using Layer Comps.\n\nFirst upload not working now BayImg  not working Well its our Nationalday so have to live with it\n\nEnjoy","torrent":{"xt":"urn:btih:0feb71f813791e9beb5f9cd0c70dc8b5eb3a8474","amp;dn":"PHOTOSHOP.TOP.SECRET.DVD.3%28Murlok%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0feb71f813791e9beb5f9cd0c70dc8b5eb3a8474","infoHashBuffer":{"type":"Buffer","data":[15,235,113,248,19,121,30,155,235,95,156,208,199,13,200,181,235,58,132,116]},"announce":[],"urlList":[]}}