{"title":"RADICI 2 (Roots 2) S02e02 [XviD - ITA Mp3 - sub ITA] [Tntvillage","uid":5168755,"size":670945280,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:10459c807fe73fdd9556e433b75fc231fc593369&amp;dn=RADICI+2+%28Roots+2%29+S02e02+%5BXviD+-+ITA+Mp3+-+sub+ITA%5D+%5BTntvillage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"darayava","files":1,"time":1258567614,"description":"RADICI 2 - Le Nuove Generazioni\n(Roots 2 - The Next Generation)\nSecondo episodio\n\nRadici ÃƒÂ¨ una miniserie televisiva realizzata negli Stati Uniti nel 1977 e basata sul romanzo omonimo di Alex Haley.\nLa serie ha realizzato gli ascolti piÃƒÂ¹ alti di tutti i tempi (130 milioni di telespettatori).\nFu segnalata per quasi una quarantina di Emmy Award e ne vinse nove. Fu inoltre premiata con un Golden Globe ed un Peabody Award.\nTra gli interpreti si segnalano LeVar Burton, Leslie Uggams, Ben Vereen, Brad Davis e Louis Gossett Jr.\nÃƒË† stata trasmessa per la prima volta in Italia da Rai Due in otto puntate a partire dall'8 settembre 1978.\nAd essa ÃƒÂ¨ seguita una seconda serie, Radici: le nuove generazioni, che si focalizza sulla difficile integrazione sociale dei discendenti di Kunta Kinte. \nVisit thelink:\nVisit the IMDB link: http://www.Imdb.com/title/tt0078678\n\n\nTrama\nQuesta serie continua la storia della famiglia di Alex Haley dopo la Guerra Civile americana...\nAvrebbe mai potuto essere realizzato un sequel degno della miniserie piÃƒÂ¹ seguita di tutti i tempi? Per noi la prima serie era andata talmente bene ha detto Alex Haley che pensavamo di dover lasciare le cose cosÃƒÂ¬ com'erano. Ma Haley ha cominciato a portarsi dietro un registratore, dettando altri racconti sulla sua famiglia mano a mano che gli tornavano alla memoria. Questi ricordi si sono poi trasformati in 1.000 pagine di trascrizioni: materiale grezzo per Roots II: le nuove generazioni.\nVincitore dell' Emmy come miglior miniserie, questo sequel di uno storico evento televisivo con 53 star e altri 235 attori ÃƒÂ¨ per molti aspetti un risultato ancora piÃƒÂ¹ significativo, ha scritto Newsweek paragonandolo a Roots (Radici). Anche oggi non ha perso neanche un po' della sua carica drammatica ed emotiva e della sua capacitÃƒÂ  di spingerci ad esaminare la storia e noi stessi. \nLa famiglia di un uomo resta la famiglia di tutti! \n\nVisit thelink:\n\nGenesi del romanzo\nHaley decise di scrivere Radici ispirato dalle numerose storie che la sua famiglia tramandava circa le proprie origini africane. In particolare, il suo interesse ebbe origine dalle storie che sentiva raccontare dalla nonna materna Cynthia, che era stata emancipata dalla schiavitÃƒÂ¹ nel 1865. A partire dai racconti della nonna, Haley ricostruÃƒÂ¬ le vicende del ramo materno della sua famiglia a partire dal suo antenato Kunta Kinte catturato dagli schiavisti in Gambia nel 1767 e deportato in America. La famiglia di Haley aveva tramandato per generazioni numerosi racconti sulla vita di Kunta Kinte, insieme ad alcune parole africane che lo stesso Kunta Kinte aveva insegnato alla figlia.(wikipedia)\n\n\n\nDati tecnici\n========================================\nNome..............: 2.avi\nDimensione........: 639 MB (or 655,220 KB or 670,945,280 bytes)\nDurata............: 01:31:47 (137,665 fr)\nVideo Codec.......: XviD\nVideo Bitrate.....: 855 kb/s\nRisoluzione.......: 512x384 (1.33:1) [=4:3]\nFPS (Frames/sec)..: 25.000\nQF (Frame quality): 0.174 bits/pixel\nAudio Codec.......: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate.....: 112 kb/s (56/ch, stereo) VBR LAME3.98r\u0004Ã‚Â¯\nFreq Audio........: 48000 Hz\n\nSottotitoli integrati per le parti in inglese\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:10459c807fe73fdd9556e433b75fc231fc593369","amp;dn":"RADICI+2+%28Roots+2%29+S02e02+%5BXviD+-+ITA+Mp3+-+sub+ITA%5D+%5BTntvillage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10459c807fe73fdd9556e433b75fc231fc593369","infoHashBuffer":{"type":"Buffer","data":[16,69,156,128,127,231,63,221,149,86,228,51,183,95,194,49,252,89,51,105]},"announce":[],"urlList":[]}}