{"title":"Call of Duty 6 - Modern Warfare 2 SOUNDTRACK [RIP] (VBR)","uid":5167508,"size":340581012,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:10e7da1dec4533a558a1fecdfd94211d4a444e20&amp;dn=Call+of+Duty+6+-+Modern+Warfare+2+SOUNDTRACK+%5BRIP%5D+%28VBR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Magerna","files":124,"time":1258491139,"description":"I here have the original and unaltered soundtrack from the famous and just released game Call of Duty 6, also known as Modern Warfare 2.\n\nI extracted the music directly from the game archives, guaranteeing original high .mp3 quality (NO RECOMPRESSION on my behalf, all the purest of game files!). Included are ALL songs declared as music, as well as the short samples that are played in MP like when you capture a flag.\n\nI refrained from packing things up with WinRAR, so everyone is free to pick single songs if they desire. MP3 titles are pretty self-explanatory, I also ordered them according to the level they are used in for easier browsing. Obviously, no id3 tags are avaible.\n\nHope this will please some other soundtrack fetishists like myself until an official (if ever) soundtrack is released.\n\nI decided to remove the Low-Quality-versions of the music that CoD uses if you choose low sound quality in-game. This way I save almost half the file space, and for soundtracks I think the HQ-version is definitely enough.\n\nIf you need other sound snippets, either give a note or just grab a proper unpacker yourself (e.g. Dragon unpacker), open the .iwd archives yourself and extract all you want.\n\nI'd be grateful for some comments and/or some quality ratings.","torrent":{"xt":"urn:btih:10e7da1dec4533a558a1fecdfd94211d4a444e20","amp;dn":"Call+of+Duty+6+-+Modern+Warfare+2+SOUNDTRACK+%5BRIP%5D+%28VBR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10e7da1dec4533a558a1fecdfd94211d4a444e20","infoHashBuffer":{"type":"Buffer","data":[16,231,218,29,236,69,51,165,88,161,254,205,253,148,33,29,74,68,78,32]},"announce":[],"urlList":[]}}