{"title":"Switchfoot - Mess Of Me   (2nafish)","uid":5191643,"size":126644228,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:111afca1903db266574f7298a6fb0a6b49d65ffe&amp;dn=Switchfoot+-+Mess+Of+Me+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259747382,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Mess of Me&quot; is a song written and recorded by the alternative rock band Switchfoot and is to be the lead single off their seventh studio album, Hello Hurricane. It was shipped to Modern Rock/Alternative, Mainstream rock, and Active rock formats, while a music video will be worked to all applicable outlets. \n\nWhile &quot;Mess of Me&quot; was scheduled to be released to radio on September 29th, the single had already made its way on to Rock radio stations throughout the country well in advance. It was first heard on Atlanta's 99X rock station. \n\nOn September 1st, Switchfoot announced that they would be hiding copies of the new single around the world. The first copy was hidden in Moonlight Beach under a palm tree. The band asked fans that if they were to find a copy to make a copy of the disk, and hide that copy elsewhere.  The single has since spread from coast to coast and overseas. \n\nLater, the single was released and impacted to radio stations September 29, and a purchasable digital download of the song was made available the same day on all the major digital outlets. Within a week, &quot;Mess of Me&quot; had already charted at least twice as well on radio as the singles &quot; Awakening&quot; and &quot;This Is Home&quot;.\n\nThe song was first performed live at the Big Ticket Festival in Michigan on June 18, 2009, and has since been a regular in Switchfoot's setlist throughout the 2009 summer festival touring season.\n\nIt was first hinted that the song was going to be the single when Jon Foreman introduced the song before playing it live at Spirit Song in Virginia on July 10, 2009, saying &quot;as far as I'm concerned,&quot; the song was to be the lead single. On July 13, it was confirmed on switchfoot.com.\n\nOn August 5th, 2009, Jon Foreman and Tim Foreman took the song to producer Rob Cavallo, &quot;working just a touch more&quot; on the song. The album track was mixed by Chris Lord-Alge. \n\nThe song is a protest against society's obsession with the pharmaceutical industry, which has become the new way to &quot;attain never-ending, everlasting, abundant life&quot; according to Foreman. Often misconstrued as an anti-drug song, it is rather a harsh commentary on the culture's need to live forever, using drugs as a means to that end, and about the emptiness of our culture.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:111afca1903db266574f7298a6fb0a6b49d65ffe","amp;dn":"Switchfoot+-+Mess+Of+Me+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"111afca1903db266574f7298a6fb0a6b49d65ffe","infoHashBuffer":{"type":"Buffer","data":[17,26,252,161,144,61,178,102,87,79,114,152,166,251,10,107,73,214,95,254]},"announce":[],"urlList":[]}}