{"title":"Brooke Hogan feat. Stack$ - Falling","uid":4989099,"size":114051076,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1136f01ea7b879e8a3d0b643aa2bccdd596a0d2f&amp;dn=Brooke+Hogan+feat.+Stack%24+-+Falling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1246937146,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Falling&quot; is a Pop/R&amp;B song by Brooke Hogan. It is the official first single off her second studio album &quot;The Redemption&quot;. The song features rapper Stack$. The song is available on the American &amp; Canadian iTunes and has been featured in the second season of Brooke Knows Best.\n\nBrooke shot the video for &quot;Falling&quot; in the middle of April, 2009, and the video was directed by upcoming music video director, Ryan M. Costa. It premiered on Brooke's official MySpace on May 19, 2009. The video features Brooke on a beach with her love interest, rapper Stack$. It has been viewed over 2 million times onand over 1 million times on her official MySpace. A remix of &quot;Falling&quot; is available on iTunes. On June 16, 2009 Falling debuted at #83 on the Itunes Top 100 Pop songs, and has since reached a peak position of #78.\n\nThe Redemption is the second studio album by American singer Brooke Hogan. The album is set to be released on July 21, 2009 under SoBe Entertainment. Brooke has collaborated with many artists for this album such as Stack$, Colby O'Donis, Fabolous, T-Pain, Flo Rida, and Trina.\n\nBrooke Ellen Bollea (born May 5, 1988), better known by her stage name Brooke Hogan, is an American pop/R&amp;B singer, actress and television personality. She appeared on the reality-television series Hogan Knows Best, which focused on her family, and which premiered on July 10, 2005 on VH1. Since the cancellation of Hogan Knows Best, she's starred in a spin-off reality series called Brooke Knows Best which focuses on her life now independent from her parents and living with two roommates. She released her debut album Undiscovered in 2006. In 2009, she will appear in a second season of Brooke Knows Best and will release her second album, The Redemption.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1136f01ea7b879e8a3d0b643aa2bccdd596a0d2f","amp;dn":"Brooke+Hogan+feat.+Stack%24+-+Falling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1136f01ea7b879e8a3d0b643aa2bccdd596a0d2f","infoHashBuffer":{"type":"Buffer","data":[17,54,240,30,167,184,121,232,163,208,182,67,170,43,204,221,89,106,13,47]},"announce":[],"urlList":[]}}