{"title":"Hellsongs - 2009 - Pieces Of Heaven, A Glimpse Of Hell [FLAC]","uid":5156278,"size":124229413,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:11f5cae09fad75a990797a14fad9fdf703cb0ae4&amp;dn=Hellsongs+-+2009+-+Pieces+Of+Heaven%2C+A+Glimpse+Of+Hell+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Minimania","files":9,"time":1257870689,"description":"Riped with EAC using secure FLAC settings.\nEnjoy!\n &lt;a href=&quot;\nhttp://hellsongs.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hellsongs.com/&lt;/a&gt;\n\nSupport Hellsongs, buy their music!\n\n\n\nHellsongs\n\nHellsongs saw the light of day in the early fall, 2004. They kickstarted with a premiere gig in a barn out on the countryside.\n\nThe threepiece managed to rehearse and arrange three songs and got cosmic response from the audience. Cheers and suggestions of new songs kept coming during the night and next show lurked around the corner.\n\nIn late 2005 the band got a lot of airplay as swedish media discovered the band through the epic version of Run to the Hills. This track and five more were recorded and released as the Lounge ep in 2006. During the next year Hellsongs started to build an reputation as a impressive live act and toured the scandinavian countries heavily.\n\nIn 2008 the Hellsingers released their full length debut &quot;Hymns in the key of 666&quot;. It entered the swedish charts at no 9 and has so far been released in the nordic countries, GAS, BeNeLux, Australia/NZ, UK, France, Spain, Japan and Russia. The album was nominated for the German Critics Award as well as the Swedish Grammy Award, and a succesful tour in the GAS countries followed.\n\nIn late 2008 the members of the band realized that they no longer shared the same vision. They decided that it was best to part ways with Harriet and let their friend and back up vocalist - Siri BergnÃƒÂ©hr - inherit the throne of Lounge Metal. The last recordings done with Harriet will be released as an ep during this spring (with Siri on backing vocals) and the band will be breaking new boundaries as they launch their european Tour de Lounge 2.0\n\n","torrent":{"xt":"urn:btih:11f5cae09fad75a990797a14fad9fdf703cb0ae4","amp;dn":"Hellsongs+-+2009+-+Pieces+Of+Heaven%2C+A+Glimpse+Of+Hell+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11f5cae09fad75a990797a14fad9fdf703cb0ae4","infoHashBuffer":{"type":"Buffer","data":[17,245,202,224,159,173,117,169,144,121,122,20,250,217,253,247,3,203,10,228]},"announce":[],"urlList":[]}}