{"title":"Saving Private Ryan (1998) DVD-R NTSC DVD9(WS) [hjsn1]","uid":5172222,"size":8316854272,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:120fb4276704d985464bc62276481cbc47b5d29c&amp;dn=Saving+Private+Ryan+%281998%29+DVD-R+NTSC+DVD9%28WS%29+%5Bhjsn1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hjsn1","files":25,"time":1258752292,"description":"\n@@@ @@@@@@ @@@@@@ @@@@@@ @@@ @@@ \n@@@ @@@@@@@@ @@@@@@@ @@@@@@@@ @@@@ @@@ \n@@! @@! @@@ !@@ @@! @@@ @@!@!@@@ \n!@! !@! @!@ !@! !@! @!@ !@!!@!@! \n!!@ @!@!@!@! !!@@!! @!@ !@! @!@ !!@! \n!!! !!!@!!!! !!@!!! !@! !!! !@! !!!\n!!: !!: !!! !:! !!: !!! !!: !!! \n!!: :!: :!: !:! !:! :!: !:! :!: !:! \n::: : :: :: ::: :::: :: ::::: :: :: :: \n: ::: : : : :: : : : : : :: : \n\n\n\nMovie Information &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0120815/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0120815/&lt;/a&gt;\n\nSteven Spielberg directed this powerful, realistic re-creation of WWII's D-day invasion and the immediate aftermath. The story opens with a prologue in which a veteran brings his family to the American cemetery at Normandy, and a flashback then joins Capt. John Miller (Tom Hanks) and GIs in a landing craft making the June 6, 1944, approach to Omaha Beach to face devastating German artillery fire. This mass slaughter of American soldiers is depicted in a compelling, unforgettable 24-minute sequence. Miller's men slowly move forward to finally take a concrete pillbox. On the beach littered with bodies is one with the name &quot;Ryan&quot; stenciled on his backpack. Army Chief of Staff Gen. George C. Marshall (Harve Presnell), learning that three Ryan brothers from the same family have all been killed in a single week, requests that the surviving brother, Pvt. James Ryan (Matt Damon), be located and brought back to the United States. Capt. Miller gets the assignment, and he chooses a translator, Cpl. Upham (Jeremy Davis), skilled in language but not in combat, to join his squad of right-hand man Sgt. Horvath (Tom Sizemore), plus privates Mellish (Adam Goldberg), Medic Wade (Giovanni Ribisi), cynical Reiben (Edward Burns) from Brooklyn, Italian-American Caparzo (Vin Diesel), and religious Southerner Jackson (Barry Pepper), an ace sharpshooter who calls on the Lord while taking aim. Having previously experienced action in Italy and North Africa, the close-knit squad sets out through areas still thick with Nazis. After they lose one man in a skirmish at a bombed village, some in the group begin to question the logic of losing more lives to save a single soldier. The film's historical consultant is Stephen E. Ambrose, and the incident is based on a true occurance in Ambrose's 1994 bestseller D-Day: June 6, 1944.\n\n\nMpaa Rating++++++++++\n\nRated R for intense prolonged realistically graphic sequences of war violence, and for language. \n\n\nRetail Release Date++++++++\n\n24 July 1998\n\nDVD Content++++++++++\n\n\nMain Movie+++++++++++++++\n+Video- CCE Encoded - 5 passes\n+Audio-English\n+Subs-English\n+ Says &quot;Captioned&quot; on the case but it doesn't say what language. \n\n\nMenu+++++++\n+Yes \n\nExtras/Special Features+++++\n+Yes\n\nRemoved++++++++++++++\nFBI crap and trailers and all of the other annoying and useless stuff.\n\n\n\nChapters++++++++++++++\n\n1. Memorial.\n2. Omaha Beach.\n3. Rallying.\n4. Breakthrough.\n5. Letters.\n6. A Public Relations Mission.\n7. Pool.\n8. Private James Ryan.\n9. Choices.\n10. Fubar.\n11. Dog-Tags.\n12. Radar Station.\n13. Big Mystery.\n14. One Decent Thing.\n15. Piaf.\n16. Born Lucky.\n17. Ammo.\n18. The Alamo.\n19. The Bridge.\n20. Duty Roster. \n\nUploader Info ***: Thank you for choosing my release from others that are available on the internet already. I wanted to ask a small favor. After you have completely downloaded my release, please return back where you downloaded the movie and leave a comment. Let me know how the movie quality is &amp; give others who are going to be downloading my release better information about the upload. I actually do check the comments and I try to respond as much as possible.\nAlso DO NOT COMMENT OR PRIVATE MESSAGE asking me to upload a movie that is going to be released on DVD in the upcoming week or month. Feel free to comment and leave requests for older movies or movies that have been out for a while. I am going to upload movies that I feel people will enjoy so if you have a movie you want me to upload that I haven't done yet, comment and i'll check it. Upload information is available to you @ torrentbucket.info. I am helping djfred keep up with you guys. The site is updated almost every week. He has movies listed on the site for up to a month in advance. If you truly love this DVD, do actually buy and support the producers, writers, actors who made this movie possible. Thank You [J] \n\n\n\n\nLinks ***********: Here are many of djfreds tutorials, Enjoy. \n\n**DVD Ripping (how to: advanced) \n\n**Rip DVD9 to DVD5 with CloneDVD2 \n\n**Rip with DVDShrink \n\n**Burn Video_TS files with NERO \n\n**Watch DVD Files with VLC Player \n\nLet him know how you like his tutorials! http://torrentbucket.com/\n\nDVD Release Dates. http://torrentbucket.com/ \n\nFor Mac Users who cant burn &amp; get CSS Error http://forum.videohelp.com/topic340322.html\n\n\nPEOPLE WHO DOWNLOAD TORRENTS FROM DJFRED AND MYSELF, PLEASE SEED EVEN AFTER THEY ARE DONE DOWNLOADING. THAT WAY WE WILL BE ABLE TO GET MORE MOVIES UP. WHO KNOWS, THE NEXT ONE WE PUT UP MIGHT BE A REQUEST OF YOURS.","torrent":{"xt":"urn:btih:120fb4276704d985464bc62276481cbc47b5d29c","amp;dn":"Saving+Private+Ryan+%281998%29+DVD-R+NTSC+DVD9%28WS%29+%5Bhjsn1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"120fb4276704d985464bc62276481cbc47b5d29c","infoHashBuffer":{"type":"Buffer","data":[18,15,180,39,103,4,217,133,70,75,198,34,118,72,28,188,71,181,210,156]},"announce":[],"urlList":[]}}