{"title":"Democracy Now - 01 jun 2011","uid":6439994,"size":455015827,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1298ae07a3fce873ff1090fb0c0fb7d677f233db&amp;dn=Democracy+Now+-+01+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1306948692,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 01, 2011\n\n- NATO Extends Libya Mission, Resumes Bombing\n- Dozens Killed in Yemen Clashes\n- Syrian Forces Shell Southern Town; Boy's Death Spurs Protests\n- Alleged 9/11 Plotters Charged Before Military Tribunal\n- Supreme Court: Ashcroft Immune From Wrongful Imprisonment Suit\n- GOP-Controlled House Rejects Debt Ceiling Ahead of Obama Meeting\n- Mladic Arrives at The Hague for War Crimes Trial\n- Cell Phone Use Potentially Cancerous, Reports the World Health Organization\n- Pakistani Intelligence Speculated in Journalist Killing\n- Obama Taps Former Energy Exec for Commerce Post\n- Kissinger Protested at New York Event\n- Peace Activists Arrested for Dancing at Jefferson Memorial\n\n\nSpecial reports\n\n- Out of Exile: Part II of Exclusive Report on Ousted Honduran President Zelaya's Return 2 Years After U.S.-Backed Coup\n\nWe continue our coverage of the historic return of ousted Honduran president, Manuel Zelaya, who on June 28, 2009, was kidnapped at gunpoint and put on a plane to Costa Rica in a coup orchestrated in part by two generals trained in the United States. Scores of peasants, teachers, journalists, farmers have been assassinated since the coup. This week 87 U.S. congress members sent a letter to U.S. Secretary of State Hillary Clinton calling on for the suspension of aid to the Honduran military and police until steps are taken to hold security forces accountable for human rights abuses. &quot;The defense and security forces must exist,&quot; Zelaya says in an interview with Democracy Now! at his home in Tegucigalpa. &quot;But violence always will be the worst method in order to correct either political or social problems. Poverty and corruption cannot be battled with more arms, but with more democracy.&quot;\n\n\n- Xiomara Castro, Wife of Manuel Zelaya, On Returning to Honduras and Her Rumored Bid for the Honduran Presidency\n\nMuch of the buzz surrounding Manuel Zelaya's return to Honduras centered on whether his wife, Xiomara Castro, will run for president. During a press conference on Sunday, Zelaya said: &quot;The one who is engaged in politics is the first lady, I'm just a simple citizen.&quot; In an interview with Democracy Now! in Honduras, Castro addresses the prospect of seeking office and her thoughts upon returning from exile.\n\n\n- Former Honduran Minister: U.S. Undoubtedly Played Central Role in Zelaya Coup\n\nAfter masked soldiers kidnapped the democratically elected president Manuel Zelaya on June 28, 2009, and flew him to a U.S. military base in Honduras and then onto Costa Rica, hundreds of Hondurans fearing for their lives went into exile. Zelaya's former Minister of Culture, Rodolfo Pastor Fasquelle, was one of them. After he fled Honduras, Fasquelle joined Harvard University as a visiting professor where he taught courses on Latin American history. Now back in Honduras, Fasquelle says he is certain the United States helped engineer the coup. Democracy Now! spoke to him in Tegucigalpa over the weekend while reporting on the return trip of Zelaya to Honduras.\n\n- Zelaya's Return: Neither Reconciliation nor Democracy in Honduras\n\nManuel Zelaya's return has raised hopes of a Honduran reconciliation and a re-admission to the Organization of American States. But Adrienne Pine, an American University professor who has worked extensively in Honduras, says the country is no closer to reconciliation than it was in the months following the June 2009 coup. &quot;In order for their to be reconciliation, there needs to be justice,&quot; Pine says. &quot;The ongoing state violence needs to end.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:1298ae07a3fce873ff1090fb0c0fb7d677f233db","amp;dn":"Democracy+Now+-+01+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1298ae07a3fce873ff1090fb0c0fb7d677f233db","infoHashBuffer":{"type":"Buffer","data":[18,152,174,7,163,252,232,115,255,16,144,251,12,15,183,214,119,242,51,219]},"announce":[],"urlList":[]}}