{"title":"Stepan Project - 2001 - Undeva in Europa","uid":5003007,"size":128034722,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:12ea780439b4ce1483fac44e5e7362162f117210&amp;dn=Stepan+Project+-+2001+-+Undeva+in+Europa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1247601915,"description":"Stepan Project &quot;Undeva ÃƒÂ®n Europa&quot;\n\nMusician belonging to the old school of Romanian rock (do you remember Pro Musica?) Ilie Stepan showed us his current concerns with the previous record, The Meaning of Life (1996). The confirmation has arrived after five years of hard work: Stepan Project (consisting of Ilie Stepan, Horia CriÃ…Å¸ovan, Mircea Stratan) offers us a double CD, released by Show Factory, a multimedia disc completed by a remarkably crafted booklet, containing a presentation of the work, lyrics and pictures.\n\nThe album has been signaled to the Universe at the 0th hour of the year 2001 by the video &quot;Lumina&quot;, launched on the Internet. Also, the work of its creators, a 60 minutes documentary, was shown on TVR channel.\n\nGrand opus, evocation of our time and space, mixture of sounds (old instruments, nature &quot;noises&quot;) and genres, an impressive fusion to which notable contemporary music personalities have contributed, 30 in number, but also the Anastasis Choir, Saint Joseph Psaltic Choir from PartoÃ…Å¸, Wandering Drummers from Povergina and wailers from SÃ„Æ’pÃƒÂ¢nÃ…Â£a.\n\nSo, jazz, folk, chamber music, avant-garde, rock, songs having folk, academic or religious lyrics, everything recorder, mixed and mastered at Radio Vest and the Show Factory. Ilie Stepan said that &quot;the symphonic music of the 19th century became the rock music of the 20th century&quot; and &quot;the folklore is the sum of a nation's feelings&quot;, statements that suggest the basis of this work.\n\nA titanic effort, an impressive result, maybe the peak recording of the year 2001.\n\n\nActualitatea MuzicalÃ„Æ’ - Rock Records","torrent":{"xt":"urn:btih:12ea780439b4ce1483fac44e5e7362162f117210","amp;dn":"Stepan+Project+-+2001+-+Undeva+in+Europa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12ea780439b4ce1483fac44e5e7362162f117210","infoHashBuffer":{"type":"Buffer","data":[18,234,120,4,57,180,206,20,131,250,196,78,94,115,98,22,47,17,114,16]},"announce":[],"urlList":[]}}