{"title":"Gandhi (1982) DD5.1 Multisubs PAL --TBS","uid":6353745,"size":4502807328,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:141e8e01f29d6adcabcca87064b4e899eaca684b&amp;dn=Gandhi+%281982%29+DD5.1+Multisubs+PAL+--TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Saggin","files":-1,"time":1304036956,"description":"Gandhi (1982) DD5.1 Multisubs PAL\n\n\nNederlands:       \n\nVerenigd Koninkrijk / India\nDrama\n188 minuten\n\ngeregisseerd door Richard Attenborough\nmet Ben Kingsley, Edward Fox en John Gielgud\n\nDeze film geregisseerd door Richard Attenborough, is gebaseerd op het \nleven van Mahatma Gandhi, ÃƒÂ©ÃƒÂ©n van de meest monumentale persoonlijkheden \nvan de vorige eeuw. De film won in totaal 8 oscars, onder meer voor \nbeste acteur, beste script en beste film.\n\n&quot;Het is eigenlijk zo,&quot; zei Richard Attenborough, &quot;dat ik helemaal geen \nregisseur wilde worden. Ik wilde alleen maar dÃƒÂ­e film draaien.&quot; Voor de \nacteur was Gandhi een missie. 20 jaar van tegenslag, spot en \npersoonlijk financieel risico moest Attenborough doorstaan om zijn \ngrote droom te kunnen verwezenlijken: het leven van Mohandas \nKharamchand Gandhi zodanig te herscheppen dat zowel een westers als een \noosters publiek het spirituele belang van de Mahatma inziet.\n\nBen Kingsley is meesterlijk als Mahatma Gandhi, de man van wijsheden \nals &quot;An Eye For An Eye Only Ends Up Making The Whole World Blind&quot;. Een \nindrukwekkend epos, met massascenes waarin geen digitale effecten zijn \ngebruikt. Een meesterwerk!\n\nHet levensverhaal van een kleine man die een grote wereldmacht op zijn \nknieÃƒÂ«n wist te krijgen en zijn volk door geweldloos verzet naar \nonafhankelijkheid wist te leiden. Gandhi werd geboren in Zuid-Afrika \nwaar hij als jong advocaat al met succes enkele excessen van de \nracistische regeringspolitie aan de kaak wist te stellen. Toen hij \nverhuisde naar het land van zijn ouders, India, werd hij daar dan ook \nals een held binnengehaald. Al snel raakte hij ook hier bij de politiek \nbetrokken. Hij kwam op voor het gewone volk, bijvoorbeeld in hun strijd \ntegen de grootgrondbezitters en langzaam maar zeker werd hij een vader \nvoor zijn volk, dat er naar snakte om zich vrij te maken van de Engelse \n &lt;a href=&quot;\nhttp://www.film1.nl/films/24818-Gandhi.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.film1.nl/films/24818-Gandhi.html&lt;/a&gt;\n\nEnglish\nUnited Kingdom / India\nDrama\n188 minutes\n\ndirected by Richard Attenborough\nBen Kingsley, Edward Fox, John Gielgud\n\nThis film directed by Richard Attenborough, based on the life of \nMahatma Gandhi, one of the most monumental figures of the last century. \nThe film won a total of eight Oscars, including best actor, best \nscreenplay and best film.\n\n&quot;It's more like,&quot; said Richard Attenborough, &quot;I do not want to become a \ndirector. I just wanted to run that movie.&quot; Gandhi was an actor for the \nmission. 20 years of adversity, ridicule and personal financial risk \nAttenborough had to endure in order to achieve his dream: the life of \nMohandas Gandhi Kharamchand way to recreate that both a western and an \neastern spiritual interests of the public understands the Mahatma.\n\nBen Kingsley is masterful as Mahatma Gandhi, the man of wisdom like &quot;An \nEye For An Eye Only Ends Up Making The Whole World Blind. &quot; An \nimpressive epic, with lots of scenes in which no digital effects are \nused. A masterpiece!\n\nThe life story of a little man with a great world power able to get on \nhis knees and his people to independence through nonviolent resistance \nwas able to lead. Gandhi was born in South Africa where he was a young \nlawyer already successfully some racist excesses of the government to \ncondemn police managed to establish. When he moved to his parents' \nhomeland, India, he was there as a hero met. Soon he became involved in \npolitics again. He stood up for ordinary people, for example in their \nstruggle against the landowners and gradually became a father to his \npeople that longed to free himself to the English \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0083987/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0083987/&lt;/a&gt;\n\nSpotinformatie\n\nSpotinformatie\nCategorie : Beeld\nBeeldverhouding : 4:3\nFramerate        : 25,000 fps\nStandaard        : PAL\nAudio     : Engels DD5.1\nFormaat : DVD5\nBron : Retail\nOndertitels : Nederlands/Engels/Hindi/Arabic/Turkish \nGenre : Drama","torrent":{"xt":"urn:btih:141e8e01f29d6adcabcca87064b4e899eaca684b","amp;dn":"Gandhi+%281982%29+DD5.1+Multisubs+PAL+--TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"141e8e01f29d6adcabcca87064b4e899eaca684b","infoHashBuffer":{"type":"Buffer","data":[20,30,142,1,242,157,106,220,171,204,168,112,100,180,232,153,234,202,104,75]},"announce":[],"urlList":[]}}