{"title":"Jamie Foxx feat. Drake, Kanye &amp; The-Dream-Digital Girl (Remix)","uid":5139446,"size":166481924,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:143a9ff0f9e6aadc2017f55aedadbf21704efc7c&amp;dn=Jamie+Foxx+feat.+Drake%2C+Kanye+%26+The-Dream-Digital+Girl+%28Remix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1256786469,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Digital Girl&quot; is a song performed by Jamie Foxx, along with Kanye West &amp; The-Dream, who also produces the song alongside Tricky Stewart. The song is the fourth track on Foxx's third studio album, Intuition, and will serve as the fourth single on the album according to Jamie Foxx on a MTV News interview. He also included that the single version would include the Young Money Entertainment consociate Drake, a version that was performed on the 10th episode of The Tonight Show with Conan O'Brien.\n\nThe single version with Kanye West, The-Dream, &amp; Drake is the official remix of the original version, it was released on June 25, 2009, recently after the death of Michael Jackson, Jamie Foxx reworks the remix with a new beat, a new verse (from Jamie only) and a new bridge from The-Dream as a tribute and is called, &quot;Digital Girl&quot; (MJ Remix) or &quot;Digital Girl&quot; (West Coast Remix), it was released on July 17, 2009. The original remix released as a digital download on August 4, 2009. An unofficial remix by Arizona and Oregon rap artist, City Boy and Illmillion on September 27, 2009. This version includes Jamie Foxx's and The-Dream's verses.\n\nThe official music video for Digital Girl (Remix) world premiered on August 20, 2009. On the video version of the song, after the 2nd chorus, the song goes to the instrumental of the MJ Remix of the song for The-Dream's verse (the bridge of the original remix) &amp; Kanye West's verse and continues til the end of the video.\n\nThe music video was directed by Hype Williams and is similar to Lloyd's &quot;Girls Around the World&quot; music video, which was also directed by Williams.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:143a9ff0f9e6aadc2017f55aedadbf21704efc7c","amp;dn":"Jamie+Foxx+feat.+Drake%2C+Kanye+%26+The-Dream-Digital+Girl+%28Remix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"143a9ff0f9e6aadc2017f55aedadbf21704efc7c","infoHashBuffer":{"type":"Buffer","data":[20,58,159,240,249,230,170,220,32,23,245,90,237,173,191,33,112,78,252,124]},"announce":[],"urlList":[]}}