{"title":"Halloween II (1981) DVD-R NTSC (WS) [hjsn1]","uid":5148733,"size":4367325184,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1462e198ee2cb568db3c63eac0c023696d2ad0c5&amp;dn=Halloween+II+%281981%29+DVD-R+NTSC+%28WS%29+%5Bhjsn1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hjsn1","files":26,"time":1257429785,"description":"\n                  @@@   @@@@@@    @@@@@@    @@@@@@   @@@  @@@  \n                  @@@  @@@@@@@@  @@@@@@@   @@@@@@@@  @@@@ @@@  \n                  @@!  @@!  @@@  !@@       @@!  @@@  @@!@!@@@  \n                  !@!  !@!  @!@  !@!       !@!  @!@  !@!!@!@!  \n                  !!@  @!@!@!@!  !!@@!!    @!@  !@!  @!@ !!@!  \n                  !!!  !!!@!!!!   !!@!!!   !@!  !!!  !@!  !!!\n                  !!:  !!:  !!!       !:!  !!:  !!!  !!:  !!!  \n             !!:  :!:  :!:  !:!      !:!   :!:  !:!  :!:  !:!  \n             ::: : ::  ::   :::  :::: ::   ::::: ::   ::   ::  \n              : :::     :   : :  :: : :     : :  :   ::    :   \n                                                  \n\n\n                              Movie Information\n                   &lt;a href=&quot; http://www.imdb.com/title/tt0082495/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0082495/&lt;/a&gt;\n\nWhile John Carpenter's 1978 horror classic Halloween irrevocably changed the style of horror cinema with its simple but relentlessly tense story, it triggered more than a decade's worth of uninspired, exploitative knock-offs, and one could easily list Halloween II among these failures. As with its predecessor, this film was written and produced by Carpenter and Debra Hill, but the terse style and unbearable suspense of the first film are missing, replaced by a more simplistic stalk-and-slash scenario. Directorial duties were handed over to Rick Rosenthal, whose lack of expertise is quite evident (though he managed to hit his stride two years later with the prison actioner Bad Boys). The plot picks up exactly where the original left off: Laurie Strode (Jamie Lee Curtis), shaken and injured from her battle with unkillable psycho Michael Myers, is taken to the Haddonfield Hospital for observation, while Dr. Sam Loomis (Donald Pleasence) continues his desperate search for his monstrous patient. An interesting plot twist has Loomis' investigations revealing Michael's true identity (some of these sequences incorporate footage of young Michael originally shot for the television version of Halloween, which contained scenes hinting at the link between Michael and Laurie). After slashing his way through the town, Myers manages to track Laurie to the hospital, where the remainder of the action takes place. Numerous night-shift employees are slaughtered in a variety of gruesome ways before Loomis catches up with his quarry, leading to an explosive -- and seemingly conclusive -- confrontation. Pleasence is compelling as usual, but Curtis, who made an auspicious debut in the original, is sadly wasted here, her character reduced to shuffling half-drugged through darkened hospital corridors and screaming helplessly. Carpenter's active involvement in the Halloween franchise continued to dwindle steadily from one sequel to the next, getting scarcely a mention by the time producers Hill, Moustapha Akkad and Irwin Yablans revived the series in 1988 for three more sequels.\n\n\n                                Mpaa Rating++++++++++\n\n                         Made before all of the rating hype. \n\n\n                                Retail Release Date++++++++\n\n                        30 October 1981 \n\n                                DVD Content++++++++++\n\n                             \n                 Main Movie+++++++++++++++\n\t              +Video- CCE Encoded - 5 passes\n\t              +Audio-English\n                          +Subs-English, French, Spanish\n\n\n                 Menu+++++++\n\t              +Yes\t\n              \n                 Extras/Special Features+++++\n\t              +Yes\n\n                 Removed++++++++++++++\n\t              FBI crap and trailers and all of the other annoying and useless stuff.\n\n\n\n                 Chapters++++++++++++++\n\n1. Halloween, 1978 [4:16]\n2. Main Titles [3:00]\n3. On the Prowl [5:05]\n4. A Survivor [5:01]\n5. The Search [2:34]\n6. At the Hospital [2:02]\n7. More Victims [4:47]\n8. Late for Work [6:33]\n9. Telephone Trouble [8:03]\n10. The Old Myers' House [2:54]\n11. Night Shift [10:40]\n12. Laurie's Coma [3:37]\n13. Escape? [4:38]\n14. Where Is Everybody? [4:20]\n15. Going After Laurie [5:36]\n16. Dr. Loomis to the Resue [12:17]\n17. A Blazing Inferno [2:26]\n18. End Titles [4:29]\n\nUploader Info ***: Thank you for choosing my release from others that are available on the internet already. I wanted to ask a small favor. After you have completely downloaded my release, please return back where you downloaded the movie and leave a comment. Let me know how the movie quality is &amp; give others who are going to be downloading my release better information about the upload. I actually do check the comments and I try to respond as much as possible.\nAlso DO NOT COMMENT OR PRIVATE MESSAGE asking me to upload a movie that is going to be released on DVD in the upcoming week or month. Feel free to comment and leave requests for older movies or movies that have been out for a while. I am going to upload movies that I feel people will enjoy so if you have a movie you want me to upload that I haven't done yet, comment and i'll check it. Upload information is available to you @ torrentbucket.info. I am helping djfred keep up with you guys. The site is updated almost every week. He has movies listed on the site for up to a month in advance. If you truly love this DVD, do actually buy and support the producers, writers, actors who made this movie possible. Thank You [J]  \n\n\n\n\nLinks ***********: Here are many of djfreds tutorials, Enjoy. \n\n**DVD Ripping (how to: advanced) \n\n**Rip DVD9 to DVD5 with CloneDVD2 \n\n**Rip with DVDShrink \n\n**Burn Video_TS files with NERO \n\n**Watch DVD Files with VLC Player \n\nLet him know how you like his tutorials! &lt;a href=&quot; http://torrentbucket.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://torrentbucket.com/&lt;/a&gt;\n\nDVD Release Dates. &lt;a href=&quot; http://torrentbucket.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://torrentbucket.com/&lt;/a&gt; \n\nFor Mac Users who cant burn &amp; get CSS Error &lt;a href=&quot; http://forum.videohelp.com/topic340322.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://forum.videohelp.com/topic340322.html&lt;/a&gt;\n\n\nPEOPLE WHO DOWNLOAD TORRENTS FROM DJFRED AND MYSELF, PLEASE SEED EVEN AFTER THEY ARE DONE DOWNLOADING. THAT WAY WE WILL BE ABLE TO GET MORE MOVIES UP. WHO KNOWS, THE NEXT ONE WE PUT UP MIGHT BE A REQUEST OF YOURS.","torrent":{"xt":"urn:btih:1462e198ee2cb568db3c63eac0c023696d2ad0c5","amp;dn":"Halloween+II+%281981%29+DVD-R+NTSC+%28WS%29+%5Bhjsn1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1462e198ee2cb568db3c63eac0c023696d2ad0c5","infoHashBuffer":{"type":"Buffer","data":[20,98,225,152,238,44,181,104,219,60,99,234,192,192,35,105,109,42,208,197]},"announce":[],"urlList":[]}}