{"title":"Greatest Martial Arts Fight Scenes (Jeti Li, Jackie Chan etc) by","uid":6414159,"size":4484410332,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:154f98ce4cd2155277932dd5f592b590d84c24a9&amp;dn=Greatest+Martial+Arts+Fight+Scenes+%28Jeti+Li%2C+Jackie+Chan+etc%29+by&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"sir_tonyx","files":85,"time":1306108075,"description":"Greatest Martial Arts Fight Scenes (Jeti Li, Jackie Chan etc) by tonyx\n\nOver the years I've collected some of my favourite fight scenes from various martial arts and action movies and I thought I'd make it available to others as well. This is by no means a definitive collection and only reflects my personal taste in on-screen martial arts but nevertheless I believe you will find a lot of excellent fights in here.\n\nMy personal preference lies with realistic one-on-one fights, thus there are fewer scenes here with the hero fighting off armies of opponents or flying around unrealistically using wires. I believe wire-free one-on-one fights showcase the acrobatic and fighting skills of the fighters the best. I also prefer scenes where the hero is facing a superior and seemingly invincible opponent, because the bigger the opponent, the bigger the win.\n\nIncluded in this collection are fight scenes from the following movies:\n\nBanlieue 13\nDragon Lord\nDragons Forever\nDrunken Master\nThe Enforcer\nFatal Contact\nFearless\nFirst Strike\nFist of Legend\nFlash Point\nFong Sai Yuk 1\nFong Sai Yuk 2\nHeart Of Dragon\nHighlander Endgame\nIp Man\nIron Monkey\nJason X\nKiss of the Dragon\nNew Police Story\nNinja in the Dragon's Den\nOnce Upon a Time in China\nOperation Scorpio\nPedicab Driver\nPolice Story II\nProdigal Son\nStar Wars Episode I\nSupercop\nThe Defender\nThe One\nThe Protector\nThe Quest\nThe Young Master\nTrue Legend\nTwin Warriors\nUndisputed II\nUndisputed III\nWheels On Meals\nWho Am I\n\nNotably missing are any scenes with Bruce Lee in them. They are well known as they are and they'd probably deserve a collection of their own. Also missing are scenes from some of the better and more recent Asian martial arts movies like &quot;Kung-Fu Hustle&quot;, &quot;Crouching Tiger, Hidden Dragon&quot; or &quot;Reign of Assassins&quot; and some of the more Hollywood style movies like &quot;Kill Bill vol 1&quot;, &quot;Kill Bill vol 2&quot;, &quot;The Matrix&quot;, &quot;Kick Ass&quot; and &quot;Scott Pilgrim vs The World&quot;. Those movies are too much of a complete package and the fights in those movies work best within the context and backdrop of the movie. The fight scenes alone wouldn't do justice to those movies, so if you haven't seen some of them, do yourself a favour and see them in their entirety.\n\nIf you find that some of the clips don't play in your regular multimedia player, I suggest using VLC Player.\n\ntonyx","torrent":{"xt":"urn:btih:154f98ce4cd2155277932dd5f592b590d84c24a9","amp;dn":"Greatest+Martial+Arts+Fight+Scenes+%28Jeti+Li%2C+Jackie+Chan+etc%29+by","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"154f98ce4cd2155277932dd5f592b590d84c24a9","infoHashBuffer":{"type":"Buffer","data":[21,79,152,206,76,210,21,82,119,147,45,213,245,146,181,144,216,76,36,169]},"announce":[],"urlList":[]}}