{"title":"Pillar - Bring Me Down","uid":4987150,"size":125343748,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:15900946616aa0b70800b6166532ab1a89a6b7c9&amp;dn=Pillar+-+Bring+Me+Down&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1246799176,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nPillar is a Grammy-nominated Christian rock band currently located in Tulsa, Oklahoma.\n\nPillar started in Hays, Kansas in 1998, when Fort Hays State University roommates Brad Noone and Rob Beckley got together with friends Travis Jenkins, Dustin Adams, and Michael Wittig, known as Kalel.  In 1999, Pillar released their first album, Metamorphosis, on their own independent label, Shadrach Records. After some more touring in Kansas, they released their second independent album, Original Superman, in 2000. Around this time they relocated to Tulsa, Oklahoma, to try to find a larger fan base.\n\nIn 2004, Pillar released the album Where Do We Go from Here. Where Do We Go from Here was as an instant hit among Christian rock fans everywhere, capturing #1 on sales in the genre for weeks. The album featured multiple hits, including &quot;Bring Me Down&quot;, and, &quot;Frontline&quot; which topped the charts for months. Not only did Christian shows and stations play &quot;Bring Me Down&quot;, it was requested heavily on secular stations as well. &quot;Bring Me Down&quot; was also featured on the sound track for Mx vs ATV: Unleashed.\n\nWhere Do We Go from Here is the third album by Christian rock band Pillar. The song &quot;Bring Me Down&quot; was frequently played on Christian radio stations and was heavily requested on secular stations as well. It was featured on the 2005 Major League Baseball video game, MLB 2006, as well as the offroad racing game ATV Vs MX Unleashed. The song &quot;Frontline&quot;, along with &quot;Bring Me Down&quot;, reached #1 on the Christian rock charts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:15900946616aa0b70800b6166532ab1a89a6b7c9","amp;dn":"Pillar+-+Bring+Me+Down","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15900946616aa0b70800b6166532ab1a89a6b7c9","infoHashBuffer":{"type":"Buffer","data":[21,144,9,70,97,106,160,183,8,0,182,22,101,50,171,26,137,166,183,201]},"announce":[],"urlList":[]}}