{"title":"WinPatrol PLUS 20.5.2011.0 Final (Murlok)","uid":6396212,"size":806908,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:15b6f26252a1c1b7badbe09f30bff1016d0eae8d&amp;dn=WinPatrol+PLUS+20.5.2011.0+Final+%28Murlok%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Murlok","files":-1,"time":1305532459,"description":"WinPatrol uses a heuristic approach to detecting attacks and violations of your computing environment. Traditional security programs scan your hard drive searching for previously identified threats. WinPatrol takes snapshot of your critical system resources and alerts you to any changes that may occur without your knowledge. You'll be removing dangerous new programs while others download new reference files.\n\nHere are some key features of &quot;WinPatrol&quot;:\nÃ‚Â· Increase Your Speed &amp; System Performance\nÃ‚Â· Detect &amp; Neutralize Spyware. Detect &amp; Neutralize ADware\nÃ‚Â· Detect &amp; Neutralize Viral infections. Detect &amp; Neutralize Unwanted IE Add-Ons\nÃ‚Â· Detect &amp; Restore File Type Changes Automatically Filter Unwanted Cookies\nÃ‚Â· Avoid Start Page Hijacking. Detect HOSTS file changes\nÃ‚Â· Kill Multiple Tasks that replicate each other, in a single step\nÃ‚Â· Stop programs that repeatedly add themselves to your Startup List\nÃ‚Â· Delete and Remove the most Stubborn Infections\n\nNEW with WinPatrol 20.5\n\nFirefox Cookies\nFirefox 4.0 uses an updated version of the SQLite database library which included features not supported by WinPatrol. We've updated our SQLite code to support Firefox 4.0 users.\n\nDuplicate WinPatrols\nSome 64-bit users reported duplicate WinPatrol entries in the startup programs list. This has been fixed. I've also updated the check box on the Options tab so you can initialization how WinPatrol is set to start.\n\nProvided Cloud Privacy Option\nWhile I'm satisfied with our implemenation of data collected when you keep or remove a program many of your friends using WinPatrol are obviously concerned about privacy. You may uncheck the option to share decisions. This may also reduce complaints by Firewall programs. Most firewall programs are happy as long as you let them know that WinPatrol.exe and WinPatrolEx.exe are safe. Even if you don't participate in sharing your choices, PLUS members will still have useful Cloud data available when checking PLUS Info.\n\nX64 Run Duplicates\nReduced confusion when applications included their RUN registry in both the WOW64 key and legacy RUN key. Both entries will be displayed when &quot;Display Secret Startup locations&quot; is checked.\n\nFirst Detected Sort\nI finally fixed a long time bug in how Startup Programs are sorted. I apoligize that more date for formats are not supported at this time. I know this is important to friends outside the U.S. but security features have taken priority.\n\nUser Interface\nSome fonts have been tweaked to make sure all information is available.\n\nDigital Signiture\nUpdated Code Signing Digitial Signiture v3 now valid until June 2012\n\n\nTested And Working\n\n\nEnjoy","torrent":{"xt":"urn:btih:15b6f26252a1c1b7badbe09f30bff1016d0eae8d","amp;dn":"WinPatrol+PLUS+20.5.2011.0+Final+%28Murlok%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15b6f26252a1c1b7badbe09f30bff1016d0eae8d","infoHashBuffer":{"type":"Buffer","data":[21,182,242,98,82,161,193,183,186,219,224,159,48,191,241,1,109,14,174,141]},"announce":[],"urlList":[]}}