{"title":"uSeesoft Total Video Converter 2.0.3.3 [ak]","uid":6413128,"size":10819338,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:15efe7f64efc7ac828dd737b8e844a3c4241f99b&amp;dn=uSeesoft+Total+Video+Converter+2.0.3.3+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1306024898,"description":"uSeesoft Total Video Converter 2.0.3.3\n\nuSeesoft Total Video Converter is the best video format converter which can convert video files at super fast speed and best video quality. It can convert video file between any video format such as converting AVI to MPEG, WMV to AVI, WMV to MPEG, MKV to AVI, MKV to MP4, etc. uSeesoft Total Video Converter can be used like iPhone video converter, 3GP video converter, PSP video converter, iPod video converter, and Zune video converter to convert any video format to your mobile phone, Sony PSP, iPod, Apple iPhone, Zune video player and other portable video players.\n\nBesides, you will find the edit function of uSeesoft Total Video Converter remarkable to customize your videos as you like. You are able to trim your videos to get your favorite clips, crop your video to fit the screen size of your portable player or you can adjust the effects of your videos with Effect. Supporting a number of portable players, uSeesoft Total Video Converter also allows you to use it as an iPhone video converter, a PSP video converter, an iPod video converter, etc.The fastest and best total video converter, uSeesoft Total Video Converter, promises to bring you a brand-new and unregretful converting experience.\n\nKey Features:\nÃ‚Â· Support converting video files from one format to another\nÃ‚Â· Support extracting audio tracks from video file\nÃ‚Â· Support batch conversion with a task list\nÃ‚Â· Support the latest popular video formats - MKV, TS, h.264, x.264, vc-1\nÃ‚Â· Unmatchable converting speed, wonderful output quality\nÃ‚Â· Windows Vista supported\nÃ‚Â· You can select video size, bit rate, NTSC/PAL, frame rate, audio codec, sample rate etc\nÃ‚Â· So easy to modify the name and path of output files\nÃ‚Â· When converting files, you can pause, stop and continue at any moment\nÃ‚Â· With the user- friendly interface, uSeesoft Total Video Converter is suited for both veterans and beginners you can complete your conversion as easy as 1-2-3\nÃ‚Â· All decoders and encoders are built in. Once you download and install uSeesoft Total Video Converter, all supported formats can be converted without downloading any more codec.\n\nHome Page - http://www.useesoft.com/\n\n\n","torrent":{"xt":"urn:btih:15efe7f64efc7ac828dd737b8e844a3c4241f99b","amp;dn":"uSeesoft+Total+Video+Converter+2.0.3.3+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15efe7f64efc7ac828dd737b8e844a3c4241f99b","infoHashBuffer":{"type":"Buffer","data":[21,239,231,246,78,252,122,200,40,221,115,123,142,132,74,60,66,65,249,155]},"announce":[],"urlList":[]}}