{"title":"THREE CLASSIC  BRITISH FILMS  4","uid":6426979,"size":2367933468,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:162aa2da85fd1ae66cb5d4e1185f1d2c3b153787&amp;dn=THREE+CLASSIC++BRITISH+FILMS++4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OLDLIMEY4","files":3,"time":1306508682,"description":"I have not been in England for 49yrs. I have been collecting Films for years and now I want to share. Enjoy and don,t forget to SEED. SEED SEED. Thank you.\n\nThe Ladykillers (1955) \n\n\n\nFive diverse oddball criminal types planning a bank robbery rent rooms on a cul-de-sac from an octogenarian widow under the pretext that they are classical musicians.\nDirector:\nAlexander Mackendrick\nWriter:\nWilliam Rose (story), and 1 more creditStars:\nAlec Guinness, Peter Sellers and Cecil Parker \n\n.The Man in the White Suit\n\nThe Man In The White Suit is a 1951 satirical comedy film made by Ealing Studios. It starred Alec Guinness, Joan Greenwood, and Cecil Parker, and was directed by Alexander Mackendrick. It followed a common Ealing Studios theme of the \\&quot;common man\\&quot; against the Establishment. In this instance the hero falls foul of both trade unions and the wealthy mill owners who attempt to suppress his invention. The film was nominated for an Academy Award for Best Writing (Screenplay) for Roger MacDougall, John Dighton, and Alexander Mackendrick.\n\nWhisky Galore!\n\nWhisky Galore! (released in the US as Tight Little Island) was a 1949 Ealing comedy film based on the novel of the same name by Compton MacKenzie. Both the movie and the novel are based on the real-life 1941 shipwreck of the S.S. Politician and the unauthorized taking of its cargo of whisky. The plot deals with the attempts of Scottish islanders to take advantage of an unexpected windfall, despite opposition from British authorities. It starred Basil Radford, Bruce Seton, Joan Greenwood and Gordon Jackson. This was Alexander Mackendrick\\'s directorial debut.","torrent":{"xt":"urn:btih:162aa2da85fd1ae66cb5d4e1185f1d2c3b153787","amp;dn":"THREE+CLASSIC++BRITISH+FILMS++4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"162aa2da85fd1ae66cb5d4e1185f1d2c3b153787","infoHashBuffer":{"type":"Buffer","data":[22,42,162,218,133,253,26,230,108,181,212,225,24,95,29,44,59,21,55,135]},"announce":[],"urlList":[]}}