{"title":"Malwarebytes' Anti-Malware 1.51.0.1200 Final Multilanguage Port","uid":6439080,"size":9358537,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:16fb2519dd2005f234cd267f977c38ab62e7df43&amp;dn=Malwarebytes%5C%27+Anti-Malware+1.51.0.1200+Final+Multilanguage+Port&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306907742,"description":"Malwarebytes' Anti-Malware 1.51.0.1200 Final Multilanguage Portable\n\n\nMalwarebytes' Anti-Malware is an anti-malware application that can thoroughly remove even the most advanced malware. It includes a number of features, including a built in protection monitor that blocks malicious processes before they even start.Malwarebytes' Anti-Malware monitors every process and stops malicious processes before they even start. The Realtime Protection Module uses our advanced heuristic scanning technology which monitors your system to keep it safe and secure. In addition, we have implemented a threats center which will allow you to keep up to date with the latest malware threats. Malwarebytes' Anti-Malware is considered to be the next step in the detection and removal of malware. We compiled a number of new technologies that are designed to quickly detect, destroy, and prevent malware. Malwarebytes' Anti-Malware can detect and remove malware that even the most well-known Anti-Virus and Anti-Malware applications on the market today cannot.\n\nKey Features:\n* Support for Windows 2000, XP, Vista, and 7 (32-bit and 64-bit).\n* Light speed quick scanning.\n* Ability to perform full scans for all drives.\n* Malwarebytes' Anti-Malware Protection Module. (requires registration)\n* Database updates released daily.\n* Quarantine to hold threats and restore them at your convenience.\n* Ignore list for both the scanner and Protection Module.\n* Settings to enhance your Malwarebytes' Anti-Malware performance.\n* A small list of extra utilities to help remove malware manually.\n* Multi-lingual support.\n* Works together with other anti-malware utilities.\n* Command line support for quick scanning.\n* Context menu integration to scan files on demand.\n\nLanguages Available: English, Albanian, Arabic, Bosnian, Bulgarian, Catalan, Chinese Simplified, Chinese Traditional, Croatian, Czech, Danish, Dutch, Estonian, Finnish, French, German, Greek, Hebrew, Hungarian, Italian, Koraen, Latvian, Macedonian, Norwegian, Polish, Portuguese, Romanian, Russian, Serbian, Slovak, Slovenian, Spanish, Swedish, Turkish, Ukrainian.\n\nChanges in Version 1.51 (May 31st, 2011):\nOverall Improvements:\n1. Scheduling has been simplified, including relocation of scheduler.\n2. Website Blocking is now disabled when protection is turned off.\n3. Logs are sorted by date automatically.\n4. Updating is now much more efficient.\n5. All HKCU settings can now be set in HKLM to override user settings.\n6. Protection module now more efficient in terms of I/O read bytes.\n\nNew Features:\n1. 14-day trial of the PRO version is now available. This is optional to all users.\n2. Scheduler now has an edit button.\n3. User is now notified of program updates awaiting installation.\n\nIssues Fixed:\n1. Fixed ignore list not working for default registry data, i.e. for Broken.OpenCommand.\n2. Add to ignore list menu item is now left enabled if show tooltip balloon is unchecked.\n3. User is now able to update from the system tray even if the scanner is open.\n4. Fixed full scan drive list updating issue.\n5. Fixed issue with protection module not honoring ignore list after an item is restored from the quarantined.\n6. Date format on update tab is now the same as the system tray.\n\nHome page - http://www.malwarebytes.org/\n\n","torrent":{"xt":"urn:btih:16fb2519dd2005f234cd267f977c38ab62e7df43","amp;dn":"Malwarebytes%5C%27+Anti-Malware+1.51.0.1200+Final+Multilanguage+Port","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16fb2519dd2005f234cd267f977c38ab62e7df43","infoHashBuffer":{"type":"Buffer","data":[22,251,37,25,221,32,5,242,52,205,38,127,151,124,56,171,98,231,223,67]},"announce":[],"urlList":[]}}