{"title":"The Last Days of Disco NTSC DVD SL (French subtitles incl)","uid":5169556,"size":4702173599,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:189b45b96adcad3b480c1aa1938e609357dc1054&amp;dn=The+Last+Days+of+Disco+NTSC+DVD+SL+%28French+subtitles+incl%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mrizzo2","files":-1,"time":1258603572,"description":"Free Nero DVD burner software here at Nero.com:\n\n\nThe Last days of Disco is a great movie from the days of Disco and the great\nsoundtrack selections from it are included. Its a great look at the contrast\nas well between blonde and brunette types in typical fashion. As such its\ninteresting indeed! And sexy too! It's unforgettable to hear Kate Beckinsale\nsing &quot;amazing grace&quot; while laying on her bed, trying to re-assure herself\nthat all will be well for her in life. Great Disco music - we need to bring\nthis culture back!!\n\nIf you need another reason to take away the social engineering rights powers\nfrom the Hollywood gang of thieves, its this movie decision once again to dump\na fine offering in favour of the completely inane.\n\nWitness the movies supporting the genre of rap and punk music types of tastes\nand you get it unmistakably clear that movies should go into the public domain\nrather than the trash can, as the offerings they prefer to make available for\nsale too often do indeed belong in the trash can while movies they choose to\nsimply withdraw from making available at any price at all (simply because they\nhave stupid tastes of their own and don't need our dough it would appear).\nThere aint many cultures in the world that allow for such brash arrogance on\nthe part of the inane. This is the same crowd that continues to gouge children\nfor a full whopping thirty bucks to give them each the benefit of watching &quot;The\nsound of music&quot; (with lovely Ms. Julie Andrews, from 1965 - a full 43 years\nago!) to further their education while growing up. Shame on the lot of you that\nhave such mindsets that run a shoddy house of ill repute. In any event that is\nwhat it will come to be altogether if the inane decisions continue to make this\nclear to all that care to se it for what it is - a complete absence of morals\nin an industry that is an essential service to the society that is held captive\nand in fact hostage to its inane vagaries in the marketplace.\n\nDisco was great, enjoyable culture, a time we intend to bring back. Its\nmuch better than waht we've been seeing instead, and its up to us to get it\ndone.\n\nIf a movie, abandoned as this one is, sits in a trash can, then it's &quot;finders\nkeepers&quot;. They dont have ownership over cultural artifacts. As such, weve made\nthis a great quality copy indeed. One mans rubbish is a another mans treasure.\nI guess the folks now in Hollywood just don't know a good thing when they're\nallowed to just sit on it. Remember the great movie &quot;White mischief&quot;? They've\nbeen just as inane here. They've so far let it sit in a vault for decades,\ncause it appears Bill Gates is just as happy spending his time playing video\ngames instead, shooting at human targets from outer space. How inane!\n\nMichel Rizzo Chessman\nSee my reviews at: moviesbyrizzo.info","torrent":{"xt":"urn:btih:189b45b96adcad3b480c1aa1938e609357dc1054","amp;dn":"The+Last+Days+of+Disco+NTSC+DVD+SL+%28French+subtitles+incl%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"189b45b96adcad3b480c1aa1938e609357dc1054","infoHashBuffer":{"type":"Buffer","data":[24,155,69,185,106,220,173,59,72,12,26,161,147,142,96,147,87,220,16,84]},"announce":[],"urlList":[]}}