{"title":"The Jacksons - Enjoy Yourself","uid":4988059,"size":123037700,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1a258c666ce10d55e733211615c8673cd75fd84b&amp;dn=The+Jacksons+-+Enjoy+Yourself&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1246879098,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Enjoy Yourself&quot; is a song recorded by The Jacksons and released as a single in 1976. It was the first non-Motown single for the group since they departed from the label earlier that year. The song reached #6 on the pop charts and #2 on the R&amp;B charts. It was also the group's first Platinum single, as well as the first song to featured new member Randy Jackson, who replaced Jermaine after he decided to stay in Motown after his brothers left. The song is sampled in &quot;Let's Have A Party&quot; by the Backstreet Boys, which appears in their 1996 album, Backstreet Boys (US).\n\nThe Jackson 5 (also spelled The Jackson Five or The Jackson 5ive, and later known as The Jacksons) were an American popular music family group from Gary, Indiana. Founding group members Jackie, Tito, Jermaine, Marlon and Michael formed the group after performing in an early incarnation called The Jackson Brothers, which originally consisted of a trio of the three older brothers. Active from 1966 to 1990, the Jacksons played from a repertoire of R&amp;B, soul, pop and later disco. During their six-year Motown tenure, The Jackson 5 were one of the biggest pop-music phenomena of the 1970s, and the band served as the launching pad for the solo careers of their lead singers Jermaine and Michael, the latter brother later transforming his early Motown solo fame into greater success as an adult artist.\n\nThe Jackson 5 were the first act in recording history to have their first four major label singles (&quot;I Want You Back&quot;, &quot;ABC&quot;, &quot;The Love You Save&quot;, and &quot;I'll Be There&quot;) reach the top of the American charts. Several later singles, among them &quot;Mama's Pearl&quot;, &quot;Never Can Say Goodbye&quot; and &quot;Dancing Machine&quot;, were Top 5 pop hits and number-one hits on the R&amp;B singles chart. Most of the early hits were written and produced by a specialized songwriting team known as &quot;The Corporation&quot;; later Jackson 5 hits were crafted chiefly by Hal Davis, while early Jacksons hits were compiled by the team of Gamble and Huff before The Jacksons began writing and producing themselves in the late-1970s.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1a258c666ce10d55e733211615c8673cd75fd84b","amp;dn":"The+Jacksons+-+Enjoy+Yourself","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a258c666ce10d55e733211615c8673cd75fd84b","infoHashBuffer":{"type":"Buffer","data":[26,37,140,102,108,225,13,85,231,51,33,22,21,200,103,60,215,95,216,75]},"announce":[],"urlList":[]}}