{"title":"Hardwar: The Future Is Greedy - Cheats","uid":6418877,"size":76134,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1a36c253a52d39330904d5634dde2faf56282afa&amp;dn=Hardwar%3A+The+Future+Is+Greedy+-+Cheats&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kameelperdza","files":1,"time":1306248678,"description":"This helps you to activate cheats.\n\nEnjoy an please seed.\n\nVisit\n\n\nHardwar places the player in the role of a freelance &quot;Moth&quot; pilot in the city of Misplaced Optimism, a space colony located on Saturn's moon, Titan. The colony was once a profitable mining outpost, but the major corporations backed out, leaving the inhabitants without the capability of space travel. During two hundred years of isolation, neo-feudal systems took precedent on Titan, with a corrupt and inefficient police force maintaining little law and order.\n\nIt is at the discretion of the players as to how they will earn their living on Titan. They can trade honestly, having to be wary of pirates. They can choose to hunt Titan's outlaws, collecting bounties from the various police stations. Players may also be lowly scavengers like many AI moths, picking at the dropped cargo of panicked traders, or players can become pirates themselves.\n\nMany AI moths flit about with valuable cargo, should the players decide to take this path; however, stolen cargo in the players' hands can be confiscated by the police, or they could become the target of other outlaws now that they are carrying valuable cargo.\n\nPlayers may even attract the unwelcome attention of one of the main factions in the game due to their piracy.\n\nGameplay is against the backdrop of a plot involving the warring power groups on Titan, including the large factions of Klamp-G and Lazarus, and the player's eventual escape. The world is set inside craters on the moon's surface, joined together by a network of tunnels.\n\nPlayers are able to buy many of the available hangars around Titan, making storage of goods and repairs much simpler. This also allows them to store extra &quot;Moths&quot; safely in one location, to set up trade facilities in different craters, and even purchase and install Clones, to ensure the players' continuance should they meet an untimely demise in the skies.\n\nAlternatively, players can use a public hangar, such as one of the various businesses around the city to trade and repair their moths.\n\nPlayers are able to trade goods from their hangar(s), and based on market forces such as supply and demand, as well as distance to the supply, players can set their own prices. Based on how good a deal the players make, AI moths will line up in droves to purchase goods, or fly on by for a better deal elsewhere.\n\nPlayers can even set up manufacturing facilities in their hangars with the purchase of relevant equipment, to turn scrap metal into ship parts, to turn water and chemicals into alcohol, or any number of other products.\n\nThe atmosphere of the game is furtive, as the players' solar-powered &quot;Moth&quot; craft hovers underneath an energy well to recharge, the players must quickly plan the next leg of their route. Even when on the side of the law, players must be wary of enemies made along the way...and the ultralight moths are definitely not meant for long flights whilst being under Laser fire, Missile attack and other special weapons.\n\nIndividuals can set up home servers so that client players can play together in a single environment, and there are multiple persistent online games that are being run by members of the community.\n\n","torrent":{"xt":"urn:btih:1a36c253a52d39330904d5634dde2faf56282afa","amp;dn":"Hardwar%3A+The+Future+Is+Greedy+-+Cheats","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a36c253a52d39330904d5634dde2faf56282afa","infoHashBuffer":{"type":"Buffer","data":[26,54,194,83,165,45,57,51,9,4,213,99,77,222,47,175,86,40,42,250]},"announce":[],"urlList":[]}}