{"title":"Bodhi Linux 1.1.0 [ISO] [geno7744]","uid":6426142,"size":400527360,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:1a3a49f5a304b237d602e3d147c14aae2fdde7dc&amp;dn=Bodhi+Linux+1.1.0+%5BISO%5D+%5Bgeno7744%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"geno7744","files":-1,"time":1306480252,"description":"Bodhi is a minimalistic, enlightened, Linux desktop.\n\nMinimum System Requirements:\n 300Mhz i386 Processor\n 128MB of RAM\n 1.5GB HD space\n\nEnlightenment is not just a window manager for Linux/X11 and others, but also a whole suite of libraries to help you create beautiful user interfaces with much less work than doing it the old fashioned way and fighting with traditional toolkits, not to mention a traditional window manager. It is fast in addition to elegant. Enlightenment is currently under heavy development. To ensure that our users always have the latest Enlightenment desktop we push out Enlightenment updates to the Bodhi repository at least once a week. We believe Enlightenment is the best desktop Linux has to offer because of it's elegance, modularity and high level of customization.\n\nUnlike some other distributions that try to make all the decisions for you, Bodhi thinks the end user is smart enough to make their own decisions. We let you choose your default theme and system layout as well as applications for completing your computing tasks. The only applications you will find pre-installed on your Bodhi system are Midori, LXTerminal, PCManFM, Leafpad and Synaptic. Beyond this you can easily find and install an application for any task you may have in mind via Bodhi Software Center. We do not see the need to clutter your system with extra applications that you may never use.\n\nGet Support: http://www.bodhilinux.com/getsupport.html\n\nFile Info\n\nMD5:56c95644b22b4bf3027b9ffde749f057","torrent":{"xt":"urn:btih:1a3a49f5a304b237d602e3d147c14aae2fdde7dc","amp;dn":"Bodhi+Linux+1.1.0+%5BISO%5D+%5Bgeno7744%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a3a49f5a304b237d602e3d147c14aae2fdde7dc","infoHashBuffer":{"type":"Buffer","data":[26,58,73,245,163,4,178,55,214,2,227,209,71,193,74,174,47,221,231,220]},"announce":[],"urlList":[]}}