{"title":"Underoath - Too Bright To See Too Loud To Hear","uid":4998012,"size":144541700,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1a65f769a655b30b2f48c7304dc5e2a11877b1a1&amp;dn=Underoath+-+Too+Bright+To+See+Too+Loud+To+Hear&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247377463,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nLost in the Sound of Separation is the sixth album by metalcore band Underoath. The album was released on September 2, 2008. The album title is taken from a line of the lyrics of &quot;We Are the Involuntary&quot;. In an interview with MTV News about the effort, the band stated it featured 11 songs that total around 42 minutes. The latest release is said to be a lot &quot;heavier&quot; and &quot;darker&quot; than the 2006 release, Define the Great Line. A handful of people from MTV were the first to listen to several of the songs off the album, reviewing afterward that &quot;The songs were anthemic, feedback-filled numbers that build slowly to their thunderous, ear-splitting crescendos.&quot; On August 28, 2008 the album was uploaded to the band's MySpace page in its entirety.\n\nEven before its release, the album had been welcomed with critical acclaim from respected reviewers from Alternative Press and AbsolutePunk.net, with Drew Beringer of AbsolutePunk calling it: &quot;...unpredictable and ear-splitting, full of ferocity and melody.&quot; On Soul-Audio.com, a music review site, staff critic John Wofford declared the album &quot;a masterpiece,&quot; calling it both &quot;frightening&quot; and &quot;rewarding&quot; and giving it a rating of 9.5 out of a possible 10. This marks only the second time a score so high has been awarded in the site's history. During Soul-Audio's End of the Year features, Wofford deemed Lost in the Sound of Separation the best album of 2008.\n\nIn its first week, Lost in the Sound of Separation debuted at #8 on the Billboard 200 charts, selling around 56,000 copies in the US alone.\n\nToo Bright To See, Too Loud To Hear is the second single and was released as a music video on April 20, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1a65f769a655b30b2f48c7304dc5e2a11877b1a1","amp;dn":"Underoath+-+Too+Bright+To+See+Too+Loud+To+Hear","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a65f769a655b30b2f48c7304dc5e2a11877b1a1","infoHashBuffer":{"type":"Buffer","data":[26,101,247,105,166,85,179,11,47,72,199,48,77,197,226,161,24,119,177,161]},"announce":[],"urlList":[]}}