{"title":"Advanced Task Manager V4[H33T][superl]","uid":4995870,"size":4923512,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1cade05452a9b74bd7561968f55cc3404686723d&amp;dn=Advanced+Task+Manager+V4%5BH33T%5D%5Bsuperl%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"superl1112","files":5,"time":1247275199,"description":"Advanced Task Manager, as shown in the title, is an advanced version of the Task Manager application in Windows. \nIt identifies all the running applications and calculates a probable danger rating based on the informations \nreceived from each running process. It shows you as much information about programs as it can and it's up to you \nto decide weather a program should be removed or not. \n\nIn the 'Programs' tab you can see information such as the process name, port id, whether it is a service or not, \nthe size of the file, the quantity of memory that is used, how much of the CPU is used, for how long is active, \nit's name and the folder where is located. You can choose, enable or disable the programs that automatically run \nat system startup in the 'Startup' tab. You can also monitor your system performance such as overall CPU usage \nand the memory occupied by the running programs in the 'Performance' tab. The program offers details regarding \nall active Internet connections and the files opened by programs running on your computer. \n\nThe interface is easy to use and the information is well structured. This tool is easy to use even if you are not \nan advanced user because is more detailed than the Windows Task Manager and it offers you more options to choose \nfrom. Somehow it is a mix between the Task Manager and the System Configuration Utility. In case you need more \ninformation about a program you can 'Google' it using the program shortcut. \n\nPluses: Easy to use and a user friendly interface. \n\nDrawbacks / flaws: \n\nIn conclusion: It's a useful tool if you want to have a clear image and complete control over the programs \nrunning on your system. \n\n1. Install                                                                   \n2. Replace existing with cracked exe from the archive                       \n3. Enjoy!                                                                    ","torrent":{"xt":"urn:btih:1cade05452a9b74bd7561968f55cc3404686723d","amp;dn":"Advanced+Task+Manager+V4%5BH33T%5D%5Bsuperl%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cade05452a9b74bd7561968f55cc3404686723d","infoHashBuffer":{"type":"Buffer","data":[28,173,224,84,82,169,183,75,215,86,25,104,245,92,195,64,70,134,114,61]},"announce":[],"urlList":[]}}