{"title":"Bangkok Haunted (2001)","uid":5143769,"size":956515885,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1d0dd45162334cc09206435ae924ff9b429f01dd&amp;dn=Bangkok+Haunted+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ayan4u","files":5,"time":1257101474,"description":"In every city... in every home, there's a real ghost story ready to be told. \n\nPLOT: Three young women gathered in a coffee bar in Bangkok tell and discuss three original ghost stories with each other. The first tale: In Bangkok, the young Jieb receives an ancient drum not listed in the order from the truck of Transportation Company owned by Mr. Anake. She calls her former Professor Arkom, who identifies the markings for good luck that she describes and tells the story of the orphan Paga. In 1917, the renowned music teacher Jangwah-Chuem and his wife Peng raise the beautiful Paga with their deformed son Gnod. Paga is a good and loving sister and daughter and becomes a great beautiful dancer. When Paga falls in love for the handsome Fond, the jealous Gnod and she vanish from their village. Jieb investigates the mystery of their disappearance and discloses the eerie truth with tragic consequences. The second tale: The gorgeous Pam receives a sample from her next-door neighbor of a love potion that makes the user irresistible to men. Pam does not know that the essence is made of blood of dead women and uses in a man in a night-club, who becomes an insatiable lover. When she uses in her acquaintance Tim, she finds the price of the aphrodisiac. The third tale: Detective Nop is in charge of the investigation of the death of a woman called Gunaya found hanged in a distant storeroom. He does not accept his chief position of suicide and he is convinced that it is a murder case. He investigates the husband of the victim, Vinal, and her former boy-friend In. When he believes he has solved the case, there is a twist with tragic consequences. ","torrent":{"xt":"urn:btih:1d0dd45162334cc09206435ae924ff9b429f01dd","amp;dn":"Bangkok+Haunted+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d0dd45162334cc09206435ae924ff9b429f01dd","infoHashBuffer":{"type":"Buffer","data":[29,13,212,81,98,51,76,192,146,6,67,90,233,36,255,155,66,159,1,221]},"announce":[],"urlList":[]}}