{"title":"Illuminati/NWO in Hollywood: Hollywood Insiders Complete Set","uid":5016446,"size":857205079,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1e71d481a76fd5f6a236490c5a6dea41bdfb1ace&amp;dn=Illuminati%2FNWO+in+Hollywood%3A+Hollywood+Insiders+Complete+Set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ricintoxin","files":11,"time":1248243748,"description":" &lt;a href=&quot;http://www.HollywoodInsiders.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.HollywoodInsiders.net&lt;/a&gt;\n\nFallen Angels 1:25hr-Analyzes Illuminist/masonic threads in seemingly unconnected movies (The man who would be king,Stargate,Starwars,Harry Potter,The Matrix, more...)and binds them into a single story.\n\nDark Stars 38min-Examines Illuminati symbolism,predictive programming,9/11 synchronicities,and Satanism in Hollywood and the music industry.\n\nRevelations Pt.1 26min-Delves in the &quot;Men in Black&quot; films and their connection to John Keel's &quot;The Mothman Prophecies.&quot; It explores excerpts from Keel's book that speak of giant bats,UFOs,Men in Black,and vampires.\n\n[Dark Stars Extras] Steve Jackson's cardgame &quot;Illuminati: The game of conspiracy&quot;(330 cards,18min). Complete Alex Jones and &quot;The Lone Gunmen's&quot; star Dean Haglund interview(26min)\n\n*ALSO sacred texts, The Mothman Prophecies, and 400 pictures of Illuminati cardgame.\n__\nfallen angels insiders occult subliminal messages anti christ 911 truth wtc conspiracy wtc7 prophecy anunnaki revelation david icke nwo new age world government order trade center aquarian elite free mason reptilian shape shifter nephilim zeitgiest rense bill william cooper ufo alien cia fbi nsa trilateral warren commission 666 draco economy economic dollar collapse satan lucifer exposed alan watt controlled demolition financial crisis george black magic bush rfid chip iraq iran war bilderberg group skull bones mark beast bohemian grove all seeing eye sons god garden eden spirit supernatural islam divine bible quran kuran barrack obama abduction paranormal tv television jinn jesus dajjal dragon demon possession serpent nibiru planet crop circle igigi sumerian babylonian giants ghosts poltergeist Zecharia Sitchin Jehovah race north american european union cherub kabbal archangels zionism israel massad grey area 51 dulce federal reserve mi5 mi6 prisonplanet red ice verichip ron paul secret society twin towers michael tsarian genetic manipulation atlantis sightings texe marrs bin laden endtimes doomsday 2012 mayan calender haddith mahdi astroid witchcraft truth rising loose change dick cheney john carpenter they live jew oil underground base denver airport fluoride symbology psychic astral projection vatican jesuit leo zagami amero pentagon terror terrorism internet2 mind control cathy brien pope false prophet military mystery sighting","torrent":{"xt":"urn:btih:1e71d481a76fd5f6a236490c5a6dea41bdfb1ace","amp;dn":"Illuminati%2FNWO+in+Hollywood%3A+Hollywood+Insiders+Complete+Set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e71d481a76fd5f6a236490c5a6dea41bdfb1ace","infoHashBuffer":{"type":"Buffer","data":[30,113,212,129,167,111,213,246,162,54,73,12,90,109,234,65,189,251,26,206]},"announce":[],"urlList":[]}}