{"title":"Aliens In America 1x01 HDTV DVB Spanish","uid":4990264,"size":182482941,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1e96f271f2fb4b7f9c300acb4603b623746a928d&amp;dn=Aliens+In+America+1x01+HDTV+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mois20","files":4,"time":1246999533,"description":"Aliens in America es una serie que relata la historia de un adolescente que busca la popularidad con la llegada de un estudiante pakistanÃƒÂ­ de intercambio. Se trata de una comedia sobre las diferencias culturales de dos chicos procedentes de mundos opuestos. Justin Tolchuck (Dan Byrd, Las colinas tienen ojos) es un tÃƒÂ­mido y sensible adolescente que no goza de popularidad en el instituto de Medora, en Wisconsin. Siempre ha sido el hazmerreÃƒÂ­r de sus compaÃƒÂ±eros pero, en este nuevo curso, tiene esperanzas de que eso cambie.\nA pesar de conseguir algÃƒÂºn que otro logro en su primer dÃƒÂ­a, las cosas vuelven a ser como el curso anterior y todos sus compaÃƒÂ±eros rechazan su compaÃƒÂ±ÃƒÂ­a. Sin embargo, su madre, Franny (Amy Pietz), es consciente de esta situaciÃƒÂ³n y decide poner una soluciÃƒÂ³n. Aconsejada por el jefe de estudios, decide aceptar su integraciÃƒÂ³n en el programa internacional de intercambio del instituto.\nNerviosos por la llegada del estudiante, Justin y sus padres acuden al aeropuerto con pancartas para recibir al estudiante londinense. Por el contrario, es un joven pakistanÃƒÂ­ el que se presenta. La familia Tolchuck considera acabadas las esperanzas de que su hijo cuente con algÃƒÂºn amigo en el instituto. Sin embargo, aÃƒÂºn desconocen las alegrÃƒÂ­as que Raja (Adhir Kalyan) estÃƒÂ¡ apunto de darles. Abierto, despierto y feliz de poder vivir con una familia americana, Raja es un chico que ha tenido una vida difÃƒÂ­cil. HuÃƒÂ©rfano desde hace un aÃƒÂ±o, el joven valora la compaÃƒÂ±ÃƒÂ­a y la hospitalidad de los Tolchuck, que al principio ven en ÃƒÂ©l a una fuente de problemas.\nGary (Scott Patterson) es el ÃƒÂºnico miembro de la familia Tolchuck que verÃƒÂ¡ con buenos ojos desde el principio la llegada de Rajan. El cabeza de familia ve en ÃƒÂ©l una fuente de ingresos y una oportunidad de que tener en casa a un chico que ayude en las tareas del hogar. Mientras, Claire, la hermana pequeÃƒÂ±a de Justin, se convertirÃƒÂ¡ en el centro del corazÃƒÂ³n de Raja desde su llegada.\nAliens in America es una comedia, ya anulada en EEUU, que acerca al espectador las diferencias que existen entre dos chicos muy distintos que aprenden a respetar sus culturas y a valorar la importancia de la amistad.","torrent":{"xt":"urn:btih:1e96f271f2fb4b7f9c300acb4603b623746a928d","amp;dn":"Aliens+In+America+1x01+HDTV+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e96f271f2fb4b7f9c300acb4603b623746a928d","infoHashBuffer":{"type":"Buffer","data":[30,150,242,113,242,251,75,127,156,48,10,203,70,3,182,35,116,106,146,141]},"announce":[],"urlList":[]}}