{"title":"Blade Kitten Portable - [Espera]","uid":6414164,"size":642595657,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1ea51c5ab56c590b45ee3856a6ecb84d003cd5c9&amp;dn=Blade+Kitten+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1306108628,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Blade Kitten 1 Click.exe&quot;\n3.Enjoy\n\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nBlade Kitten is an episodic platform game series based on the webcomic of the same name about a female half human, half cat bounty hunter named Kit Ballard. The game was released on Microsoft Windows, PlayStation 3 and Xbox 360 on September 22, 2010. It features anime-style graphics.\n\nBlade Kitten is a 2.5D platforming action adventure game set three years before the comic book series.[1] on an artificial alien planetoid known as Hollow Wish. The game begins with Kit tracking down a local troublemaker called Terra-Li but on her way to doing so, Kit uncovers a dark and evil secret about Hollow Wish and its inhabitants. Soon after arriving at the planetoid, Kit runs into fellow bounty hunter Justice Kreel who destroys her ship and steals her breaker key which contains all the information she needs to track down and kill Terra-Li. While the only playable character is Kit, the game does boast a large array of alternate costumes that change either Kits clothing or to a completely different person.\n\nThe game also includes Kit's alien sidekick Skiffy and her floating sword called Darque Blade . She is able to swing her sword at close range or send it flying over a larger distance to attack enemies and hit inaccessible switches. While progressing through the game, the sword can be upgraded and changed to four different types of blade that can deal either higher amounts of damage, faster attack speed or auto lock-on. She can also ride dinosaur style animals called Noots over the plains of Hollow Wish.\n\nThe game features different types of collectible items that are picked up while progressing through the game or a hidden inside treasure chests which themselves are hidden somewhere in each level. These items act as both a score booster and the games currency, which can be used to buy upgrades like more health and stamina for Kit Ballard, costume changes and blade upgrades. The Krome Studios mascot, Ty the Tasmanian Tiger also makes an appearance as one of the unlockable costumes. The game consists of nineteen levels and one boss battle.\n\nSystem Requirements\n\n    Minimum:\n        OS: Windows XP SP2, Vista SP2, 7\n        Processor: Intel Core2 Duo 1.8 GHz or AMD Athlon X2 +3800 or better\n        Memory: 1GB RAM\n        Graphics: ATI Radeon X1800 or NVIDIA GeForce 7800 or better\n        DirectXÃ‚Â®: DirectX 9.0c\n        Hard Drive: 3GB free\n        Sound: DirectX 9.0c-compatible\n        Other Requirements: Internet connection required\n\n\n","torrent":{"xt":"urn:btih:1ea51c5ab56c590b45ee3856a6ecb84d003cd5c9","amp;dn":"Blade+Kitten+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ea51c5ab56c590b45ee3856a6ecb84d003cd5c9","infoHashBuffer":{"type":"Buffer","data":[30,165,28,90,181,108,89,11,69,238,56,86,166,236,184,77,0,60,213,201]},"announce":[],"urlList":[]}}