{"title":"Terminator.Salvation.2009.iTALiAN.iNTERNAL.LD.DVDSCR.XviD-SiLENT","uid":5006373,"size":732467200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1eaf10beac1d55a0ceec2d930725d8ed916c2478&amp;dn=Terminator.Salvation.2009.iTALiAN.iNTERNAL.LD.DVDSCR.XviD-SiLENT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"confe90","files":1,"time":1247705922,"description":"Terminator Salvation (2009) \n\n.::Locandina::.\n\n[img]http://img151.imageshack.us/img151/1168/terminatorsalvation6700.jpg[/img]\n\n\n.::Cast::.\n\nTitolo originale: Terminator Salvation\nNazione: U.S.A.\nAnno: 2009\nGenere: Azione, Fantascienza, Thriller\nDurata: 115'\nRegia: McG\n\nProduzione: The Halcyon Company, IMF Internationale Medien und Film GmbH &amp; Co. Produktions KG, Intermedia Films, Lin Pictures, T Asset Acquisition Company\nDistribuzione: Sony Pictures Releasing Italia\nData di uscita: 05 Giugno 2009 (cinema)\n\n\n.::Cast::.\n\nChristian Bale, Sam Worthington, Anton Yelchin, Moon Bloodgood, Common, Bryce Dallas Howard, Roland Kickinger, Helena Bonham Carter, Chris Ashworth\n\n\n.::Trama::.\n\n[b]In seguito all'olocausto nucleare causato dalla Skynet, che ha determinato lo sterminio di gran parte della razza umana, un manipolo di uomini tra quelli sopravvissuti, guidati da John Connor, cerca di salvare quel poco che ÃƒÂ© rimasto.[/b]\n\n\n.::Recensione::.\n\nIl marchio ha qualcosa di rassicurante sia per chi compra che per chi vende, e questa veritÃƒÂ  puÃƒÂ² essere applicata facilmente a quel tipo di film &quot;griffato&quot; che viene etichettato con il nome esotico di &quot;franchise&quot;. Al di lÃƒÂ  di meriti o demeriti di ogni singolo prodotto, il film di marca ha sempre l'ambizione di essere un'evoluzione rispetto al predecessore: vuole mantenere i tratti caratteristici che lo rendono riconoscibile, abbandonare i particolari obsoleti o privi di appeal, e allo stesso tempo il &quot;franchise&quot; vuole assecondare i gusti del nuovo pubblico, senza scordare di lanciare strizzatine l'occhio ai fan della prima ora.\n\nOrmai la giovinezza di John Connor e le cronache di Sarah Connor sono una cosa del passato. A meno che in futuro a qualche sceneggiatore non venga in mente di rimescolare la linea temporale del passato creando un effetto domino di paradossi (eh sÃƒÂ¬: ÃƒÂ¨ complicato). Adesso ci troviamo invece nel futuro post-apocalittico e post-nucleare, a metÃƒÂ  tra Matrix e Mad Max, che nei primi capitoli della serie aveva sfornato i sicari meccanici che dovevano impedire al futuro profeta di nascere. Del resto possiamo ammirare il leader della resistenza umana nello splendore - privo di effetti speciali - di Christian Bale, giÃƒÂ  abbondantemente addestrato a combattere il male in difesa dell'umanitÃƒÂ . Il panorama ÃƒÂ¨ cupo e desertico, ambientato lungo la costa ovest degli Stati Uniti, fra il Grand Canyon e San Francisco. La fotografia prevalente ÃƒÂ¨ una specie di bianco e nero seppiato tendente all'antracite, una sorta di rappresentazione palpabile del dominio del metallo sulla carne. A farla da padrone sono perÃƒÂ² le macchine, sempre piÃƒÂ¹ cattive e sofisticate, dalle mini moto da combattimento fino ai mostruosi &quot;harvester&quot;, mostri meccanici che raccolgono prigionieri umani a scopo di sperimentazione.\n\nMolte cose danno la sensazione di essere giÃƒÂ  viste, ma i produttori hanno deciso di giocare questa debolezza apparente come punto di forza, costruendo una serie di rimandi che colpiscono visceralmente molto piÃƒÂ¹ che a livello cosciente. CosÃƒÂ¬ ÃƒÂ¨ impossibile non provare una lieve emozione nel vedere una macchina che calpesta un teschio umano, nel sentire John Connor pronunciare la fatidica frase &quot;I'll be back&quot; o persino nel vedere una terribile forma digitalizzata del buon vecchio e storico Schwarzy. Con un avvertenza: il cerchio ÃƒÂ¨ ben lontano dall'essere chiuso.\n\n[b]La frase: &quot;E' una guerra! Tu piÃƒÂ¹ di tutti dovresti capire che c'ÃƒÂ¨ un prezzo da pagare&quot;.[/b]\n\n\n.::Trailer::.\n\n\n\nAudio 7.5\nVideo 8.5\n","torrent":{"xt":"urn:btih:1eaf10beac1d55a0ceec2d930725d8ed916c2478","amp;dn":"Terminator.Salvation.2009.iTALiAN.iNTERNAL.LD.DVDSCR.XviD-SiLENT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eaf10beac1d55a0ceec2d930725d8ed916c2478","infoHashBuffer":{"type":"Buffer","data":[30,175,16,190,172,29,85,160,206,236,45,147,7,37,216,237,145,108,36,120]},"announce":[],"urlList":[]}}