{"title":"El Fin Del Mundo - Miniserie Completa DVDRip Spanish","uid":5017469,"size":1488424102,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1ec1c614cf32f3da66b438e567a18f0c80eae2ad&amp;dn=El+Fin+Del+Mundo+-+Miniserie+Completa+DVDRip+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":2,"time":1248293058,"description":"CategorÃƒÂ­a 7: El Fin del Mundo es una miniserie que retoma la acciÃƒÂ³n que dejÃƒÂ³ sin conclusiÃƒÂ³n CategorÃƒÂ­a 6: El DÃƒÂ­a de la DestrucciÃƒÂ³n, con la tormenta que destruyÃƒÂ³ Chicago siguiendo con su camino de destrucciÃƒÂ³n y desolaciÃƒÂ³n. La nueva directora de la FEMA, la Agencia Federal de Emergencias, Judith Carr (Gina Gershon, Cara a Cara), se encuentra en una delicada situaciÃƒÂ³n al ver que la tormenta empieza a pasearse por todo el paÃƒÂ­s, dejando en ruinas una ciudad tras otra.\n\nCon pocas respuestas en su mano y la creencia de que se seguirÃƒÂ¡ con esta destrucciÃƒÂ³n, Judith descubre que la tormenta fue predecida dos aÃƒÂ±os antes de que pasara, por el cientÃƒÂ­fico Ross Duffy (Cameron Daddo, SuperespÃƒÂ­as), un antiguo romance suyo. A pesar de intentar mantenerlo al margen, finalmente Judith se ve obligada a convencerle para que organice un equipo especial de investigaciÃƒÂ³n para rastrear la tormenta y averiguar quÃƒÂ© es lo que la estÃƒÂ¡ provocando.\n\nAsÃƒÂ­, en compaÃƒÂ±ÃƒÂ­a del cazador de tormentas Tommy Tornado (Randy Quaid, Cinco dÃƒÂ­as para morir) y la cientÃƒÂ­fica Faith Clavell (Shannen Doherty, Embrujadas), en tierra firme, y del piloto Mike Davis (Tom Skerritt, The Grid: La Amenaza) en el cielo, Ross intentarÃƒÂ¡ desvelar el secreto que se esconde en la tormenta.\n\nMientras la devastaciÃƒÂ³n que estÃƒÂ¡ produciendo esta agresiva tormenta empieza a llegar su momento mÃƒÂ¡s duro y destructorm, no sÃƒÂ³lo en Estados Unidos, sino alrededor de todo el planeta, Judith tendrÃƒÂ¡ que hacer frente a las acusaciones que apuntan a que su relaciÃƒÂ³n con Ross va mÃƒÂ¡s allÃƒÂ¡ de toda ÃƒÂ©tica y relaciÃƒÂ³n profesional, unas acusaciones que pueden hacer mucho daÃƒÂ±o a las familias de ambos.\n\nLa tormenta de Chicago y otra tormenta de igual tamaÃƒÂ±o y peligrosidad comienzan a moverse la una hacia la otra, amenzando con crear una supertormenta aniquiladora, la primera tormenta de categorÃƒÂ­a 7 en la historia de la humanidad. Judith y Ross se esfuerzan en buscar soluciÃƒÂ³n a este desastre natural, mientras las tormentas se mueven en direcciÃƒÂ³n a Los Angeles y los evangelistas Donny Hal (James Brolin, AtrÃƒÂ¡pame si puedes) y Penny Hall (Swoosie Kurtz, Mentiroso compulsivo) ayudan al incrementar el miedo en el paÃƒÂ­s, asegurando que las tormentas y otras advertencias bÃƒÂ­blicas sÃƒÂ³lo significan que el Fin de los Tiempos estÃƒÂ¡ prÃƒÂ³ximo.","torrent":{"xt":"urn:btih:1ec1c614cf32f3da66b438e567a18f0c80eae2ad","amp;dn":"El+Fin+Del+Mundo+-+Miniserie+Completa+DVDRip+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ec1c614cf32f3da66b438e567a18f0c80eae2ad","infoHashBuffer":{"type":"Buffer","data":[30,193,198,20,207,50,243,218,102,180,56,229,103,161,143,12,128,234,226,173]},"announce":[],"urlList":[]}}