{"title":"Vase de Noces","uid":5013639,"size":10146887680,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1ee9de963fa6539515060277fb3622c01e5fb477&amp;dn=Vase+de+Noces&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SickStiff","files":-1,"time":1248117741,"description":"Full DVD rips of the recent 2-disc version from Camera Obscura of this notorious movie. The film is also known as Wedding Trough, One Man and His Pig and the less subtle The Pig Fucking Movie.\n\nBesides the film, there's also a documentary, 'Of Pigs and Men' (73 min), wherein the director Thierry ZÃƒÂ©no and star Dominique Garny discuss the origins of the film.\n\nTaken from Wikipedia:\n\n&quot;The film has a very incoherent plot structure, and is difficult to describe chronologically due to several strange and often random scenes interweaved into the overall story. Such displays consist of the farmer fastening doll heads to pigeons, cutting off the head of a chicken, and collecting strange materials in jars.\n\nA farmer, who may be the last person on Earth, lives on a rural farm in Belgium, and falls in love with his huge sow. After bonding with her in several strange ways, such as rolling in manure with her, he finally decides to consummate the relationship as a result of which the sow gives birth to human/pig hybrids, whom the farmer immediately tries to bond with. He tries to feed them all, but they all try to leave to be with their mother. Jealous, the farmer hangs all of them. When she discovers that her children are dead, the sow runs away in grief and falls into a mud pit, where she drowns.\n\nThe farmer begins to look for his love, and when he finds her, he becomes overcome in sadness. He drags the sow out of the hole and buries her back at the farm, and subsequently tries burying himself along with her. When this fails, he decides that his life is also over, and begins destroying every important aspect of his life, including the strange jars that he collects throughout the film. After his breakdown, he oddly begins making tea out of his feces and urine, which he consumes wholeheartedly, and immediately becomes sick. Finally, he hangs himself off a ladder, which is the last image of the film.&quot;\n\nLet it be clear: this film is not for the easily offended or those with a weak stomach. This film promises a punch, and delivers it without a doubt.\n\nMore info:\n- http://en.wikipedia.org/wiki/Vase_de_Noces\n- http://www.imdb.com/title/tt0072355/","torrent":{"xt":"urn:btih:1ee9de963fa6539515060277fb3622c01e5fb477","amp;dn":"Vase+de+Noces","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ee9de963fa6539515060277fb3622c01e5fb477","infoHashBuffer":{"type":"Buffer","data":[30,233,222,150,63,166,83,149,21,6,2,119,251,54,34,192,30,95,180,119]},"announce":[],"urlList":[]}}