{"title":"A Crude Awakening (.mp4)","uid":5007960,"size":754480691,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:1f01c152771dcabd68e38048591300434d5d5624&amp;dn=A+Crude+Awakening+%28.mp4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1247849950,"description":"An unforgettable and shocking wake-up call, A CRUDE AWAKENING offers the rock-solid argument that the era of cheap oil is in the past. Relentless and clear-eyed, this intensively-researched film drills deep into the uncomfortable realities of a world that is both addicted to fossil fuels and blissfully unaware of the looming &quot;peak oil&quot; crisis.\n\nDrawing on an international cast of maverick energy experts and thinkers, directors Basel Gelpke and Ray McCormack debunk the conventional wisdom that oil production will continue to climb, and instead stare bleakly at a planet facing economic meltdown and conflict over its most valuable resource. Featuring a haunting score by Phillip Glass and a fascinating array of rare archival footage, the film explores oil's rocky relationship with human progress in locales ranging from ancient Baku, Azerbaijan to dusty oilpatch town McCamey, Texas.\n\nAmidst a dark and disturbing vision of our future, A CRUDE AWAKENING hints at a humbler way of life built around sustainability and alternative energy, providing a visually stunning, boldly prophetic testament which provokes not just thought but action.","torrent":{"xt":"urn:btih:1f01c152771dcabd68e38048591300434d5d5624","amp;dn":"A+Crude+Awakening+%28.mp4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f01c152771dcabd68e38048591300434d5d5624","infoHashBuffer":{"type":"Buffer","data":[31,1,193,82,119,29,202,189,104,227,128,72,89,19,0,67,77,93,86,36]},"announce":[],"urlList":[]}}