{"title":"Collective Soul - Welcome All Again","uid":5142586,"size":107020292,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1f62dc76053ed80210816c471388894005c58f48&amp;dn=Collective+Soul+-+Welcome+All+Again&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"2nafish","files":-1,"time":1257027138,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nCollective Soul is an American rock band from Stockbridge, Georgia. They have enjoyed popularity on alternative rock, mainstream rock and pop music radio throughout the 1990s and into the new millennium, recording seven #1 mainstream rock hits. They broke into mainstream popularity with their hit single &quot;Shine&quot; from their debut album Hints, Allegations, and Things Left Unsaid, released in 1993. They were inducted into the Georgia Music Hall of Fame on September 19, 2009.\n\nCollective Soul released their eighth studio album, another self-titled, but designated by the band as Rabbit. It was released on August 25, 2009 by Roadrunner Records. The first single was &quot;Staring Down&quot; and the second single was &quot;Welcome All Again&quot;. &quot;Staring Down&quot; peaked at #17 on the Mediabase Hot AC chart and also charted on Billboard's Adult Top 40. The album debuted at #24 on the Billboard Hot 200.\n\nIn September 2009, Collective Soul were inducted into the Georgia Music Hall of Fame. In their induction speech, band leader Ed Roland thanked a long list of former members and collaborators who have been involved over the past 2 decades, including Ross Childress, Ryan Hoyle and Cheney Brannon. Ed invited founding member and longtime drummer Shane Evans to the stage to celebrate with the band.\n\nCollective Soul, also known simply as Rabbit, is the eighth studio album by Atlanta-based rock band Collective Soul. It was released on August 25, 2009.\n\nCollective Soul is Collective Soul's first release with a parent label since the group started its own independent El Music Group label in 2004.\n\nCollective Soul also includes two songs (&quot;You&quot; and &quot;Understanding&quot;) that were written by all members in the band, a first for Collective Soul. According to singer/guitarist Ed Roland: &quot;I think it's the confidence that the other guys have gotten in their music skills and the songwriting and also, for lack of a better term, me letting go of my ego a little bit...&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:1f62dc76053ed80210816c471388894005c58f48","amp;dn":"Collective+Soul+-+Welcome+All+Again","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f62dc76053ed80210816c471388894005c58f48","infoHashBuffer":{"type":"Buffer","data":[31,98,220,118,5,62,216,2,16,129,108,71,19,136,137,64,5,197,143,72]},"announce":[],"urlList":[]}}