{"title":"[PDF] [2011] Identities and Allegiances in the Eastern Mediterra","uid":6454887,"size":4414092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f8e0bc3b549885d86f7003aa763fd9da4727a36&amp;dn=%5BPDF%5D+%5B2011%5D+Identities+and+Allegiances+in+the+Eastern+Mediterra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lyndavilla","files":2,"time":1307551016,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n  &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nThis volume of studies explores a particularly complex period in Byzantine history, the thirteenth century, from the Fourth Crusade to the recapture of Constantinople by exiled leaders from Nicaea. During this time there was no Greek state based on Constantinople and so no Byzantine Empire by traditional definition. Instead, a Venetian/Frankish alliance ruled from the capital, while many smaller states also claimed the mantle of Byzantium. Even after 1261 when the Latin Empire of Constantinople was replaced by a restored Greek state, political fragmentation persisted. This fragmentation makes the study of individuals more difficult but also more valuable than ever before, and this volume demonstrates the very considerable advances in historical understanding that may be gained from prosopographical approaches. Specialist historians of the Byzantine successor states of the period, and of their most important neighbours, here examine the self-projection and interactions of these states, combining military history and diplomacy, commercial and theological contacts, and the experiences and self-description of individuals. This wide-ranging series of articles uses a greatly increased diversity of sources - Arabic, Armenian, Bulgarian, Greek, Latin, Persian and Serbian - to exploit the potential of the novel methodology employed and of prosopography as an additional historical tool of analysis.","torrent":{"xt":"urn:btih:1f8e0bc3b549885d86f7003aa763fd9da4727a36","amp;dn":"%5BPDF%5D+%5B2011%5D+Identities+and+Allegiances+in+the+Eastern+Mediterra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f8e0bc3b549885d86f7003aa763fd9da4727a36","infoHashBuffer":{"type":"Buffer","data":[31,142,11,195,181,73,136,93,134,247,0,58,167,99,253,157,164,114,122,54]},"announce":[],"urlList":[]}}