{"title":"Coast to Coast AM - Sep 28 2009 - Alien Hypotheses","uid":5105534,"size":56438077,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:1fae3c1e00f3eb22c6994f901521273903a17d0a&amp;dn=Coast+to+Coast+AM+-+Sep+28+2009+-+Alien+Hypotheses&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":4,"time":1254335807,"description":"Alien Hypotheses\n\nDate: 09-28-09\nHost: George Noory\nGuests: Mac Tonnies, David Blume, Daryl Hannah\n\nAuthor, blogger and Fortean researcher Mac Tonnies argued that the ET hypothesis (that aliens are visiting our world from other star systems) is somewhat of an outmoded concept, and the truth may be stranger than we can imagine, involving a myriad of overlapping explanations. The notion of parallel worlds has gained credence in the scientific world, and the aliens could represent a kind of symbiosis with beings from another dimension, he noted. The so-called ETs could be a species of intelligent non-humans, or &quot;Cryptoterrestrials&quot; (the title of his forthcoming book) who covertly share our planet with us. Because aliens are typically described as a bipedal and human-like species, it suggests to him they have developed here on Earth.\n\nYet, the prototypical alien-- the spindly, big headed 'grey,' has the physique to be an ideal astronaut with few physical requirements-- perhaps they were designed for space travel, Tonnies commented. Cultural associations also influence how the aliens are perceived. In Zimbabwe for instance, entities wearing silvery suits associated with metallic craft have been described as the &quot;ghosts of ancestors,&quot; he detailed. Regarding the alien's reported hybridization program, we could be dealing with something beyond the understanding of our neurological hard-wiring, he said.\n\nTonnies sees humans themselves in a kind of transitional state, eventually merging with technology and becoming more evolved and compassionate. He also talked about how some of the artifacts on Mars, such as at Cydonia, are a genuine scientific mystery. While not yet definitive proof of ET presence, they merit serious study, he said.\n\nAlternative Energy\n\nIn the last hour, ecological biologist David Blume and actress/activist Daryl Hannah talked about renewable energy and gasoline alternatives such as alcohol. There's a surplus of corn that could be converted into fuel, and in states like Wisconsin where alcohol competes with gasoline at the pumps, the price for gas is much lower than it is in California, he said. Hannah noted that cactus can actually be converted into fuel, and recommended the Sustainable Biodiesel Alliance as a further resource.\n\nWebsite(s):\nmactonnies.com\nalcoholcanbeagas.com\ndhlovelife.com\n\nBook(s):\nAfter the Martian Apocalypse: Extraterrestrial Artifacts and the Case for Mars Exploration\nAlcohol Can Be a Gas!\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:1fae3c1e00f3eb22c6994f901521273903a17d0a","amp;dn":"Coast+to+Coast+AM+-+Sep+28+2009+-+Alien+Hypotheses","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fae3c1e00f3eb22c6994f901521273903a17d0a","infoHashBuffer":{"type":"Buffer","data":[31,174,60,30,0,243,235,34,198,153,79,144,21,33,39,57,3,161,125,10]},"announce":[],"urlList":[]}}