{"title":"Driver Sweeper v3.0.0 Portable [ADHDerby]","uid":6446787,"size":5740219,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1fdcc124a3b80eb3e746ba73beac513825030eb6&amp;dn=Driver+Sweeper+v3.0.0+Portable+%5BADHDerby%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ADHDerby","files":-1,"time":1307294889,"description":"Driver Sweeper keeps your PC stable and fast with advanced driver removal that ensures the maximal performance of your PC. Driver Sweeper avoids driver conflicts and system failures by removing all previous driver entries. Combined with additional features such as backups and a desktop icon manager, Driver Sweeper offers a complete solution to all your driver needs.\n\n\nFeatures:\n\n- Scan and Remove - Scan for driver entries on your system and remove the entries you actually want to remove\n- Desktop Icons - Backup the positions of your desktop icons and restore them after the new drivers are installed\n  No manual arrangement of your desktop icons anymore after a new driver installation\n- Custom Filters - Create custom filters for other drivers or extend the shipped filters of Driver Sweeper\n- Log Files - View detailed information about the removed driver entries\n- Backup Manager - Driver Sweeper automatically creates a backup of the drivers you selected to remove\n  You can restore all removed entries if you want to revert to a previous driver version\n- Parameters - Use parameters to completely automate the cleaning process\n\n\nLanguages:\n\nArabic, Brazilian Portuguese, Bulgarian, Czech, Danish, Dutch, English, Finnish, French, German, Hungarian, Italian, Japanese, Korean, Latvian, Lithuanian, Norwegian, Polish, Russian, Simplified Chinese, Slovakian, Spanish, Swedish, Traditional Chinese, Turkish, Ukrainian\n\n\nRequirements:\n\n- OS: Any Windows version (32-bit and 64 bit) with Microsoft .NET Framework 3.0 or higher installed\n- Disk Space 12,3 MB\n\n\nChangelog v3.0.0 (22-04-11):\n\nNew:\n\n- Added NEC - USB cleaning\n- Added Fresco Logic - USB cleaning\n- Added theme support - There are four additional themes to choose from besides the default theme\n\nUpdated:\n\n- Improved AMD - Display cleaning\n- Improved Intel - Chipset cleaning\n- Improved NVIDIA - Display cleaning\n- Improved NVIDIA - Chipset cleaning\n- Improved NVIDIA - PhysX cleaning\n- External executables are now executed in Windows Temp folder to prevent antivirus warnings\n- Initial work done for a major improvement to both cleaning and restore methods\n- Removed unused external executable\n- Improved update check\n- Internal libraries\n- Improved Traditional Chinese translation\n\n\nNote: This release is completely portable and it doesn't contain the OpenCandy advertising module!\n\n\nCheers,\n\nADHDerby","torrent":{"xt":"urn:btih:1fdcc124a3b80eb3e746ba73beac513825030eb6","amp;dn":"Driver+Sweeper+v3.0.0+Portable+%5BADHDerby%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fdcc124a3b80eb3e746ba73beac513825030eb6","infoHashBuffer":{"type":"Buffer","data":[31,220,193,36,163,184,14,179,231,70,186,115,190,172,81,56,37,3,14,182]},"announce":[],"urlList":[]}}