{"title":"Democracy Now - 17 may 2011","uid":6400668,"size":443063244,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:20ae69b532e554461b42c36a135c234a2c9c0928&amp;dn=Democracy+Now+-+17+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1305652802,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 17, 2011\n\n- NATO Bombs Key Gaddafi Targets In Tripoli\n- U.S. Joins Talks With Taliban Amid Fresh Deaths of Civilians And U.S. Troops\n- NATO Helicopter Fires On Pakistani Army Post\n- New York Investigates Major Banks Over Mortgage Security Operations\n- Supreme Court Increases Police Power To Conduct Warrantless Searches\n- IMF Chief Held On Sex Crime Charges Denied Bail\n- Canada Wildfires Threaten Oil Pipeline Spill Cleanup\n- New Yorker Expose Reveals Obama's Expansive Attack On Whistleblowers\n- Supreme Court Refuses To Hear Bush-Era Extraordinary Rendition Case\n- Journalists Detained in Libya May Be Released\n- Iran Comments On Missing Al Jazeera Correspondent\n\n\nSpecial reports\n\n- Israeli Troops Shoot U.S. Student in Head with High-Velocity Tear Gas Canister\n\n&quot;I was shot at close range with a high-velocity metal tear gas canister... When it hit me, it tore off a part of my scalp,&quot; says Christopher Whitman, a 25-year-old American student and activist who was seriously injured when he was shot by Israeli forces while attending a West Bank protest on Friday. At the time of the shooting, Whitman was recording video of the weekly nonviolent protest against the Israeli separation wall in the West Bank. Several Palestinians were also injured during the protest.\n\n\n- A New Nonviolent Resistance Movement Grows as Palestinians Mark Nakba Day with Protests at Syria, Lebanon and Gaza Borders\n\nPalestinian President Mahmoud Abbas has declared three days of mourning for the 14 Palestinians killed when Israeli troops opened fire on massive protests at Israel's multiple borders on Sunday. In an unprecedented action, Palestinian refugees from Syria, Jordan and Lebanon, as well as residents of Gaza, tried to enter Israel. In addition to those killed, hundreds of people were wounded. As many as 300 people from Syria overwhelmed border patrols and briefly entered Israel. The series of protests came on Nakba Day, when Palestinians mourn the 1948 establishment of Israel, which drove hundreds of thousands of Palestinians out of their homes. We're joined by Fadi Quran, a youth leader in Ramallah who helped organize a protest at the Kalandia checkpoint on Sunday.\n\n\n- &quot;Violent Crackdown&quot; on Pro-Palestinian Protesters in Cairo Leaves Over 350 Injured\n\nEgyptian police violently crushed a Sunday protest marking the anniversary of the 1948 establishment of Israel. At least 350 people were injured outside of the Israeli embassy in Cairo when police reportedly fired live ammunition, tear gas grenades and rubber bullets at the crowd. Meanwhile, former Egyptian president, Hosni Mubarak, is expected to plead for amnesty and apologize on state television for causing harm to the nation, saying he received faulty information from some of his advisers. We speak with Democracy Now! correspondent Sharif Abdel Kouddous who is reporting in Cairo.\n\n\n- Opposition to Military Trials of Civilians in Egypt Gains Momentum\n\nThree months after the Egyptian military took the reins of power following the popular uprising that ousted former president, Hosni Mubarak, the Supreme Council of Armed Forces is coming under growing criticism for its widespread use of military trials against civilians. On May 9, a press conference was organized at the Egyptian Journalists Syndicate in downtown Cairo for people to speak out against the military court system, which has been used to convict and jail more than 5,000 civilians since January 25, the first day of massive protests at Cairo's Tahrir Square. Democracy Now! correspondents Sharif Abdel Kouddous and Nicole Salazar filed this video report from Cairo.\n\n\n- &quot;Getting Wise to Breitbart's Lies&quot;: Missouri Professors Survive Right-Wing Smear Campaign By Andrew Breitbart\n\nTwo Missouri labor professors have been vindicated after a right-wing smear campaign almost cost them their jobs. Last month, the website BigGovernment.com'run by right-wing blogger Andrew Breitbart'posted footage of a labor relations class taught by University of Missouri professors Judy Ancel and Don Giljum. In the video, the professors appeared to make a number of statements backing the use of violence in the struggle for labor rights. But it turned out the video was edited in a way to distort their words'similar to recent video campaigns against ACORN, Planned Parenthood, NPR and former FDA official, Shirley Sherrod. &quot;I was just appalled. I knew it was me speaking, but it wasn't saying what I had said in class,&quot; said Judy Ancel, Director of the Institute for Labor Studies, University of Missouri-Kansas City.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:20ae69b532e554461b42c36a135c234a2c9c0928","amp;dn":"Democracy+Now+-+17+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20ae69b532e554461b42c36a135c234a2c9c0928","infoHashBuffer":{"type":"Buffer","data":[32,174,105,181,50,229,84,70,27,66,195,106,19,92,35,74,44,156,9,40]},"announce":[],"urlList":[]}}