{"title":"Smuggle_Truck-VACE","uid":6446606,"size":16413884,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:214010d98d199a8d453f4d439878a32fd0e4201e&amp;dn=Smuggle_Truck-VACE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":6,"time":1307291999,"description":"Smuggle Truck (c) Owlchemy Labs\n\n.)      .' .-'''-..'\n-...-'      &quot;----- -\ni\n..'/ //\n/\n. /\n.                                                                /  7\n-      Game Type...: Drive            # of Disks.: 4  4.77MB    /  /\n&quot;      Released....: June 5th, 2011    Protection.: Money        /  /  7\n..' .' .'\n\n.----------------------------- r e l e a s e info\n\n-  Smuggle Truck is an over-the-top physics-based driving game  where  you\n'  must save your passengers by smuggling them  across  the border in  the\nleast amount of time. Tilt your truck, catch newborn babies, drive over\n.  armadillos,  and  rocket your  way through hills, caverns, deserts, and\nforests to save the people\n\nThe Story\n\nSmuggle Truck  was  inspired  by  the  frustration  our  friends  have\nexperienced  in trying to immigrate to the United States. With  such  a\ntroublesome  issue  being largely avoided in popular media,  especially\nvideo games,  we  felt  the  best  way  to  criticize  it  was  with an\ninteractive satire\n\nIn Smuggle Truck, players  are  driving  a truck with passengers in the\nback, bringing them  over a fictional border. This idea originated as a\nresult of learning that the process of legal  immigration  was  not  as\nstraightforward as  we  had  assumed. As we  lived through a painful 12\nmonths of our friend struggling through the absurd legal minefield that\nsurrounds U.S. immigration, we felt that we should create a  game  that\ntouches on the issue. The comment was thrown around that &quot;it's so tough\nto  legally  immigrate  to  the U.S., it's  almost  easier  to  smuggle\nyourself over the border&quot;, and thus  Smuggle Truck was born. A  two-day\nprototype eventually turned into an iPhone game, with the plan to reach\nas many players as possible\n\nThroughout  the creation of the game, we maintained a meticulous eye to\navoid depicting a specific stereotype  or location, instead  opting  to\ngeneralize smuggling  to its  most basic  abstract  form. Through  user\ntesting and feedback from  fellow developers and even random strangers,\nwe worked to maintain a light and  humorous representation of a subject\nthat is normally avoided\n\nWith a satirical  angle on a real issue, we want to create a game  that\nis  fun  to play but also stirs up discussion  on  ways to  improve the\nproblematic immigration system in the United States.\n\n..--''&quot;&quot;      .\n.-----------------'------ r e l e a s e notes\ni  i\n1# Unzip, Unrar manually.\n2# Run setup.bat, after thats done hit Smuggle Truck.exe to play\n3# Have phun\n\nRipped: Nothing\n\nREMEMBER :\nIf you like this game, buy it. Developers deserve your support","torrent":{"xt":"urn:btih:214010d98d199a8d453f4d439878a32fd0e4201e","amp;dn":"Smuggle_Truck-VACE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"214010d98d199a8d453f4d439878a32fd0e4201e","infoHashBuffer":{"type":"Buffer","data":[33,64,16,217,141,25,154,141,69,63,77,67,152,120,163,47,208,228,32,30]},"announce":[],"urlList":[]}}