{"title":"Lights - Saviour","uid":5158840,"size":129667076,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:22686ce8dbef86f35f8751320fdf94c99ecca19f&amp;dn=Lights+-+Saviour&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1258022236,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Saviour&quot; is the lead single from Lights' debut album The Listening released on July 6, 2009 in Canada and in the United States in late 2009 or early 2010.\n\nThe video features Lights drawing comics in her bedroom, which gradually animate and send her comic self into outer space. Lights lands on a desolate planet and walks around, looking for something. She picks up a crystal with a flower growing inside it, and plants it into the earth, causing the dark sky to become filled with light and the plants to thrive once again - she becomes the &quot;saviour&quot; of the planet. Meanwhile, the real Lights plays her keytar, draws, and walks around her bedroom, discovering things that had appeared in the comic. The video concludes with her blowing on a pink flower that begins to glow with ethereal light. This is a prequel to the Drive My Soul video.\n\nThe song is a poppy, keyboard-driven new wave number and is the first Lights song to feature prominent Auto-Tune. It is about Lights telling someone of her troubles and how she doesn't like who she's become. Furthermore, she tells them that one day, she will need them to save her.\n\nA week after the song's release in Canada, the song has entered the Canadian Hot 100, debuting at number 49.\n\nThe Listening is the debut studio album by Lights released in Canada on September 22, 2009 and in the United States on October 6, 2009. It is currently slated to be released sometime throughout October, 2009 in Australia. It will be released in Europe in early 2010.\n\nLights (stylized as LIGHTS, born Valerie Poxleitner on 11 April 1987) is a Juno Award-winning Canadian singer-songwriter. She is known for composing and performing synthpop music such as the songs &quot;Drive My Soul,&quot; &quot;Ice,&quot; &quot;Saviour,&quot; and &quot;February Air&quot; and has performed internationally.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:22686ce8dbef86f35f8751320fdf94c99ecca19f","amp;dn":"Lights+-+Saviour","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22686ce8dbef86f35f8751320fdf94c99ecca19f","infoHashBuffer":{"type":"Buffer","data":[34,104,108,232,219,239,134,243,95,135,81,50,15,223,148,201,158,204,161,159]},"announce":[],"urlList":[]}}