{"title":"ZygorGuides Level + Spec Ingame Addon (May, 26, 2011)","uid":6425918,"size":3418105,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:22fee44f4b0659de045ded53dc7dbef88b8a9f46&amp;dn=ZygorGuides+Level+%2B+Spec+Ingame+Addon+%28May%2C+26%2C+2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BronzeBeard","files":1,"time":1306468487,"description":"    -Completely Updated For Cataclysm and Patch 4.0.6\n    -Fully Customizable User Interface With Minimalist and Full View Modes.\n    -Frustration Free Smart Injection System Syncs Guide With Pre-Leveled Characters, Recruit-A-Friend, Heirlooms, and Dungeon Leveling.\n    -Loremaster Guide Included At No Extra Cost. All Game Zones Covered.\n    -In-Game Talent Build Advisor Shows You Where To Spend Talent Points.\n    -Built In Waypoint Arrow. No TomTom Or Other Addons Needed\n\nEverything you know about World of Warcraft has changed forever. The entire 1-60 portion of the game has been redesigned from the ground up, the talent system has been reworked in new and exciting ways, 2 new races are now playable, and the level cap has been raised to 85.\n\nThat much new content can be daunting to take in. It doesn\\'t matter if you are an experienced, hardcore player or a complete noob, everyone has to relearn the game again for Cataclysm. But that challenge doesn\\'t have to be hard at all, in fact, it can be made fun and easy with Zygor\\'s all new 1-85 leveling guides.\n\nOur world reknowned leveling guides have been completely rewritten from scratch for Cataclysm. We\\'ve even gone the extra mile and added a full guide for getting the Loremaster achievement at no additional cost. So this is it. You are just a click away from aquiring the only tool that can unlock the full World of Warcraft experience.\n\nREMEMBER TO SEED","torrent":{"xt":"urn:btih:22fee44f4b0659de045ded53dc7dbef88b8a9f46","amp;dn":"ZygorGuides+Level+%2B+Spec+Ingame+Addon+%28May%2C+26%2C+2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22fee44f4b0659de045ded53dc7dbef88b8a9f46","infoHashBuffer":{"type":"Buffer","data":[34,254,228,79,75,6,89,222,4,93,237,83,220,125,190,248,139,138,159,70]},"announce":[],"urlList":[]}}