{"title":"BlazeVideo VideoFlick 1.0.1.2","uid":6441361,"size":33210189,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2309a03f8158f9aed8c03fe6d59512d7cb8c76b0&amp;dn=BlazeVideo+VideoFlick+1.0.1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306992812,"description":"BlazeVideo VideoFlick 1.0.1.2\n\nView &amp; Organize, Create movies, Publish clips online, Email movies, Snapshot photo from video and more on one single VideoFlick.\n\nResize your photos into your favorite size\nCrop the unnecessary part of the original photo to make it more beautiful.\n\nEasy and Enhanced Photo Fixs\nManually adjust brightness, contrast, hue, saturation, blur and sharp.\n*Remove red-eye with one click\n*Merge Photo collection\nMerge several photos together adds transition between two pictures for\n\nSnapshot Video\nVideoFlick extracts every single frame from video, so you can capture the perfect shot from videos.\n\nSharing Online\nBesides editing, VideoFlick provides direct editing video uploading to Youtube, Flickr and other online video services.\n\nSharing Via Email\nVideoFlick makes it pretty easy to invite your friends and family to enjoy your creativity. Send attachment-free emails to make watching videos a breeze.\n\nImport Media Files from any DV, DC and Removable Media\nVideoFlick offers you to access all videos and photos on any home DV, DC, mobile phone camera, DVD, removable disc, etc..\n\nCrop the Imperfect Video\nCrop the original video to the proper field you want. Now you can crop the video black side and make your favorite videos is too large to perfectly play on your iPod, iPad, PSP, MP3/MP4 player, Mobile Phone, etc.\n\nAdd Watermark Anywhere onto Original Video\nAdd watermark to your video to protect your copyright, add comments, timestamps and other your copyright.\n\nMerge Video Clips with Your Own Title and Credits\nVideoFlick allows you to merge several video clips together with your own personalized title and credits screen.\n\nFind Your Media Files with Ease\nVideoFlick makes it extremely easy to organzie your video and photo collection. Your imported media folders could be seperatedly listed as video folder and photo folder. Media files in the folder could be viewed in Thumbnail and Full Screen.\n\nDisc Creation\nEnjoy your finished videos/photos at home by producing DVD disc or CD disc.\n\nPlay Your Files on Mobile Devices\nVideoFlick exports video files to FLV, AVI and ASF. Coming soon for iPod, iPhone, BlackBerry, PSP, 3GP and Mobile Phone.\n\nOne-click FixVideo\nFlick enables a number of enhancement you can apply with just one click.\n\nQuickly-accessed function\nButtom toolbar lists the basic features of VideoFlick. With many features just for video, VideoFlick list the video-only features with active status which allows you to quickly access the available features.\n\nHtml Ablum Producing\nVideoFlick helps you to create all the image collection in Picture Tray into html page with different album style.Ways to Show and Tell.\n\nHome Page - http://www.blazevideo.com/videoflick/\n\n\n","torrent":{"xt":"urn:btih:2309a03f8158f9aed8c03fe6d59512d7cb8c76b0","amp;dn":"BlazeVideo+VideoFlick+1.0.1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2309a03f8158f9aed8c03fe6d59512d7cb8c76b0","infoHashBuffer":{"type":"Buffer","data":[35,9,160,63,129,88,249,174,216,192,63,230,213,149,18,215,203,140,118,176]},"announce":[],"urlList":[]}}