{"title":"2012 (2009) Retail (multi-subs) Pal TBS","uid":6415101,"size":4685547256,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:232cef1157a2a210f9fe02fe60ceeba30eb8aadc&amp;dn=2012+%282009%29+Retail+%28multi-subs%29+Pal+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spookkie","files":112,"time":1306144515,"description":"2012 (2009) Retail (multi-subs) Pal TBS\n\nVerenigde Staten\nActie / Drama\n158 minuten\n\ngeregisseerd door Roland Emmerich\nmet John Cusack, Amanda Peet en Chiwetel Ejiofor\n\nIn het jaar 2009 worden aanwijzingen gevonden uit het Maya-tijdperk die voorspellen dat 21 december 2012 het einde van de wereld is zoals we die kennen en dat de overgang plaatsvindt naar iets nieuws. Wanneer Jackson Curtis (John Cusack) en zijn twee kinderen een familietrip naar Yellowstone maken, stuiten ze heel toevallig op een enorme researchinstallatie in een uitgedroogde meerbodem en ontdekken zo het geheim van de dreigende apocalyps die de regering verborgen gehouden heeft. Jackson moet de zaken nu in eigen handen nemen en hij stort zich in een wanhopige wedloop om zijn gezin en zichzelf te redden terwijl hij getuige is van aardbevingen, vulkaanuitbarstingen, tsunami's en allerlei andere rampen die de aarde voor de mensheid in petto heeft.\n\nDr. Adrian Helmsley, part of a worldwide geophysical team investigating the effect on the earth of radiation from unprecedented solar storms, learns that the earth's core is heating up. He warns U.S. President Thomas Wilson that the crust of the earth is becoming unstable and that without proper preparations for saving a fraction of the world's population, the entire race is doomed. Meanwhile, writer Jackson Curtis stumbles on the same information. While the world's leaders race to build &quot;arks&quot; to escape the impending cataclysm, Curtis struggles to find a way to save his family. Meanwhile, volcanic eruptions and earthquakes of unprecedented strength wreak havoc around the world. \n\nWeblink: http://www.moviemeter.nl/film/53803\nWeblink: http://www.imdb.com/title/tt1190080/\n\n---Source: 2012 (2009) Retail\n---Audio: Enlish,\n---Subs: English, Nederlands, French, Arabic, Danish, Finnish, Hindi, Norwegian, Swedish\n---Format: Video_TS &amp; Audio_TS\n---Format: Pal\n---Format: DVD5\n---Menu: Yes\n---Extra: Stripped\n\n","torrent":{"xt":"urn:btih:232cef1157a2a210f9fe02fe60ceeba30eb8aadc","amp;dn":"2012+%282009%29+Retail+%28multi-subs%29+Pal+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"232cef1157a2a210f9fe02fe60ceeba30eb8aadc","infoHashBuffer":{"type":"Buffer","data":[35,44,239,17,87,162,162,16,249,254,2,254,96,206,235,163,14,184,170,220]},"announce":[],"urlList":[]}}