{"title":"BLEACH VOLUME 15","uid":5005355,"size":4509956458,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:245cce5b66a739110d495695459941d639bd9733&amp;dn=BLEACH+VOLUME+15&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mike80219","files":-1,"time":1247698883,"description":"Actors: Bleach \nDirectors: Noriyuki Abe \nFormat: Animated, Color, DVD, NTSC, Subtitled \nLanguage: English, Japanese \nAspect Ratio: 1.33:1 \nNumber of discs: 1 \nRating: Unrated \nStudio: VIZ VIDEO \nDVD Release Date: March 17, 2009 \nRun Time: 100 minutes \n\nEpisodes #59 through #63 of the hit fantasy Bleach bring the &quot;Rescue&quot; story arc to its conclusion. Ichigo squares off against Rukia's arrogant brother Byakuya in a dramatic display of high-power swordsmanship. During the battle, Ichigo begins to grow a half-mask that resembles the monstrous Hollows he battled in the &quot;Substitute&quot; story. Horrorified, he rips it away and renews his attack. But Ichigo has no time to celebrate his narrow victory over Byakuya: The duelists, Rukia, Ichigo's friends, and the other Soul Society Captains discover they have all been used as pawns by an unscrupulous villain. What initially seemed like minor story elements turn out to have greater significance than anyone suspected: e.g. it's no coincidence that Yoruichi, the former princess of the Seireitei, chose to share her exile with Urahara, a.k.a. &quot;Hat and Clogs Guy.&quot; Director Noriyuke Abe once again shifts from dramatic daring-do to broad comedy as he sets the stage for the next storyline. Ichigo's time in the Soul Society made him much stronger--but is he strong enough for the adventures that await him? The set comes with a plastic Bleach keychain. (Rated &quot;Teen,&quot; suitable for ages 13 and older: violence, grotesque imagery, alcohol use, risquÃƒÂ© humor) --Charles Solomon \n\nProduct Description\nRukia's life has been spared--for the moment. While Renji races away from the execution grounds with Rukia in his arms, Ichigo's battle with Rukia's cold-blooded brother, Byakuya Kuchiki, rages on. Can a substitute Soul Reaper vanquish the most accomplished captain of the Seireitei? Before the dust can settle, even greater upheaval shakes the Soul Society to its core when the depth of the deception and betrayal at the hands of a beloved--and supposedly dead--captain comes to light. Ichigo and his comrades may have saved Rukia from execution, but who will save the Soul Society?\n\nContains episodes 59-63 (Bilingual, English &amp; Japanese with optional subtitles) \n","torrent":{"xt":"urn:btih:245cce5b66a739110d495695459941d639bd9733","amp;dn":"BLEACH+VOLUME+15","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"245cce5b66a739110d495695459941d639bd9733","infoHashBuffer":{"type":"Buffer","data":[36,92,206,91,102,167,57,17,13,73,86,149,69,153,65,214,57,189,151,51]},"announce":[],"urlList":[]}}