{"title":"Disturbia 720P English","uid":5170271,"size":4187332995,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:247a94a1d88f71f62944251446c55e479f35b949&amp;dn=Disturbia+720P+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cx902b","files":2,"time":1258651918,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0486822/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0486822/&lt;/a&gt;\n\nAfter his father is killed in a car accident, things unravel for Kale Brecht and he is placed under house-arrest for punching his Spanish teacher. Having nothing better to do, Kale occupies himself by spying on his neighbors. But one night, he witnesses what appears to be a murder going on in Mr. Turner's house. Kale becomes obsessed with uncovering the truth behind these murders but, after a few unsettling run-ins with Mr. Turner, it becomes a matter of life and death. And the ominous question: Who is watching who? Written by O.G. \n\nAfter his father's death, Kale Brecht becomes sullen, withdrawn, and troubled -- so much so that he finds himself under a court-ordered sentence of house arrest after a run in with the law. His mother, Julie, works night and day to support herself and her son, only to be met with indifference and lethargy. The walls of his house begin to close in on Kale. He becomes a voyeur as his interests turn outside the windows of his suburban home towards those of his neighbors, one of which Kale begins to suspect is a serial killer. But, are his suspicions merely the product of cabin fever and his overactive imagination? Written by Anonymous \n\nAfter the death of his father in a car accident, Kale Brecht becomes a troublemaker and aggressive teenager. When he punches his Spanish teacher at school, he is sentenced to three months of house-arrest during his vacations. Kale snoops his neighbors with a binoculars and video camera for killing time, and becomes a voyeur of his next door neighbor Ashley Carlson. When Ashley sees Kale and his friend Ronnie at the window, he tells out of the blue that their neighbor Robert Turner seems to be a wanted serial killer from Austin, Texas. The trio sneaks around his house, and Kale begins to suspect that Mr. Turner might really be the murderer. Written by Claudio Carvalho, Rio de Janeiro, Brazil \n\nKale Brecht is a 17-year-old who is placed under house arrest after punching one of his teachers. He is confined to his house with no available entertainment, and decides to use his free time spying on his neighbors. Things start to get weird when guests enter Robert Turner's house and not come back out. Kale and his friends, Ronnie and Ashley Carlson, start to grow more and more interested in what is actually happening within the house of Robert Turner.\n","torrent":{"xt":"urn:btih:247a94a1d88f71f62944251446c55e479f35b949","amp;dn":"Disturbia+720P+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"247a94a1d88f71f62944251446c55e479f35b949","infoHashBuffer":{"type":"Buffer","data":[36,122,148,161,216,143,113,246,41,68,37,20,70,197,94,71,159,53,185,73]},"announce":[],"urlList":[]}}