{"title":"Bon Jovi - She Don't Know Me","uid":5139588,"size":142972932,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:25018bec7d1a65122e99c63fc3a75792a9cda361&amp;dn=Bon+Jovi+-+She+Don%5C%27t+Know+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1256800858,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;She Don't Know Me&quot; is the second single from American rock band Bon Jovi's debut album, Bon Jovi.\n\nThe song has the distinction in that it is the only Bon Jovi studio release that was not written by a member of the band. \n\nIn the early 1980's, Mark Avsec (of Donnie Iris &amp; The Cruisers fame) wrote and produced the debut album for the disco band LaFlavour. At the time, Bon Jovi and LaFlavour were both signed to labels owned by Polygram. By the time Avsec composed LaFlavour's followup album, however, the band's name was changed to &quot;Fair Warning&quot; and their disco image was scrapped.\n\nAround this same time as LaFlavour's transformation, PolyGram was preparing to release Bon Jovi's debut album. The decision was made to take the song which Avsec had penned for Fair Warning and feature it on the Bon Jovi album instead.\n\nIn addition to the studio version of the song, a live version also appears on the Document in Japan bootleg recorded on 28th May 1985 from the 7800Ã‚Â° Fahrenheit tour. It is an extended version of the song lasting 8:24, commencing with a 3 minute drum solo.\n\nBon Jovi is the debut album from American rock band Bon Jovi, released January 21, 1984. Produced by Tony Bongiovi and Lance Quinn, the album is significant for being the only Bon Jovi album on which a song (&quot;She Don't Know Me&quot;) appears that was not written or co-written by members of the band.\n\nIn 1980 Jon Bon Jovi started to work at Power Station Studios, a Manhattan recording facility where his cousin, Tony Bongiovi, was a co-owner. Jon Bon Jovi made several demos and sent them out to many record companies, but failed to make an impact.\n\nIn 1982 Jon Bon Jovi went to local radio station WAPP 103.5FM &quot;The Apple&quot;. DJ Chip Hobart listened to Jon's demos and loved &quot;Runaway&quot;, deciding to include it on the station's compilation album of local homegrown talent. The studio musicians who helped record &quot;Runaway&quot; were known as The All Star Review. They were: guitarists Dave Sabo and Tim Pierce, keyboardist Roy Bittan, drummer Frankie LaRocka and bassist Hugh McDonald.\n\nThe song began to get airplay around New York. Jon signed to Mercury Records, part of the PolyGram company. Jon Bon Jovi wanted a group name and the A&amp;R staff at PolyGram came up with Bon Jovi.\n\nIn March 1983 Bon Jovi called David Bryan (then Rashbaum), who in turn called bassist Alec John Such and an experienced drummer named Tico Torres. At that time Bon Jovi's lead guitarist was Dave Sabo (a.k.a. The Snake), who later formed the group Skid Row. Dave Sabo was eventually replaced by Richie Sambora.\n\nBand recorded the album (originally titled &quot;Tough Talk&quot; but renamed after the record company decided it was wiser to issue the album as a self titled release) at Power Station Studios and produced by Tony Bongiovi and Lance Quinn. Most of the songs are written by Jon Bon Jovi David Bryan and Richie Sambora. &quot;Burning For Love&quot; and &quot;Come Back&quot; were the very first songs written for the album. Three singles were released from the album, &quot;Runaway&quot;, &quot;She Don't Know Me&quot; and in Japan only, &quot;Burning For Love&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:25018bec7d1a65122e99c63fc3a75792a9cda361","amp;dn":"Bon+Jovi+-+She+Don%5C%27t+Know+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25018bec7d1a65122e99c63fc3a75792a9cda361","infoHashBuffer":{"type":"Buffer","data":[37,1,139,236,125,26,101,18,46,153,198,63,195,167,87,146,169,205,163,97]},"announce":[],"urlList":[]}}