{"title":"PhotoFiltre Studio X 10.4.0","uid":6437704,"size":11507164,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:25208945f143a4f37105716b4fdf7c727ae54aaf&amp;dn=PhotoFiltre+Studio+X+10.4.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306850907,"description":"PhotoFiltre Studio X 10.4.0\n\nPhotoFiltre Studio - software for quick and easy learning curve. It includes tools that allow both to create new works, and to edit already existing images. In PhotoFiltre can adjust the brightness, contrast, saturation, gamma correct, use of filters (watercolor, pastels, ink, etc) Furthermore, this editor can work with the decorative text to optimize the schedule, create greeting cards and envelopes from finished shablonov.Suschestvenno expand program options you can connect to it plugins.\n\nIn addition, the disposal of the user is more than a hundred filters for image processing, such as watercolor, pastels, the effect of breakage on puzzles, etc. Those filters that are used most often made to the toolbar for easy access. Among other possibilities PhotoFiltre Studio can note the use of layers, advanced selection and saving provision in a separate file for later use. The program interface is translated into several languages, including Russian.\n\nPhotoFiltre Studio provides support for the filter of Adobe Photoshop (format 8bf, only 32 bits! Installed in any directory, it is permissible attachment subdirectories) that allows you to connect any number of configuration you plug arranging them in an external, in relation to the main Plugins directory software directory ( path to the directory specified in &quot;Settings -&gt; 8BF&quot;) and, as necessary to switch them, though this will require restarting the program PhotoFiltre Studio.\n\nFeatures:\n- Apply different filters\n- The use of two types of vector selection\n- Creating and using layers\n- Instrument cleaning image\n- Tools for the automatic imposition of a transparent gradient\n- The function to remove red eye\n- Creation of animated GIF-pictures with the built-in generator\n- Integrated module FotoMaski\n- Create and export 32x32, 48x48, 64x64 Icons\n- Integrated browser to view images\n\nHome Page - http://www.photofiltre-studio.com/\n\n","torrent":{"xt":"urn:btih:25208945f143a4f37105716b4fdf7c727ae54aaf","amp;dn":"PhotoFiltre+Studio+X+10.4.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25208945f143a4f37105716b4fdf7c727ae54aaf","infoHashBuffer":{"type":"Buffer","data":[37,32,137,69,241,67,164,243,113,5,113,107,79,223,124,114,122,229,74,175]},"announce":[],"urlList":[]}}