{"title":"ApexDC++ 1.2.1 (Source code)","uid":4999639,"size":9290918,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:2633b406141f5f8cad27336b0844e40f1eab995f&amp;dn=ApexDC%2B%2B+1.2.1+%28Source+code%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1247454643,"description":"Copied from ApexDC++ Homepage:\n\n\nApexDC++ is an innovative Direct Connect client based on the StrongDC++ modification. ApexDC++ is actively developed and provides a user-friendly interface, unique features, unlimited customisation and a dedicated support team.\n\nApexDC++ is, and always will be, free from all forms of malware.\nThe project is managed and developed by veterans of the P2P scene and as such we feel we are in touch with the opinions, wishes and requirements of our users.\n\n\nCompatibility: Windows 98, ME, XP, Vista and 7\n\n\n\nInfo about StrongDC++, copied from StrongDC++ Homepage:\n\nStrongDC++ is a client for sharing files in Direct Connect network. It is modification of program DC++ and it brings many news and features from other modification. Since DC++ is developed under GNU/GPL, you can download source and modify it.\n\n\nAttention\n\nStrongDC++ has been to designed to share a legal material only! Program developer isn't responsible for activities which the users use this software to.\n\n\nMain benefits of StrongDC++\n\n\nSafe segmented downloading\n\nDownload one file from more users simultaneously without corruption! This way of downloading dramatically improves download speed, especially for fast connections, and it's safer than classical downloading. Segment position ans size are decided by file size and chunks speed.\n\n\nPartial file sharing\n\nAllows downloading and uploading parts of file which is being currently downloaded by you or other users. This increases download speed and file expanding over network.\n\n\nDownload/Upload speed limiter\n\nAvoids a full line usage and leaves some speed for web browsing. Realise, that download speed limit is dependent on upload speed limit which is dependent on amount of opened slots/hubs.\n\n\nAutomatic slow downloads disconnecting\n\nDisconnects sources who speed is under certain value for certain time. If download speed during segmented downloading goes too low, the source is disconnected regardless the set value to avoid unnecessary slot usage.\n\n\nCustomization\n\nYou can set sounds according to situation, change color scheme or icons, show popup balloons, see emoticons and many more...\n\n\nChangelog:\n\n\nFix: High CPU issues related to TLS\n\nFix: Tooltip not showing on first button in Media Toolbar plugin \n\n\nChange: Re-worded TLS option in Security settings page (disabled by default - please enable if you wish to use encrypted hubs)\n\nChange: Improved Toolbar icons' sharpness (Thanks RadoX)\n\nChange: Updated installer to NSIS 2.45 improving reliability","torrent":{"xt":"urn:btih:2633b406141f5f8cad27336b0844e40f1eab995f","amp;dn":"ApexDC%2B%2B+1.2.1+%28Source+code%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2633b406141f5f8cad27336b0844e40f1eab995f","infoHashBuffer":{"type":"Buffer","data":[38,51,180,6,20,31,95,140,173,39,51,107,8,68,228,15,30,171,153,95]},"announce":[],"urlList":[]}}