{"title":"MATRIX_REVOLUTIONS..DVDrip(vice)","uid":5009093,"size":449986693,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:265c8b832240a90f22def5607a1fff9d7c5f019b&amp;dn=MATRIX_REVOLUTIONS..DVDrip%28vice%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1247889625,"description":"Resolution : 368X208 (Wide Screen) PSP\n\nVideo Codec : MPEG4\nVideo Bitrate : 448 Kbps\nAudio Codec : AAC\nAudio Bitrate : 64 Kbps\n\n\nThe events of the film immediately follow those of The Matrix Reloaded and assume familiarity therewith.\n\nBane/Smith and Neo are both in an unconscious state. Both men appear to be asleep, but neural patterns show a Matrix similarity in Bane and true Matrix patterns in Neo. As such, Morpheus starts a search for Neo within the Matrix. Neo is trapped in a subway station named &quot;Mobil Avenue,&quot; (Mobil being an anagram of Limbo) a transition zone between the Matrix and the Source (the Machines' mainframe). At this station, Neo meets a 'family' of programs, including a girl named Sati, whose father tells Neo that Mobil Avenue is controlled by a program called The Trainman who is an exile loyal only to the Merovingian. When Neo tries to board the train with the family, the Trainman refuses to let him aboard.\n\nSeraph contacts Morpheus on behalf of the Oracle. The Oracle, now bound in a new shell as the previous one was deleted, informs Morpheus and Trinity of Neo's confinement in Mobil Avenue. Seraph, Morpheus, and Trinity pursue the Trainman to secure Neo's release, but he escapes. The trio enter Club Hel to confront the Merovingian for Neo's freedom. The Merovingian demands &quot;the eyes of the Oracle&quot; in exchange for Neo's release. Trinity loses her patience and provokes a Mexican standoff, forcing the Merovingian to release Neo.\n\nTroubled by new visions of the Machine City, Neo decides to visit the Oracle. She informs him that as the One, he has developed a wireless connection with the Source. All of Neo's abilities - inside and outside the Matrix - exist because of this connection. She also explains Neo's early frustration at the knowledge of the true prophecy, and that he chose not to be ready to accept the truth. She characterizes Smith, who is also growing in power, as Neo's exact &quot;opposite&quot; and his &quot;negative&quot;, who threatens to destroy the Machine City as well as the Matrix. She tells Neo cryptically that &quot;everything that has a beginning has an end&quot;, and that the war is about to end &quot;one way or another.&quot; After Neo leaves the Oracle, a large group of &quot;Smiths,&quot; who had already assimilated Sati, arrive and assimilate the unresisting Oracle, gaining her powers of precognition.","torrent":{"xt":"urn:btih:265c8b832240a90f22def5607a1fff9d7c5f019b","amp;dn":"MATRIX_REVOLUTIONS..DVDrip%28vice%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"265c8b832240a90f22def5607a1fff9d7c5f019b","infoHashBuffer":{"type":"Buffer","data":[38,92,139,131,34,64,169,15,34,222,245,96,122,31,255,157,124,95,1,155]},"announce":[],"urlList":[]}}