{"title":"Diddy-Dirty Money feat. Notorious B.I.G. - Angels (2nafish)","uid":5188204,"size":192567300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:26bfef26902d515bd360f80bbc76de1ac9f73885&amp;dn=Diddy-Dirty+Money+feat.+Notorious+B.I.G.+-+Angels+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259562919,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Angels&quot; is the lead single from Diddy's upcoming studio album Last Train to Paris released on November 3, 2009 through Bad Boy Records. The song features Diddy-formed group Dirty Money and late rapper The Notorious B.I.G..\n\nThe music video was filmed in black-and-white scenes, it features Diddy walking and riding a motorcycle around the neighborhood of New York City.\n\nDirty Money's other personnel, Kalenna and Danity Kane's former member Dawn Richard, are captured making appearances in the video directed by Hype Williams.\n\nThe song was originally leaked on the internet on June 23, 2009, once the song was leaked, the leaked version was removed on the next day by warning by Diddy &amp; Bad Boy Records, who were angered about by the leak. The song samples the instrumentation from the song &quot;Where I'm From&quot; by Jay-Z (which was coincidentally produced by The Hitmen, Diddy's production group). The Notorious B.I.G.'s verse comes from his song &quot;My Downfall&quot; off of his sophomore album Life After Death. In this song, Diddy makes use of the Auto-Tune effect for his verses. The only parts rapped in the song are by The Notorious B.I.G.\n\nFreestyles were made by Rick Ross, Lupe Fiasco and Raekwon.\n\nLast Train to Paris is the upcoming fifth solo concept-studio album by American rapper Diddy and is scheduled to be released in 2010 on Interscope Records. In April 2009, with Dawn Richard of Danity Kane and singer Kalenna, Diddy formed the group Dirty Money, which will perform on this album.\n\n\nSome lyrics in this video are censored.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:26bfef26902d515bd360f80bbc76de1ac9f73885","amp;dn":"Diddy-Dirty+Money+feat.+Notorious+B.I.G.+-+Angels+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26bfef26902d515bd360f80bbc76de1ac9f73885","infoHashBuffer":{"type":"Buffer","data":[38,191,239,38,144,45,81,91,211,96,248,11,188,118,222,26,201,247,56,133]},"announce":[],"urlList":[]}}