{"title":"Microsoft Plus Superpack For Windows XP","uid":5103742,"size":317722624,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:27b5f07b0071ac753750d6163c15b15f51f5db64&amp;dn=Microsoft+Plus+Superpack+For+Windows+XP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xx666xX","files":-1,"time":1254204505,"description":"Microsoft Plus! SuperPack for Windows XP is loaded with stunning screensavers and themes, exciting games, and great ideas for getting more out of your photos, music, and home movies. It's the perfect way to take your Windows experience to the next level.\n\nFeatures:\nCreate amazing slideshows with your digital photos\nInsert your own narration, music and effects, and then share it all through e-mail, the Web, or on video CDs that play back in most home DVD players.\nPersonalize your PC with screensavers and themes\nEnjoy eight great screensavers and four adventurous themes. Experience a lifelike marine aquarium, launch yourself into outer space, and much more.\nTake a break with fun and exciting games\nGet a new spin on bowling, navigate challenging 3-D mazes, or put your puzzle-solving skills to the test.\nMake the most of your music\nEasily create CD/DVD labels and inserts. Jazz up Windows Media Player with colorful new skins, party mode, and desktop dancers. Copy your vinyl records and tapes onto your PC, and more!\nTurn your home movies into a Hollywood production\nMake your movies even more impressive with 50 video effects and transitions for Windows Movie Maker 2 for Windows XP.\n\nSystem Requirements:\nMicrosoft Windows-based computers\nOperating System Windows XP Home Edition, Windows XP Professional, Windows XP Media Center Edition, or Windows XP Tablet PC Edition\n- Processor Multimedia PC with 500-MHz processor (750-MHz processor recommended)\n- Memory 128 MB of RAM or greater (256 MB recommended)\n- Hard Disk 400 MB of available hard-disk space\n- Drive CD-ROM or DVD drive\nDisplay Super VGA (800 x 600) or greater resolution video adapter and monitor\nVideo Card Video adapter with 3-D graphics acceleration and 16 MB of memory required to run screen savers, games, and visualizations in Plus! SuperPack for Windows XP; video adapter must be compatible with Windows XP (you can update to latest video drivers from applicable card manufacturer\u0019s Web site or Windows Update)Note Video adapters that use 3DFX Voodoo, Savage 4, and Savage 2000 chipsets are not compatible with screen savers and games and are not supported\nSound Card Windows XP-compatible sound card\nInput Device Keyboard; Microsoft Mouse or compatible pointing device Internet Connection 56 Kbps or faster telephone/fax modem, cable modem, or DSL modem; some Internet functionality may require Internet service and payment of a separate fee to a service provider; local and/or long-distance telephone toll charges may apply; Internet access required to activate Plus! Digital Media Edition","torrent":{"xt":"urn:btih:27b5f07b0071ac753750d6163c15b15f51f5db64","amp;dn":"Microsoft+Plus+Superpack+For+Windows+XP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27b5f07b0071ac753750d6163c15b15f51f5db64","infoHashBuffer":{"type":"Buffer","data":[39,181,240,123,0,113,172,117,55,80,214,22,60,21,177,95,81,245,219,100]},"announce":[],"urlList":[]}}