{"title":"Born This Way (Glee Cast Version) - Single","uid":6340180,"size":6067697,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:281950d2378d728983b41f43b21b7a44e5efbcf6&amp;dn=Born+This+Way+%28Glee+Cast+Version%29+-+Single&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iBenTV","files":1,"time":1303627832,"description":"Glee Cast Performing Born This Way By Lady GaGa\n\nRelease Date:  2011-04-24\nSource:        iTunes\nGenre:         Pop \nRecord Label:  N/A\nEncoder:       LAME3.98 \nQuality:       320kbps\nDescription:   The Cover of Born This Way BY Lady GaGa\nRemix Single Cover:  Included\n\nTracklist:\n\n\n1. Born This Way (Glee Cast Version)\n\n\n------------------------------------------------------------------------------\t\nBorn This Way&quot; is a song by American singer-songwriter Lady Gaga from her second studio album of the same name. Released as the album's lead single on February 11, 2011,[3] the song was written by Lady Gaga and Jeppe Laursen, and it was produced by Gaga, Laursen, Fernando Garibay, and DJ White Shadow.[2]\n\n&quot;Born This Way&quot; received mixed to positive reception from critics, being described as a &quot;club-ready anthem&quot;, although it faced criticism for having similarities with Madonna's hit &quot;Express Yourself&quot;. It reached number one in 19 countries, including Austria, Australia, Canada, Germany, Ireland, New Zealand, Switzerland and Sweden. In the United States, it became her third single to top the Billboard Hot 100 chart. Additionally, &quot;Born This Way&quot; is the 1000th number-one song on the Hot 100 and only the nineteenth to debut at number-one, being the first song in more than 13 years to defend the debut top position more weeks, spending a total of six weeks atop the Hot 100. In the UK Singles Chart it debuted and peaked at number-three. It is the fastest-selling single in iTunes history, selling one million copies in five days.[4]\n\n&quot;Born This Way&quot; was premiered at the 53rd Grammy Awards, where Gaga performed after coming out of a vessel. The song was also performed during the last leg of her The Monster Ball Tour, in North America. Singer Katy Perry and internet sensation Maria Aragon have also covered the song.\n---------------------------------\n\nPlease Seed and let the song spread away into everyone's heart!!!","torrent":{"xt":"urn:btih:281950d2378d728983b41f43b21b7a44e5efbcf6","amp;dn":"Born+This+Way+%28Glee+Cast+Version%29+-+Single","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"281950d2378d728983b41f43b21b7a44e5efbcf6","infoHashBuffer":{"type":"Buffer","data":[40,25,80,210,55,141,114,137,131,180,31,67,178,27,122,68,229,239,188,246]},"announce":[],"urlList":[]}}