{"title":"Jada - American Cowboy","uid":5007521,"size":122800132,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:28a167e5d35ca29a7071d4fdda7f8ae436e4e4cd&amp;dn=Jada+-+American+Cowboy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247827009,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nJada is an American girl group from Boston, Massachusetts. The group is currently signed to Motown/Universal. The group consists of Elle Wine, April Forrest, Lauren O'Keefe and Jacyn Tremblay.\n\nDuring the group's earlier days, they sang at during sporting events, tree lighting ceremonies among other such venues as well as recording a demo. In 2006, the group signed to Motown/Universal Records with powerhouse vocals, soulful &amp; sophisticated harmonies, gospel infused ballads and infectious grooves exploding in a bold and funky mix of pop/r&amp;b. To date, the group have not yet released an album on the label. However, the group reported that since signing with Motown, they have been working with J. R. Rotem, Dallas Austin, Swizz Beats, RedOne, Akon, Ryan Tedder, Toby Gad and Wyclef Jean among others. In promotion of the album, the group toured with The Plain White T's, Lloyd and Brooke Hogan over the summer. They were created by producer, Ric Poulin and music manager, Laura Poulin, of Bristol Entertainment, whom they are still currently signed with. Their song,&quot;I'm That Chick&quot; was featured on the Bring It On: In It to Win It mini soundtrack in late 2007. In February 2008, Jada appeared with R&amp;B singer JoJo at the Ultimate Prom. In 2008 producers The Clutch and Danja have produced a song for Jada called &quot;Denial&quot; and performed live on NECN.\n\nIn December 9, 2008 Jada has won their first award at the Boston Music Awards 2009 for Outstanding Pop/R&amp;B Act Of The Year.\n\nJada's debut single, &quot;American Cowboy,&quot; was released to iTunes on March 31st. The video for it was released on April 25th. &quot;American Cowboy&quot; was featured on the April 27th episode of House, during Chase's bachelor party. Their debut album will be released sometime in June, and may contain a collaboration with R&amp;B singer JoJo.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:28a167e5d35ca29a7071d4fdda7f8ae436e4e4cd","amp;dn":"Jada+-+American+Cowboy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28a167e5d35ca29a7071d4fdda7f8ae436e4e4cd","infoHashBuffer":{"type":"Buffer","data":[40,161,103,229,211,92,162,154,112,113,212,253,218,127,138,228,54,228,228,205]},"announce":[],"urlList":[]}}