{"title":"Auslogics System Information 2.1.0.0","uid":6427022,"size":5752090,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:28b306e3409c0276379daaaf56cf66fa508fda79&amp;dn=Auslogics+System+Information+2.1.0.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306510591,"description":"Auslogics System Information 2.1.0.0\n\nAuslogics System Information provides comprehensive and easy to understand information about your system configuration. It will show hardware configuration, video-card information, OS details, list of running processes, and other information. This information can be saved as a file and sent to technical support. With hardly a stumble, this utility quickly collects and reports information about your system. The program's multipage interface is logically ordered, easily navigated, and sortable. You will especially enjoy the last, as columns on each page can be immediately sorted with quick clicks on category headers. The simple and advanced modes are very similar and most users tend to choose the latter.\n\nAuslogics System Information is both reliable and comprehensive; both primary requirements of this genre. It's also quick. Total system scans took seconds on our test machines. Fourteen categories of information, ranging from hardware to operating system are logically displayed.\n\nHelps to explore your computer\nAuslogics System Information will help you to evaluate the state of your computer and obtain a detailed report for technical experts or IT department. This tool is also recommended for users searching for driver updates, hardware manufacturers and those who just wish to know more about their computer internals.\n\nCreates a report in just one click\nCreating a report of your computer's system data couldn't be easier as you merely choose HTML, XML or plain text and press a button. Any information can be also placed into the clipboard with just one click.\n\nEasy to use and understand\nThe program's multipage interface is very clean and simple to navigate. It is much easier to use and understand than the built-in Windows system information tool.\n\nReceives the highest ratings from both users and editors\nAuslogics System Information received the highest ratings from users and editors onalike and has been featured in multiple US / UK / Australian and European magazines.\n\nHome Page - http://www.auslogics.com/en/\n\n\n","torrent":{"xt":"urn:btih:28b306e3409c0276379daaaf56cf66fa508fda79","amp;dn":"Auslogics+System+Information+2.1.0.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28b306e3409c0276379daaaf56cf66fa508fda79","infoHashBuffer":{"type":"Buffer","data":[40,179,6,227,64,156,2,118,55,157,170,175,86,207,102,250,80,143,218,121]},"announce":[],"urlList":[]}}