{"title":"ZEITGEIST- Il Film -Versione italiana - www.zeitgeistitalia.org","uid":5107258,"size":733488614,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:29150c400823dc612a21bcad3de58256644adec8&amp;dn=ZEITGEIST-+Il+Film+-Versione+italiana+-+www.zeitgeistitalia.org&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1254474181,"description":"ZEITGEIST- Il FILM - Versione italiana - (www.zeitgeistitalia.org)\n\nZeitgeist, The Movie Trascrizione: Introduzione\nPosted 1 giugno 2009 - 1:02am by 4v4l0n42\nVoce: ChÃƒÂ¶gyam Trungpa Rinpoche\n\nLa spiritualitÃƒÂ  ÃƒÂ¨ quel particolare termine che indica il nostro approccio con l'intuizione. Nella tradizione teistica, ÃƒÂ¨ presente l'idea di rispettare determinate prescrizioni. Una certa azione ÃƒÂ¨ riprovevole secondo i principi divini, un'altra azione soddisfa invece i principi di Dio... e cosÃƒÂ¬ via.\n\nNella tradizione non teistica, invece, ÃƒÂ¨ chiaro che la storia degli eventi non ÃƒÂ¨ cosÃƒÂ¬ importante, ciÃƒÂ² che ÃƒÂ¨ davvero importante ÃƒÂ¨ &quot;qui&quot; ed ÃƒÂ¨ &quot;il presente&quot;. Il presente ÃƒÂ¨ davvero &quot;presente&quot;. Cerchiamo di fare l'esperienza di ciÃƒÂ² che ÃƒÂ¨ a nostra disposizione sul posto, in quel momento. Non ha senso pensare a ciÃƒÂ² che esistito in passato e che avremmo potuto avere ora. Questo ÃƒÂ¨ il &quot;presente&quot;. Questo preciso istante. Niente di mistico. Solo il &quot;presente&quot;, molto semplice, diretto. E da questo attaccamento al presente, tuttavia, nasce una consapevolezza della propria intelligenza, sempre, in quanto interagisci con la realtÃƒÂ , istante dopo istante, nel luogo in cui ti trovi. Costantemente. Proviamo una meravigliosa sensazione di &quot;perfezione&quot;. Sempre.\n\nTuttavia ci sentiamo minacciati dal Presente, quindi ci spostiamo nel passato o nel futuro, prestando attenzione alle cose materiali che fanno parte della nostra vita, la vita cosÃƒÂ¬ ricca che conduciamo.\n\nFacciamo molte scelte continuamente, ma nessuna di queste viene considerata giusta o sbagliata di per sÃƒÂ¨. Tutte le volte che facciamo l'esperienza di qualcosa, avviene senza condizionamenti. Niente ci arriva con un'etichetta con sopra scritto, &quot;questo ÃƒÂ¨ considerato sbagliato&quot;, &quot;questo ÃƒÂ¨ giusto&quot;.\n\nAbbiamo l'esperienza di qualcosa, ma in veritÃƒÂ  non prestiamo la dovuta attenzione a ciÃƒÂ² che ci succede.\nNon consideriamo veramente che stiamo andando in una certa direzione.\nCi sembra una scocciatura.\nSi attende di essere morti.\nSi attende di essere morti. (Eco...)\nQuesto ÃƒÂ¨ il problema. Non fare davvero affidamento al Presente. In ciÃƒÂ² che sperimentiamo nella realtÃƒÂ  presente, possiamo trovare cose formidabili. CosÃƒÂ¬ formidabili che non riusciamo ad affrontarle. PerciÃƒÂ², siamo costretti a prendere a prestito dal passato e ad invitare il futuro, di continuo. E forse ÃƒÂ¨ per questo che cerchiamo la religione.\nForse ÃƒÂ¨ per questo che protestiamo nelle strade.\nForse ÃƒÂ¨ per questo che ci lamentiamo della nostra societÃƒÂ .\nForse ÃƒÂ¨ per questo che votiamo per i Presidenti.\nTutto questo appare ironico...\nA dire il vero, molto bizzarro.\nVoce: Jordan Maxwell\n\nPiÃƒÂ¹ inizi a porti domande su tutto ciÃƒÂ² che crediamo di comprendere, su da dove veniamo, su ciÃƒÂ² che pensiamo delle nostre azioni e piÃƒÂ¹ inizi a vedere che siamo stati ingannati.\nOgni istituzione ci ha ingannato. Per un attimo, cosa vi fa pensare il fatto che l'istituzione religiosa sia l'unica a non essere mai stata toccata?\n\nLe istituzioni religiose di questo mondo stanno in cima al sudiciume. Le istituzioni religiose di questo mondo sono create dalle stesse persone che vi hanno dato il vostro governo, la vostra corrotta educazione, che hanno creato i cartelli internazionali delle banche. PerchÃƒÂ© ai nostri potenti non importa affatto di te o della tua famiglia. Tutto ciÃƒÂ² che gli interessa ÃƒÂ¨ quello che gli ÃƒÂ¨ sempre interessato. CioÃƒÂ¨ controllare tutto questo dannato mondo. Siamo stati allontanati dalla presenza del Divino e della VeritÃƒÂ  nell'universo che gli uomini hanno chiamato Dio.\n\nIo non so cos'ÃƒÂ¨ dio, ma so quello che non ÃƒÂ¨.E sino a quando non sei preparato a guardare in faccia tutta la veritÃƒÂ , ovunque questo ragionamento ti conduca, qualunque siano le conclusioni, se vorrai, potrai guardare altrove o tenere il paraocchi, ma ad un certo punto lungo il tuo percorso, scoprirai di esserti fatto corrompere dalla &quot;giustizia divina&quot;.\n\nPiÃƒÂ¹ cerchi di informarti e piÃƒÂ¹ comprendi da dove viene tutto, le cose piÃƒÂ¹ ovvie cambiano e inizi a vedere bugie ovunque. Tu devi sapere la veritÃƒÂ , cercare la veritÃƒÂ  e la veritÃƒÂ  ti renderÃƒÂ  libero.\n\n    Deve essere difficile... per coloro che confondono l'autoritÃƒÂ  con la veritÃƒÂ , invece di considerare la veritÃƒÂ  come l'autoritÃƒÂ  - G. Massey, Egittologo.\n\nVoce: George Carlin\n\nPerchÃƒÂ© devo dirvi la veritÃƒÂ , gente. Devo dirvela.\n\nQuando si parla di stronzate, di stronzate piÃƒÂ¹ grandi di tutti i tempi, di stronzate di serie A, dovete avere soggezione della campionessa di tutti i tempi in termini di false promesse e pretese esagerate... la religione.\n\nPensateci. La religione ÃƒÂ¨ riuscita a convincere davvero la gente che c'ÃƒÂ¨ un uomo invisibile che vive in cielo che vede tutto quello che fai, ogni minuto, di ogni giorno. E l'uomo invisibile ha una lista speciale di dieci cose che non vuole che tu faccia. E se tu fai una qualsiasi di queste dieci cose, ha un posto particolare, pieno di fuoco, fumo, ustioni, torture e sofferenze, dove lui ti manderÃƒÂ  a vivere e soffrire e a bruciare, tossire, urlare e piangere per sempre fino alla fine dei tempi!\n\nMa Lui ti ama. Lui ti ama, e ha bisogno di soldi! Lui ha sempre bisogno di soldi! ÃƒË† onnipotente, ÃƒÂ¨ assolutamente perfetto, sa tutto, vede tutto, ma per un motivo o per un altro... non riesce a gestire il suo denaro! La religione, raccoglie milioni di dollari, loro non pagano tasse... e hanno sempre bisogno di qualcosa in piÃƒÂ¹. Ora, voi parlate di una storia piena di belle stronzate. \n\n\nZeitgeist, The Movie Trascrizione: Parte 1 - La piÃƒÂ¹ grande storia mai raccontata\nPosted 1 giugno 2009 - 1:18am by 4v4l0n42\nParte 1: La piÃƒÂ¹ grande storia mai raccontata\n\nQuesto ÃƒÂ¨ il sole. A partire dal 10.000 a.C., la storia ÃƒÂ¨ piena graffiti o scritture che rappresentano il rispetto e l'adorazione della gente per questo elemento. Ed ÃƒÂ¨ facile comprendere perchÃƒÂ©; in quanto ogni giorno il sole sorge, porta la luce, il calore e la sicurezza, salvando l'uomo dal freddo, dall'oscuritÃƒÂ  e da tutti i predatori nell'oscuritÃƒÂ  della notte. Senza di esso, le civiltÃƒÂ  capirono che il grano non crescerebbe e gli esseri viventi sul pianeta non sopravviverebbero. Questi dati di fatto hanno reso il sole l'oggetto piÃƒÂ¹ adorato di tutti i tempi. Allo stesso modo, prestavano molta attenzione anche alle stelle. Il rilevamento delle stelle consentiva loro di riconoscere ed anticipare eventi che si ripetevano nel corso di lunghi periodi di tempo, ...come le eclissi e le lune piene. Hanno, pertanto, catalogato in gruppi la mappa celeste, in quelle che oggi conosciamo come costellazioni.\n\nQuesta ÃƒÂ¨ la croce dello Zodiaco, una delle immagini concettuali piÃƒÂ¹ antiche della storia umana. Essa rappresenta metaforicamente il sole mentre attraversa le 12 maggiori costellazioni nel corso di un anno. Rappresenta anche i 12 mesi dell'anno, le 4 stagioni, i solstizi e gli equinozi. Il termine &quot;Zodiaco&quot; si riferisce al fatto che le costellazioni sono antropomorfizzate, ovvero personificate come persone o animali.\n\nIn altre parole, le civiltÃƒÂ  antiche non solo osservavano il sole e le stelle, ma li personificavano, elaborando mitologie circa i loro movimenti e le loro relazioni. Il sole con il suo potere di dare la vita e di salvatore era personificato come colui che rappresenta il Creatore invisibile ovvero Dio. Era conosciuto come il &quot;Sole di Dio&quot;, la luce del mondo, il salvatore dell'umanitÃƒÂ . CosÃƒÂ¬ pure le 12 costellazioni che rappresentavano le tappe del viaggio del Dio Sole e venivano identificate con nomi che spesso rappresentavano fenomeni naturali che si manifestano in quel periodo dell'anno. Per esempio, Acquario, colui che versa l'acqua, che porta le piogge di primavera.\n\nQuesto ÃƒÂ¨ Horus (Ra). ÃƒË† il Dio Sole dell'Egitto, risalente all'anno 3000 a.C. ÃƒË† il Sole antropomorfo e la sua vita ÃƒÂ¨ una serie di mitologie allegoriche del movimento del sole nel cielo. Dagli antichi geroglifici in Egitto, abbiamo appreso molto di questo Messia solare. Per esempio, Horus, essendo il sole, o la luce, aveva un nemico dal nome di Set e Set era le personificazione dell'oscuritÃƒÂ  notturna. E metaforicamente parlando, ogni mattina Horus vinceva la battaglia contro Set - mentre la sera, Set sconfiggeva Horus, mandandolo negli inferi. ÃƒË† importante notare che &quot;l'oscuritÃƒÂ  contro la luce&quot; o &quot;il bene contro il male&quot; sono fra le piÃƒÂ¹ onnipresenti dicotomie mitologiche mai conosciute e che si manifestano ancor oggi a vari livelli.\n\nSinteticamente, la storia di Horus ÃƒÂ¨ la seguente:\nHorus nacque il 25 Dicembre dalla vergine Isis-Meri. La sua nascita fu accompagnata da una stella dell'est, e dopo la sua nascita, fu adorato da tre Re. All'etÃƒÂ  di 12 anni, era un insegnante adolescente prodigio e all'etÃƒÂ  di 30 anni venne battezzato da una figura nota come Anup e da quel momento iniziÃƒÂ² il suo ministero. Horus aveva 12 discepoli che viaggiavano con lui compiva miracoli, come la guarigione dei malati e il camminare sulle acque, Horus era conosciuto con vari nomi simbolici come &quot;La veritÃƒÂ &quot;, &quot;La luce&quot;, &quot;Il figlio eletto di Dio&quot;, &quot;il Buon Pastore&quot;, &quot;l'Agnello di Dio&quot; e molti altri. Dopo esser stato tradito da Typhon, Hours venne crocifisso, sepolto per 3 giorni, dopodichÃƒÂ© risorse.\n\nQueste caratteristiche di Horus, anche se potrebbero non essere reali, sembrano permeare molte culture del mondo, in quanto si ÃƒÂ¨ scoperto che molte altre divinitÃƒÂ  presentano la stessa struttura mitologica generale.\n\nAttis, divinitÃƒÂ  Frigia. Nato da una vergine, Nana, il 25 Dicembre, crocifisso, sepolto in una tomba e dopo 3 giorni, ÃƒÂ¨ risorto.\n\nKrishna, dall'India, nato da una vergine, Devaki, con una stella dell'est che segnalava il suo arrivo, ha compiuto miracoli con i suoi discepoli, fu crocifisso e dopo la sua morte ÃƒÂ¨ risorto.\n\nDioniso della Grecia, nato da una vergine il 25 Dicembre, era un insegnante viaggiatore che compiva miracoli, come trasformare l'acqua in vino, veniva chiamato anche &quot;Re dei Re&quot;, &quot;l'Unigenito di Dio&quot;, &quot;l'Alfa e l'Omega&quot; e molti altri, e dopo la sua morte, ÃƒÂ¨ risorto.\n\nMitra, dalla Persia, nato da una vergine il 25 Dicembre, aveva 12 discepoli e compiva miracoli, e dopo la sua morte venne sepolto per 3 giorni, dopodichÃƒÂ© ÃƒÂ¨ risorto. Veniva chiamato anche &quot;la VeritÃƒÂ &quot;, &quot;la Luce&quot; e in molti altri modi.\n\nÃƒË† interessante notare che il giorno sacro del culto di Mitra era la Domenica. CiÃƒÂ² che conta ÃƒÂ¨ che ci sono dozzine di salvatori, di differenti epoche, da molte parti del mondo, che condividono queste caratteristiche generali. Resta l'interrogativo: perchÃƒÂ© queste caratteristiche? PerchÃƒÂ© la nascita da una vergine il 25 Dicembre? PerchÃƒÂ© morto per 3 giorni e poi l'inevitabile resurrezione? PerchÃƒÂ© 12 discepoli al seguito? Per scoprirlo, esaminiamo i piÃƒÂ¹ recenti Messia legati al sole.\n\nGesÃƒÂ¹ Cristo ÃƒÂ¨ nato dalla vergine Maria il 25 Dicembre a Betlemme, la sua nascita ÃƒÂ¨ stata annunciata da una stella dell'Est, che tre Re, o Magi, hanno seguito per trovare ed andare ad adorare il nuovo salvatore. Fu un insegnante adolescente all'etÃƒÂ  di 12, all'etÃƒÂ  di 30 venne battezzato da Giovanni Battista e da allora iniziÃƒÂ² il suo ministero. GesÃƒÂ¹ aveva 12 discepoli che viaggiavano con lui e compiva miracoli, come la guarigione dei malati, il camminare sulle acque, la resurrezione dei morti; era anche conosciuto come &quot;Re dei Re&quot;, il &quot;Figlio di Dio&quot;, la &quot;Luce del Mondo&quot;, &quot;l'Alfa e l'Omega&quot;, &quot;l'Agnello di Dio&quot; e molti altri. Dopo essere stato tradito dal suo discepolo Giuda, venduto per 30 denari d'argento, fu crocifisso, sepolto in una tomba e dopo tre giorni risorse ed ascese in Cielo.\n\nInnanzitutto, la sequenza della nascita ha un'origine del tutto astrologica. La stella dell'Est ÃƒÂ¨ Sirio, la stella piÃƒÂ¹ luminosa del cielo, che il 24 Dicembre si allinea con le tre stelle piÃƒÂ¹ brillanti della Cintura di Orione. Queste tre stelle luminose sono chiamate oggi come lo erano nei tempi antichi: i Tre Re. I &quot;Tre Re&quot; assieme a Sirio, la stella piÃƒÂ¹ luminosa, si allineano nella direzione in cui sorge il sole il 25 Dicembre. Ed ÃƒÂ¨ per questo che si dice che i Tre Re &quot;seguono&quot; la stella dell'est, affinchÃƒÂ© trovino l'alba: la nascita del sole.\n\nLa vergine Maria ÃƒÂ¨ la costellazione Virgo, conosciuta anche come Virgo la Vergine. Virgo in latino significa vergine. Alla costellazione Virgo ci si riferisce anche come &quot;Casa del Pane&quot; e la rappresentazione di Virgo ÃƒÂ¨ una vergine che tiene un covone di grano. Questa &quot;Casa del Pane&quot; e il simbolo del grano rappresentano i mesi di Agosto e Settembre, il tempo della mietitura. In effetti, anche Betlemme si traduce letteralmente come &quot;Casa del Pane&quot;. Betlemme ÃƒÂ¨ quindi un riferimento alla costellazione Virgo, un posto che si trova in cielo, non sulla Terra.\n\nC'ÃƒÂ¨ un altro fenomeno molto interessante che si verifica nei giorni fra il solstizio d'inverno e il 25 dicembre... Dal solstizio d'estate sino al solstizio d'inverno, i giorni diventano piÃƒÂ¹ corti e freddi. Dalla prospettiva dell'emisfero nord, il sole appare muoversi verso sud e diventare piÃƒÂ¹ piccolo e piÃƒÂ¹ debole. L'accorciarsi delle giornate e la fine dei raccolti, con l'avvicinarsi del solstizio d'inverno, simboleggiavano un processo di morte per gli antichi. Era la morte del Sole. E il 22 Dicembre, la morte del sole si realizzava completamente, in quanto il sole avendo continuato a muoversi verso Sud per 6 mesi, ha raggiunto il punto piÃƒÂ¹ basso nel cielo. La cosa curiosa che accade ÃƒÂ¨ questa: il Sole smette di muoversi verso Sud (almeno percettibilmente) per 3 giorni. Durante questa pausa di 3 giorni, il Sole rimane in prossimitÃƒÂ  della Croce del Sud: la Costellazione Crux. E dopo questo periodo, il 25 Dicembre, il Sole si muove di un grado, questa volta a Nord, facendo presagire giorni piÃƒÂ¹ lunghi, calore e primavera. E questo fu detto: il Sole ÃƒÂ¨ morto sulla croce, morÃƒÂ¬ per 3 giorni, solo per risorgere o nascere di nuovo. Questa ÃƒÂ¨ la ragione per la quale GesÃƒÂ¹ e numerose altre divinitÃƒÂ  legate al Sole, condividono queste idee di crocifissione, morte di 3 giorni e resurrezione. ÃƒË† il periodo di transizione nel quale il Sole inverte la sua direzione di nuovo verso l'emisfero nord, portando la Primavera e, quindi, la salvezza.\n\nTuttavia gli antichi non celebravano la resurrezione del Sole sino all'Equinozio di Primavera, o Pasqua. Questo perchÃƒÂ© a partire dall'equinozio di primavera, il Sole ufficialmente supera la forza maligna dell'oscuritÃƒÂ , in quanto il giorno da quel momento diventa piÃƒÂ¹ lungo della notte, e le condizioni rivitalizzanti della primavera emergono.\n\nProbabilmente, il piÃƒÂ¹ ovvio dei simbolismi astrologici riguardanti GesÃƒÂ¹ ÃƒÂ¨ quello dei 12 discepoli. Sono semplicemente le 12 costellazioni dello Zodiaco, assieme ai quali GesÃƒÂ¹, essendo il Sole, viaggia.\n\nIn effetti, il numero 12 viene ripetuto di continuo in tutta la Bibbia.\n\nRitornando alla croce dello Zodiaco, la rappresentazione della &quot;vita&quot; del Sole, non era soltanto una rappresentazione artistica o uno strumento per identificare i movimenti del sole. Era anche un simbolo spirituale pagano, che veniva sinteticamente rappresentato in questo modo. Questo non ÃƒÂ¨ un simbolo della cristianitÃƒÂ . Ma un simbolo della Croce dello Zodiaco per i Pagani. Questa ÃƒÂ¨ la ragione per cui GesÃƒÂ¹ nell'arte sacra antica, veniva sempre mostrato con la sua testa di fronte alla Croce, in quanto GesÃƒÂ¹ ÃƒÂ¨ il Sole, il &quot;Sole di Dio&quot;, la &quot;Luce del Mondo&quot;, il &quot;Salvatore Risorto&quot;, che &quot;ritornerÃƒÂ  ancora&quot;, come ritorna ogni giorno, La &quot;gloria di Dio&quot; che ci difende contro le &quot;forze dell'oscuritÃƒÂ &quot;, e lui ÃƒÂ¨ &quot;rinato ancora&quot;, come ogni giorno, e puÃƒÂ² essere visto &quot;arrivare dalle nuvole&quot;, &quot;lassÃƒÂ¹ in cielo&quot;, con la sua &quot;corona di spine&quot; o &quot;raggi solari&quot;.\n\nOra, fra le metafore astrologiche e astronomiche della Bibbia, una delle piÃƒÂ¹ importanti ha a che fare con le Ere. In tutte le scritture ci sono numerosi riferimenti alle &quot;Ere&quot;. Al fine di comprenderne la ragione, deve essere per noi familiare il fenomeno conosciuto come &quot;Precessione degli Equinozi&quot;. Gli antichi Egizi, assieme a molte culture molto prima di loro, hanno scoperto che approssimativamente ogni 2150 anni il sole sorge, nella mattina dell'equinozio di primavera, in corrispondenza di un differente segno dello Zodiaco. Questo ÃƒÂ¨ dovuto ad una lenta rotazione angolare che la Terra mantiene mentre ruota attorno al suo asse. ÃƒË† chiamata &quot;precessione&quot; in quanto le costellazioni vanno all'indietro, anzichÃƒÂ© nel normale ordine dell'anno. Il periodo di tempo necessario affinchÃƒÂ© questa precessione attraversi tutti i 12 segni ÃƒÂ¨ approssimativamente 25.765 anni. Questo ÃƒÂ¨ anche chiamato &quot;il Grande Anno&quot;, e le antiche civiltÃƒÂ  ne erano ben consapevoli. Si riferivano a ciascuno di questi periodi di 2.150 anni come ad un' &quot;Era&quot;. Dall'anno 4.300 a.C. all'anno 2.150 a.C., era l'Era di Taurus, il Toro; dal 2150 a.C. all' 1 d.C. era l'Era di Aries, l'Ariete; e dal 1 d.C. al 2150 d.C. abbiamo l'Era dei Pesci, l'Era dove ci troviamo attualmente. E all'incirca nell'anno 2150, entreremo in una nuova Era. L'Era dell'Acquario.\n\nIn generale, la Bibbia si riferisce ad un movimento simbolico entro 3 Ere, presagendone una quarta. Nel Vecchio Testamento quando MosÃƒÂ¨ scende dal Monte Sinai con i 10 Comandamenti si infuria vedendo il suo popolo che venera un vitello d'oro. Infatti, lancia le sue tavole di pietra e ordina alla sua gente di uccidersi per potersi purificare. Molti studiosi della Bibbia attribuirebbero questa furia al fatto che gli Israeliti stavano venerando un falso idolo, o qualcosa che lo rappresentava. La veritÃƒÂ  ÃƒÂ¨ che il vitello d'oro rappresenta Taurus, il Toro, mentre MosÃƒÂ¨ rappresenta la nuova Era di Aries, l'Ariete. Questa ÃƒÂ¨ la ragione per cui gli Ebrei ancora oggi, suonano il corno d'Ariete. MosÃƒÂ¨ rappresenta la nuova Era di Ariete, e con l'arrivo della nuova Era, tutti devono abbandonare quella vecchia. Anche altre divinitÃƒÂ  mettono in evidenza queste transizioni fra Ere, come Mitra, una divinitÃƒÂ  pre-Cristiana che uccide un Toro, con la stessa simbologia.\n\nGesÃƒÂ¹, quindi, ÃƒÂ¨ la figura che introduce l'era che segue quella di Aries, l'era dei Pesci, o dei &quot;Due Pesci&quot;. Il Pesce ÃƒÂ¨ un simbolismo molto comune nel Nuovo Testamento, come GesÃƒÂ¹ che sfama 5000 persone con pane e &quot;due pesci&quot;. Quando ha iniziato il suo ministero, incamminandosi per la Galilea, fece amicizia con due pescatori, che lo seguirono. E credo che tutti abbiamo visto il simbolo del pesce &quot;Jesus Lives&quot; attaccato sul retro delle auto. Pochi sanno cosa significa veramente. ÃƒË† un simbolo astrologico pagano per il Regno del Sole durante l'Era dei Pesci. Anche la presunta data di nascita di GesÃƒÂ¹ ÃƒÂ¨ essenzialmente la data di inizio di questa Era.\n\nIn Luca 22:10, quando i discepoli chiedono a GesÃƒÂ¹ dove si preparerÃƒÂ  la Pasqua dopo la sua morte, GesÃƒÂ¹ replicÃƒÂ²: &quot;Vedrete, appena entrati in cittÃƒÂ , venirvi incontro un uomo che porta una brocca d'acqua... seguitelo nella casa dove entrerÃƒÂ .&quot; Questa scrittura ÃƒÂ¨ di gran lunga uno dei piÃƒÂ¹ significativi fra tutti i riferimenti astrologici. L'uomo che versa la brocca d'acqua ÃƒÂ¨ Acquario, l'uomo che porta l'acqua, che ÃƒÂ¨ sempre rappresentato come un uomo che versa acqua da una brocca. Egli rappresenta l'era dopo i Pesci, e quando il Sole (il Dio Sole) lascerÃƒÂ  l'era dei Pesci (GesÃƒÂ¹), entrerÃƒÂ  nella Casa di Acquario, dato che Acquario segue i Pesci nella Precessione degli Equinozi. GesÃƒÂ¹ sta solo dicendo che dopo l'Era dei Pesci, arriverÃƒÂ  l'Era di Acquario.\n\nOra, abbiamo tutti sentito parlare della fine dei tempi e della fine del mondo. A parte le rappresentazioni fumettistiche del Libro delle Rilevazioni, questa idea proviene principalmente da Matteo 28:20, dove GesÃƒÂ¹ dice: &quot;Io sarÃƒÂ² con voi, fino alla fine del mondo.&quot; Tuttavia, nella versione della Bibbia di Re Giacomo, la traduzione &quot;mondo&quot; ÃƒÂ¨ errata, assieme a molti altri errori di traduzione. La parola utilizzata veramente ÃƒÂ¨ &quot;aeon&quot;, che significa &quot;era&quot;. &quot;Io sarÃƒÂ² con voi, anche alla fine dell'era.&quot; E questo ÃƒÂ¨ vero, in quanto la personificazione dell'Era dei Pesci in GesÃƒÂ¹-Sole terminerÃƒÂ  quando il Sole entrerÃƒÂ  nell'Era dell'Acquario. L'intero concetto di fine dei tempi e di fine del mondo ÃƒÂ¨ un errore di interpretazione di un'allegoria astrologica. Diciamolo a quei circa 100 milioni di Americani che credono che la fine del mondo sia vicina.\n\nInoltre, il personaggio di GesÃƒÂ¹, essendo un ibrido letterario ed astrologico, ÃƒÂ¨ piÃƒÂ¹ esplicitamente un plagio della figura del Dio sole egiziano Horus. Per esempio, graffiti di oltre 3500 anni fa delle mura del Tempio di Luxor in Egitto riportano immagini dell'Annunciazione, dell'immacolata concezione, della nascita e dell'adorazione di Horus. Le immagini iniziano con Thaw che annuncia alla vergine Isis il concepimento di Horus, dopodichÃƒÂ© il fantasma sacro Nef ingravida la vergine, e abbiamo, quindi, il parto della vergine e l'adorazione. Questa ÃƒÂ¨ esattamente la storia del miracolo del concepimento di GesÃƒÂ¹. In effetti, le similitudini letterarie tra la religione egiziana e cristiana sono sbalorditive.\n\nE il plagio ÃƒÂ¨ continuo. La storia di NoÃƒÂ© e della sua arca ÃƒÂ¨ presa direttamente dalla tradizione. Il concetto di Grande Alluvione ÃƒÂ¨ onnipresente nel mondo antico, con oltre 200 differenti citazioni in differenti periodi ed epoche. Tuttavia, basta guardare non molto indietro ad una fonte precristiana, la Leggenda di Gilgamesh. Scritta nel 2600 a.C. Questa storia parla di un Grande Alluvione ordinato da Dio, di un'arca con sopra animali portati in salvo e persino la liberazione e il ritorno di una colomba, che corrispondono del tutto alla storia biblica, assieme a molte altre similitudini.\n\nE poi c'ÃƒÂ¨ il plagio della storia di MosÃƒÂ¨. Della nascita di MosÃƒÂ¨, ÃƒÂ¨ stato detto che venne messo in una cesta di giunchi e abbandonato alla corrente del fiume, in modo da evitare l'infanticidio. Venne poi salvato da una figlia di reali e da lei cresciuto come un Principe. Questa storia del bimbo nella cesta ÃƒÂ¨ stata rubata direttamente dal mito di Sargon di Akkad del 2250 a.C. circa. Sargon una volta nato, fu messo in una cesta di giunchi in modo da evitare l'infanticidio e abbandonato lungo un fiume. Venne, a sua volta, salvato e cresciuto da Akki, una levatrice di una famiglia reale.\n\nInoltre, MosÃƒÂ¨ era conosciuto come il portatore delle leggi, colui che ha portato i dieci comandamenti, le Leggi di MosÃƒÂ¨. Tuttavia, l'idea di una Legge inviata da un Dio ad un profeta su una montagna ÃƒÂ¨ anch'esso un tema ricorrente molto antico. MosÃƒÂ¨ ÃƒÂ¨ solo un altro portatore delle leggi divine, assieme ad una lunga schiera di analoghe figure nella storia mitologica. In India, Manu fu il grande portatore di leggi. A Creta, Minos ascese il Monte Dicta, dove Zeus gli diede le sacre leggi. Mentre in Egitto c'era Mises, che portÃƒÂ² le tavole di pietra sopra le quali c'erano le leggi scritte da Dio. Manu, Minos, Mises, MosÃƒÂ¨.\n\nE per quel che riguarda i 10 Comandamenti, essi sono ripresi integralmente dalla formula magica n. 125 del Libro Egizio dei Morti. Quello che nel Libro dei Morti era &quot;Io non ho rubato&quot; divenne &quot;Non rubare&quot;, &quot;Io non ho ucciso&quot; divenne &quot;Non uccidere&quot;, &quot;Io non ho detto bugie&quot; divenne &quot;Non dire falsa testimonianza&quot; e cosÃƒÂ¬ via. In effetti, la religione Egiziana sembra costituire le basi fondamentali principali della teologia Giudaico-Cristiana. Battesimo, vita dopo la morte, giudizio finale, parto della vergine, morte e resurrezione, crocifissione, l'arca dell'alleanza, circoncisione, salvatori, la santa comunione, il grande alluvione, Pasqua, Natale, l'Ascesa al cielo, e molti molti altri, sono tutti concetti ascrivibili a credenze egizie, che risalgono a prima delle origini della CristianitÃƒÂ  e del Giudaismo.\n\nGiustino il Martire, uno dei primi difensori e storici cristiani, scrisse: &quot;Quando noi affermiamo che Lui, GesÃƒÂ¹ Cristo, nostro Maestro, fu generato senza unione sessuale, fu crocifisso, morÃƒÂ¬, e poi risorse e ascese in Cielo, non proponiamo niente di differente da ciÃƒÂ² che voi considerate appartenga a quelli che chiamate Figli di Giove.&quot; In un altro testo, Giustino il Martire affermava: &quot;Egli era nato da una vergine, accettate questa come una caratteristica comune alle vostre credenze su Perseo&quot;. ÃƒË† ovvio come Giustino e altri Paleocristiani sapessero quanto simili fossero la CristianitÃƒÂ  e le religioni Pagane. Tuttavia, Giustino aveva una soluzione. Secondo lui, era stato il Diavolo. Il Diavolo fu cosÃƒÂ¬ lungimirante da arrivare prima di Cristo, e creare queste caratteristiche nel mondo pagano.\nVoce: Bill Hicks\n\nCristianesimo fondamentalista, affascinante. Questa gente crede davvero che il mondo abbia 12.000 anni. Allora ho chiesto a uno di questi: &quot;Ok, e i fossili di dinosauro?&quot; E lui mi ha detto: &quot;I fossili di dinosauro? Dio li ha messi lÃƒÂ¬ per testare la nostra fede!&quot; &quot;....io credo che Dio ti abbia messo qui per testare la mia fede!&quot;\nParte 1 (cont.)\n\nLa Bibbia non ÃƒÂ¨ nient'altro che un'opera letteraria ibrida astro-teologica, come pressochÃƒÂ© tutte le precedenti mitologie religiose. In effetti, questa abitudine di trasferire le caratteristiche di un personaggio ad un nuovo personaggio, ÃƒÂ¨ presente anche all'interno della stessa Bibbia Nel Vecchio Testamento, c'ÃƒÂ¨ la storia di Giuseppe. Giuseppe era un prototipo di GesÃƒÂ¹. Giuseppe era stato generato con una nascita miracolosa, GesÃƒÂ¹ era stato generato con una nascita miracolosa. Giuseppe aveva 12 fratelli, GesÃƒÂ¹ aveva 12 discepoli. Giuseppe fu venduto per 20 monete d'argento, GesÃƒÂ¹ fu venduto per 30 monete d'argento. Il fratello Giuda propone di vendere Giuseppe, il discepolo Giuda propone di vendere GesÃƒÂ¹. Giuseppe inizia la sua opera all'etÃƒÂ  di 30 anni, GesÃƒÂ¹ inizia la sua opera all'etÃƒÂ  di 30 anni. Il parallelo puÃƒÂ² continuare all'infinito.\n\nPer di piÃƒÂ¹, esiste una qualsiasi prova storica non Biblica dell'esistenza di una persona vivente di nome GesÃƒÂ¹ il Figlio di Maria, che ha viaggiato con 12 discepoli, che ha guarito persone e cose di questo tipo? Ci sono numerosi storici che hanno vissuto nell'area del Mediterraneo, sia durante che subito dopo la presunta vita di GesÃƒÂ¹. Quanti di questi storici hanno documentato questa figura? Nessuno. In effetti, questo non significa che i difensori del personaggio storico GesÃƒÂ¹ non abbiano sostenuto il contrario. Si fa riferimento tipicamente a quattro storici per sostenere l'esistenza di GesÃƒÂ¹. Plinio il Giovane, Svetonio, Tacito sono i primi tre. Ciascuna delle loro iscrizioni consiste in solo alcune frasi dove al massimo si fa riferimento a Christus o a Cristo, che di fatto non ÃƒÂ¨ un nome, ma un appellativo. Significa &quot;Unto del Signore&quot;. La quarta fonte ÃƒÂ¨ Giuseppe Flavio ed ÃƒÂ¨ stato provato per secoli che questa fonte era un falsa. Tristemente, ÃƒÂ¨ ancora collocata fra le veritÃƒÂ .\n\nVoi credete che un uomo che ÃƒÂ¨ risorto dopo la morte e asceso in Cielo e davanti agli occhi di tutti ha compiuto numerosi miracoli, a lui attribuiti, non sarebbe apparso nei documenti storici? Non ÃƒÂ¨ apparso, perchÃƒÂ© una volta soppesate le prove, ci sono probabilitÃƒÂ  molto elevate che la figura conosciuta come GesÃƒÂ¹ non sia nemmeno esistita.\n\n    La religione Cristiana ÃƒÂ¨ una parodia del culto del sole,\n    hanno messo un uomo chiamato Cristo al posto del sole, e\n    adorano quella figura come originariamente si adorava il sole\n\n    Thomas Paine, 1737-1809 \n\nVoce: Jordan Maxwell\n\nNon vogliamo essere ostili, ma vogliamo basarci sui fatti. Non vogliamo ferire sentimenti, ma vogliamo essere accademicamente corretti, rispetto a ciÃƒÂ² che comprendiamo e sappiamo essere vero. La CristianitÃƒÂ , appunto, non si basa sulla veritÃƒÂ . Abbiamo scoperto, infatti, che la CristianitÃƒÂ  non era niente piÃƒÂ¹ che una storia Romana, sviluppata in modo politico. La realtÃƒÂ  ÃƒÂ¨ che GesÃƒÂ¹ era la divinitÃƒÂ  Sole della setta gnostica Cristiana e come tutti gli altri Dei Pagani, era una figura mitologica. ÃƒË† stato l'establishment politico che ha cercato di storicizzare la figura di GesÃƒÂ¹ per funzioni di controllo sociale. Nel 325 d.C. a Roma, l'imperatore Costantino riunÃƒÂ¬ il Concilio di Nicea. ÃƒË† stato durante queste riunioni che le dottrine cristiane, motivate politicamente, vennero formalmente definite, e da allora ebbe inizio una lunga storia di frodi spirituali e spargimenti di sangue in nome della religione Cristiana. E per i 1600 anni successivi, il Vaticano ha mantenuto la sua forza opprimente su tutta l'Europa, portando periodi &quot;gioiosi&quot; come l'Alto Medioevo, assieme ad eventi &quot;gloriosi&quot; come le Crociate e l'Inquisizione.\n\nLa cristianitÃƒÂ , assieme agli altri sistemi religiosi teistici, sono la frode di questa Era. ÃƒË† servita per separare popolazioni dal loro habitat naturale, e allo stesso modo, per separare i popoli fra loro. Sostiene una cieca sottomissione all'autoritÃƒÂ . Riduce le responsabilitÃƒÂ  dell'uomo, considerato che ÃƒÂ¨ &quot;Dio&quot; che controlla tutto, e oltretutto terribili crimini possono essere giustificati nel nome di uno Scopo Divino. E piÃƒÂ¹ importante di tutto, rende piÃƒÂ¹ potenti coloro che sanno la veritÃƒÂ , ma usano il mito per manipolare e controllare le societÃƒÂ . Il Mito Religioso ÃƒÂ¨ l'arma piÃƒÂ¹ potente che sia mai stata creata, e serve come terreno psicologico sopra il quale altri miti possono sorgere.\nVoce: David Ray Griffin\n\nUn Mito ÃƒÂ¨ un'idea che, sebbene sia ritenuta vera da molte persone, ÃƒÂ¨ falsa. In un senso piÃƒÂ¹ profondo, in senso religioso, un mito serve come storia in grado di orientare e mobilitare la gente. Non si mette al centro la fedeltÃƒÂ  di una storia alla realtÃƒÂ , ma la sua funzione. Una storia non puÃƒÂ² funzionare se non viene considerata come vera all'interno di una comunitÃƒÂ  o di una nazione. Non si discute nemmeno con quelle persone che hanno il cattivo gusto di porgere domande circa la veritÃƒÂ  della storia sacra. I tutori della fede non entrano in dibattito con loro. Li ignorano o li condannano pubblicamente come blasfemi.\nTV\n\nÃƒË† sbagliato, blasfemo ed immorale che lei voglia suggerire, insinuare o aiutare altre persone a giungere alla conclusione che il Governo Americano avrebbe ucciso 3000 dei suoi stessi cittadini.\n\n               Fonte [http://www.zeitgeistitalia.org/node/59]\n\n                               Buona Visione","torrent":{"xt":"urn:btih:29150c400823dc612a21bcad3de58256644adec8","amp;dn":"ZEITGEIST-+Il+Film+-Versione+italiana+-+www.zeitgeistitalia.org","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29150c400823dc612a21bcad3de58256644adec8","infoHashBuffer":{"type":"Buffer","data":[41,21,12,64,8,35,220,97,42,33,188,173,61,229,130,86,100,74,222,200]},"announce":[],"urlList":[]}}