{"title":"ConvertXtoDVD 4.1.19.365 Full [djjlicious]","uid":6400822,"size":19789418,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:29938017d0c5767338167bc4bc75eb97591f53fe&amp;dn=ConvertXtoDVD+4.1.19.365+Full+%5Bdjjlicious%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"djjlicious","files":-1,"time":1305657521,"description":"A professional program to help you to create your own DVD.\n\nVSO ConvertXtoDVD is a combo of DVD Movie Converter and DVD Movie Burner which can convert almost all video formats to DVD formats with high speed and perfect quality. Click the &quot;Convert&quot; button, the program automatically burn DVD data to DVD Disc after converting.\nConvertXtoDVD \t\nConvertXtoDVD supports converting almost all video formats to DVD.\nVideo formats supported: AVI, DivX, XviD, MOV, MKV, FLV, MPEG-1, MPEG-2, MPEG-4, NSV, DVR-MS, TS, IFO, VOB, ASF, WMV, RealMedia, RM, RMVB, OGM, existing files from digital camcorders, TV/Sat, capture cards, etc. No external codecs needed like avi codec download.\n\nCreate DVD menus with different templates.\nYou can create DVD menus with different templates available, possibility to add background video, image or audio, have chapter and audio/subtitle menus.\n\nConvertXtoDVD converts video with high speed.\nFast and quality encoder, typically less than 1 hour for converting 1 movie, and supports Multi-Core processors!\n\nExtensive burning range.\nIncluded burning engine with burn speed control choice of SAO or packet writing methods, supports all DVD formats.\n\nUniversal video output formats make sure playing DVD in any home Player.\nVideo output for video standard (NTSC, PAL), TV Screen (Widescreen 16:9, Fullscreen 4:3) and DVD Resolution (Full D1, Broadcast D1, Half D1, SIF), or choose automatic for all choices listed above. Also convert video from NTSC to PAL or PAL to NTSC.\n\nSupport Audio formats.\nsupported internal and external: AC3, DTS, PCM, OGG, MP3, WMA and more... Select audio output format.\n\nSubtitles files supported internal and external:\nSRT, .SUB/IDX, .SSA, opensubtitles, dvbsub with color and font selection, and supports tags like italic, bold, turn on/off with DVD player remote control\n\nSupport Multilingual and Windows Vista.\n\nRead the ReadMe file and enjoy!!","torrent":{"xt":"urn:btih:29938017d0c5767338167bc4bc75eb97591f53fe","amp;dn":"ConvertXtoDVD+4.1.19.365+Full+%5Bdjjlicious%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29938017d0c5767338167bc4bc75eb97591f53fe","infoHashBuffer":{"type":"Buffer","data":[41,147,128,23,208,197,118,115,56,22,123,196,188,117,235,151,89,31,83,254]},"announce":[],"urlList":[]}}