{"title":"yumurta.2008.dvdrip.avi","uid":5016936,"size":628332972,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:29a1e2e81e01504b952b72a5d2edfb41ec49571a&amp;dn=yumurta.2008.dvdrip.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sourberry","files":1,"time":1248268756,"description":"Poet Yusuf (35-38) returns to his childhood hometown, which he hadn't visited for years, upon his mother's death. He is faced with a neglected, crumbling house. Ayla, a young girl (17-19) awaits him there. Yusuf has been unaware of the existence of this distant relation who had been living with his mother for five years; He stays by his dead mother's bedside for a while on the morning of his return. Ayla's presence alleviates the emotions evoked by death to an extent. But how will Yusuf cope with the guilt that embraces him after the funeral? Will he manage to overcome it? The maternal household's chattels, and everyday habits, the staid rhythm of the provinces and the spaces filled with ghosts&amp;; The town he once had left to escape all this, re-enchants Yusuf. Yusuf finds out on the day he's due to return to Istanbul that he is obliged to perform the sacrifice his mother had been prevented by death from fulfilling. Ayla pressures him. Yusuf and Ayla set off for the saint's tomb, some three or four hours away, for the traditional sacrifice ceremony that his mother Zehra had pledged. Ayla is very excited about this, her first trip out of the small town. An accident is to force Yusuf to confront all that he had been trying to evade. Unable to locate the herd amongst which the sacrificial animal was to be selected, they have to spend the night in a hotel by the crater lake. While the falling snow blankets guilt, they are no longer heading back to that old town.","torrent":{"xt":"urn:btih:29a1e2e81e01504b952b72a5d2edfb41ec49571a","amp;dn":"yumurta.2008.dvdrip.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29a1e2e81e01504b952b72a5d2edfb41ec49571a","infoHashBuffer":{"type":"Buffer","data":[41,161,226,232,30,1,80,75,149,43,114,165,210,237,251,65,236,73,87,26]},"announce":[],"urlList":[]}}