{"title":"Battle.In.Seattle.2007.iTAL.LiMITED.DVDRip.XviD-Rebels[volpebian","uid":5018732,"size":732809216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2bf29c08ea0cda61beefdabcc90f0d15562410cd&amp;dn=Battle.In.Seattle.2007.iTAL.LiMITED.DVDRip.XviD-Rebels%5Bvolpebian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Volpebianca","files":1,"time":1248355660,"description":"::: Info :::\nTitolo: Battle In Seattle - Nessuno Li PuÃƒÂ² Fermare\nTitolo originale: Battle In Seattle\nAnno: 2007\nGenere: Azione, Drammatico\nDurata: 99\nData Di Uscita:\nRegia: Stuart Townsend\nCast: Martin Henderson (Jay), Michelle Rodriguez (Lou), Woody Harrelson (Dale), Charlize Theron (Ella), Jennifer Carpenter (Sam), Andre 3000 (Django), Ray Liotta (Mayor Jim Tobin), Connie Nielsen (Jean), Channing Tatum (Johnson), Isaach De BankolÃƒÂ© (Abasi), Rade Serbedzija (Dr. Maric), Ivana Milicevic (Carla), Tzi Ma (Governatore), Joshua Jackson (Randall), Christopher Jacot (Michael), Gary Chalk (Chief Faherty), Gary Hudson (Tenente), Barbara Tyson (Anna), Alistair Abell (Eric), Tyler Hazelwood (Anarchist), Tobias Mehler (Jonathan), Max Teichan (Man / Father), Richard Ian Cox (Mayor's Assistant), Arminder Randhawa (Mayor's Assistant #2), Richard Hendery (Santa), Ryan McDonald (Passer-by), Louis Chirillo (Individual), Deborah Demille (Dottore), Lindsay Bourne (Hanson), Mark Gibbon (Squad Leader), Tony Alcantar (Mark Harrington), Mark Brandon (Anchorman Delle News), Rex Davison (Security Staff), Glenn Ennis (Officer #1), Ken Kirzinger (Funzionario #2), Dean Moen (Officer Jeremy), Matthew MacCaul), Debra Donohue (Shopper), Douglas Arthurs (Smith), Kelly-Ruth Mercier (Donna Di Guardia), Daniel Bacon (Civilian), Marsha Regis (Protester #1), Brett Dier (Protester #2), Alberta Mayne (Protestor #3), Gina Holden (Protester #4), Paul Anthony (Protester #5), Adrian Hough (Durell), Brad Loree (Piedipiatti #1), Alex Terzieff (Piedipiatti #2), Michael Agostini (Labor Marshall), Chris Robson (Staff Member), Linda Muir (Topless Woman), Adrian Holmes (Giornalista), Yaroslav Poverlo (Lovitz), Dee Jay Jackson (Autista Dell'Autobus), Haskell Wexler (Wexler, Haskell), George Gordon (Anchorman #2), Nels Lennarson (Wto Delegate), Barry Nerling (Nd Cop), Nick Boganwright (Paramedico), Bill Clinton (Se Stesso), Rik Deskin (Delegate), Michael Taylor Donovan (Union Marshall), Austin Farwell (Officer D. Andrew), Kelly King (Protester), Joel Ross (Anarchist #1), Peter Shinkoda (Protester), Kyle J.M. Thompson (Turtle Group Protester), Alberto Valenzuela (Protester)\n\n::: Trama :::\nMentre sta per avere inizio la terza conferenza dell'Organizzazione Mondiale del Commercio (WTO), per le strade di Seattle alcuni uomini si muovono nell'ombra. Bloccare il congresso ÃƒÂ¨ il loro obiettivo e sono disposti a tutto pur di raggiungerlo, anche se la scelta che hanno fatto cambierÃƒÂ  per sempre la vita di ciascuno di loro.\n\nQualitÃƒÂ  audio e video Ottima da DVD","torrent":{"xt":"urn:btih:2bf29c08ea0cda61beefdabcc90f0d15562410cd","amp;dn":"Battle.In.Seattle.2007.iTAL.LiMITED.DVDRip.XviD-Rebels%5Bvolpebian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bf29c08ea0cda61beefdabcc90f0d15562410cd","infoHashBuffer":{"type":"Buffer","data":[43,242,156,8,234,12,218,97,190,239,218,188,201,15,13,21,86,36,16,205]},"announce":[],"urlList":[]}}