{"title":"PANDORUM.2009.DVDrip[vice]","uid":5175455,"size":525929993,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2d883b1afb648cc29759d4ba9650cd7e73ea0a62&amp;dn=PANDORUM.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vicerock","files":-1,"time":1258941920,"description":"PANDORUM DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 01:48:06\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCast\n\n* Dennis Quaid as Lt. Payton\n* Ben Foster as Corporal Bower\n* Cam Gigandet as Gallo\n* Antje Traue as Nadia\n* Cung Le as Manh\n* AndrÃƒÂ© Hennicke as Hunter Leader\n* Norman Reedus as Shepard\n* Wotan Wilke MÃƒÂ¶hring as Young Bower's Father\nPlot\n\nTwo astronauts, Bower (Foster) and Payton (Quaid), wake up from suspended animation to find themselves alone, with no memory of who they are, what they are doing, or what has happened to the crew of their 60,000 passenger sleeper ship the Elysium. They are unable to access the ship's bridge, and cannot communicate with any other members of the crew, including the flight team they are to relieve.[5] While exploring the spacecraft under Payton's radio guidance, Bower talks with Payton about Pandorum, a psychological condition brought on by extended periods of hyper-sleep (suspended animation) and its symptoms and effects, including severe paranoia, vivid hallucinations, and homicidal tendencies.\n\nAs Bower explores on, he encounters dead bodies, and fast moving humanoid creatures. Escaping from one of them, he then encounters other human survivors, and they work together to reach the ship's nuclear reactor. The reactor will fail permanently if Bower does not reset it soon. Moving on, the group encounters another survivor, who tells them the story of what had happened before they awakened. Their mission is revealed to be one of desperation. Earth, suffering from massive overpopulation, dispatched the sleeper ship and its crew on a 123-year voyage to a new, Earth-like planet to create a settlement. When the ship receives one last message from Earth, informing them that Earth was no more and that they were the last survivors, one of the three crew members awoke (as there are usually three flight crew active at any one shift) turned insane, killed his other two crew mates, then played God by awakening most of the crew and locking them away. When he grew bored of it, he went back into suspended animation and left the crew locked away. Genetic augments that every crew member had received prior to the mission (for quick adaptation to the new planet) had instead adapted them to the ship, turning them into the cannibalistic monsters that Bower and the other survivors have been encountering. This survivor then knocks them out with gas. Upon awakening, they find themselves chained up, with the survivor about to kill them for food.\n\nMeanwhile, Payton discovers another crew member, Gallo, who reveals to him that he was part of the flight crew that received the message from Earth. After receiving the Earth's last message, Gallo gives a different account from what Bower has heard, that the other two crew mates with Gallo had an onset of Pandorum and, eventually, Gallo was forced to kill them in order to survive. By now, most of the ship's population is either dead or mutated.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1188729/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1188729/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS ","torrent":{"xt":"urn:btih:2d883b1afb648cc29759d4ba9650cd7e73ea0a62","amp;dn":"PANDORUM.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d883b1afb648cc29759d4ba9650cd7e73ea0a62","infoHashBuffer":{"type":"Buffer","data":[45,136,59,26,251,100,140,194,151,89,212,186,150,80,205,126,115,234,10,98]},"announce":[],"urlList":[]}}