{"title":"(PSX-PSP) Fighting Force 1 &amp; 2 converted properly [ResourceRG Ga","uid":4996198,"size":664947636,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:3037e1f0f1bad3f2731a0a609d761cec85e3b7ec&amp;dn=%28PSX-PSP%29+Fighting+Force+1+%26+2+converted+properly+%5BResourceRG+Ga&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"toxicjuggalo","files":3,"time":1247299444,"description":"You MUST use 3.40 pops for these games to run properly......KloWn\n\nFIGHTING FORCE:\n\nAfter his predictions of the world's demise fall flat, Dr. Dex Zeng tries to destroy the world himself. Fortunately, the FIGHTING FORCE is here to save the day. You take of the role of Hawk Manson, Ben &quot;Smasher&quot; Jackson, Mace Daniels, or Alana McKendrick, and battle through seven expansive levels (some with branching paths) with each character's unique moves and combinations. You will need every move too, since up to five enemies may attack at once. To keep the destruction moving at a furious pace, pick up pipes, guns, knives, soda machines, and anything else that might be lying around and get creative. For maximum carnage, tell a friend to use the other controller and double-team Zeng's minions. Can the FIGHTING FORCE stop Zeng's evil plot in time?\n\nFIGHTING FORCE 2:\n\nThe Nakamichi Corporation has been trading in illegal biotechnology and is the site of a cloning facility. SICOP, an elite police force whose goal is to stop corporate crime, sends their best man Hawk Manson to be judge, jury, and executioner. You take control of Hawk as he explores futuristic factories and research centers. Use over 20 different weapons including sledgehammers, shotguns, pistols, nightsticks, and knives to take out the enemy. However, finding these weapons requires the destruction of the interactive 3D environments. While destruction and carnage are one approach to the game, those who want peaceful conflict resolution can use stealth to avoid some of the gunplay. Only you can get Hawk through Nakamichi Corporation in FIGHTING FORCE 2.","torrent":{"xt":"urn:btih:3037e1f0f1bad3f2731a0a609d761cec85e3b7ec","amp;dn":"%28PSX-PSP%29+Fighting+Force+1+%26+2+converted+properly+%5BResourceRG+Ga","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3037e1f0f1bad3f2731a0a609d761cec85e3b7ec","infoHashBuffer":{"type":"Buffer","data":[48,55,225,240,241,186,211,242,115,26,10,96,157,118,28,236,133,227,183,236]},"announce":[],"urlList":[]}}