{"title":"Best of 2001 Vol 1 Promo Only (Vob files) [Video Album]","uid":5159283,"size":7533074034,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:306c5801ff0553c3caaf72d27f6c2a1d13b83690&amp;dn=Best+of+2001+Vol+1+Promo+Only+%28Vob+files%29+%5BVideo+Album%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"towerelect","files":40,"time":1258047915,"description":"RE SEED to remove the now sadly defunct Demonoid tracker and add new public ones.  I don't know about anyone else but I have been having difficulty connecting to the Pirate Bay and EzyTV trackers lately so I have not included them either.\n\nI have less than 13 days internet access left and will be offline until March 2010 so doubt I will finish uploading the whole of this decade, but I will continue then once my new home and country have given me the net again.  Please try keep all my music video torrents alive until then.  Thanks.\n\nSource Promo Only DVD9 ripped into tracks and then re named using industry standard conventions with DVD Decrypter in split by cell ID file mode.  One day us VJ's will get all music video's sent to us in this PC friendly format as no one plays physical media on a DVD or Karaoke Player any more.  Hello music industry, wake up time.  While I have your ear music industry, drop support for obsolete 4:3 screen ratio at the same time.  Let them go letter box not us state of the art wide screen 16:9 Hi Def types.   Thank you.\n\nSee torrent files for track listings.\n\nVOB (mpeg2) files\n320kps Stereo Audio\nMixed (sigh) screen ratio's to support obsolete CRT TV's.\n\nEnjoy and please read the enclosed guide to good torrents.\n\nEnjoy.  Rigmar Radio\n\nPS A large US based film studio is employing hackers to disrupt all bit torrent trafic by Denial of Service blocking the common trackers we all use and enjoy.   If you know what DHT is then USE IT, be your own tracker then they have no way of shutting down the file share network.   Keyword 'Distributed Hash Tracking' or DHT for short.  Read up on it, switch it on in your bit torrent client and lets keep ahead of Hollywood once again.","torrent":{"xt":"urn:btih:306c5801ff0553c3caaf72d27f6c2a1d13b83690","amp;dn":"Best+of+2001+Vol+1+Promo+Only+%28Vob+files%29+%5BVideo+Album%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"306c5801ff0553c3caaf72d27f6c2a1d13b83690","infoHashBuffer":{"type":"Buffer","data":[48,108,88,1,255,5,83,195,202,175,114,210,127,108,42,29,19,184,54,144]},"announce":[],"urlList":[]}}