{"title":"Skilf - Alter Egos [urban-grime-rap]","uid":6359408,"size":156534142,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:310acca5af3d34c2b91b94e7ba8fce608a05c3c6&amp;dn=Skilf+-+Alter+Egos+%5Burban-grime-rap%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ManchesterSound","files":21,"time":1304275898,"description":"Skilf is a Brighton based Urban artist with a unique and distinctive sound. For the past two years he has been bubbling under the surface and turning many a head with his heartfelt lyrics and determination to be heard by all. He started rapping at the tender age of 16, taking direct influence from MC's of the UK Garage era. Through time his style changed dramatically. The inspiration from artists such as Bob Dylan, Sage Francis, Nas, Eminem, Common, Wu Tang Clan, The Streets and Akala had a big impact on Skilf's approach to writing, and as a result his lyrics became a lot more conceptual and thought provoking.\n\nUnfazed by the restrictions of 'genre' over the years he has tussled with everything from hip hop to drum 'n' bass, to grime, dub step, garage, trip hop and electro proving himself as an extremely versatile artist who isn't afraid of stepping out of his the comfort zone to try new things. Skilf has performed at a number of events supporting and appearing on the same line ups as Ghostface Killah (of Wu Tang Clan), Tim Westwood, Kidz In The Hall, Sway, Chipmunk, Taio Cruz, The Futureheads, Task Force, Pendulum, Grooverider, Andy C, MC Dynamite, Skream and Benga to name a few.\n\n&quot;Skilf stands out from the crowd with well crafted beats and strong wordplay&quot;\nRWD Mag\n\n&quot;An exciting talent breaking barriers with his own agenda&quot;\nClash Magazine\n\n&quot;If I had to tip one act for the top it would be Skilf&quot;\nHip Hop Connection\n\nWebsite: www.skilf.co.uk\nMySpace:\nTwitter:\nFacebook:\n\n** uploaded my www.manchestersound.org - download, listen, enjoy, share **","torrent":{"xt":"urn:btih:310acca5af3d34c2b91b94e7ba8fce608a05c3c6","amp;dn":"Skilf+-+Alter+Egos+%5Burban-grime-rap%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"310acca5af3d34c2b91b94e7ba8fce608a05c3c6","infoHashBuffer":{"type":"Buffer","data":[49,10,204,165,175,61,52,194,185,27,148,231,186,143,206,96,138,5,195,198]},"announce":[],"urlList":[]}}