{"title":"Coast.to.Coast.AM.July.07.2009-komie","uid":4991687,"size":55917135,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:313148c6e515c0f16746060b7dc5013b3f3cea5a&amp;dn=Coast.to.Coast.AM.July.07.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":5,"time":1247079695,"description":"Lunar &amp; NASA Secrets\n\n\n\nDate:\n07-07-09\n\nHost:\nGeorge Noory\n\nGuests:\nRichard C. Hoagland, Andrew Gause\n\n\nC2C science advisor, Richard C. Hoagland discussed how a current NASA return to the Moon has already led to a major new confirmation of the &quot;lunar dome model,&quot; and shared evidence for the existence of a &quot;secret space program.&quot; As explored in his book Dark Mission, he contended that NASA is actually the originator of Apollo Moon landing hoax theories. They co-opted a fake conspiracy to supplant the real conspiracy-- that there are ancient artifacts on the moon, and that humans are the 'ETs' who have traveled to other planets in the past, he detailed.\n\nA clandestine group has secret technology such as antigravity and free energy, which has enabled setting up bases on the Moon, Hoagland continued. A recent infrared/thermal photograph of the Moon's south pole taken by NASA's LCROSS spacecraft was leaked, and he suggested that yellow perimeter lines in the image are evidence for huge domes on the lunar surface.\n\nNow that a number of nations are sending craft to the Moon, an upcoming crater impact mission being staged by NASA in October could be an attempt to vaporize artificial domes to cover-up evidence of secret space missions over the last 40 years, Hoagland hypothesized. For more, see Part I of Richard's report, The Smoking Gun?\n\nEconomic Analysis\n\nFirst hour guest, financial expert Andy Gause offered commentary on the current economic landscape. We're heading into an inflationary period reminiscent of 1977-'80, and now is a good time to buy tangible assets like property, he said.\nWebsite(s):\n# enterprisemission.com\n# darkmission.net\n# andygause.com\nBook(s):\n# The Monuments of Mars: A City on the Edge of Forever\n# Dark Mission\n# Secret World of Money\n# Uncle Sam Cooks the Books","torrent":{"xt":"urn:btih:313148c6e515c0f16746060b7dc5013b3f3cea5a","amp;dn":"Coast.to.Coast.AM.July.07.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"313148c6e515c0f16746060b7dc5013b3f3cea5a","infoHashBuffer":{"type":"Buffer","data":[49,49,72,198,229,21,192,241,103,70,6,11,125,197,1,59,63,60,234,90]},"announce":[],"urlList":[]}}