{"title":"The Texas Chainsaw Massacre - The Thomas Hewitt File [fanedit.or","uid":5184979,"size":4618308134,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:31abad5ff0b0db0b28b06503102798fa6671ba37&amp;dn=The+Texas+Chainsaw+Massacre+-+The+Thomas+Hewitt+File+%5Bfanedit.or&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Samppa2","files":26,"time":1259425446,"description":"Info copied from  &lt;a href=&quot;\nhttp://fanedit.org/383/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://fanedit.org/383/&lt;/a&gt;\n\nThis is the story of Thomas Hewitt. The drastically cut combination of TCM - THE BEGINNING and TCM - REMAKE turns the very mediocre originals to one complete gruesome story about one of the most frightening serial killers ever in movie history.\n\n\noriginal film names: The Texas Chainsaw Massacre - The Beginning\nThe Texas Chainsaw Massacre - Remake\nfilm studio name: New Line Cinema\nDate Original Film Was Released: 2003 / 2006 3\nDate Edit Was Released: JAN 24 2007\nOriginal Runtime: 91 min &amp; 98 min\nNew Runtime: 98 min\nAmount of time Cut/Added: 91 minutes cut\nCuts removed/added/extended:\n\n   1. -removed the beginning narration from 2003\n   2. -removed all teenagers and bikers from THE BEGINNING\n   3. -removed Uncle Monty losing his legs, in fact we removed any reference to him ever having legs.\n   4. -removed all of Jedidiah (the kid), except where he tells them where to find the Sheriff\n   5. - shortened Erin's scene in  the living room of the Hewitts'\n   6. - removed Erin stabbing Andy (friends don't do that, especially not girls and especially not with a knife)\n   7. - removed all the animals from the meat factory (factory was closed for good before)\n   8. - removed the ending narration from THE BEGINNING and 2003\n\nall in all we made more than 50 cuts\n\n\nDVD - Features:\n\n   1. 98 minutes NTSC 1.85:1 anamorphic widescreen with AC3-5.1 audio and a vbr of 4.500KB/s using a 3 pass encoding with CCE.\n   2. Languages : ENGLISH\n   3. Subtitles : ENGLISH\n   4. MENUS : still\n   5. SCENE SELECTION : yes\n   6. DELETED SCENES : yes, deleted deaths 25 min special\n   7. COVER ART : yes, on DVD-Rom part\n   8. CBB info : get information on all 15 CBB fanedits\n\nConceptual improvements/advancements of edit over original:\n\n**************************INTRODUCTION***********************************\nTCM The Beginning and TCM Remake were not that bad, but no competition to the atmosphere of the 1974 original. But still they gave the audience a more inside look into TCM and that is what brought us to the idea to create a complete Thomas Hewitt (a.k.a. Leatherface) story by taking scenes from both movies. Since the beginning really sucked, when it came to storytelling about the first Hewitt victims, these had to go completely.\n\n***************************THE EDIT**************************************\nIt was very important for us to tell a believable and continuing story, so we had to erase anything that didn't make sense (like the animals in the meat factory in REMAKE, when the same factory was closed for good in THE BEGINNING) for both. Deleting them was tough work.\nNext thing was to find out where the movies went over the top with gore or credibility. That is why Uncle Monty will not loose his legs in our edition. The Hewitt's are still cannibals, although there is hardly any mention of that in REMAKE, but it somehow made sense. Erin stabbing Andy was way over the top, this would never have happened in reality (friends just don't do that to each other), but we kind of solved this very sufficiently. Be surprised.\nFor the tension of the movie we removed the annoying and badly acted Jedidiah (the kid) almost completely from the movie and you can be sure, he won't be missed. But it is a wonderful example of editing, how we removed him from leading our two escapees from the dungeon. Unfortunately there was no room left on the DVD to include this scene as deleted scene.\nOur movie is scary, gory, cruel and very dark, it is not for the faint of heart and we are not sure if this would have gained an R rating in the US.\n\nTime needed for the edition\nplanning: 4 weeks\nediting: 4 days\nsound editing: 3 days\ntrailer: 1 day\nDVD layout and features: 2 days\npersons involved: 4","torrent":{"xt":"urn:btih:31abad5ff0b0db0b28b06503102798fa6671ba37","amp;dn":"The+Texas+Chainsaw+Massacre+-+The+Thomas+Hewitt+File+%5Bfanedit.or","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31abad5ff0b0db0b28b06503102798fa6671ba37","infoHashBuffer":{"type":"Buffer","data":[49,171,173,95,240,176,219,11,40,176,101,3,16,39,152,250,102,113,186,55]},"announce":[],"urlList":[]}}