{"title":"Presidentes de Latinoamerica","uid":6351579,"size":6149869568,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:31c9c59964ba15f205eb970bc48b304ae6d53f44&amp;dn=Presidentes+de+Latinoamerica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dani3488","files":13,"time":1304016347,"description":"Sinopsis\t\n \nAmÃƒÂ©rica Latina estÃƒÂ¡ viviendo un clima polÃƒÂ­tico y social sin precedentes. Parece despertar de un viejo letargo. Presidentes de LatinoamÃƒÂ©rica es un ciclo de documentales de producciÃƒÂ³n nacional que viene a registrar de manera integral las transformaciones que esta nueva ÃƒÂ©poca va dejando en cada uno de los paÃƒÂ­ses de la regiÃƒÂ³n. Ideado y realizado por Occidente Producciones, revela como nunca antes los sueÃƒÂ±os y las luchas de aquellos hombres que hoy presiden los destinos de los pueblos latinoamericanos.\n\nLas cÃƒÂ¡maras de Occidente viajaron por todo el continente para capturar este irrepetible momento histÃƒÂ³rico, elaborando asÃƒÂ­ un documento ÃƒÂºnico que seguramente se convertirÃƒÂ¡ en aÃƒÂ±os venideros en una consulta obligada.\n\nCon una mirada humana pero tambiÃƒÂ©n social, cada uno de estos documentales se ha propuesto revelar un perfil desconocido, sorprendente, profundo y cercano de los mandatarios latinoamericanos.\n\nDESCONOCIDO\nPorque cada programa se introduce en lo profundo de LatinoamÃƒÂ©rica, descubriendo las facetas menos conocidas y publicitadas de sus presidentes y de sus pueblos.\n\nSORPRENDENTE\nPorque el resultado de esta gira despierta el asombro. Sorprende encontrarnos con un Rafael Correa ÃƒÂ­ntimo, andando en su bicicleta y comiendo luego en un simple mercado de pueblo junto a su gente, o a un Evo Morales que cuenta los sueÃƒÂ±os premonitorios de su infancia, aquellos que su mismo padre le indicÃƒÂ³ como la clave de lo que deberÃƒÂ­a afrontar en el futuro.\n\nPROFUNDO\nPorque los presidentes abren sus corazones y cuentan sus vidas; agudizan la mirada y hablan de polÃƒÂ­tica, de ellos y de sus vecinos, de la integraciÃƒÂ³n latinoamericana, de manos amigas y no tanto.\n\nCERCANOS\nPorque nunca un ciclo mostrÃƒÂ³ a personas tan importantes de tan cerca.\n\n\n\nFuente: Sitio Oficial http://www.presidentestv.com.ar","torrent":{"xt":"urn:btih:31c9c59964ba15f205eb970bc48b304ae6d53f44","amp;dn":"Presidentes+de+Latinoamerica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31c9c59964ba15f205eb970bc48b304ae6d53f44","infoHashBuffer":{"type":"Buffer","data":[49,201,197,153,100,186,21,242,5,235,151,11,196,139,48,74,230,213,63,68]},"announce":[],"urlList":[]}}