{"title":"[PDF] [2006] Science Fact and Science Fiction An Encyclopedia","uid":6457689,"size":4106319,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:325c789ab01831fb77c3953a8cae73f1539b0b49&amp;dn=%5BPDF%5D+%5B2006%5D+Science+Fact+and+Science+Fiction+An+Encyclopedia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lyndavilla","files":2,"time":1307636938,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n  &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nScience fiction is a literary genre based on scientific speculation. Works of science fiction use the ideas and the vocabulary of all sciences to create valid narratives that explore the future effects of science on events and human beings. Science Fact and Science Fiction examines in one volume how science has propelled science-fiction and, to a lesser extent, how science fiction has influenced the sciences. Although coverage will discuss the science behind the fiction from the Classical Age to the present, focus is naturally on the 19th century to the present, when the Industrial Revolution and spectacular progress in science and technology triggered an influx of science-fiction works speculating on the future. As scientific developments alter expectations for the future, the literature absorbs, uses, and adapts such contextual visions. The goal of the Encyclopedia is not to present a catalog of sciences and their application in literary fiction, but rather to study the ongoing flow and counterflow of influences, including how fictional representations of science affect how we view its practice and disciplines. Although the main focus is on literature, other forms of science fiction, including film and video games, are explored and, because science is an international matter, works from non-English speaking countries are discussed as needed.","torrent":{"xt":"urn:btih:325c789ab01831fb77c3953a8cae73f1539b0b49","amp;dn":"%5BPDF%5D+%5B2006%5D+Science+Fact+and+Science+Fiction+An+Encyclopedia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"325c789ab01831fb77c3953a8cae73f1539b0b49","infoHashBuffer":{"type":"Buffer","data":[50,92,120,154,176,24,49,251,119,195,149,58,140,174,115,241,83,155,11,73]},"announce":[],"urlList":[]}}