{"title":"Incubus - Talk Shows On Mute","uid":4994529,"size":146812932,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:327b046794b0e1f3a72663d3c28f3e7a540ba191&amp;dn=Incubus+-+Talk+Shows+On+Mute&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1247213641,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Talk Shows on Mute&quot; is a song by the American alternative rock band Incubus. It was released as the second single from the band's 2004 album, A Crow Left of the Murder..., and peaked at #3 on the Billboard Modern Rock Tracks chart.\n\nThe song has a mellow and stripped-down sound, with lyrics containing references to George Orwell's novel Nineteen Eighty-Four and Philip K. Dick's novel Do Androids Dream of Electric Sheep?. Lead singer Brandon Boyd says the inspiration for the song came to him while watching a talk show on an airplane.\n\n&quot;I was on an airplane when a talk show began playing on the TVs. I decided to start narrating for the people, which is a really great game if you're ever bored enough. I realized a time will probably come when television will watch us if we're watching it, if that hasn't already happened, figuratively or literally. It sounded like some sort of pseudo-Big Brother nightmare, so I wrote it down.&quot;\n\nThe song's music video was directed by Floria Sigismondi, who also directed the band's &quot;Megalomaniac&quot; video. The video alludes to another George Orwell novel, Animal Farm. It depicts a world where animals have taken over, and the members of Incubus are shown on a talk show demonstrating &quot;stupid human trix&quot;.\n\nThe song's chorus features the line; &quot;Come one, come all into nineteen eighty-four.&quot; This can be abbreviated to form the word &quot;cocaine&quot;\n\nA Crow Left of the Murder... is the fifth studio album by alternative rock band Incubus, released on February 3, 2004. The album marks the first appearance of bassist Ben Kenney, following the departure of founding member Dirk Lance.\n\nThe singles from this album, &quot;Megalomaniac&quot; and &quot;Talk Shows on Mute&quot;. &quot;Agoraphobia&quot; and &quot;Sick Sad Little World&quot;, were also released as radio-only singles.\n\nThe album debuted at number two on the U.S. Billboard 200, selling about 332,000 copies in its first week on the chart. It has since gone on to sell 1.9 million copies and has been certified platinum by the RIAA.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:327b046794b0e1f3a72663d3c28f3e7a540ba191","amp;dn":"Incubus+-+Talk+Shows+On+Mute","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"327b046794b0e1f3a72663d3c28f3e7a540ba191","infoHashBuffer":{"type":"Buffer","data":[50,123,4,103,148,176,225,243,167,38,99,211,194,143,62,122,84,11,161,145]},"announce":[],"urlList":[]}}