{"title":"Sanctuary4gamers Episode 64 - The Ballad of Gay Chris","uid":5158848,"size":81888689,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3437d6ab63539b152d8a5a4db802dd0ece8f3a2e&amp;dn=Sanctuary4gamers+Episode+64+-+The+Ballad+of+Gay+Chris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1258023459,"description":"On this weeks cast we invite our good friend Rizzo on to talk about the eurogamer event in London covering god of war 3, left for dead 2 and lots more.\n\nSteve picks up his miniature plastic guitar again and displays his skills at Band Hero, and he finally talks about a certain Ps3 game that he promised not to talk about..ever!\n\nBallad of gay Tony gets a good rogering and the boys give their impressions of all the sex and shooting.\n\nWe answer your questions and Chris answers you jibba jabba Japanese questions.\n\nWAIT! We can't forget the competitions! Not only do we give out our Z1 Turtle Beach headset for PC but also Steve gives away 2 codes for Forza downloads PLUS a crap signed CD by myself and Steve PLUS another shite CD of my fake album BUT ALSO one code for a game courtesy of Frozenbyte (Via Rizzo).\n\nWe are now at a very special point, we need TWO new written itunes reviews to get us to 100 itunes reviews in the UK - if you have time, please leave us an itunes review and make us happy.\n\n\nAlso, if you are reading this - do us a favour and make a tweet telling your friends you are listening to the s4g podcast!","torrent":{"xt":"urn:btih:3437d6ab63539b152d8a5a4db802dd0ece8f3a2e","amp;dn":"Sanctuary4gamers+Episode+64+-+The+Ballad+of+Gay+Chris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3437d6ab63539b152d8a5a4db802dd0ece8f3a2e","infoHashBuffer":{"type":"Buffer","data":[52,55,214,171,99,83,155,21,45,138,90,77,184,2,221,14,206,143,58,46]},"announce":[],"urlList":[]}}