{"title":"Steven Curtis Chapman - 1992 - The Great Adventure","uid":5108084,"size":48134733,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:34537cd8ceb3227e7900cccd0819cb569a2de8f1&amp;dn=Steven+Curtis+Chapman+-+1992+-+The+Great+Adventure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorrentTracts","files":11,"time":1254545311,"description":"Steven Curtis Chapman - 1992 - The Great Adventure\n\n\nTRACK LISTING:\n\n01 - Prologue\n02 - The Great Adventure\n03 - Where We Belong\n04 - Go There With You\n05 - That's Paradise\n06 - Don't Let The Fire Die\n07 - Got To B Tru\n08 - Walk With The Wise\n09 - Maria\n10 - Still Called Today\n11 - Heart's Cry\n\n\nADDITIONAL INFORMATION:\n\nThe last three years have brought more success and recognition to Steven Curtis Chapman than perhaps he ever dreamed. Besides establishing himself as a sought-after songwriter Chapman's greatest strength he has shown himself to be an engaging and charismatic performer. One would think that, after racking up nearly a dozen Dove Awards, Chapman would be tempted to coast and simply spoon-feed his audience songs with all the right buzzwords, thereby putting a stranglehold on the charts, and giving himself the perfect platform from which to vault into mainstream acceptance.\nSo, how does Chapman top an album as widely praised as For the Sake of the Call? Happily, on The Great Adventure, Chapman has opted to pursue the course of writing honest and encouraging songs which don't simply attempt to duplicate a formula. Musically, he seems to have settled into a contemporary pop niche, with his bluegrass/country roots still an unmistakable part of the equation. That gives The Great Adventure greater conceptual unity than Chapman's previous four efforts.\n\nUnfortunately, one of the albums first mis-cues happens to be the lead-off track, a Copland-esque instrumental prologue which is supposed to evoke in the listener a sense of joining Chapman on this bold journey. I found the opening acappella vocals (&quot;Saddle up your horses!&quot;) of the title cut to be every bit as stirring, and more in keeping with the musical atmosphere of the rest of the album. That songs buoyant chorus, urging the listener to &quot;follow our leader into the glorious unknown&quot; is an accurate barometer of what's to follow. Chapman then takes us back to Eden the beginning of mans adventure on &quot;Where We Belong,&quot; a song which illustrates how &quot;one man became the doorway&quot; to restore our relationship with the Father. The artists tender nature, evident on several tracks, especially shines through on &quot;Go There With You,&quot; a beautiful song of love and support for the person chosen as a life partner (&quot;I will give myself to love the way love gave itself for me&quot; and &quot;Maria,&quot; a prayer for those silently crying out (&quot;like a desert longs for rain&quot;) for a compassionate touch.\n\nThe three tracks which come in the middle of the album best illustrate the range of Chapman's songwriting gifts. &quot;Don't Let the Fire Die&quot; is Chapman's plea to a friend whose faith had sustained him (&quot;I can still feel the prayers you prayed for me all those years&quot;), not to let his own flame of passion for Christ diminish (&quot;I can still see the spark of his love in your eyes&quot;). This lovely acoustic ballad is reminiscent of the sound of a 70s band Pure Prairie League, which our thirty-something readers may remember; Chapman's vocals are the most moving on this track. At the other extreme is the self-deprecating &quot;Got to B Tru,&quot; which finds Chapman jokingly interpreting some beat-box rhythms, with the help of dc Talks Toby McKeehan. Chapman tries his best to master the hip-hop exclamation &quot;yeah, boyy-ee!&quot; but his Kentucky drawl can only manage an enthusiastic &quot;yeah, bud!&quot; Almost lost among the laughs is the important observation that how we live our faith usually speaks louder than our words. &quot;Walk With the Wise&quot; teaches a lesson that's simple, but one which we too often ignore: &quot;We will grow wise if we walk with the wise.&quot; Chapman also realizes another fact most of us come to know; as we get older, our parents get smarter, or as he puts it, &quot;I've learned to look for answers in those born before my time.&quot; The song offers a sparkling country arrangement, featuring the vocal talents of Ricky Skaggs and Lionel Cartwright, the dobro picking of Rusty Young (Poco) and accordion embellishments by Jo-el Sonnier.\n\nOne of the nicest surprises on The Great Adventure comes in the form of a guest vocal by BeBe Winans on &quot;Still Called Today.&quot; The message again a timeless but important one is not to let the sun go down on your anger: &quot;Go say what you need to say while it is still called today.&quot; The surprise comes not from Chapman's delivery, which is passionate and warm, but how well his voice dovetails with BeBe's, and how natural and supple Winan's sounds within the pure pop arrangement. At the other end of the trail, stripped back to a simple piano/guitar/string arrangement, Chapman reminds us that his &quot;Hearts Cry&quot; is to &quot;Know the one who died for me and live my life for Christ.&quot;\n\nThere are some songs on The Great Adventure that would not be out of place on CMT and country radio; Chapman's easy-going demeanor and wholesome good looks would seem to make him a natural for either arena. But what makes The Great Adventure so satisfying is that Chapman will not sacrifice making plain his beliefs for a shot at that brass ring.\n\n\n\nTORRENTED BY:\n\nTorrent Tracts, October 2009\n\n","torrent":{"xt":"urn:btih:34537cd8ceb3227e7900cccd0819cb569a2de8f1","amp;dn":"Steven+Curtis+Chapman+-+1992+-+The+Great+Adventure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34537cd8ceb3227e7900cccd0819cb569a2de8f1","infoHashBuffer":{"type":"Buffer","data":[52,83,124,216,206,179,34,126,121,0,204,205,8,25,203,86,154,45,232,241]},"announce":[],"urlList":[]}}