{"title":"Aata Pita 2010 Marathi Xvid DVDRip","uid":6448074,"size":729873997,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:345803da2ef45e79e4c975ab5d5183f30ebaeb59&amp;dn=Aata+Pita+2010+Marathi+Xvid+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bahirjinaik","files":2,"time":1307338730,"description":"Presentor: Samarth Art Innovatives\nProducer: Bhooshan Patil, Deepali Samant and Aachal Rane\nStory, Screenplay, Direction: Uttung Shelar\nDialogues: Prashant Loke\nCinematographer: Prasad Bhende\nMusic: Sanjeev Kohli\nCast: Bharat Jadhav, Sanjay Narvekar, Ashwini Apte, Girish Salvi, Pradeep kabre, Mohan Khambete, Pratibha Goregaonkar, Raju Shisadkar, Santosh Patil, Rahul Kulkarni, Rohan Bhalekar, Satish Pulekar\n\n\nSomeone has rightly said that there is a fine line between coincidence and fate. Samarth Art Innovative's new Marathi film 'Aatapita' tries to draw this fine line, when Ashutosh (Bharat Jadhav) who dreams of becoming a writer decides to make Nandu (Sanjay Narvekar), the hero of his story. Nandu works in the recovery of loan department of a bank. Writer- director Uttung Shelar who has conceptualized this unusual plot, has however left it to the audience to decide whether the happenings in the film are just a coincidence or it's the destiny of the person. \n\n'Aatapita' is a simple tale in the day to day life of two individuals, presented in a tricky manner to keep the audience on the hold till the climax, when it finally concludes with a surprise. It's a totally different experience in Marathi films, as such themes are generally observed in Marathi dramas. But, the director has given a better treatment to the plot, using the adaptability of the two excellent actors, who bring liveliness to every scene. Moreover, the dialogues by Prashant Loke, obviously help add a special flavor to the screenplay, which is based mainly on these two characters . ","torrent":{"xt":"urn:btih:345803da2ef45e79e4c975ab5d5183f30ebaeb59","amp;dn":"Aata+Pita+2010+Marathi+Xvid+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"345803da2ef45e79e4c975ab5d5183f30ebaeb59","infoHashBuffer":{"type":"Buffer","data":[52,88,3,218,46,244,94,121,228,201,117,171,93,81,131,243,14,186,235,89]},"announce":[],"urlList":[]}}