{"title":"RESEED The Unexpected Guest - Demon (1982) 320CBR","uid":4988531,"size":162729968,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3623f3623084a4cb280eb231691f1d8e4c6e17b5&amp;dn=RESEED+The+Unexpected+Guest+-+Demon+%281982%29+320CBR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"degsey","files":20,"time":1246909334,"description":"Demon's second album The Unexpected Guest was recorded in 1982 at Bray Studios, famous for the Hammer Horror Films. Even today people still talk about 'The Unexpected Guest' in reverential terms, many citing it as one of the most powerful and finest examples of its genre. Certainly, it showcased the band's distinctive Classic Rock musical style and the thoughtful, imaginative lyrics of Dave Hill and Mal Spooner. The addition of Andy Richards on keyboards gave yet more depth to the already expansive Demon sound. Furthermore, this second album offering was more complete, flowing easily from beginning to end.\n\nTrack Listing:\n\n   1. Intro: An Observation\n   2. Don't Break the Circle\n   3. The Spell\n   4. Total Possession\n   5. Sign of a Madman\n   6. Victim of Fortune\n   7. Have We Been Here Before?\n   8. Strange Institution\n   9. The Grand Illusion\n  10. Beyond the Gates\n  11. Deliver Us From Evil\n  12. Outro\n\nplus Bonus Tracks\n\n  13. Don't Break The Circle (1988 Remix)\n  14. Have We Been Here Before? (Out-Take)\n  15. Victim Of Fortune (Out-Take)\n  16. Strange Institution (Out-Take)\n\nLineup:\n\n    * Dave Hill\n    * Mal Spooner\n    * Les Hunt\n    * Chris Ellis\n    * Andy Richards\n    * John Wright\n\n\nBuoyed by the interest and critical acclaim that the first album had received, the new look line-up decamped to Bray Studios, fabled home of Hammer Films, early in 1982, to record their second album, 'The Unexpected Guest'. Even today, two decades on, people still talk about 'The Unexpected Guest' in reverential terms, many citing it as one of the most powerful and finest examples of its genre. Certainly, it showcased the band's distinctive musical stylings and the thoughtful, imaginative lyrics of Dave Hill and Mal Spooner. The addition of Andy Richards on keyboards gave yet more depth to the already expansive Demon sound. Furthermore, this second LP offering was more complete, flowing easily from beginning to end, demonstrating that the band had progressed and grown during the previous year. In July of 1982 another single, 'Have We Been Here Before?' was released and the band hit the road for a series of live promotional gigs.\n\nThe live shows of this era were something to behold. Straight out of the schlock-horror handbook, each performance guaranteed a gore-fest of stomach-churning intensity. For 'Night of the Demon' Dave would don a latex Demon costume and horned Devil mask, giving the impression that he was taking his annual holiday from the ninth circle of Hell. The stage was appropriately adorned with all manner of funereal trappings and monumental masonry, including an open grave, blowing leaves and two, giant, white crucifixes! Later in the show, Dave would appear, in all his hideously wrinkled glory, first as the 'Father of Time', and then as the Madman pictured on the gatefold sleeve of 'The Unexpected Guest'. Naturally, the rest of the band was not excluded from sharing their bloodletting tendencies with the assembled throng. Les Hunt was known, on occasion, to bleed profusely from the multiple puncture wounds in his arms. What is more, all of this was performed to some of the loudest, heaviest heavy rock of the time. Since both Alice Cooper and KISS had foresworn make-up, costumes and ghoulish accessories, Demon was widely held to be the hottest live ticket in town. \n\nPlease seed to at least 1:1\n\nComments welcome\n\nEnjoy!","torrent":{"xt":"urn:btih:3623f3623084a4cb280eb231691f1d8e4c6e17b5","amp;dn":"RESEED+The+Unexpected+Guest+-+Demon+%281982%29+320CBR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3623f3623084a4cb280eb231691f1d8e4c6e17b5","infoHashBuffer":{"type":"Buffer","data":[54,35,243,98,48,132,164,203,40,14,178,49,105,31,29,142,76,110,23,181]},"announce":[],"urlList":[]}}