{"title":"Army Of Lovers - The Gods Of Earth And Heaven + [1993, 320 kbps]","uid":5013169,"size":264381629,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:36490da9ad09ad5be62718e6fdcac45d28db7c1e&amp;dn=Army+Of+Lovers+-+The+Gods+Of+Earth+And+Heaven+%2B+%5B1993%2C+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"musicalibera","files":39,"time":1248100448,"description":"ARMY OF LOVERS - The Gods Of Earth And Heaven + (1993)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD.\nNumber of tracks 27.\n\nLetsingit.com biography:\n\n&quot;Army of Lovers released a new album in 1993. &quot;The Gods of Earth &amp; Heaven&quot; was a bombastic collection of songs and maybe the album that most fans like the best. Bard once said that &quot;This is THE album of Army Of Lovers. We will never make a better one!&quot;.  The actual Army line-up underwent a complex series of changes in the years following the release of the first album; originally a three-part outfit consisting of La Camilla, Jean-Pierre Barda and Alexander Bard, in its time the Army has swapped a couple of members around (exchanging La Camilla for Michaela Dornonville De La Cour), and had now expanded into a platoon of four with the addition of Dominika Peczynski, another voluptuous lady with an impressive cleavage, allegedly a former telephone sex operator. On &quot;The Gods of Earth and Heaven&quot; all four members of the band are given a short vignette to introduce themselves to the listeners; Michaela opens with &quot;Chihuahuas On Parade&quot;, Jean-Pierre declares his undying love for his mirror in &quot;Le Portrait De Jean-Pierre&quot;, Dominika tells the sad tale of the clinically depressed O in broken Italian and Alexander finishes with &quot;Also Sprach Alexander&quot;, a reference to Richard Strauss' classical tone poem &quot;Thus Spoke Zarathustra&quot; and Bard's Zoroastrian faith.\n\nThe album is built-up like a musical, with an ouverture, spoken dialogue, showstoppers and a climactic finale, the band are even dressed up as characters from The Sound of Music on the front cover, but the similarities end there. This slightly warped musical features songs dealing with a wide variety of issues, like eating disorders, Judaism, sexual preferences, the beaches of St Tropez, Ukraine, the ballad of Marie Curie (&quot;she glows in the dark... she's radioactive.. radioactive....&quot;), &quot;Heterosexuality&quot;, a song with vocals but practically no lyrics but all the more moaning and groaning, the story of a Catholic saint crucified for his supposed penchant for beautiful boys, the passing of a close friend, a monk with an exceedingly active love life and songs with lyrics like &quot;There's a rocket in my pocket!&quot;. Not your regular West End musical in other words. \n\nMuch to the chagrin of Polydor who had now signed the band for Continental Europe and the UK, &quot;The Gods of Earth and Heaven&quot; didn't shift quite as many copies as the preceding &quot;Massive Luxury Overdose&quot;. The album did however produce one major hit; &quot;Israelism&quot;, a song that was completely banned in Germany because of its controversial lyrics and video, with its allusions to the Star of David, &quot;spring predicition: clouds of bugs&quot;, circumcision, diamond markets in the ghetto, Kabbala and Jezebel, &quot;like a Golda high on Sion&quot;, milk and honey and &quot;40 years of desert trips&quot;. MTV US and MTV Europe also banned the video, fearing it would be perceived as an anti-Semitic provocation. Even though the song received practically no promotion or airplay whatsoever, with very few European radio stations actually daring to play the track, it managed to become a Top 40 hit in both Germany and several other countries in Continental Europe. It also reached #10 in their native Sweden and it actually went to #1 in two countries; Finland and..... very paradoxically considering the subject matter..... Israel! The only ones who apparently really got the joke, because that was what it was, were the Israelis themselves. And to those who got the wrong end of the stick Jean-Pierre and Dominika later clarified that this was in fact a loving celebration of their own Jewish heritage, albeit with a large portion of dark humour.\n \nThe follow-up singles chosen were the summery tune &quot;La Plage De Saint Tropez&quot;, complete with mock French accents, and &quot;I Am&quot;. The main creative force behind the band was, undeniably, Alexander Bard, something of a personality in Sweden if only because of his unremitting arrogance, be it real or all part of the fun, and &quot;I Am&quot; was a self-ironic comment on that perception, be it true or false. Neither &quot;Plage De Saint Tropez&quot; nor &quot;I Am&quot; managed to repeat the commercial success of &quot;Crucified&quot; but that didn't bother the group all that much, mass appeal had never been their primary goal, in that case they never would have recorded a song like &quot;Israelism&quot; and made it the lead single, let alone promoted it with that video... But thanks to their breakthrough with &quot;Crucified&quot; they had found their niche and their particular audience and now worldwide. In the following decades that fanbase in KÃƒÂ¶ln, Haifa, MÃƒÂ¥lilla and St. Petersburg would prove to be very loyal.&quot; \n\n\nTRACK LIST\n\nThe Gods Of Earth And Heaven\n============================\n\n01. Chihuahuas On Parade\n02. We Are The Universe\n03. La Plage De Saint-Tropez\n04. I Am\n05. Le Portrait De Jean-Pierre\n06. Israelism\n07. The Grand Fatigue\n08. Carry My Urn To Ukraine\n09. Sebastien\n10. La Storia Di O\n11. Blood In The Chapel\n12. The Ballad Of Marie Curie\n13. Heterosexuality\n14. Sons Of Lucy\n15. Also Sprach Alexander\n16. The Day The Gods Help Us All\n17. Israelism (Kibbutznikblitzkrieg Radio Edit)\n18. Israelism (Goldcalfhorahorror Mix)\n19. Israelism (TrÃƒÂ¨s Camp David Mix)\n20. Israelism (Kibbutznikblitzkrieg Mix)\n22. Israelism (Dub Mix)\n23. La Plage De Saint Tropez (Cancanpourbonbondepapa Mix)\n24. Heterosexuality (Garden Of Sweden Mix)\n25. I Am (Superegomaniac Mix)\n26. I Am (Charismathematic Mix)\n27. I Am (Bubble Dub)\n\n\nEnjoy - and thanks in advance for seeding.\n\nPS. No there's nothing wrong with your ears. &quot;TrÃƒÂ¨s Camp David Mix&quot; and &quot;Dub Mix&quot; of &quot;Israelism&quot; are indeed near identical mixes. The only ones who can hear the difference between those two are most likely dogs. One released on the 2-track single, the other on the 4-track. Very clever. Talk about your &quot;record label scam&quot; Alexander.... Hmmmm, Alexander Bard and dogs...Now there's a coincidence. (Bard famously &quot;gave birth&quot; to a bulldog in one of their videos.)","torrent":{"xt":"urn:btih:36490da9ad09ad5be62718e6fdcac45d28db7c1e","amp;dn":"Army+Of+Lovers+-+The+Gods+Of+Earth+And+Heaven+%2B+%5B1993%2C+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36490da9ad09ad5be62718e6fdcac45d28db7c1e","infoHashBuffer":{"type":"Buffer","data":[54,73,13,169,173,9,173,91,230,39,24,230,253,202,196,93,40,219,124,30]},"announce":[],"urlList":[]}}