{"title":"House M.D. S3 disk 4 (dutch subs) 2Lions-Team","uid":5015687,"size":4681997369,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:37f667578afe9b991d03fa63a40e851b3316dc65&amp;dn=House+M.D.+S3+disk+4+%28dutch+subs%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"filmfan84","files":-1,"time":1248208688,"description":"House M.D. Season 3 Disk 4\n\nWith: Hugh Laurie, Lisa Edelstein, Robert Sean Leonard\n\nDutch\nEpisodes:\nNeedle in a Haystack: House en zijn team proberen een 16-jarige met interne bloedingen te helpen, terwijl zijn familie elke vorm van moderne medische behandeling weigert\nInsensitive: In het ziekenhuis werd een verkeersslachtoffer binnengebracht, die immuun voor pijn blijkt te zijn. Levensgevaarlijk, voor wie een slutiende diagnose wil stellen...\nHalf-Wit: Een muzikaal genie wiens talenten op onverklaarbare wijze kwamen bovendrijven na een busongeval wordt behandeld door House, die zelf ook met zijn gezondheids problemen blijft kampen.\nTop Secret: Een ex-Marine, pas thuis na 2 jaar dienst in Irak, lijdt aan een heleboel niet nader omschreven kwaltjes. Het team vraagt zich af of zijn geval wel gegrond is.\n\nEnglish:\nNeedle in a haystack: House and his staff must deal with a teenage Gypsy boy suffering from inexplicable respiratory distress. However, House has bigger issues on his mind: Cuddy has given away his handicapped spot.\nInsensitive: It's Valentine's Day, and Cuddy has a blind date. Meanwhile, House leaves ER duty to take the case of a child patient named Hannah.   \nHalf-Wit: House encounters a brain-damaged musical prodigy with inexplicable abilities while the team faces serious concerns about House's own health.\nTop Secret: The ex-Marine that saved House's life, in a dream he had, is admitted in the hospital with symptoms resembling Gulf War Syndrome. While House is busy dealing with his own health issues, and Chase and Cameron are too busy with each other, the ex-Marine gets worse.\n\nGenre: TV Serie\nLanguages: English (5.1)\nSubtitels: Dutch\nFormat ..: PAL\nSource ..: DVD 9 \n \n*******************************************************************************\n\nBrought to you by \nfilmfan84\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n      &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nL&lt;/a&gt;\n\n*******************************************************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:37f667578afe9b991d03fa63a40e851b3316dc65","amp;dn":"House+M.D.+S3+disk+4+%28dutch+subs%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37f667578afe9b991d03fa63a40e851b3316dc65","infoHashBuffer":{"type":"Buffer","data":[55,246,103,87,138,254,155,153,29,3,250,99,164,14,133,27,51,22,220,101]},"announce":[],"urlList":[]}}