{"title":"Mariah Carey - Never Too Far","uid":5138657,"size":108482564,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:38b85960d333cf87f254cfa3b4c167660c815c87&amp;dn=Mariah+Carey+-+Never+Too+Far&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1256721951,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Never Too Far&quot; is a song written and produced by American singer Mariah Carey, Jimmy Jam and Terry Lewis for Carey's tenth album, Glitter. The protagonist of this ballad states that although physical distance can sometimes separate lovers, the love they share will never be too far apart. It was released as the album's second single in 2001, and was Carey's first radio airplay-only release in the U.S. after 1998 when Billboard magazine had given chart eligibility to singles that weren't released in a physical format.\n\n&quot;Never Too Far&quot; became Carey's first U.S. single to not appear on the Billboard Hot 100, but it reached number 5 on Billboard's Bubbling Under Hot 100 Singles chart, which represents the twenty-five singles below the Hot 100's number 100 position which have not yet appeared on the Hot 100. It was not solicited to R&amp;B radio stations in the U.S. As a double A-side with &quot;Don't Stop (Funkin' 4 Jamaica),&quot; the single reached the top forty in the United Kingdom and Australia. In Germany, Switzerland, the Netherlands, and Sweden, it was released on its own and peaked outside the top forty.\n\nNo remixes of the song were commissioned, though a radio edit reduces the lengthy introduction. The charity single &quot;Never Too Far/Hero Medley&quot; combines the first verse of &quot;Never Too Far&quot; with a re-recorded version of the second verse and bridge of Carey's &quot;Hero&quot; (1993), and it was later released in the U.S. and charted on the Billboard Hot 100.\n\nCarey was unable to film a music video for the single as she was recovering from an emotional and physical breakdown. Instead, a video was created using a scene taken directly from the film Glitter, where Billie Frank (played by Carey) sings the song at Madison Square Garden during her first sold-out concert. Frank's performance of the song in the film omits its entire second verse, and the song's development runs in parallel with the film's love story.\n\nThe song has been covered live by many singers in Philippines, including Regine Velasquez, Jonalyn Viray, Rachelle Ann Go, and Erik Santos.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:38b85960d333cf87f254cfa3b4c167660c815c87","amp;dn":"Mariah+Carey+-+Never+Too+Far","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38b85960d333cf87f254cfa3b4c167660c815c87","infoHashBuffer":{"type":"Buffer","data":[56,184,89,96,211,51,207,135,242,84,207,163,180,193,103,102,12,129,92,135]},"announce":[],"urlList":[]}}