{"title":"SPlayer 3.7 Build 2250 Portable","uid":6439317,"size":11674853,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:39c17bf527fdc1f048bdbe5adc8df2cba7e7621a&amp;dn=SPlayer+3.7+Build+2250+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306936451,"description":"SPlayer 3.7 Build 2250 Portable\n\nSPlayer is a simple and yet practical media player, which supports all the popular media formats, including DVDRip, HDTV, RMVB, QuickTime, MPEG-2, MPEG-4, AC3/DTS, VP3/6/7, Indeo, XVD, OGG/OGM, APE, FLAC, TTA, AAC, MPC, 3GP/AMR, and subtitles.\n\nLow consumption Optimization of a variety of creative techniques, smooth playback. Maximize the efficiency are always our mission ...\n\nEasy to use Crafted user experience design. Up to more than 150 unique, small features. &quot;devil hidden in the detail&quot; is our motto\n\nExtreme compact World's smallest and most sophisticated players, complete installation package only 4M, still as powerful as ever ...\n\nSubtitle matching SPlayer's smart matching can automaticly download the highest quality in English and Chinese subtitles\n\nExquisite beauty Designer Raven from Milan created a set of interfaces. Beautiful skin can let you feel more comfortable while playing\n\nHD\n* ShaderEngineTMimage enhancement engine,reduce screen noise, sharp picture quality rendering\n* LiveColorTMcolor enhancement algorithms, the picture is more colorful colors\n* SmartAmplifyTMIntelligent sound field balance of technology, sound is even more shocking\n\nLow consumption\n* FastMotionTMoptimized to significantly reduce CPU and memory footprint. Optimization for multi-core SSE2 SSE3 MMX GPU etc\n* PowerTravelTMpower-saving mode of travel, reduce energy consumption, increase the cruise time for notebook\n* EyeCareTMtake care your eyes for long time watching, health is the most important\n\nIntelligent\n* Anti-SillyTMSmart, hand-free configuration, hundreds of branch logic automatically selects the best mode based on the hardware configuration.\n* CloudMatchingTMIntelligent Display subtitles technology, foreign language film is no longer a need to find matching subtitles\n\nDelicate beauty\n* After a number of enthusiastic users of professional advice and design, SPlayer interface adhering to simple, stylish, functional integrity without affecting the general use. Buttons novice twist, the cure that is to go\n\nHome Page - http://splayer.org/index.en.html\n\n\n","torrent":{"xt":"urn:btih:39c17bf527fdc1f048bdbe5adc8df2cba7e7621a","amp;dn":"SPlayer+3.7+Build+2250+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39c17bf527fdc1f048bdbe5adc8df2cba7e7621a","infoHashBuffer":{"type":"Buffer","data":[57,193,123,245,39,253,193,240,72,189,190,90,220,141,242,203,167,231,98,26]},"announce":[],"urlList":[]}}