{"title":"Cork USB Dead Drops - Freshly Minted Content","uid":6432473,"size":1777667467,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3a518fe2bd2385a9a643da56782bd80a2ff3ef52&amp;dn=Cork+USB+Dead+Drops+-+Freshly+Minted+Content&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cathalgar","files":154,"time":1306701065,"description":"June 2011, Nexus Cork (of hackerspacecork.com ) will be rolling out some lovingly crafted USB dead drops. Blog post:\n\nThe Cork USB Dead Drops project, derived from the deaddrops.com project, was intended not only to be a raw Dead Drops collection but also a way to stimulate and promote knowledge of Free Culture.\n\nThe preloaded content includes:\nSoftware:\nUbuntu Linux, Tor, Freenet, Bitcoin\n\nBooks\nA selection of Cory Doctorow's books, Lawrence Lessig's &quot;Free Culture&quot;, the &quot;Eclipse Phase&quot; RPG, and issue 1.2 of Libre Graphics Magazine\n\nMusic\nAlbums and Tracks from Brad Sucks, DEAFETHOS, Diablo Swing Orchestra, Hungry Lucy, Tryad, Zero Page\n\nMovies\nBig Buck Bunny, Sintel, and a trailer for Nasty Old People.\n\nAs Dead Drops are prone to things like deletions, substitutions and reformatting by their users, some of these awesome preloaded things will sometimes not be available, so we're uploading a torrent file of all the &quot;Freshly Minted Content&quot; that will be found on spanking new Cork USB Dead Drops!\n\nIf you'd like to re-use the preloaded content..well, it's not mine to stop you; it's all either free software or creative-commons licensed software. You *can* re-use the lovingly written license and artist information files, intro document and any other original content; consider them to be under a Creative Commons, Attribution Sharealike license.\n\nEnjoy!\nCathal Garvey, of Nexus Cork\nPS: If you like our Dead Drops and want to help us set up more, you can donate via bitcoin: 1LExNvHJS7TBiJgBk4Xo1SdxDBFad3k2Z4","torrent":{"xt":"urn:btih:3a518fe2bd2385a9a643da56782bd80a2ff3ef52","amp;dn":"Cork+USB+Dead+Drops+-+Freshly+Minted+Content","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a518fe2bd2385a9a643da56782bd80a2ff3ef52","infoHashBuffer":{"type":"Buffer","data":[58,81,143,226,189,35,133,169,166,67,218,86,120,43,216,10,47,243,239,82]},"announce":[],"urlList":[]}}