{"title":"Salim Langde pe mat ro","uid":5107827,"size":272758139,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3a5b11e30ef5cc9f08e6d4d44f6596f62988df6f&amp;dn=Salim+Langde+pe+mat+ro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"totallamp","files":2,"time":1254511923,"description":"\n\nSalim has been born lame (slightly), and lives with his mom, dad, and a sister who is old enough to be married. He and his dad search around for a suitable groom for her, and he meets Aslam. Salim rejects Aslam, as Aslam is not making enough wages that are commensurate with his qualifications. Salim meets with some gangsters, who promise him that they will make him rich soon, and all he has to do is incite religious riots, pitting Hindus against the Muslims, and he will be well rewarded. Salim has always wanted to be rich, but will he take this opportunity to be wealthy?\n\n\n\n\nThe film explores the psyche of the minority community in a city/country. Salim is uneducated, his father could only afford to educate his eldest son, who dies of a shock while working as an electrician. Salim, the younger son is uneducated so falls into bad company and is almost on the verge of getting integrated into the Bombay underworld. Some events make him realise that he must change and earn an honest living... his quest to earn clean, white money is poignant. He is so enmeshed in this bad world that getting out of it is going to be difficult. His pain becomes almost palpable.\n\n\n","torrent":{"xt":"urn:btih:3a5b11e30ef5cc9f08e6d4d44f6596f62988df6f","amp;dn":"Salim+Langde+pe+mat+ro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a5b11e30ef5cc9f08e6d4d44f6596f62988df6f","infoHashBuffer":{"type":"Buffer","data":[58,91,17,227,14,245,204,159,8,230,212,212,79,101,150,246,41,136,223,111]},"announce":[],"urlList":[]}}