{"title":"CaptureXT Screen Capture 2.4-serial incl","uid":5004844,"size":3659320,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3a8374baeaadb688499c9e71c615475e9faa9d7d&amp;dn=CaptureXT+Screen+Capture+2.4-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jmb2012","files":2,"time":1247677307,"description":"Belltech CaptureXT is a professional quality screen capture program for Windows. Capture any part of your computer screen, edit in several ways, apply effects to enhance communication and share easily. Put text, lines, arrows, translucent shapes to illustrate your ideas easily and effectively. Save your work in popular image formats (jpg, gif, bmp, png) or email it or paste to your presentations, manuals, marketing materials, web pages.\n\nProduct Highlights:\n\n    * Capture is easy: Screen capture with CaptureXT is easy as 1-2-3. Just click the capture button and you are done. You can activate capture with hotkeys, or access capture menus from try.\n    * Capture any shape: You don't need to limit your capture with a rectangular area. Capture any polygonal region, circular area or any freehand region.\n    * Put text, balloons, shapes to convey the message: Put text with any font and color. Rotate the text or apply transparency to text. Add any rectangle, circle, freehand shape and filled colors ... opaque or translucent. Add stamp or callout shape to express effectively.\n    * Use high-lighter, arrow to pin-point: Use the highlighter tool button to highlight any area of your captured image. Place arrows, lines to pin-point the area of interest, or use eraser to remove any sensitive information.\n    * Amazing Edge Effects: CaptureXT can add spectacular edge effects to your capture. Add torn edge, saw edge, shark edge, wave edge, beveled edge and more. These edge effects bring professional look to your capture and a good idea to use them in presentations, web pages etc.\n    * Apply shadow for professional presentation: You can apply real-world shadow to your captured image. Also you can choose your shadow color, shadow size or background color. Simple to use yet so powerful!\n    * Put caption, time-stamp for convenience: Putting caption and time stamp is a great idea for software engineers and web site tester who want to use this program for sharing error screens. CaptureXT can do that easily, along with user name, computer name etc.\n    * Professional image editing: You can also use this application for professional image editing. Open your image, adjust brightness/contrast, resize, rotate, flip or apply effects like blur, sharpen, emboss and more.\n    * Share - email or save as image: After your capture and editing is complete, you can copy-paste it to your presentation or save as popular image format (jpg, gif, bmp, png) or quickly send to someone by email.\n\n\nSystem Requirements:\n-Windows Vista/XP/98/ME/2000/NT/2003\n-About 10MB of hard-disk space ","torrent":{"xt":"urn:btih:3a8374baeaadb688499c9e71c615475e9faa9d7d","amp;dn":"CaptureXT+Screen+Capture+2.4-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a8374baeaadb688499c9e71c615475e9faa9d7d","infoHashBuffer":{"type":"Buffer","data":[58,131,116,186,234,173,182,136,73,156,158,113,198,21,71,94,159,170,157,125]},"announce":[],"urlList":[]}}