{"title":"Mitchel Musso - The In Crowd","uid":5108079,"size":139757572,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3aa5fd90d1d79b9785b0c7e29ea53ec64b916ea8&amp;dn=Mitchel+Musso+-+The+In+Crowd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1254544750,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nMitchel Tate Musso (born July 9, 1991) is an American actor and musician. Musso is perhaps best known for his role as Oliver Oken in the Disney Channel sitcom, Hannah Montana and Jeremy Johnson in the Disney Channel animated series Phineas and Ferb. In other works, he provided his voice of DJ for the computer animated film, Monster House and also starred as Raymond Figg in the Disney Channel Original Movie, Life Is Ruff which was released on July 15, 2005. Musso's self-titled debut album was released on June 2, 2009.\n\nMusso sang a remixed remake of the song &quot;Lean On Me&quot; for the Disney film, Snow Buddies; the music video is included on the DVD and the song is included on the Radio Disney Jams 10 CD. Musso also sang the song &quot;If I Didn't Have You&quot; with Hannah Montana co-star Emily Osment for the DisneyMania 6 CD. For their 2009 Disney Channel Original Movie, Hatching Pete, Musso teamed up with co-star Tiffany Thornton, from Sonny With A Chance, to record a song called &quot;Let It Go&quot; that was used in the film. The two also worked on a music video for the song which was released to Disney Channel. Musso also recorded a song called &quot;The Girl Can't Help It&quot; for another Disney Channel Original Movie, Princess Protection Program. &quot;Let it Go&quot;and &quot;The Girl Can't Help It&quot; will be on the Disney compilation album, Disney Channel Playlist, which was released on June 9, 2009.\n\nIn a studio effort, Musso released his self-titled debut album on June 2, 2009. His debut single, &quot;The In Crowd,&quot; a cover of a John Hampson song, premiered on Radio Disney on December 5, 2008. The song is also featured on Radio Disney Jams, Vol. 11. His second single, Hey, was released on May 15, 2009 on Radio Disney with an accompanying music video that premiered on Disney Channel.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3aa5fd90d1d79b9785b0c7e29ea53ec64b916ea8","amp;dn":"Mitchel+Musso+-+The+In+Crowd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aa5fd90d1d79b9785b0c7e29ea53ec64b916ea8","infoHashBuffer":{"type":"Buffer","data":[58,165,253,144,209,215,155,151,133,176,199,226,158,165,62,198,75,145,110,168]},"announce":[],"urlList":[]}}