{"title":"Amorphis - Silver Bride","uid":5139674,"size":125749252,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3ad125d274cfe68e960e9fa5b2822f8cf8ece852&amp;dn=Amorphis+-+Silver+Bride&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1256810652,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nAmorphis is a Finnish metal band started by Jan Rechberger, Tomi Koivusaari, and Esa Holopainen in 1990. Initially, the band was a death metal act, but on later albums they evolved into playing other types of genres. They frequently use the Finnish national Kalevala as a source for their lyrics.\n\nSkyforger is the ninth studio album by Finnish heavy metal band Amorphis. Like the previous album, the lyrics to Skyforger are English translations of Finnish poems based on the Kalevala and written by Pekka Kainulainen. Unlike the two previous albums, it is based on different parts of several episodes, but all told from a single character's point of view. In this sense it is a return to Tales from the Thousand Lakes which told stories from different parts of the Kalevala. The last two albums focused on Kullervo and LemminkÃƒÂ¤inen, respectively, and this one focuses on Ilmarinen.\n\nLike Amorphis's previous two albums, Eclipse and Silent Waters, Skyforger is a concept album and was recorded at Sonic Pump Studios in Helsinki.\n\nIn addition to a regular edition, the album was also released in a limited digipak edition which included the bonus track &quot;Godlike Machine&quot;. Initially, this digipak edition caused controversy because of sound level fluctuations during the tracks &quot;My Sun&quot; and &quot;Skyforger&quot;, but Nuclear Blast has since remedied the problem by promising replacement CDs.\n\nOn April 22, 2009, &quot;Silver Bride&quot; was released as a Finland-only single, peaking at number 1. The music video for the single premiered on May 11, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3ad125d274cfe68e960e9fa5b2822f8cf8ece852","amp;dn":"Amorphis+-+Silver+Bride","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ad125d274cfe68e960e9fa5b2822f8cf8ece852","infoHashBuffer":{"type":"Buffer","data":[58,209,37,210,116,207,230,142,150,14,159,165,178,130,47,140,248,236,232,82]},"announce":[],"urlList":[]}}