{"title":"Push.2009.iTAL.DVDRip.XviD-Republic[volpebianca]","uid":5018780,"size":1467711488,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3af52bb413300f65b15d6df658e1a8dc235378d1&amp;dn=Push.2009.iTAL.DVDRip.XviD-Republic%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Volpebianca","files":2,"time":1248356797,"description":"::: Scheda del film :::\n\nRegia: Paul McGuigan\nSceneggiatura: David Bourla\nAttori: Dakota Fanning, Camilla Belle, Chris Evans, Djimon Hounsou, Cliff Curtis, Joel Gretsch, Neil Jackson, Scott Michael Campbell, Brandon Rhea, Corey Stoll, Nate Mooney Ruoli ed Interpreti\nFotografia: Peter Sova\nMontaggio: Nicolas Trembasiewicz\nMusiche: Neil Davidge\nProduzione: Infinity Features Entertainment, Icon Productions, Summit Entertainment\nDistribuzione: Eagle Pictures\nPaese: USA 2009\nUscita Cinema: 27/03/2009\nGenere: Azione, Fantascienza, Thriller\nDurata: 111 Min\n\n::: Trama del film :::\n\nick Gant ÃƒÂ¨ un telecinetico di seconda generazione, capace di muovere gli oggetti con la sola forza della mente. Traumatizzato dalla morte del padre, avvenuta dieci anni prima ad opera di una spietata agenzia governativa, Nick si ÃƒÂ¨ ritirato a vivere in un quartiere popoloso di Hong Kong, spendendo il suo tempo tra scommesse ai dadi e raggiri. Avvicinato da Cassie, un'adolescente chiaroveggente e saputella, viene coinvolto in un gioco pericoloso. DovrÃƒÂ  recuperare una valigia contenente un farmaco in grado di aumentare prestazioni e poteri in soggetti con capacitÃƒÂ  paranormali. Non sarÃƒÂ  sempre facile eludere la sorveglianza e sfuggire ai poteri di spietati segugi, capaci di prevedere il futuro, di controllare le menti e di influenzare le azioni altrui. Ma Nick e Cassie hanno un piano, un disegno ed un segreto.\nNasce da esperimenti eugenetici autorizzati dalla Germania nazista e portati avanti dalla CIA e da altre agenzie britanniche, canadesi e delle Nazioni Unite, questo minestrone di fantascienza, avventura, spionaggio, horror, azione, che sbaglia tutte le dosi e mette tutta la pesantezza del digitale al servizio di un autore leggero. Se per il progetto MK-Ultra le agenzie di spionaggio offrirono pubblicamente una giustificazione razionale, la necessitÃƒÂ  di contrattaccare e competere con le capacitÃƒÂ  di controllo mentale del nemico sovietico e comunista, piÃƒÂ¹ difficile ÃƒÂ¨ trovare una spiegazione a questa grottesca rappresentazione di virtÃƒÂ¹ guerriere e patriottiche contro il sistema governativo costituito e contro l'invasore asiatico.\nCon una negligenza da blockbuster Push alterna sequenze di azione a dialoghi che vorrebbero essere emblematici di una vera e propria visione del mondo, della fragilitÃƒÂ  delle relazioni umane, della difficoltÃƒÂ  di saper scegliere la cosa giusta nei momenti piÃƒÂ¹ difficili. Nato da un'idea originale di David Bourla e ambientato a Hong Kong dentro un presente che sembra giÃƒÂ  futuro, il film di Paul McGuigan ha piÃƒÂ¹ di qualche debito con i mutanti X-Men della Marvel, a partire dalla maledizione di un corpo incontrollabile.\nCome le creature di Stan Lee, i protagonisti paranormali di Push sono superuomini umani troppo umani, una comunitÃƒÂ  di diversi prigioniera dei poteri del proprio corpo o della propria mente e incapaci di integrarsi nell'umanitÃƒÂ .\nIl confronto si limita a questo perchÃƒÂ© il regista ÃƒÂ¨ incapace di servire e salvaguardare la causa della &quot;diversitÃƒÂ &quot;, girando un film rumoroso e manicheo, uno spettacolo effettato che non avanza ipotesi alcuna, ripresentando l'eterno scontro tra integrazionisti (la Divisione) e separatisti (Nick, Cassie e compagni), tra pacifisti indulgenti e attivisti violenti. Il film non eleva mai il racconto dai toni di una esibita convenzionalitÃƒÂ  drammaturgica e a latitare ÃƒÂ¨ soprattutto la profonditÃƒÂ  di intenti e di argomenti.\nIl tentativo del regista e del protagonista, orfano pallido e battuto dei Fantastic Four, di tenere desti gli spettatori con le imprese, con le urla degli insopportabili bleeder-brothers e con i &quot;botti&quot; delle sparatorie risulterÃƒÂ  vano. Dopo la visione reclamate un &quot;wiper&quot;, il superuomo che puÃƒÂ² cancellare qualsiasi memoria.\n\nQualitÃƒÂ  audio e video Ottima da DVD.","torrent":{"xt":"urn:btih:3af52bb413300f65b15d6df658e1a8dc235378d1","amp;dn":"Push.2009.iTAL.DVDRip.XviD-Republic%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3af52bb413300f65b15d6df658e1a8dc235378d1","infoHashBuffer":{"type":"Buffer","data":[58,245,43,180,19,48,15,101,177,93,109,246,88,225,168,220,35,83,120,209]},"announce":[],"urlList":[]}}