{"title":"J. River Media Center 16.0.81 FINAL-MPT [ak]","uid":6398837,"size":21068963,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3c5ead0a3fdc388f098248b429abe38709ce0f1f&amp;dn=J.+River+Media+Center+16.0.81+FINAL-MPT+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1305605963,"description":"J. River Media Center 16.0.81 FINAL-MPT\n\nJ.River Media Center has a streamlined user interface designed to make it even easier to organize, find and play your digital files, and to connect to hardware devices. All-in-one media management app turns any Windows PC into an entertainment hub for complete control of your digital media. It connects PC to stereo, TV, remote control devices, digital cameras, scanners, and portable MP3 players. It plays all media, rips, burns, and organizes all your music, images, and video. MC encodes and plays all popular media formats. Powerful utilities include Media Server for streaming music and images to remote PCs.\nMusic, photos and video - all with one program! Connect your PC to your home entertainment hardware and control it all with a remote! Load your music on your iPod while you watch TV! All easily done with Media Center! Copy music from MEDIA CENTER to a portable digital audio player or move digital camera photos into MC's powerful image library.\nRecord your favorite shows and watch them on your TV. More than one soundcard? Play different music simultaneously in different rooms. MC's Media Server can even stream your music to your PC at work!\nJ. River Media Center Features:\nAudio\n* Native support of DirectShow DSP filters\n* Audiophile -- WASAPI exclusive output using high-end USB DACs\n* Audiophile -- Added ability to play files from memory instead of disk\n* Audiophile -- Support for high end USB DAC's with WASAPI\n* Headphone DSP makes listening more natural and comfortable.\n* /SoundcardSwitch command for the launcher (MC14.exe), allows soundcard selection on Vista and W7\n* 3D album view adjusts text size to display more tracks when necessary\n* 3D album view allows playing, adding, shuffling, and adding as next to play\n* Improved tagging and tag compatibility\nImages\n* Image Preview allows zoom from a thumbnail to rotate, delete, compare, edit, and more\n* Image thumbnail frames (optional)\n* Photoshop PSD file support\n* Single command copy / send to an editor like Photoshop, and stack new image with original\nVideo\n* Video tagging using sidecar files\n* Chapter Support for MKV and MP4\n* Chapters added to On Screen Display\n* Info Panel displays metadata\nTelevision\n* Added new &quot;watched&quot; column to metadata\n* EPG can automatically retrieve XMLTV data\n* Automatic correlation of XML channel names and MC channel names\n* Info Panel displays metadata, including TV program art\n* TV program art from YADB\nTheater View\n* Watch Hulu and YouTube from Theater View\n* Customizable nested views in Theater View\n* Customizable File Info panel to display metadata\n* Speed and quality enhancements\n* Custom backgrounds\n* Touch screen support\n* On screen clock\nRemotes and Servers\n* Wiki articles: Remotes and Servers\n* Remote Relay using IR transceivers for controlling a set top box or receiver\n* Remote Setup Wizard\n* Media Center Remote learning and blasting\n* Media Center can connect to another Media Center to act as a remote (TRemote)\n* New HID remote control plug-in -- supports shortcuts with keyboard, mouse, gamepad\n* Remote control with REST based Web Service Interface in Library Server\n* Library Server supports read and write to allow for shared, multi-user database access\n* DLNA added to the UPnP Server\n* Library Server clients can write changes back to server\n* Library Server connections allow playback on server as Playing Now zones\nOptimization\n* Faster file import on multi-core systems\n* Faster drawing on multi-core systems\n* Faster image rendering\n* Faster MP3 ID3v2 tag reading\nGeneral\n* New import wizard finds and suggests folders to import\n* Animated scrolling in lists and trees\n* Improved search box suggestion\n* New Media Center 14 Service runs when the player is running to allow talking to hardware (for remotes, portable devices, etc.) when UAC is enabled.\nHomepage - http://www.jrmediacenter.com\n\n","torrent":{"xt":"urn:btih:3c5ead0a3fdc388f098248b429abe38709ce0f1f","amp;dn":"J.+River+Media+Center+16.0.81+FINAL-MPT+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c5ead0a3fdc388f098248b429abe38709ce0f1f","infoHashBuffer":{"type":"Buffer","data":[60,94,173,10,63,220,56,143,9,130,72,180,41,171,227,135,9,206,15,31]},"announce":[],"urlList":[]}}