{"title":"Taylor Swift - Change (Live)   (2nafish)","uid":5179036,"size":156389380,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3c72c102abc0c14d4413075d9a997b9feed016a1&amp;dn=Taylor+Swift+-+Change+%28Live%29+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259137121,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nA live performance by Taylor Swift - Change from the show CMT Studio 330 Sessions.\n\n\n&quot;Change&quot; is a single by country pop artist Taylor Swift. It was released to iTunes on August 8, 2008, as part of the compilation album &quot;AT&amp;T TEAM USA Soundtrack&quot;. It also appears on her second studio album, Fearless.\n\nSwift was quoted on the AT&amp;T Blue Room site as saying that she had originally written the song &quot;the day after she won the CMA Horizon Award...about being on a small record label in this huge music industry.&quot; She also said it has an &quot;alternative meeting for competition...the Olympics is either make it or break it, and this song encompasses that.&quot; \n\n&quot;Change&quot; initially &quot;bubbled under&quot; the Billboard Hot 100 chart, debuting at number 20 on Billboard's Bubbling Under Hot 100 chart in the issued dated August 23, 2008. The following week, the song made a strong debut onto the Hot 100 at number ten, spurred by strong digital sales and a number three debut on Billboard's Hot Digital Songs chart.\n\nFearless is the second studio album by American country pop artist Taylor Swift, and was released on November 11, 2008 on Big Machine Records. The album debuted at number one on the U.S. Billboard 200, selling 592,304 copies in its first week, the best first-week sales for a female artist in 2008. Fearless became the first album to sell one million copies in 2009. As of September 2009, the album has been certified 4x Platinum by the RIAA.\n\nThe album's lead single, Love Story, was her first song to achieve commercial success outside the United States; It reached number one in Australia and number two in the United Kingdom. The third single, &quot;You Belong with Me&quot;, has become the biggest hit of Swift's career domestically, and became the highest charting country single since 2000, peaking at number two on the Billboard Hot 100. The album topped the Billboard 200 for 11 non-consecutive weeks and topped the Billboard Top Country Albums for 26 non-consecutive weeks. The album was re-released as Fearless: Platinum Edition with six new songs on October 26, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3c72c102abc0c14d4413075d9a997b9feed016a1","amp;dn":"Taylor+Swift+-+Change+%28Live%29+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c72c102abc0c14d4413075d9a997b9feed016a1","infoHashBuffer":{"type":"Buffer","data":[60,114,193,2,171,192,193,77,68,19,7,93,154,153,123,159,238,208,22,161]},"announce":[],"urlList":[]}}