{"title":"N.E.S. Emulator with 661 games[tim225]","uid":6341860,"size":144228765,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3d4ac5bcd8223c68f27b82e135719e92a3f224f0&amp;dn=N.E.S.+Emulator+with+661+games%5Btim225%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tim2251337x","files":692,"time":1303701179,"description":"The Nintendo Entertainment System (also called NES or Nintendo) is an 8-bit video game console that was released by Nintendo in North America during 1985, in Europe during 1986 and Australia in 1987. In most of Asia, including Japan (where it was first launched in 1983), China, Vietnam, Singapore, Middle East and Hong Kong, it was released as the Family Computer.\n  As the best-selling gaming console of its time, the NES helped revitalize the US video game industry following the video game crash of 1983, and set the standard for subsequent consoles of its generation. \nJnes is a NES emulator for Microsoft Windows. It is coded by Jabo, who is known for his work on Project64, a Nintendo 64 emulator. Using DirectX for hardware acceleration, Jnes also features online play with Kaillera, and the ability to use codes for cheat devices like the Game Genie and Pro Action Replay. It also has the ability to use a mouse like a zapper. Jnes is known as one of the most accurate NES emulators for Windows.\n This Emulator works with all windows platforms\n661 games are included in this pack(with no duplicates)\nNo installation needed\nOpen the emulator folder and double-click the jnes app\nGuide the directory to the NES folder if needed\nThen choose your game\nCheck out the file list on this page to see the individual games","torrent":{"xt":"urn:btih:3d4ac5bcd8223c68f27b82e135719e92a3f224f0","amp;dn":"N.E.S.+Emulator+with+661+games%5Btim225%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d4ac5bcd8223c68f27b82e135719e92a3f224f0","infoHashBuffer":{"type":"Buffer","data":[61,74,197,188,216,34,60,104,242,123,130,225,53,113,158,146,163,242,36,240]},"announce":[],"urlList":[]}}