{"title":"Asparagus+Joy Street (S Pitt)","uid":4993422,"size":333331280,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3d8586ec91150db3d1d4718f946d6065d0bc8c2b&amp;dn=Asparagus%2BJoy+Street+%28S+Pitt%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"les907","files":1,"time":1247159822,"description":"ASPARAGUS\n\nI thoroughly enjoyed this short, although some may not., 27 October 2001\n9/10\nAuthor: ellis1138 from NJ, USA\n\nI found the images to be insightful, and was glad to see that the director was not afraid to portray the feminine in depth. It's very hard to explain, since this short is an abstract, but I enjoyed it thoroughly. Some people may be uncomfortable with the overt sexual imagery, though, especially the scene in the garden. \n\nJOY STREET\n\nLight at the End of the Bowl, 2 July 2007\n10/10\nAuthor: Tiskit Tothead (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;aadec2cfdec5dec2cfcbced9ead3cbc2c5c584c9c5c7&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;) from Too-Stoned, Arizona\n\nThe next time you draw in a lung full, thank the lucky stars dancing across your vision for the animation of Suzan Pitt. Because of her revolutionary cartoons, your green sticky landscape is oh so much richer and your fuzzy red hair flecked future is all the fatter. Joy Street even opens with the image of glowing threads of smoke lighting up dark alleys, an image that should &quot;resinate&quot; with the Herbal-American viewer. In fact, I believe this nine-leaf masterwork of the nineties holds a key position in the cultural history of the Herbal-American community. This film, which some of you smoked out to back in the day on the classic VHS collection Cartoon Noir, is a splendid visualization of why we smoke so much of this fine green eye medication in the first place: to enhance the inspirational aspects of life in order to battle with modern despair. Pitt gets despair right on: the closed in feeling of alienation, inner pain and hopelessness that can swallow up one's reality, especially when enhanced with alcohol and tobacco, is vividly recreated here, quite a feat for animation. In fact, some dopers out there will get flat-out bummed by the depression expression of the suicidal main character and wonder why I gave this the coveted nine-leaf rating. All I can say is hang in there, as many high-leaf viewing experiences have dark valleys that need to be traveled through, like the evil forest scene in Disney's Snow White (seven leaves) or the part where the son gets thrown in the incinerator by his dad in Pot, Parents and the Police (eight leaves). So hold tight and draw deep, cause the cartoon mouse ashtray soon comes to life, turning the black turtleneck of misery inside out. Here Suzan Pitt does her riff on the classic genre of still objects coming to life at night and partying, and what a riff it is. How many times have you been way past blue, took a big, fat toke, then suddenly noticed a small detail of your existence that makes everything seem suddenly worthwhile? That's what you get here. Pitt even includes a rain forest of inspiration for the viewer to play with, crafted from her travels in Central America, and it's a blast. Don't linger over the ape smelling the flower, though, as those of you who have experienced Pitt's other classic pieces of animation will no doubt read sexual connotations in the image. Now that will bend your head. Nine Leaves: Atomic. A perfect drug movie. Like going to another planet on your couch. ","torrent":{"xt":"urn:btih:3d8586ec91150db3d1d4718f946d6065d0bc8c2b","amp;dn":"Asparagus%2BJoy+Street+%28S+Pitt%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d8586ec91150db3d1d4718f946d6065d0bc8c2b","infoHashBuffer":{"type":"Buffer","data":[61,133,134,236,145,21,13,179,209,212,113,143,148,109,96,101,208,188,140,43]},"announce":[],"urlList":[]}}