{"title":"Kodiyettam","uid":5021240,"size":1240141480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3e6e5acdb87aaaadb12e79d5d665c148c1c0a5c3&amp;dn=Kodiyettam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pcsjith","files":2,"time":1248468766,"description":"Kodiyettam (The Ascent) - 1977\nDir.- Adoor Gopalakrishnan \n\nLanguage- Malayalam (Kerala, India)\nSubtitle- English\n\nNo. of Files- 2\n\nKodiyettam01.dat\nKodiyettam02.dat\n\nAdoor's second feature film made five years after Swayamvaram achieved commercial success in Kerala, while reaching an artistic height. \n\n  &quot;Its structure is that of a festival in a village temple. I wanted to create an intimate experience of everyday rural life. It is structured in such a way as to look natural, as if there are no outside interventions. During the course of the film, the festival comes full circle, parallel to it is the inner development of the character as well.&quot; \n \nShankaran Kutty lives a childish life even at his mid ages. He ignores his identity as a grown up individual and wanders without taking up any responsibilities and also without reacting to the insults by the society. It is the festive season, the drum beats at the temple, flying kite, and speeding up vehicles that attracts him the most. He begins to come to terms with real human relationships through an encounter with a truck driver. \n\nThe film unfolds at the slow, rhythmical pace of a village festival which provides the opening imagery of the tale. The main character's maturation to adulthood draws parallels to the social and historical changes in Kerala. \n\nKodiyetam won the State award for the best film and the National award for best actor for Gopi in 1977. \n\nDirection &amp; Screenplay: Adoor Gopalakrishnan\nCast: Gopi, Lalitha, Aziz, Thikkurisi Sukumaran Nair, Adoor Bhawani\nCinematography: Mankada Ravi Varma\nEditing: M Mani\n\nAbstract Source- http://www.cinemaofmalayalam.net/kodiyettam.html\n\nIMDB- http://www.imdb.com/title/tt0076277/\n\nThe print quality of the film is not that great, an unfortunate reality of Indian materpieces. Proceed only if you are an afficionado or can overlook the trifles.\nPlease seed if you think more people should watch this. Thank you.","torrent":{"xt":"urn:btih:3e6e5acdb87aaaadb12e79d5d665c148c1c0a5c3","amp;dn":"Kodiyettam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e6e5acdb87aaaadb12e79d5d665c148c1c0a5c3","infoHashBuffer":{"type":"Buffer","data":[62,110,90,205,184,122,170,173,177,46,121,213,214,101,193,72,193,192,165,195]},"announce":[],"urlList":[]}}