{"title":"Moonrise (1948) Dane Clark Eng","uid":6412366,"size":1049907379,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3e81cabd4631a620a137bf209dd4b70f2e8abc04&amp;dn=Moonrise+%281948%29+Dane+Clark+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"johnefp","files":-1,"time":1306041588,"description":"All of his life, Danny Hawkins (Dane Clark) has been taunted and mistreated by most of the people around him, enduring innumerable beatings and other humiliations as a boy because his father was a murderer who died on the gallows. He finds it not much better as an adult, living with his aunt in the small Virginia town of Woodville -- especially when he is contending for the attentions of young schoolteacher Gilly Johnson (Gail Russell) with his boyhood tormentor Jerry Sykes (Lloyd Bridges), whose bullying and arrogance are made worse (and more galling) by the fact that he's the son of the town banker (and its richest man). Sykes picks a fight with Danny and loses for the first time, but he dies in the process. Knowing how the town thinks of him because of his father, Danny tries to hide the body. But for all of his bitterness over how he's been treated, he can't truly escape the feelings of guilt over what he's done -- nor can he escape his fear of what people will probably think. For a time, his new romance with Gilly distracts him, but he's unable to put it out of his mind for long, especially when he's forced to join his good friend Mose (Rex Ingram) on a raccoon hunt that takes them right to the pond where the body is hidden. Soon the sheriff (Allyn Joslyn) is investigating, and he can't help but confer with the one man in town whose judgment he respects nearly as much as his own -- Danny. And when Danny's deaf-mute friend, Billy (Harry Morgan), unknowingly uncovers a key piece of evidence, Danny is pushed almost to the breaking point. He's driven by his own instincts to run away, and invite almost certain capture or death, but Gilly and the sheriff see this as a chance for Danny not only to free himself of the torment over what he's done but from the past that has haunted him and blighted his life -- if only they can reach him and make him understand.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0040607/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0040607/&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/imdbid-40607/sublanguageid-all&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/imdbid-40607/sublanguageid-all&lt;/a&gt;\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:26:31\nMovie complete : Yes\n\n[Video]\nResolution : 704x528  4/3\nCodec : DivX (4 / 5 / 6)\nFPS : 25,00\nBitRate : 1490 Kbps\nQuality Factor : 0,16 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps\n","torrent":{"xt":"urn:btih:3e81cabd4631a620a137bf209dd4b70f2e8abc04","amp;dn":"Moonrise+%281948%29+Dane+Clark+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e81cabd4631a620a137bf209dd4b70f2e8abc04","infoHashBuffer":{"type":"Buffer","data":[62,129,202,189,70,49,166,32,161,55,191,32,157,212,183,15,46,138,188,4]},"announce":[],"urlList":[]}}