{"title":"The Lost Boys (1987)  DVD-R  PAL","uid":5008974,"size":4266799104,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3ec77b8904006fc50f535719993672858d3454d8&amp;dn=The+Lost+Boys+%281987%29++DVD-R++PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Coolguy33","files":-1,"time":1247879589,"description":"The Lost Boys (1987)\n\n\n\nDirected by Joel Schumacher \nProduced by Harvey Bernhard\nRichard Donner \nWritten by Janice Fischer\nJames Jeremias (story and screenplay)\nJeffrey Boam (screenplay only) \nStarring Jason Patric\nKiefer Sutherland\nCorey Haim\nCorey Feldman\nJami Gertz\nEdward Herrmann\nBarnard Hughes\nDianne Wiest \nMusic by Thomas Newman \nCinematography Michael Chapman \nEditing by Robert Brown \nDistributed by Warner Bros. \nRelease date(s) July 31, 1987 \nRunning time 93 minutes \nCountry  United States \nLanguage English \n\n\n\n\nThe Lost Boys is a 1987 American horror film about two young Arizonans who move to California and end up fighting a gang of teenage vampires.\n\nDirected by Joel Schumacher, the film stars Jason Patric, Corey Haim, and Kiefer Sutherland, and co-stars Jami Gertz, Corey Feldman, Dianne Wiest, Edward Herrmann, Alex Winter, Jamison Newlander, and Barnard Hughes.\n\nFollowing the divorce of their parents, Micheal [Jason Patric] &amp; Sam [Corey Haim] Emerson, along with their mother Lucy [Dianne Wiest], move to Santa Carla, California to live with their mother's father, a peculiar old man [Barnard Hughes]. Santa Carla happens to be the murder capital of the world. Santa Carla is a beach town with a boardwalk and the kids that hang out there, including a group of tough kids lead by David [Keifer Sutherland]. While Lucy gets a job working for Max [Edward Herrmann] at the local video store, Sam befriends the Frog Brothers, Edgar [Corey Feldman] and Alan [Jamison Newlander] who inform Sam that Santa Carla is crawling with vampires.\n\nMeanwhile, Michael becomes enthralled by the mysterious &amp; beautiful Star [Jami Gertz], who happens to be the girlfriend of David. David &amp; his gang take Michael to their hideout, which is the remnants of an old hotel that collapsed during an earthquake. While there, Michael inadvertently drinks David's blood, thinking it is wine. Michael starts to develop some side effects - including sensitivity to sounds, a lack of reflection, and even flying. Sam accuses Michael of being a vampire but Michael convinces Sam that he can figure out how to fix it. Instead, Michael sleeps with Star. Sam decides to take matters into his own hands and asks for counsel from the Frog Brothers who promptly tell Sam that the only remedy is to drive a stake in Michael's heart but that Michael may only be a half-vampire, in which case, if the head vampire is killed, Micheal will go back to normal.\n\nMeanwhile, Lucy begins to date Max &amp; thinks that her boys are just having problems dealing with her dating after the divorce. Finally, Michael decides to take Star, along with a little half-vampire boy named Laddie Thompson [Chance Michael Corbitt], from David's clutches and brings Sam &amp; the Frog Brothers with him to kill David &amp; his gang while Michael grabs Star &amp; Laddie. The inexperienced Frog Brothers manage to kill one vampire before waking the bunch &amp; flee into the daylight. David smiles as the group escapes saying &quot;tonight&quot;. Sam, Michael, &amp; the Frog Brothers prepare for the night ahead. They prepare a bathtub full of garlic. They fill squirt guns with holy water. They prepare wooden stakes. Night falls &amp; David &amp; the remainder of his crowd come to Sam &amp; Michael's house to seek vengeance. Sam &amp; Michael take out one of the vampires by electricity and the Frog Brothers are saved by Sam &amp; Michael's dog when the dog knocks a vampire into the bathtub with garlic. Finally, David &amp; Michael face off. Michael kills David by pushing him onto some antlers. The only problem is that Michael doesn't go back to being human. David was not the head vampire.\n\nJust then Lucy comes home with Max from a date. Unseen by Max, Michael &amp; Star hide in the shadows as Max approaches the deceased David. Max appears to be upset by the death. It's then that it is revealed that Max is the head vampire &amp; David &amp; his gang were Max's &quot;children&quot; of sorts. Max wanted David to make Michael &amp; Sam part of the &quot;family&quot; so that Lucy would agree to being with Max knowing what he is. Max wanted Lucy because his boys were in need of a mother. Even though his boys are dead he still wants Lucy. Max takes hold of Sam, telling Lucy that Sam will die if she doesn't come to him. Just then Lucy's father busts into the house in his car equipped with wooden stakes. Max is killed &amp; the day is saved. As Lucy makes sure her boys are okay, the grandfather goes to the kitchen, pops open a beer &amp; says &quot;There's one thing about living in Santa Carla I never could stomach - all the damn vampires.&quot; \n\n\n\n\n\nLanguages: English, French, Italian\nSubs:      English, French, Italian, Dutch, Spanish, Portuguese, Ariabic\n           English For The Hearing Impaired / Italian For The Hearing Impaired\nAspect Ratio: 2.35:1 \nWidescreen 16:9\nPAL\n\n\nUntouched","torrent":{"xt":"urn:btih:3ec77b8904006fc50f535719993672858d3454d8","amp;dn":"The+Lost+Boys+%281987%29++DVD-R++PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ec77b8904006fc50f535719993672858d3454d8","infoHashBuffer":{"type":"Buffer","data":[62,199,123,137,4,0,111,197,15,83,87,25,153,54,114,133,141,52,84,216]},"announce":[],"urlList":[]}}