{"title":"The Living Want Me Dead.avi","uid":6404349,"size":720769024,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f6316aa2c519d39c0a70ec2870446487cb8cfe5&amp;dn=The+Living+Want+Me+Dead.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"petschekr","files":1,"time":1305760105,"description":"It's not uncommon for people to seem a little 'on-edge' come the holiday season, but for mild-mannered Howard Phillips, it just so happens that everyone else is suddenly running right over that edge with bloodshot eyes, foaming mouths, and unstoppable urges to kill...and they're running towards him. It could have something to do with the lack of shopping days left on the calendar, but Howard is betting that his recent visit to a medical testing facility is more likely to blame. Before he can find out what he took and how to stop it, he'll need to go toe-to-toe, or fist-to-teeth, with every bloodlusting living thing between him and quiet spot to put a plan together.\n\nHoward Phillips is having a very bad day. Everywhere he goes, ordinary people suddenly start vomiting around him, before flying into a (literally) murderous rage and trying to kill him. Postmen, gardeners, joggers... even his cat. Sure, it's the silly season and sometimes people get stressed but something is very very wrong here. Maybe he shouldn't have ditched his job as one of those dudes who hold up signs for the latest Christmas bargain, while dressed up as Santa. But hey, the pay sucked, and after taking advice from a hobo (as ya do), Harold decided to be a guinea pig for a medical testing lab. Apparently, it was for one of those new &amp; improved deodorant sprays- y'know, the kind that turns hot chicks into nymphos and throw themselves at you? (me neither actually. Dammit.)\n\nWell... this particular spray, had kinda the opposite effect. And if Harold wants to see in the new year, he better come up with a plan to stay alive...\n\nLength: 23 Minutes\nLanguage: English\nSub-titles: None\n\nEnjoy!\nAnd please seed!","torrent":{"xt":"urn:btih:3f6316aa2c519d39c0a70ec2870446487cb8cfe5","amp;dn":"The+Living+Want+Me+Dead.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f6316aa2c519d39c0a70ec2870446487cb8cfe5","infoHashBuffer":{"type":"Buffer","data":[63,99,22,170,44,81,157,57,192,167,14,194,135,4,70,72,124,184,207,229]},"announce":[],"urlList":[]}}