{"title":"Stolen Babies, Stolen Lives  2009 05 24   CBC  Passionate Eye","uid":5188172,"size":587724800,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3ff129afbed2f8700da4c314232a812c5f761460&amp;dn=Stolen+Babies%2C+Stolen+Lives++2009+05+24+++CBC++Passionate+Eye&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"john1942","files":1,"time":1259561191,"description":"Stolen Babies, Stolen Lives  2009 05 24   CBC  Passionate Eye \n\n\n560 MB/ 00:46:52 /  XviD\n\nPassionateEye.StolenBabiesStolenLives.xvid.avi\n\nImagine how you'd feel if you learned the 'parents' you loved and trusted all your life were actually responsible for kidnapping and murdering your biological parents. That's what's happening in Argentina, 30 years after the end of the Dirty War (1976-81), and the subject of this dramatic documentary and psychological portrait.\n\nStolen Babies, Stolen Lives returns to Argentina 30 years later to tell the emotional story of young men and women who are learning the true story of who they are and what happened to their biological parents. They are the lost children of the &quot;disappeared' (men and women who were kidnapped by the military junta), and now as adults they're struggling to come to terms with the past and reconcile with their lost biological families.\n\nFor some, the nightmare is coupled with the incomprehensible news that the parents who nurtured and cared for them all these years, not only stole them as babies, but are also responsible for killing their mothers shortly after they'd given birth in prison camps.\n\nStolen Babies, Stolen Lives begins by introducing us to Gonzalo and Matias Reggiardo-Tolosa, 30 years old twins who were stolen during Argentina's Dirty War. Today, the man they've called father all their lives Samuel Miara stands accused of terrible war crimes - torture, rape, and murder - yet the twins still love him, and still visit him in prison.\n\nThe documentary also introduces us to Natalia-Suarez Nelson who was also stolen and her mother killed shortly after her birth. For years she protected the parents who stole her by refusing to give the DNA that would prove her birth identity. Recently, her father turned violent against her and Natalia was finally convinced to testify against him and send him to prison.\n\nThe story seems unbelievable. The choices the stolen children are forced to make, heart-rending. The reasons why they'd continue to protect their 'parents' dumbfounding. But as this documentary illustrates, their search for identity and reconciliation is essential both for their own well-being and for the very future of Argentina itself.\n\nWith the participation of acclaimed author Eduardo Galeano. The documentary is directed by Peter Svatek, and produced by Josette Gauthier of Montreal based Triplex films in association with CBC Newsworld and Radio Canada.\n\n &lt;a href=&quot;\nhttp://www.cbc.ca/documentaries/passionateeyemonday/2008/stolenbabies/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cbc.ca/documentaries/passionateeyemonday/2008/stolenbabies/&lt;/a&gt;\n\n\n\n\n","torrent":{"xt":"urn:btih:3ff129afbed2f8700da4c314232a812c5f761460","amp;dn":"Stolen+Babies%2C+Stolen+Lives++2009+05+24+++CBC++Passionate+Eye","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff129afbed2f8700da4c314232a812c5f761460","infoHashBuffer":{"type":"Buffer","data":[63,241,41,175,190,210,248,112,13,164,195,20,35,42,129,44,95,118,20,96]},"announce":[],"urlList":[]}}