{"title":"Datarock - The Pretender [Brand New 2009].mpg","uid":5153070,"size":59611140,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4119c3e6da2bcc41131d8ec83ff24023748d4bf0&amp;dn=Datarock+-+The+Pretender+%5BBrand+New+2009%5D.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"claudeq","files":1,"time":1257685324,"description":"Datarock is a Norwegian electro rock band. The band formed in 2000 as Fredrik Saroea, Ketil Mosnes and Kevin O'Brien and soon hired Tom MÃƒÂ¦land. O'Brien and MÃƒÂ¦land later left the band, but the duo of Saroea and Mosnes continued the project.\n\n\nThe band has released three EPs and their debut album, Datarock Datarock, was released in 2005 in 10 countries on the band's own label, YAP (Young Aspiring Professionals), receiving favourable reviews, especially in the UK. They made an appearance in Australia's Triple J Hottest 100 with the single &quot;Computer Camp Love&quot; in 2005, placing at #12. Fredrick has commented that Australia was the only country to pick up Datarock early aside from their homeland. This song was #88 on Rolling Stone's list of the 100 Best Songs of 2007.\n\nTheir song &quot;Fa-Fa-Fa&quot; was featured in a Coca-Cola advert, and is also featured in NHL 08, FIFA 08 and NBA Live 08. It also appears in The Sims 2: Free Time, and The Sims' video team was asked to create a custom music video for &quot;Fa-Fa-Fa&quot;. Another one of their songs, &quot;New Song&quot;, is featured in Madden NFL 08. In addition, a remix of &quot;I Used To Dance With My Daddy&quot; is featured in Need For Speed: ProStreet and &quot;True Stories&quot; is featured in FIFA 09. Datarock is also featured in FIFA 10 with &quot;Give it Up&quot;\n\n \nDatarock at South by South West\nDatarock was also featured in an Apple advertisement for the fourth generation iPod Nano. The ad showed the song &quot;Fa-Fa-Fa&quot; playing on an orange iPod Nano. The coverart for Datarock Datarock was also shown.\n\nFredrik Saroea also has solo aspirations and has recorded several individual tracks, including a duet with fellow Norwegian pop-star Annie for the song &quot;I Will Always Remember You&quot;, which has been included on later presses of the band's debut LP.\n\nDatarock's song &quot;True Stories&quot;, featuring lyrics made up entirely of Talking Heads song titles, is featured as a promotional download in MP3 format from the Sims 3.\n\n\nEnjoy this catchy song from the new album Red in 2009","torrent":{"xt":"urn:btih:4119c3e6da2bcc41131d8ec83ff24023748d4bf0","amp;dn":"Datarock+-+The+Pretender+%5BBrand+New+2009%5D.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4119c3e6da2bcc41131d8ec83ff24023748d4bf0","infoHashBuffer":{"type":"Buffer","data":[65,25,195,230,218,43,204,65,19,29,142,200,63,242,64,35,116,141,75,240]},"announce":[],"urlList":[]}}