{"title":"Hostel(2005)DVDRip.AC3(ENG)-DROCK","uid":6394168,"size":734670848,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:416af86197ad6155136c9f6a837cabcd0dc65567&amp;dn=Hostel%282005%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1305419842,"description":"Cabin Fever director Eli Roth skips the humor of his freshman feature and goes straight for the jugular in this unrelenting scare-fest about a pair of libidinous American backpackers seeking cheap thrills in the European countryside. Their carefree college days close behind and the responsibility of the real world looming ever closer on the horizon, Josh (Derek Richardson) and Paxton (Jay Hernandez) strap on their backpacks and prepare for a stratospheric last hurrah of booze, babes, drugs, and debauchery halfway across the globe. It's during a visit to Amsterdam that the pair meets up with raucous Icelandic backpacker Oli (Eythor Gudjonsson), and after the three globe-trotting thrill seekers catch wind of a Slovakian city whose male population has dwindled as a result of civil strife -- leaving the ladies ready and willing to accept any male companionship that might turn up at the local hostel -- the trio quickly beats a hasty retreat to the out-of-the-way oasis. Upon check-in, the trio is greeted by a bevy of beautiful locals and is quickly convinced that the hedonistic hideaway is indeed the real deal. Hazily awakening the following morning to find no trace of backpacking buddy Oli, Paxton chalks his former traveling companion's disappearance up to capriciousness and prepares for another day of debauchery, despite Josh's rapidly elevating sense of unease. Now trapped defenselessly in a foreign land without any means of escape and no way of anticipating the unimaginable hell that lies ahead, the pair is plunged into a torturous netherworld where the screams of the damned fill the air with dread and the warm rays of the sun are little more than a fading memory. \n\nRipped with Autogk.\n\nLength: 1 Hour 34 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:416af86197ad6155136c9f6a837cabcd0dc65567","amp;dn":"Hostel%282005%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"416af86197ad6155136c9f6a837cabcd0dc65567","infoHashBuffer":{"type":"Buffer","data":[65,106,248,97,151,173,97,85,19,108,159,106,131,124,171,205,13,198,85,103]},"announce":[],"urlList":[]}}