{"title":"Andy Stanley - Why Worry?","uid":6340911,"size":4681441280,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4181ce1eab9568fea963b4b093ba0e0263e9ade9&amp;dn=Andy+Stanley+-+Why+Worry%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"JudgeNot71","files":1,"time":1303659128,"description":"Why Worry is part of a new video series from Andy Stanley, best-selling author, communicator, and pastor of North Point Community Church in Alpharetta (Atlanta), Georgia. Launched in 1995, North Point Ministries is now one of the fastest growing and most influential Christian organizations in America. Each Sunday, over 25,000 adults attend services at one of three North Point campuses in the Atlanta area, while many more attend North Point's nearly 30 strategic partner churches in the U.S. and around the world.\n\n\n\nWorry. It's universal. It is as much a part of life as breathing. Yet Jesus said, Don't! Don't worry! Easier said than done. In Why Worry, Andy Stanley explores what Jesus had to say about this important topic. You ll discover where worry comes from, why it's so difficult to overcome, and what you can do to conquer worry in your life.\n\n\n\nAndy guides you through one of the Bible's Old Testament stories in which the main character is challenged with a single question a question that brought a new and needed perspective to his worries. This question may be the key to overcoming worry in your own life as well! (Three parts)\n\n1) Devotion Emotion\n2) Switching Sides\n3) Now and Then\n\n** If you enjoy this DVD, please buy it from your local Christian shop or the Zondervan website. Andy's DVDs are reasonably priced, and well worth every dime! ** ","torrent":{"xt":"urn:btih:4181ce1eab9568fea963b4b093ba0e0263e9ade9","amp;dn":"Andy+Stanley+-+Why+Worry%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4181ce1eab9568fea963b4b093ba0e0263e9ade9","infoHashBuffer":{"type":"Buffer","data":[65,129,206,30,171,149,104,254,169,99,180,176,147,186,14,2,99,233,173,233]},"announce":[],"urlList":[]}}