{"title":"Neverending Story trilogie 2Lions-Team","uid":5166767,"size":4617631346,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:41f016725fc4059aece33699548cab34cf6c1958&amp;dn=Neverending+Story+trilogie+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JUULTJE","files":-1,"time":1258451522,"description":"The Neverending Story Ttrilogie op 1 DVD       \n\n \n  The Neverending story trilogie op 1 DVD\nIncl menu\n&quot;De kwaliteit is geen retail, maar nog altijd prima&quot;\n\n\n\n***********************************************************\n\n* The NeverEnding Story I\n\nWest-Duitsland / Verenigde Staten\nFantasy / Avontuur\n102 minuten / 94 minuten (internationale versie)\n\ngeregisseerd door Wolfgang Petersen\nmet Barret Oliver, Thomas Hill en Noah Hathaway\n\nBastian wordt altijd op school gepest. Op een dag, wanneer dit weer gebeurt, vlucht hij naar een boekenwinkel. Als de oude eigenaar een telefoontje krijgt neemt hij het boek mee en laat een briefje achter met het bericht dat hij hem weer terug zal brengen. Hij leest in het oude boek, The Neverending Story, over de jongen die het fantasierijk Fantasia kan redden van boze krachten. Zijn fantasie en de werkelijkheid gaan echter door elkaar lopen.\n\n\nEngliish\n\nBastian is a young boy who lives a dreary life being tormented by school bullies. On one such occasion he escapes into a book shop where the old proprieter reveals an ancient story-book to him, which he is warned can be dangerous. Shortly after, he &quot;borrows&quot; the book and begins to read it in the school attic where he is drawn into the mythical land of Fantasia, which desperately needs a hero to save it from destruction\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1475&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1475&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0088323&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0088323&lt;/a&gt;\n\n***********************************************************\n\n\n* Neverending Story II: The Next Chapter, The (1990)\n\nVerenigde Staten / Duitsland\nFamilie / Avontuur\n90 minuten\n\ngeregisseerd door George Miller (I)\nmet Jonathan Brandis, Kenny Morrison en Clarissa Burt\n\nBastian beland weer in de droomwereld van Fantasia waar hij een dubbele strijd moet leveren: hij moet Fantasia redden voor de macht van een boosaardige tovenares en hij moet de ontbrekende schakels van zijn eigen leven zien te vinden. Natuurlijk staan oude vrienden hem bij: de jonge krijger Atreyu, Falkor de Geluksdraak en Rock Biter.\n\nEnglish\n\nOnce again, Bastian is transported to the world of Fantasia which he recently managed to save from destruction. However, the land is now being destroyed by an evil sorceress, Xayide, so he must join up with Atreyu and face the Emptiness once more\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/4217&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/4217&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0100240&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0100240&lt;/a&gt;\n\n***********************************************************\t\n\n\n* NeverEnding Story III, The (1994) \n\nDuitsland / Verenigde Staten\nAvontuur / Fantasy\n95 minuten\n\ngeregisseerd door Peter MacDonald\nmet Jason James Richter, Melody Kay en Jack Black\n\nBastian heeft er altijd van gedroomd een broertje of zusje te hebben, en als zijn vader eindelijk hetrouwt, gaat zijn wens in vervulling. De nieuwe vrouw van zijn vader heeft namelijk een dochtertje, en Bastian en Nicole kunnen het samen uitstekend vinden. Op een dag wordt Nicole echter vreselijk gepest door een groepje kwajongens, en als het tweetal de boekenwinkel van Karl Konrad Koreander invluchten, ontdekken ze het boek met het Ondeindige Verhaal en vluchten ze naar Fantasia. Helaas komt het boek per toeval in de handen van bendeleider Slip terecht, die eveneens naar Fantasia reist en daar met opzet de hele boel op stelten zet.\n\nEnglish\n\nWhile the first two movies were based on the novel by Michael Ende, this one is only based &quot;on the characters.&quot; It transfers Fantasia into the &quot;real&quot; world. Bastian's dream to get a sibling becomes true when his father re-marries, but soon he has trouble with his new step sister Nicole and with a gang of school bullies, the Nasties. Hiding in the school library, Bastian finds his favorite book of THE NEVERENDING STORY, where it is later found by Slip, the gang leader. The latter recognizes the power of the book and begins to form Fantasia after his bad intentions. When the chaos becomes worse the Child-like Empress requests Bastian to move back to the real world, get the book back and save Fantasia. Accidentally some Fantasia characters travel with him to reality, but get lost in different places. Meanwhile Slip and the other Nasties spread anarchy. Finally, Bastian gets support from Nicole, who begins to believe in the power of Fantasia. Together they are able to solve the situation and become friends.\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/15293&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/15293&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0110647&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0110647&lt;/a&gt;\n\n***********************************************************\n\n\nmet dank aan de makers van deze dvd!!\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Anders\nAudio : English\n \nOndertitels : Nederlands (ingebakken)(hardcoded)\n \nGenre : Avontuur\n \n ***************************************** \n\n\nBrought to you by \n\n2Lions Team\n\n    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions-Team for all your Dutch MOVIES and more \n\n*****************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\n\n\n \n \n \n","torrent":{"xt":"urn:btih:41f016725fc4059aece33699548cab34cf6c1958","amp;dn":"Neverending+Story+trilogie+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41f016725fc4059aece33699548cab34cf6c1958","infoHashBuffer":{"type":"Buffer","data":[65,240,22,114,95,196,5,154,236,227,54,153,84,140,171,52,207,108,25,88]},"announce":[],"urlList":[]}}