{"title":"VMWare workstation 7.1.4 [Rar - MulitLang][TNT Village]","uid":6432523,"size":583545572,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:421c52abae2f7afdd0ddfe18a50ee59f028269c8&amp;dn=VMWare+workstation+7.1.4+%5BRar+-+MulitLang%5D%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DrBald","files":1,"time":1306702345,"description":"\nVMWare workstation 7.1.4 build 385536\n\n\n.: Descrizione del Software:.\nVMware Workstation ÃƒÂ¨ una serie di software sviluppati dalla VMware Inc. che consentono di eseguire pi\u001aÃ€ sistemi operativi in un ambiente virtuale. Il primo vantaggio che si puÃƒÂ² vedere e capire logicamente ÃƒÂ¨ la possibilitÃƒÂ  di poter implementare su una piattaforma con sistema operativo Windows o Linux e con relativo hardware, un numero n di altre macchine virtuali con sistema operativo diverso.\nI software di questo genere vengono definiti virtual machine, macchine virtuali, termine che sta ad indicare la creazione di uno o pi\u001aÃ€ ambienti virtuali in un unico computer, fornisce una completa emulazione dell'hardware senza intaccare le risorse della macchina nativa ed emulando sistemi operativi tra loro differenti. Si puÃƒÂ² pensare che le prestazioni del sistema operativo emulato possano esser minori rispetto a quelle che ha il sistema operativo se fosse eseguito &quot;realmente&quot; ma in realtÃƒÂ  le prestazioni sono comparabili perchÃƒÂ© il sistema ÃƒÂ¨ pensato per essere eseguito su macchine multiprocessore: ogni virtual machine lavora con un core, o lo gestisce in real-time in base a criteri di condivisione e si possono quindi ottenere prestazioni elevate (da sistema nativo).\nVMware riesce ad emulare architetture x86 (con processore Intel Pentium1-4 oppure AMD Athlon) e x86-64 (AMD Athlon 64/ Intel Xeon) ed emula anche processori dual-core.\nVMware ÃƒÂ¨ disponibile per Microsoft Windows, GNU/Linux e Mac OS X. Fornisce la possibilitÃƒÂ , durante la configurazione, di scegliere se creare una sottorete Host-only e una sottorete NAT.\n\n\n.: Scheda del Software:.\nNome:  VMWare Workstation\nOs:  WindowsXP o superiore (32 o 64-bit)\nLingua: Inglese\nAnno: 2011                                    \nVersione: 7.1.4 build 385536\nGenere:  Virtualizzazione\nProduzione:  VMware Inc.\nData di uscita versione base:  29 Gennaio 2010[/SIZE]\n\n.: Requisiti del Software:.\n-&gt;Processore Da 1.3 GHz o superiore (x32 o x64). Supportati sistemi a multiprocessore\n-&gt;Ram 1 GB di RAM\n-&gt;Spazio libero 1 GB\n\n.: Istruzioni per l'uso:.\n-&gt;Estrarre il file\n-&gt;Eseguire il setup del programma\n-&gt;Inserire il seriale quando richiesto\n-&gt;Enjoy\n\n\n----------------------------------------------------------------------------------------------------------------------\n\nVMWare workstation 7.1.4 build 385536\n\n.:Software Description:.\nVMware Workstation is a virtual machine software suite for x86 and x86-64 computers from VMware, a division of EMC Corporation which allows users to set up multiple x86 and x86-64 virtual computers and to use one or more of these virtual machines simultaneously with the hosting operating system. Each virtual machine instance can execute its own guest operating system, including Windows, Linux, BSD variants, and others. In simple terms, VMware Workstation allows one physical machine to run multiple operating systems simultaneously. Other VMware products help manage or migrate VMware virtual machines across multiple host machines. Workstation is sold by VMware; VMware Player is a similar program with fewer features supplied free of charge.\nVMware Workstation supports bridging to existing host network adapters, CD-ROM devices, hard disk drives, and USB devices (including USB Isochronous devices such as webcams, microphones etc), and provides the ability to simulate some hardware. For example, it can mount an ISO file as a CD-ROM, and .vmdk files as hard disks, and can configure its network adapter driver to use network address translation (NAT) through the host machine rather than bridging through it (which would require an IP address for each guest machine on the host network).\nVMware Workstation allows the testing of live CDs without first recording them onto physical discs or rebooting the computer. Multiple successive snapshots of an operating system running under VMware Workstation can be taken, and the virtual machine can be restarted in the state it was in when any snapshot was saved. This is useful for software developers and testers, for environments at risk from virus infection, and for demonstrating software.\nVMware Workstation includes the ability to designate multiple virtual machines as a team which administrators can then power on and off, suspend, and resume as a single object, making it particularly useful for testing client-server environments.\n\n.: Software Sheet:.\nName:  VMWare Workstation\nOs:  WindowsXP o superiore (32 o 64-bit)\nLanguage: Inglese\nYEar: 2011                                    \nVersion: 7.1.4 build 385536\nKind:  Virtulizazion\nProductor:  VMware Inc.\nBase Version Release Date: January, 29th 2010[/SIZE]\n\n.: Software Requirements:.\n-&gt;Processor Da 1.3 GHz or greater (x32 o x64). Multiprocessor system are supported\n-&gt;Ram 1 GB or RAM\n-&gt;Hard Drive 1 GB\n\n.: Instructions:.\n-&gt;Extract the archive\n-&gt;Run program Setup\n-&gt;Insert serial when asked for\n-&gt;Enjoy\n","torrent":{"xt":"urn:btih:421c52abae2f7afdd0ddfe18a50ee59f028269c8","amp;dn":"VMWare+workstation+7.1.4+%5BRar+-+MulitLang%5D%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"421c52abae2f7afdd0ddfe18a50ee59f028269c8","infoHashBuffer":{"type":"Buffer","data":[66,28,82,171,174,47,122,253,208,221,254,24,165,14,229,159,2,130,105,200]},"announce":[],"urlList":[]}}