{"title":"The.Patriot.DVDrip[vice]","uid":5182800,"size":761985911,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:42d843212d13758c8b546395987226f5ed11009c&amp;dn=The.Patriot.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1259327711,"description":"THE PATRIOT DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 02:37:11\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCAST\n\nMel Gibson\nHeath Ledger\nJason Isaacs\nJoely Richardson\nChris Cooper\nTom Wilkinson\nTchÃƒÂ©ky Karyo\n\nPLOT\n\nAt the beginning of the American Revolution, Benjamin Martin is a South Carolina veteran of the French and Indian War and a widower raising his seven children (Gabriel, Thomas, Margaret, Nathan, Samuel, William, and Susan) on his plantation. Gabriel, the eldest, is anxious to join the American forces fighting the British in the Revolutionary War. Knowing war from personal experience, Ben tries to discourage his son's ambitions, but his son enlists anyway.\n\nGabriel returns home some time later, stumbling wounded into the family home and carrying military dispatches. The next day, a military skirmish has the Martins caring for the wounded from both sides. British soldiers - the ruthless Green Dragoons cavalry - arrive and kill the Colonial wounded, burn down the Martin house and arrest Gabriel as a spy, intending to hang him. When Benjamin's next eldest son, Thomas, assaults several British soldiers in an attempt to free Gabriel, he is shot and killed by the leader of the Green Dragoons, Colonel William Tavington.\n\nMaking use of his knowledge of fighting in the wilds, Benjamin and his two younger sons, Nathan and Samuel set forth to ambush the British column in the woods. They kill 20 of the soldiers in an ambush and free Gabriel. All three boys are horrified at their first glimpse of their father's ferocity when he hacks a fleeing soldier to death with a tomahawk. Gabriel rejoins the cause against his father's will again, stating it is his duty as a soldier. Benjamin decides to join as well, leaving the rest of the children in the care of his wife's sister, Charlotte.\n\nContinental Army Colonel Harry Burwell, having fought alongside Benjamin in the French and Indian War, asks him to organize a militia designed to keep British General Cornwallis in the south until the French Navy arrives to assist. French officer Jean Villeneuve, is present to help train the militia.\n\nBenjamin's South Carolina militia uses guerrilla warfare, attacking the British supply lines. Eventually Tavington, who is tasked to find Martin, manages to capture several of Martin's men. Benjamin rides to the British garrison to parlay the release of his men. As he is leaving Tavington recognizes him. In an attempt to aggravate him into a fight, because the rules of war do not permit the British to touch Benjamin unless he shows aggression, Tavington mocks him about the death of Thomas and Benjamin responds by saying, &quot;Before this war is over, I'm going to kill you.&quot;\n\nTo combat the militia, Cornwallis has Tavington track Ben's family to their refuge with Charlotte and burns down her plantation. However, the family escapes, and are led to a safe haven by Gabriel. Gabriel also marries his childhood friend Anne Howard. Soon after, Tavington orders Anne and her family, along with all their fellow townspeople, to be burned alive whilst locked in the church for aiding the Continentals.\n\nA grief-stricken Gabriel rides out with others to avenge their deaths. During the ensuing fight, all of Tavington's Dragoon unit and Gabriel's militia are killed, but in hand-to-hand combat Tavington kills Gabriel with his sabre and escapes. Benjamin is devastated and his zeal for combat extinguished, until he finds a tattered revolutionary flag that Gabriel had mended among his dead son's possessions. He rides after the Continental Army flying the flag and rejoins his militia.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0187393/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0187393/&lt;/a&gt;\n\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:42d843212d13758c8b546395987226f5ed11009c","amp;dn":"The.Patriot.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42d843212d13758c8b546395987226f5ed11009c","infoHashBuffer":{"type":"Buffer","data":[66,216,67,33,45,19,117,140,139,84,99,149,152,114,38,245,237,17,0,156]},"announce":[],"urlList":[]}}