{"title":"The Sounds - No One Sleeps When I'm Awake","uid":4996093,"size":154783748,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4392b09db4acd32d83371747c1add5a0bd92542a&amp;dn=The+Sounds+-+No+One+Sleeps+When+I%5C%27m+Awake&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1247292634,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;No One Sleeps When I'm Awake&quot; is the lead single by Swedish New Wave band The Sounds from their third album Crossing the Rubicon. It was released on 17 April, 2009.\n\nCrossing the Rubicon is the third studio album by Swedish New Wave band The Sounds released on June 2, 2009. On April 17, the first single &quot;No One Sleeps When I'm Awake&quot; was released on iTunes worldwide. The album was available to Spotify Premium customers from May 29, and it was officially released June 2. For their third album, the band dropped all their producers and founded their own label, Arnioki Records, and used their own money to record Crossing the Rubicon.\n\nThe Sounds are a Swedish New Wave band founded in 1999 in Helsingborg. Their musical style mixes punk and pop/Synth-pop influences. Most songs make integrated use of synthesizers. The group is often compared[who?] to New Wave acts such as Blondie, The Cars, the Epoxies and Missing Persons.\n\nTheir debut album Living in America was released in 2002, with the follow up Dying to Say This to You on March 21, 2006. \n\nLead singer Maja Ivarsson is vocal about her ambition, claiming &quot;I want to be the best female vocalist around...of at least this century&quot;. She was featured on Cobra Starship's &quot;Snakes on a Plane (Bring It)&quot;, for the film Snakes on a Plane. In addition to Ivarsson's contribution to the Snakes soundtrack, the entire band is featured as track 6, &quot;Queen of Apology,&quot; remixed by Fall Out Boy's Patrick Stump.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4392b09db4acd32d83371747c1add5a0bd92542a","amp;dn":"The+Sounds+-+No+One+Sleeps+When+I%5C%27m+Awake","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4392b09db4acd32d83371747c1add5a0bd92542a","infoHashBuffer":{"type":"Buffer","data":[67,146,176,157,180,172,211,45,131,55,23,71,193,173,213,160,189,146,84,42]},"announce":[],"urlList":[]}}