{"title":"South.River.GroupDrive.Collaboration.Suite.v6.00.1070.Enterprise","uid":5196871,"size":51331523,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:45f02a34a5ef68b2e809aa1b1e3509e620c76f7f&amp;dn=South.River.GroupDrive.Collaboration.Suite.v6.00.1070.Enterprise&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TvTeam","files":14,"time":1259961833,"description":"B L I Z Z A R D               \n                                              \n                                                        \n                   South River GroupDrive               \n          Collaboration Suite v6.00.1070 Enterprise Edition         \n                                                                       \n             release date: 2009-12-04      supplier: TEAM BLZ           \n                   disks: 11               cracker: TEAM BLZ          \n               protection: Lic/Online Auth       os: WinALL            \n                                                                  \n                                                              \n     \n                  RELEASE INFO               \n       \n                                              \n                                                         \n                                                                \n                                                                    \n                                                                       \n                                                                       \n    GroupDrive Collaboration Suite                                     \n                                                                       \n    GroupDrive is a business-class file and document collaboration     \n    product. Businesses can use GroupDrive to securely collaborate     \n    over the Internet without the inherent problems of e-mailing       \n    attachments. Because your files are stored in a central location,  \n    users always have the most current version of a document. The      \n    GroupDrive Server provides secure file storage and backup for      \n    your important business files and documents.                       \n                                                                       \n    With easy file sharing and real-time document collaboration,       \n    GroupDrive gives your team a secure private business network that  \n    lets you work at the speed of business.                            \n                                                                       \n    The GroupDrive Collaboration Suite consists of 3 components:       \n                                                                       \n    * GroupDrive Server - a secure WebDAV server for storing and       \n      collaborating on files. GroupDrive uses WebDAV over SSL.         \n    * GroupDrive Client - Virtual drive connection to the GroupDrive   \n      server enables users access and save files from within any       \n      Windows application.                                             \n    * GroupDrive Web Interface - A simple and intuitive interface      \n      that allows users to store and collaborate on documents from     \n      any machine with a Web browser and Internet access.              \n                                                                       \n    Access Your Files From Anywhere                                    \n                                                                       \n    GroupDrive provides simple access to your files, from anywhere,    \n    at any time. The GroupDrive Server sits between the Internet and   \n    your data and provides a central, secure method to access your     \n    files from outside the corporate network. Remote workers can       \n    access and share corporate information without expensive VPNs or   \n    remote access software. Students benefit by having access to       \n    class files and assignments, even while off campus. GroupDrive     \n    integrates with existing user authentication servers allowing a    \n    single secure sign-on implementation. Users can access their data  \n    using any Web browser, or for added functionality, by using our    \n    exclusive GroupDrive Virtual Drive technology for Windows.         \n                                                                       \n    Share Documents Easily                                             \n                                                                       \n    Users can easily create shared workspaces. The creator of the      \n    workspace can define the actions that other users can take on the  \n    documents and folders in the workspace. Documents can also be      \n    shared with customers and partners outside of your organization    \n    by sending QuickLinks rather than bulky e-mail attachments.        \n    Keep Important Files Secure                                        \n                                                                       \n    GroupDrive supports encrypted sessions using industry proven SSL   \n    (Secure Sockets Layer), to secure your critical business           \n    documents. GroupDrive also has support for third-party client      \n    certificates, ensuring that your users are being authenticated     \n    prior to access being granted to the GroupDrive server.            \n    Reduce Training and Support Costs                                  \n                                                                       \n    Because GroupDrive is so easy to use, the cost of training is      \n    greatly reduced. Your users can access, edit, and share documents  \n    through a mapped drive letter  the same way that they access      \n    files on their own computers. Users also have the option of using  \n    an intuitive browser interface, allowing them secure access to     \n    documents from any computer.                                       \n                                                                       \n    GroupDrive offers the most mature drive-mapping technology on the  \n    market, a robust and secure WebDAV server and the convenience and  \n    simplicity of a well-designed Web interface.                       \n                                                                       \n                                                                       \n    Advanced Features...                                               \n                                                                       \n    - SSL Support - GroupDrive has built-in SSL (Secure Sockets Layer  \n      protocol) support, ensuring that all traffic between the         \n      GroupDrive Server and client is secure. Includes SSL             \n      certificate support including support for third-party            \n      Certificate Authorities such as Verisign and Entrust.            \n    - Supports SRT's DMZedge Server - Reduce the risk of network       \n      intrusion without having to keep copies of your confidential     \n      business files outside of your firewall. DMZedge allows you to   \n      close all inbound ports in your firewall - GroupDrive will open  \n      outbound ports to the DMZedge Server, which will send user       \n      requests as a response on the outbound channel.                  \n    - Encrypted File System - When used in conjunction with an NTFS    \n      file system and Active Directory server, GroupDrive supports     \n      encrypted file storage, ensuring your files are safe.            \n    - Folder Quotas - By establishing quotas on any given folder,      \n      users can regulate the amount of space that can be used by       \n      other users in a collaborative setting.                          \n    - Cross-platform Access - Access your GroupDrive from anywhere,    \n      anytime, from any Windows, MAC OS/X, Classic Mac 9, UNIX, or     \n      Linux desktop.                                                   \n    - NT Authentication - GroupDrive can be seamlessly integrated      \n      into an existing Windows NT, Active Directory, or LDAP server.   \n      Adding GroupDrive instantly adds full collaboration to the       \n      entire domain.                                                   \n    - Web Browser Interface - Users have anywhere, anytime access to   \n      their files. Using any browser, users can view, share, edit, or  \n      e-mail files.                                                    \n    - Windows Drive Mapping Client - South River Technologies          \n      pioneered the concept of Internet drive mapping, enabling file   \n      access and collaboration as easily as accessing files on the     \n      local PC. GroupDrive lets you collaborate from the familiar      \n      Windows Explorer interface or from within the applications that  \n      you use every day.                                               \n    - Optional Public Access - With the optional GroupDrive Public     \n      Connector Pack, users are able to share a file or folder with    \n      the general public providing non-GroupDrive users access to      \n      their shared information.                                        \n    - Block Level Locking (SimulShare) - GroupDrive provides block     \n      level locking when files are being edited. This enables          \n      multiple users to collaborate in real-time, without getting      \n      locked out of a file, and without overwriting another users      \n      changes.                                                         \n                                                                       \n                                                                       \n    Changes in 6.00                                                    \n                                                                       \n    - New: FIPS compliant SSL engine.                                  \n    - New: Macintosh client..                                          \n    - New: Ability to set a default value for QuickLink expiration.    \n    - Fixed: Security issue with Windows client utility with default   \n      security descriptor.                                             \n    - Fixed: Windows 7 compatability with Windows client utility.      \n                                                                       \n    Changes in 5.11                                                    \n                                                                       \n    - Fixed: DMZ port issue when using both HTTP and HTTPS             \n      redirecting that prevented HTTP from being redirected.           \n                                                                       \n                                                                       \n                                                                      \n                                                                \n                                                          \n                                            \n       \n                  INSTALL INFO                \n       \n                                            \n                                                          \n                                                                \n                                                                      \n                                                                       \n    Run GROUPDRIVE6001070.EXE and follow instructions.                 \n                                                                       \n    Run B-GDCSUITE6001070-PATCH.EXE to eliminate the online            \n    authorization check from the activation procedure.                 \n                                                                       \n    Product Registration Codes...                                      \n                                                                       \n    Server Registration Code: 57-258N05-80308A99-007D06-5432           \n    Client Registration Code: 58-1B9N05-80308A99-007D06-5432           \n    Connector Pack Registration Code: 59-1F3N05-80308A99-007D06-5432   \n                                                                       \n                                                                       \n                                                                      \n                                                                \n                                                          \n                                            \n       \n                    GREETINGS                 \n       \n                                            \n                                                          \n                                                                \n                                                                      \n                                                                       \n      greets fly out to all groups which actively and courageously     \n             work on building better release conditions and            \n                        thus keep the scene up.                        \n                                                                       \n                   special greets to our friends in:                   \n                                                                       \n            absokt - acme - air - digerati - explosion - f4cg          \n         orion - pdx - shock - ssg - tbe - tmg - unleashed - zwt       \n                                                                       \n                                                                      \n                                                                \n                                                          \n                                            \n       \n                     CONTACT                  \n       \n                                            \n                                                          \n                                                                \n                                                                      \n                                                                       \n     We are a closed group, if we need you then we will contact you!   \n                                                                       \n        Software worth using is worth buying.. keep this in mind!      \n                                                                       \n                                                                  \n                                                          \n                                                  \n           nfo updated on       \n                        2009.07.19                 \n                                    \n                                       \n                            INFOFILE DRAWN BY\n                                 H7/ACCESSiON","torrent":{"xt":"urn:btih:45f02a34a5ef68b2e809aa1b1e3509e620c76f7f","amp;dn":"South.River.GroupDrive.Collaboration.Suite.v6.00.1070.Enterprise","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45f02a34a5ef68b2e809aa1b1e3509e620c76f7f","infoHashBuffer":{"type":"Buffer","data":[69,240,42,52,165,239,104,178,232,9,170,27,30,53,9,230,32,199,111,127]},"announce":[],"urlList":[]}}