{"title":"The Righteous Judge (Animated Christian Movie)","uid":5017264,"size":253058382,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:464b037317646f9a5f8c76ad5c32d2565469a3a8&amp;dn=The+Righteous+Judge+%28Animated+Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"IndianChristian","files":3,"time":1248285061,"description":"The Righteous Judge (Animated Christian Movie)\n\nJesus had to struggle with authorities who saw His message as a threat. Caiaphas, the high Judge, tries to trick Jesus into making a judgment against the legal and moral authorities. Jesus responds with the great command: &quot;Let he who is without sin, cast the first stone.&quot; On the street we see Aaron, a poor blind beggar. As two men pass him, one expresses the belief that Aaron's blindness is a punishment from God for his sins or the sins of his parents. Aaron is convinced in his heart and souls that Jesus can heal him, but he cannot find Him. His good parents set off to try to find Jesus. Caiaphas, the high judge of Israel, considers himself to be enormously wise - wiser than Solomon. He sentences a woman, who has been disloyal to her husband, to be stoned to death. News comes that Jesus has healed a man on the Sabbath even though, according to Jewish law, no work is to be done on the Sabbath. Caiaphas angrily sends men to arrest Jesus and they find Him teaching in the temple. He turns aside Caiaphas' men, saying they do not judge righteously. Caiaphas and his men then plot to trick Jesus. They bring the condemned woman to Jesus and ask Him to judge her. If He frees her, He is breaking the law of Moses; to sentence her to be stoned is to break Roman law. Jesus says, &quot;Let him who has no sin cast the first stone.&quot; The members of the mob who gathered to punish her drop their stones to the pavement and disperse. Jesus tells the woman, &quot;Go, and sin no more.&quot; When Aaron finds Jesus, Jesus anoints his eyes with clay and tells him to wash in the pool of Siloam. Aaron does so and his blindness is cured. Caiaphas questions Aaron, who replies that he was healed by Jesus. Caiaphas now knows that Jesus is a greater judge than he.\n \nRuntime: 28 mins\nLanguage: English (No-Subtitles)\nYear: 1990\nMy Rating: 9/10\nQuality: 8/10 \n\nIf financially possible, please buy this CD/DVD to keep Christian films in business. If Christians won't buy Christian films then who will?\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God's word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\nPS: If you need any specific christian movie or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ea83848e838b8489829883999e838b84d8dadad3aa938b828585c48985c48384&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n&quot;Don't ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\t\t\n","torrent":{"xt":"urn:btih:464b037317646f9a5f8c76ad5c32d2565469a3a8","amp;dn":"The+Righteous+Judge+%28Animated+Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"464b037317646f9a5f8c76ad5c32d2565469a3a8","infoHashBuffer":{"type":"Buffer","data":[70,75,3,115,23,100,111,154,95,140,118,173,92,50,210,86,84,105,163,168]},"announce":[],"urlList":[]}}