{"title":"Live Theatre - The Patriots (1976) American Revolution Drama","uid":6447370,"size":1472037954,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:46df1c60d02563c0bb8d6a1ffe01c469ed3a0c38&amp;dn=Live+Theatre+-+The+Patriots+%281976%29+American+Revolution+Drama&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1307309531,"description":"Live Theatre - The Patriots (1976) American Revolution Drama\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1500kbps \nDuration.............: 1:55:07\nResolution...........: 600*464 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 1,471,641,198 \nSubtitles............: NONE\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0254664/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0254664/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/GAIBNaADH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/GAIBNaADH&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Patriots_(play)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Patriots_(play)&lt;/a&gt;\n\n\n\nThe Patriots is an award-winning play written in a prologue and three acts by Sidney Kingsley in 1943. It won the New York Drama Critics' Circle award for Best Play, and ran for 173 performances.\n\nThis absorbing 1976 production of dramatist Sidney Kingsley's historical play centers on the formative days of the United States and the disputes between founding fathers Thomas Jefferson (Robert Murch) and Alexander Hamilton (Philip LeStrange). Although the two men greatly respect each other, the deep-seated clash in their ideologies engenders conflict just as the fledgling country is beginning to take root.\n\n &lt;a href=&quot;\nhttp://countrystudies.us/united-states/history-41.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://countrystudies.us/united-states/history-41.htm&lt;/a&gt;\n\nHamilton vs Jefferson\n\nThe conflict that took shape in the 1790s between the Federalists and the Antifederalists exercised a profound impact on American history. The Federalists, led by Alexander Hamilton, who had married into the wealthy Schuyler family, represented the urban mercantile interests of the seaports; the Antifederalists, led by Thomas Jefferson, spoke for the rural and southern interests. The debate between the two concerned the power of the central government versus that of the states, with the Federalists favoring the former and the Antifederalists advocating states' rights.\n\nHamilton sought a strong central government acting in the interests of commerce and industry. He brought to public life a love of efficiency, order and organization. In response to the call of the House of Representatives for a plan for the &quot;adequate support of public credit,&quot; he laid down and supported principles not only of the public economy, but of effective government.\n\nHamilton pointed out that America must have credit for industrial development, commercial activity and the operations of government. It must also have the complete faith and support of the people. There were many who wished to repudiate the national debt or pay only part of it. Hamilton, however insisted upon full payment and also upon a plan by which the federal government took over the unpaid debts of the states incurred during the Revolution.\n\nHamilton also devised a Bank of the United States, with the right to establish branches in different parts of the country. He sponsored a national mint, and argued in favor of tariffs, using a version of an &quot;infant industry&quot; argument: that temporary protection of new firms can help foster the development of competitive national industries. These measures -- placing the credit of the federal government on a firm foundation and giving it all the revenues it needed -- encouraged commerce and industry, and created a solid phalanx of businessmen who stood firmly behind the national government.\n\nJefferson advocated a decentralized agrarian republic. He recognized the value of a strong central government in foreign relations, but he did not want it strong in other respects. Hamilton's great aim was more efficient organization, whereas Jefferson once said &quot;I am not a friend to a very energetic government.&quot; Hamilton feared anarchy and thought in terms of order; Jefferson feared tyranny and thought in terms of freedom.\n\nThe United States needed both influences. It was the country's good fortune that it had both men and could, in time, fuse and reconcile their philosophies. One clash between them, which occurred shortly after Jefferson took office as secretary of state, led to a new and profoundly important interpretation of the Constitution. When Hamilton introduced his bill to establish a national bank, Jefferson objected. Speaking for those who believed in states' rights, Jefferson argued that the Constitution expressly enumerates all the powers belonging to the federal government and reserves all other powers to the states. Nowhere was it empowered to set up a bank.\n\nHamilton contended that because of the mass of necessary detail, a vast body of powers had to be implied by general clauses, and one of these authorized Congress to &quot;make all laws which shall be necessary and proper&quot; for carrying out other powers specifically granted. The Constitution authorized the national government to levy and collect taxes, pay debts and borrow money. A national bank would materially help in performing these functions efficiently. Congress, therefore, was entitled, under its implied powers, to create such a bank. Washington and the Congress accepted Hamilton's view -- and an important precedent for an expansive interpretation of the federal government's authority.","torrent":{"xt":"urn:btih:46df1c60d02563c0bb8d6a1ffe01c469ed3a0c38","amp;dn":"Live+Theatre+-+The+Patriots+%281976%29+American+Revolution+Drama","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46df1c60d02563c0bb8d6a1ffe01c469ed3a0c38","infoHashBuffer":{"type":"Buffer","data":[70,223,28,96,208,37,99,192,187,141,106,31,254,1,196,105,237,58,12,56]},"announce":[],"urlList":[]}}