{"title":"Corbin Fisher - - - Fucking Brady ((MictrmbL))","uid":5168362,"size":119131646,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:476be8c892fe417bbd1dfe8e06ce7b1b9a66f551&amp;dn=Corbin+Fisher+-+-+-+Fucking+Brady+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mictrmbl","files":32,"time":1258502738,"description":"From the vaults of Corbin Fisher:\n\nAs you're aware from Brady's initial introduction, he's a fan of the site that decided to give applying a shot. I'm glad he did apply, as his handsome face and great body carried with them a lot of potential!\n\nI always get a kick out of it when a fan applies to the site, and on the occasions we've had a guy come out for a shoot that was also a fan I've always had to ask them what they liked about the site, who their favorite guys were, and stuff like that. I can't help but be a bit curious as it's an opportunity to get valuable feedback from a member, as well as possibly get some hot video ideas out of it!\n\nIn Brady's case, he mentioned he really liked some of our recent videos where we skipped a lot of the foreplay and went straight in to some hot, hardcore and intense sex. It made it all seem much more real to him, as that's how sex often goes in peoples' private lives.\n\nWell, all that sounded great to me! With Brady having mentioned, as well, that Lucas is one of his favorite CF studs, I immediately got to pairing these two guys up with one another and having it be another hot and intense pure-sex video. These guys were perfect for that as Lucas is a master at fast and furious pounding and Brady was more than eager to be on the receiving end of something like that! ","torrent":{"xt":"urn:btih:476be8c892fe417bbd1dfe8e06ce7b1b9a66f551","amp;dn":"Corbin+Fisher+-+-+-+Fucking+Brady+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"476be8c892fe417bbd1dfe8e06ce7b1b9a66f551","infoHashBuffer":{"type":"Buffer","data":[71,107,232,200,146,254,65,123,189,29,254,142,6,206,123,27,154,102,245,81]},"announce":[],"urlList":[]}}