{"title":"SAM Discography w/ Goodies (NewestComplete)","uid":5171249,"size":315214970,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:483328e6224ab2ad1ad3e2ccc15bf20fd14c531a&amp;dn=SAM+Discography+w%2F+Goodies+%28NewestComplete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vybes","files":-1,"time":1258700597,"description":"About the torrent:\n\nThis is an updated torrent of the S.A.M discography I posted before. Finally located Demo Lition, along with a bunch of other goodies. Mostly just graphics and such in regards to S.A.M. Along with a PDF of info about the artists!\n\n\n\nAll tracks are labeled and listed correctly, along with ALL tracks have album covers. Even the remixes where labeled from the original albums they are off of. All the tracks vary in quality, I'm sorry for that, but when I had the opportunity to have it in a higher quality, I took it. Other than that I hope you enjoy the songs!!!\n\n\n\nArtist Biography:\n\nArtist's Site: www.project-sam.com\n\nAlready in their early years Joe and Daniel were experimenting with different music genres and found their destination in electronic music. Soon their first output &quot;Demo Lition&quot; was taking the dancefloors by storm. SAM was born. Shortly after the first, self-titled debut album &quot;Synthetic Adrenaline Music&quot; was being released by the Pro Noize label from the Dark Dimensions family. With their clubhit &quot;24 Stunden&quot; SAM entered the German Alternative Charts (DAC) and several other disco- and web charts. That was in 2006. After a short time of absence and development SAM started working on their new release &quot;Destruction Unit&quot;, which is probably being released in June 2008. After the pause, it seems that the music is more powerful and aggressive than ever!\n\n\n~Uploaded by Sayt~\n~ENJOY!~","torrent":{"xt":"urn:btih:483328e6224ab2ad1ad3e2ccc15bf20fd14c531a","amp;dn":"SAM+Discography+w%2F+Goodies+%28NewestComplete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"483328e6224ab2ad1ad3e2ccc15bf20fd14c531a","infoHashBuffer":{"type":"Buffer","data":[72,51,40,230,34,74,178,173,26,211,226,204,193,91,242,15,209,76,83,26]},"announce":[],"urlList":[]}}