{"title":"Janet Jackson - Dream Street","uid":5141381,"size":134377476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:483e66df0a04b476461238f947175a3b6fef3f8c&amp;dn=Janet+Jackson+-+Dream+Street&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1256956669,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nJanet Jackson's second album Dream Street had three single releases, &quot;Two to the Power of Love&quot;, &quot;Fast Girls&quot;, and &quot;Don't Stand Another Chance&quot;. The title track was also scheduled to be released in 1984, but due to low sales the producers canceled these plans. Thanks to the TV show Fame, &quot;Dream Street&quot; did get a music video.\n\n&quot;Dream Street&quot; was Janet Jackson's very first music video. It is a girl's rise to stardom in the 1950's. The video starts off with Janet on a bus to Hollywood, then she finds a roommate and a friend for an apartment. The next scene is of her struggling working in a restaurant having a hard time adjusting, but she meets a man who is attracted to her and gives her a card for an audition. She tries out in a dance audition for Debbie Allen. She gets the part and the video is up to date in 1984, with Janet wearing a red leather outfit doing a great dance routine.\n\nDream Street is the second studio album by American recording artist Janet Jackson, released in 1984.\n\nMore pop than her debut album's &quot;bubblegum soul&quot; feel, the album wasn't the runaway success that Janet's father Joseph thought it would be, peaking at number one hundred forty-seven on the Billboard 200 in 1984. Today, this is Jackson's rarest album and is much sought after by fans, though it is still available as an expensive Japanese import. The album did have one modest hit for Jackson, the top ten R&amp;B single, &quot;Don't Stand Another Chance&quot;, produced by brother Marlon. Also, the video for the song &quot;Dream Street&quot;, her first music video, was shot during the shooting of the TV show Fame.\n\nThis would be the last of Jackson's pre-stardom albums. She would break out of her squeaky-clean sounds with her Control album in 1986.\n\nIt was made available to iTunes on May 15, 2007.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:483e66df0a04b476461238f947175a3b6fef3f8c","amp;dn":"Janet+Jackson+-+Dream+Street","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"483e66df0a04b476461238f947175a3b6fef3f8c","infoHashBuffer":{"type":"Buffer","data":[72,62,102,223,10,4,180,118,70,18,56,249,71,23,90,59,111,239,63,140]},"announce":[],"urlList":[]}}