{"title":"Eric Hufschmid's Painful Questions &amp; Painful Deceptions","uid":5186601,"size":504008466,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4846dce8a40b5146b4d10ac439ecf583c657d8d3&amp;dn=Eric+Hufschmid%5C%27s+Painful+Questions+%26+Painful+Deceptions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nIx76","files":-1,"time":1259455593,"description":"Eric Hufschmid's Painful Questions and Painful Deceptions\n\nwww.erichufschmid.net/\n\ntorrent contents:\n\n* Painful Questions - An Analysis of the September 11th Attack a book by Eric Hufschmid both of the English and Deutsch editions are included\n\n* Painful Deceptions - A video supplement to the book Painful Questions by Eric Hufschmid, (Created 19 April 2003/Edited 30 July 2004) Duration of video: 01:58:08\n\n* Addendum to Book and Film\n\n* Audible interview with the author Eric Hufschmid, Date: 2007.03.16 Duration of audio: 02:41:47\n\n* Extras\n\nBook/Film Description from Amazon.com\n\nThis book has the color photos, diagrams, and the analysis to show that the World Trade Center towers and Building 7 were demolished with explosives that were placed in the buildings in preparation for the 9-11 attack.\n\nThis book is being used by people around the world to support the accusation that the US Government was the primary conspirator in the 9-11 attack.\n\nFor two examples, David Ray Griffin references it in his book &quot;The New Pearl Harbor&quot;, and Andreas von Bulow, a retired German government official, is referencing it in his book published in Germany.\n\nIf you believe Osama bin Laden attacked us without our government's assistance, why not find the flaws in this book, put these accusations to rest, and help restore America's credibility?\n\nIf you already believe the attack was conducted by the U.S. government, this book will help you educate your fellow citizens on the unbelievable corruption in our world.\n\nBook/Film Description from geeman-headquarters.com\n\nEric Hufschmid wrote the book, &quot;Painful Questions,&quot; which deals with the events of 9-11.\n\nEvidence and facts are carefully examined; photos and video captures are analyzed.\n\nEric shows us with graphic (literally), undeniable evidence that the official explanations for the atrocities committed on September 11, 2001 are questionable at best.\n\nHe shows us that there is MUCH more to 9-11 than we are being told by our media and our government.\n\nEric Hufschmid raises some very uncomfortable questions about 9-11; questions so uncomfortable that the magician/comedians Penn and Teller showed the book and urged people, &quot;if you ever see anyone carrying it, push them down a flight of stairs.&quot;\n\nWhy? Look to who cuts their pay checks and it might become clearer.\n\nTo provoke calls of violence against himself and others by representatives of the &quot;entertainment industry,&quot; Eric must have found something to make some powerful people VERY &quot;uncomfortable&quot; indeed.\n\nIf you or I were to attempt to incite violence against fellow citizens we would be arrested as TERRORISTS!\n\nEric then made the DVD movie, &quot;Painful Deceptions&quot; as a video supplement to his book.\n\n\nfor more information visit www.erichufschmid.net/","torrent":{"xt":"urn:btih:4846dce8a40b5146b4d10ac439ecf583c657d8d3","amp;dn":"Eric+Hufschmid%5C%27s+Painful+Questions+%26+Painful+Deceptions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4846dce8a40b5146b4d10ac439ecf583c657d8d3","infoHashBuffer":{"type":"Buffer","data":[72,70,220,232,164,11,81,70,180,209,10,196,57,236,245,131,198,87,216,211]},"announce":[],"urlList":[]}}