{"title":"Iron Maiden - Wrathchild","uid":5138699,"size":109787140,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:48816e33309094065ec51e72d2f6277f1a3ce220&amp;dn=Iron+Maiden+-+Wrathchild&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1256727176,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nKillers is the second album by English heavy metal band Iron Maiden, released on February 2, 1981 in the UK, and June, 1981 in the US. The album was the first of their albums to feature guitarist Adrian Smith, and the last to feature vocalist Paul Di'Anno, who was fired from the band mid-tour due to problems with alcohol and cocaine. This was also the first album produced by veteran producer Martin Birch who went on to produce their next eight albums before retiring after Fear of the Dark in 1992.\n\nBeing the most popular song on the album, &quot;Wrathchild&quot; has been on the set lists of nearly all of the band's concert tours. The song was covered in 2005 by the female tribute The Iron Maidens on their 2007 album Route 666 and again in 2008 by Gallows on the tribute CD Maiden Heaven: A Tribute to Iron Maiden released by Kerrang! magazine.\n\nThe song was also featured in the Playstation 2 game Guitar Hero Encore: Rocks The 80s.\n\nThe album is an unusual one in that it features two instrumentals and was written almost exclusively by Steve Harris with only minor assistance from the rest of the band. Only the title track and &quot;Twilight Zone&quot; received additional writing credits. All of the songs, with the exception of &quot;Murders in the Rue Morgue&quot; and &quot;Prodigal Son,&quot; were written before the release of their debut album (they could not fit all of them on one album, and the songs were later re-recorded anyway to feature Adrian Smith); an early version of &quot;Wrathchild&quot; was featured on the Metal for Muthas compilation.\n\nThe U.S. edition, which came out a few months after its UK release, was initially released on Harvest Records/Capitol Records and subsequently on Sanctuary Records/Columbia Records. &quot;Twilight Zone&quot; was also added to the album.\n\nThe song &quot;Murders in the Rue Morgue&quot; is based on the story of the same name by Edgar Allan Poe. &quot;Rue Morgue&quot; is the name of a fictitious street in Paris, it translates in English as &quot;Mortuary Street&quot;. However, the only reference to the story in the song is when two girls are found dead.\n\nKillers World Tour was the tour supporting the album. This tour would feature the band's first ever concert in America.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:48816e33309094065ec51e72d2f6277f1a3ce220","amp;dn":"Iron+Maiden+-+Wrathchild","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48816e33309094065ec51e72d2f6277f1a3ce220","infoHashBuffer":{"type":"Buffer","data":[72,129,110,51,48,144,148,6,94,197,30,114,210,246,39,127,26,60,226,32]},"announce":[],"urlList":[]}}