{"title":"Gay Pokeporn v1.0 - Gary Oak !ArcHIvEpAQ","uid":6417059,"size":178480613,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:4b93d1ec8e26e2738c0ba3bccbc0953256950d6b&amp;dn=Gay+Pokeporn+v1.0+-+Gary+Oak+%21ArcHIvEpAQ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GaryOakar","files":623,"time":1306204161,"description":"Gary Oak's\n\n   ___       __                            ___           __   _         \n  / _ \\___  / /_____ ___  ___  _______    / _ | ________/ /  (_)  _____ \n / ___/ _ \\/  '_/ -_) _ \\/ _ \\/ __/ _ \\  / __ |/ __/ __/ _ \\/ / |/ / -_)\n/_/   \\___/_/\\_\\\\__/ .__/\\___/_/ /_//_/ /_/ |_/_/  \\__/_//_/_/|___/\\__/ \n                  /_/                                                   \n\nFaggotry Version 1.0\n\nAt the time of this finalized version at 5/21/2011, the Archive has been downloaded 27,047 times.\n\nName: ---------------- Gary Oak !ArcHIvEpAQ\nEmail: --------------- &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;420523303b0d232916302b3224232502252f232b2e6c212d2f&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; (Yes I DO actually check this!)\nUpdates: ------------- http://rs.4chan.org/?s=Gary+Oak&amp;from=ALL\nTwitter: ------------- http://twit ter.com/GaryOakArchive\nRecommended Reading: - http://www.fanfiction.net/s/6640086/1/Saffron\n\n---\nDisclaimer\n\nI, Gary Oak !ArcHIvEpAQ, Do not own any of the materials contained within this large-ish collectionof pokeporn. I am not responsible for how the contents of the contained folders and what Anonymous, namefags, or tripfags do with it. Anyone who uses the material on /vp/ other than in Archive threads does not represent the views, statement, mission, or any related subject involving Gary Motherfuckin' Oak.\n\nIf you wish to have a picture, flash animation, movie, or work of fiction removed please contact me through my email at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;badddbc8c3d5dbd1cec8d3cadcdbddfaddd7dbd3d694d9d5d7&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; and it will be removed for the next version.\n\n---\nIntroduction\n\nThe Pokeporn Archive was made by me to combat all the porn threads and garybombing that was going on many moons ago. I was tired of seeing tits and sex (surprising, I know. But it's actually possible to get sick of looking at porn), and gary spam everywhere all days of the week. So one day I decided to make this to fight back indirectly. It works because it pretty much holds all the pokeporn a person would ever need and more, so it removes the necessity of threads. Posting the links around helps because then it gives it to more people who would then stop posting \n(Theoretically). Garybombing never worked because it's 4chan and people do things out of spite, or anger.\n\nNow, I know that people want to fap, and I honestly don't give a shit if you post porn on /vp/. But you should all remember. Porn is fine in moderation (One thread at a time, and spoilered), but when you get to the levels of 8 threads a day all over the damn place, then you know you have a problem with the board. And honestly, I know it is incredibly hypocritical for me to make threads ABOUT porn when I even say that I don't want it all over /vp/. But hey, what works right?\n\nI'm still unsure if this ever made an impact or not. Mostly due to the volatile nature of 4chan in general. But it can't hurt totry.\n\n---\nFAQ\n\nQ: Why is there no M+M gay?\nA: Are you blind?\n\nQ: I bet you have something against gay people, huh.\nA: I will decline to comment.\n\nQ: Something is in the wrong place!\nA: Sorry about that, I have tried to organize them, but the sheer number of them prevents me from actually going through all of them. I've tried to sort them a bit better, but you can't expect all too much when there's literally thousands of images, animations, and etc.\n\nHow to help me if you see a problem with locations.\n    1. Find the name\n    2. Email me or post in one of my threads the names/ID # tags\n          For example &quot;Misc Pokemon47&quot;, or &quot;Ivy8, 9, and 10&quot;.\n    3. I'll be able to find it and easily search and destroy (Or, just move it), for the next update.\n    4. Thanks for helping!\n\nQ: So there's a lot of tentacles, but no visible pokemon in the PokemonxHuman sections. What gives?\nA: Since there's so many pokemon that DO have tentacles, and how some of them \nmatch, I'd rather play it safe than sorry and move ALL tentacle porn, whether it has a pokemon in it or not, to the PokemonXHuman section since I really don't know. If you have a better solution, I'd be happy to hear it. I've also moved egg porn to it as well.\n\nQ: Why is there so much shit in this?\nA: I've made an attempt to get rid of all the REALLY bad art. You can have your own opinions on it but if you hate it so badly, perhaps you can send me a suggestion?\n\nQ: When do you make threads?\nA: Never daily, around 5PM EST. I make them as I please, this is just a reference for general times.\n\nQ: Why is there a lot of X pokemon/character compared to Y pokemon/character?\nA: Some pokemon/characters just don't have that much porn. Sorry bro.\n\nQ: I keep posting but I sometimes accidentally forget to spoiler? wat do?\nA: First, don't panic. click the check mark next to your post and scroll down and press delete. You will have to wait a few seconds before you are allowed to delete your post. I don't take it too seriously, but try and avoid posting without spoilers as it might get unwanted attention.\n\nQ: Will there be a new thread after the first one hits image limit?\nA: Depends. If there's a lot of people who say yes, I'll go for it. If there happens to be a large amount of spam, then no. I'd rather not go through the trouble.\n\nQ: Why isn't there a new archive yet? It's already been a few weeks.\nA: Because I'm incredibly busy. And I don't want to stare at porn all day sometimes.\n\nQ: Why is there Digimon in the Archive?\nA: It's a joke.\n\nQ: Can I have some of your real contact info?\nA: NOPE! Other than what I listed above, I'm not going to have random anons interfere with my personal life. If you want to find out more about me, don't bother. The emails, twitter, and anything else is unrelated to me. Besides, it's more than enough to contact me. I actually DO check my emails, so please, don't hesitate to drop a line.\n\nQ: What's your waifu?\nA: Blaziken. If you have some new porn of her that'd be great!\n\nQ: Gary? Posting porn?\nA: Yes, it's called irony.\n\nQ: What can I do to help?\nA: Spoiler all your porn, don't spam, be polite, and if there's a conversation, you \nare welcome to join.\n\n---\nUseful Tools\n\n7-Zip: Better than WinRAR/zip and FREE!\nLink: http://www.7-zip.org/\n\nVisipics: The most used tool in my arsenal, it finds and sorts similar pictures for deletion.\nLink: http://www.visipics.info/index.php?title=Download\n\nBulk Renamer: Renames files and folders en masse.\nLink: http://www.bulkrenameutility.co.uk/Main_Intro.php\n\n/b/rowser: A neat tool that allows you to browse a whole board. You can find updates on /rs/ by looking it up. Password: &quot;CRUISECONTROL&quot;\nLink: http://rs.4chan.org/?s=Browser&amp;from=ALL\n\n4chan Plus: A nice Chrome extension that includes thread hiding, auto refresh, spoiler preview quick reply and more. Appears to be abandonware at this point, Switch to 4chanX\nLink: https://chrome.google.com/extensions/detail/pinelipedelckihohgdlpcclgocodhjj\n\n4chanX: For Firefox. Includes many of the same features in Plus. Requires Greasemonkey. Also usable in Chrome/ium.\nLink: http://userscripts.org/scripts/show/51412\n\n---\n\nChangelog\n\n- v1.0\nStarted archive\nTotal Size: &lt;300mb\n\n- v1.1\nTotal size: 377MB\n\n- v1.2\nNew pictures, updated and fixed Readme.\nTotal size: 771.13MB\n\n- v1.3\nTorrent online, more of everything.\nTotal size: 1.02GB\n\n- v1.4\nReduced repeats, more pokegirls. New Doujins sections for both categories, split pokemon and \npokegirls into two different downloads for DDL'ers\nTotal size: 1.07GB\n\n- v1.5\nReduced repeats, sorting improved again. Added the changelog.\nTotal size: 1.15GB\n\n- v1.6\nMassively increased Pokemon sections, more sorting will be done in v1.7, and split pokemon into \ntwo parts due to folder size.\nTotal size: 1.83GB\n\n- v1.7\nMassively increased Pokegirl sections, attempted a sorted out what I consider &quot;bad&quot; and non-porn. Split pokegirls into two parts due to folder size. Merged Pokemon to one folder. Wood screws.\nTotal size: 1.80GB\n\n- v1.8\nRenamed all pictures, deleted a metric fuckton, better sorting, and added a lot more to the collection.\nTotal size: 1.88GB\n\n- v1.9\nLarge amount added, sorting improved as usual. It's a big update.\nTotal size: 2.21GB\n\n- v1.95\nMany of the things in v2.0 are being implemented in a limited version here. It's not a final version and there's still problems with it. New Gay Archive.\n\n- v2.0\nFormat change to .7z, new &quot;Flash&quot; section (You can find SDT in there), new &quot;Erotic Fiction&quot; sections, new &quot;gif&quot; sections, and naming system overhaul. \nTotal size:\n\n- v2.1\nPossible: Individual .7z archives for each folder. Focusing soley on removing problems from v2.0 There won't be all that much new, however there is a possiblity of a lot deleted. Probably will fix the Gay archive so it's actually more sorted (Assuming I get new material in the first place). Expected release date: September, I ain't sticking around for summer. I wish you luck /vp/!\nTotal size:\n\n- v2.2\nYour guess is as good as mine.\nTotal size:\n\n---\nCredits and Thanks\n\n\n- Every artist that has created everything in here. Without you guys, there'd be nothing in the first place!\n- wat and Raiden for helping me sort v1.95.0. (Large amount of GB of porn!)\n- Keith, qnqnx, Kris, Trainer With a Mouth, Sofa, Dark, cptkirkcobain, Reginald, wat, Raging Furfag, and Anonymous for content.\n- Lyraeon and FicFags Anonymous for being cool guys and writing erotic fiction for the rest of us!\n- Dahmer (who is actually Igglybuff) and all bombers Gary or otherwise for \nentertainment.\n- Raging Furfag, Hoppip, Pornodex Guy, Zalgo, Unown, and Alex for being pretty cool guys.\n- Anonymous, for helping contribute and supporting the project.\n- I don't say thanks to any haters. But I will say I'm sorry for anything I've done.\n- stickmanoncrack for actually reading the README, and winning a bonus poptart.\n- The Falcon, for inspiring me to make my own copypasta resource to help reduce annoying threads. And for making the best /g/uide ever.\n\n\nAnd of course, You for downloading.\n\n\nEnjoy!\n\n&gt;yfw tl:dr","torrent":{"xt":"urn:btih:4b93d1ec8e26e2738c0ba3bccbc0953256950d6b","amp;dn":"Gay+Pokeporn+v1.0+-+Gary+Oak+%21ArcHIvEpAQ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b93d1ec8e26e2738c0ba3bccbc0953256950d6b","infoHashBuffer":{"type":"Buffer","data":[75,147,209,236,142,38,226,115,140,11,163,188,203,192,149,50,86,149,13,107]},"announce":[],"urlList":[]}}