{"title":"Hiems - Worship Or Die (2009)","uid":5020861,"size":93884607,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4bf7ff15021088663d204eb22c9bb4347e06e063&amp;dn=Hiems+-+Worship+Or+Die+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Baphom3t","files":14,"time":1248456123,"description":"HIEMS - the Latin word for Winter; the decay, the bitter end that awaits us all. A deeper experience in the depths of emotional void, a further look in the private abyss of a sick mind. We have to travel back to 1996 to see the birth of the band, when Algol, led by an intense need of putting in music and words his troubled mind, decided to start on his own this project. The &quot;one man band&quot; dimension is almost essential for this kind of experience, being the ultimate representation of the ghosts that haunt a tormented soul. No artistic compromises, like it or not. In the whole nineties the band worked in a deeply underground way, and in 1999, after having released three demotapes, Algol decided to put HIEMS on hiatus for various personal reasons. \n\nIn 2004 the band came back working on the first full lenght &quot;COLD VOID JOURNEY&quot;, that was released one year later by Iso666 production (and by Obscure Abhorrence on vinyl, limited to 99 copies). Representing a summa of the first years of HIEMS, the album showed a classic approach to Black Metal, with all the trademarks connected to the musical past of the band - a blast beat inferno, corrosive distorted vocals, groovy patterns and a sick industrial ambiance. HIEMS made his first live apparition in a december night in Rome during 2006, with the help of Argento and Azoth of Spite Extreme Wing on guitar and bass, and Thorns (the same drummer that recorded CVJ) on drums. \n\nIn the midtime, a new record deal was inked with the US label Moribund Records and Algol started working alone on the new material, feeling a strong and natural need to evolve his musical direction in a different way; he decided to take care personally of all duties, including drums. A new track was recorded for the BMIA Signvm Martis compilation, released in 2007 (more infos on the BMIA project can be found here www.signum-martis.org). The recordings of the second album titled &quot;WORSHIP OR DIE&quot; started the same year, ending in september 2008. Worship Or Die will be released soon by Moribund Records, along with a brand new remastered edition of the first album Cold Void Journey, featuring a second cd containing all the early band's works. Future is never bright, and HIEMS will be here for a long time remembering you how miserable are our lives. Forever spread the Sickness!\n\nCurrent line-up \nAlgol - Vocals, bass, guitar, drums, keyboards (Forgotten Tomb, The Tombers, Dead?)\n\nGenre = Black Metal\nFormat = Mp3\nBit Rate = Vbr\n\nTrack Listing\n1. Worship or Die \n2. I  \n3. Scum Destroyer  \n4. W.O.F.   \n5. Adventum   \n6. Bringer of Light \n7. Wounds Just Death Can Heal \n8. Hiems \n9. 2909979  \n10. Race With the Devil","torrent":{"xt":"urn:btih:4bf7ff15021088663d204eb22c9bb4347e06e063","amp;dn":"Hiems+-+Worship+Or+Die+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bf7ff15021088663d204eb22c9bb4347e06e063","infoHashBuffer":{"type":"Buffer","data":[75,247,255,21,2,16,136,102,61,32,78,178,44,155,180,52,126,6,224,99]},"announce":[],"urlList":[]}}