{"title":"AMS Greeting Card Studio 5.17","uid":6443185,"size":11527486,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4c92399dae74b1230c13db5a12e44c2ef6bb4c38&amp;dn=AMS+Greeting+Card+Studio+5.17&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1307039449,"description":"AMS Greeting Card Studio 5.17\n\nGreeting Card Studio is an easy-to-use application that enables users to make high-quality greeting cards featuring their own family photos and text. The program comes packed with professionally designed templates and matching graphics. Just supply the paper, choose your desired design, open the design template, personalize and print! You may also create your own unique design and enhance picture with effects, spice up your creation with borders, frames, backgrounds and clipart. Zoom, rotate, and flip the photo inside the card until it looks perfect. When you are finished with your work you can save it as digital file.\n\nShow Off Your Smile\nMake last minute adjustments to your digital photos so they look perfect in the selected theme. Tools include, Zoom In, Zoom Out, Rotate, Flip, Color Balance, etc.\n\nCustomize Your Greeting\nFor a more personalized touch, add a funny or thoughtful message to your card design. Text controls include: Font, Size, Align Left or Center, Text Color, Bold, Italics. The product includes a lot of greeting texts for many occasions.\n\nDownload Extra Card Designs\nAfter registration you can download more card designs to add to your current collection.\n\nSave Cards as Projects\nSave each card design as a project file for opening, editing and printing later.\n\nPrint Cards\nPrint your photo greeting cards on 4x6 and other photo paper from all of the major brands such as Kodak, Avery, HP, Canon, Epson, etc.\n\nHome page - http://ams-soft.com/\n\n\n","torrent":{"xt":"urn:btih:4c92399dae74b1230c13db5a12e44c2ef6bb4c38","amp;dn":"AMS+Greeting+Card+Studio+5.17","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c92399dae74b1230c13db5a12e44c2ef6bb4c38","infoHashBuffer":{"type":"Buffer","data":[76,146,57,157,174,116,177,35,12,19,219,90,18,228,76,46,246,187,76,56]},"announce":[],"urlList":[]}}