{"title":"Encyclopedia Dramatice User Table credentials (compromised datab","uid":6352381,"size":821928,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4d0fcfb4f5a32b4b5ef4ba88e1aa55c45b54bd9a&amp;dn=Encyclopedia+Dramatice+User+Table+credentials+%28compromised+datab&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1304045195,"description":"Mirror of the original, so that it may never be lost\n\n####################################################\n\n\nHello there internet, my name is Sherrod DeGrippo. I like to cause grief\nfor people online if they should cross me. But between you and me, I'm\nreally bad at receiving harassment myself. SSSHH!!\n\nI used to run a site called Encyclopedia Dramatica. Maybe you heard of it?\nIt was a place where nightmares of the innocent came true, and societal\nfailures gathered together to die like that faggot Sean Carasov. (Hopefully\nWeev will follow suit). Hmm.. I wonder how the other inmates are liking his\njokes about niggers and rape. Lulz.\n\nWhen I'm not studying to re-attempt my CISSP exams I am running ./nessus\nagainst the clueless dolts that employ me. How they came to the conclusion\nthat I was the person for the job is beyond me.. and much like my vagina\nthe logic behind it is out of my reach. Oh, sorry didn't I mention I gave\nmeaning to the term &quot;lulz cow&quot;?\n\nNonetheless, I am an expert in the field of information security and should\nnot be taken lightly. No one can hack me because I don't use the default \nport for SSH. Unfortunately I like to re-use passwords, so I guess that's\nsomething I should make into a new years resolution, or something. Here\nare some of my favourites:\n\n24366DeG, blur6666, niggers, omgwtf, hammeratv, kthanks, salla, moo1234\na138c5, 8087fb, omgwtf, atlgoth23, unfunf, d7bd7b, *TbgvsWz, p-p-pokerface\n\n\n.. Among others.\n\n\nI'm kind of a big deal around here. With an inflated ego and a body to match,\nthe only person who could ever love me thinks his sole purpose in life is to\nprotect Sarah ConnorBut Linda Hamilton\nis much prettier than me, so I guess I'll just settle for sweet talking weev\ninto making other people's lives miserable to help raise my self esteem. No one\ngets the better of Girlvinyl!\n\n\nAs my many resumes state, I am highly skilled in the area of intrusion detection.\nAlthough there was this one time (more like months) where people were accessing\nmy computer without my knowledge and laughing at me fumbling about with bash.\n\n\nDespite what the people I've tormented will tell you I'm actually quite the sweetie.\nI'm loving, caring, and a friend to all. I'm also painfully naive and unfamiliar with\nthe phrase &quot;what goes around comes around&quot;. I don't believe in dropping &quot;docs&quot; on anyone\nso to prove it here is my SSN as collateral: 257-59-3529. If I should go against my word\nthen you are free to do as you wish.\n\nBut forget all that drama. ED is a thing of the past. So without further adieu, I welcome you to\nmy new site ohinternet.com! This time I'll do it right - promise. \n\nWith love,\n\nSherrod E. DeGrippo\nFat Cunt Extroardinare, eDrama LLC\n","torrent":{"xt":"urn:btih:4d0fcfb4f5a32b4b5ef4ba88e1aa55c45b54bd9a","amp;dn":"Encyclopedia+Dramatice+User+Table+credentials+%28compromised+datab","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d0fcfb4f5a32b4b5ef4ba88e1aa55c45b54bd9a","infoHashBuffer":{"type":"Buffer","data":[77,15,207,180,245,163,43,75,94,244,186,136,225,170,85,196,91,84,189,154]},"announce":[],"urlList":[]}}