{"title":"cFosSpeed 6.50 Build 1810 Final - Boost your internet speed","uid":6431196,"size":8831661,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4d8a850eb5ec6333e9c2b2441460188c2b5b9e06&amp;dn=cFosSpeed+6.50+Build+1810+Final+-+Boost+your+internet+speed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306658031,"description":"cFosSpeed 6.50 Build 1810 Final - Boost your internet speed\n\ncFosSpeed is a high-performance network driver for DSL modems and routers. Highlights of this program include Traffic Shaping, For DSL modems and routers, Fully compatible with conventional PPPoE drivers, Automatic router detection, Self-calibrating, Highly responsive when used with online games and Peer-to-Peer networks like eMule or Kazaa, and Freely configurable priority classes.\n\ncFos Traffic Shaping reduces delays during data transfer and allows you to surf the Internet up to three times faster. Finally, you can use the full bandwidth of your DSL connection!\n\nDuring TCP/IP transfer, a certain amount of data needs to be confirmed upon reception before more can be sent. Stalling data confirmation results in delays and transfer-rate slowdowns, thus forcing the sender to wait. Especially for ADSL, it is possible to slow a download to a crawl by choking the upstream channel (which has the smaller bandwidth anyway) with an upload. This is because in such a scenario there is not enough upstream bandwidth left for data confirmation. The standard solution so far has been to try and compensate for this by increasing TCP window size, thereby allowing more data to be sent without immediate confirmation. The main problem here is that this also leads to high ping times (latency) and significant delays during Webpage rendering. Latency of up to 2 seconds is not uncommon for TCP windows with a size of 64k. In short, huge window sizes just won?t let you achieve full download speed. By contrast, cFos Traffic Shaping prioritizes data traffic in such a fashion that important packets zip past regular packets. This way, receipts always arrive in time, and uploads wont ever choke your broadband connection again! cFos Traffic-Shaping technology recognizes a number of important packet types and prioritizes them not only to keep Internet traffic running smoothly but also to ensure particularly low ping times. This not only accelerates surfing and download speeds significantly, but it is also a decisive advantage for online gaming. With cFos Traffic Shaping, you will notice measurable improvements and benefits like:\n\n* Full download rate during upload\n* Consistently quick response time while surfing the Web or running other applications\n* Improved VoIP speech quality\n* Perfect for online gamers!\n* Extended Traffic Shaping for DSL modems, cable modems &amp; routers\n* Highly responsive when used with online games and filesharing (P2P) like eMule, Kazaa or Bittorrent\n* Minimal ping times for streaming audio &amp; video, Voice over IP (VoIP), Internet Radio, etc.\n* Individual program prioritization\n\nTraffic Shaping best for\n* Broadband: DSL, Cable\n* Narrow band: modem, ISDN\n* Mobile\n* Filesharing (P2P)\n* Games\n* Streaming Media, VoIP\n\nFeatures\n* Low Ping\n* Prioritising programs\n* Prioritising protocols\n* Online Budgets\n* Firewall\n\nConnections:\n* Broadband: Cabel and DSL\n* Narrow band: Modem and ISDN\n* Mobile\n* Media:\nDSL, PPPoE\nDSL, PPPoA (VCmux and LLC)\nDSL, PPTP\nCable\nISDN\nIP over AAL\nRFC1483/2684 bridged\n\nRouting:\n* Router and dial-up connections\n* LAN and WLAN\n* Router and Bridge-Mode\n* VPN\n* Multiple connections simultaneously\n* Adjustable routes\n* Several IP adresses per adapter\n\nTraffic Shaping:\n* Multi-User version\n* TX and RX-Shaping\n* L7 Protocol Analysis\n* Prioritization of Programs\n* RTP/VoIP Detection\n* 5 priority queues\n* Individual rules with filter language\n\nOptions:\n* Low-Latency Mode\n* Auto-MTU optimization\n\nExtras:\n* Time and volumen budgets\n* Usage Graph\n* Overview of connections\n* Skin-Windows\n* Firewall\n* Data and packet logging\n* 32-Bit and 64-Bit version\n* 12+ languages\n","torrent":{"xt":"urn:btih:4d8a850eb5ec6333e9c2b2441460188c2b5b9e06","amp;dn":"cFosSpeed+6.50+Build+1810+Final+-+Boost+your+internet+speed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d8a850eb5ec6333e9c2b2441460188c2b5b9e06","infoHashBuffer":{"type":"Buffer","data":[77,138,133,14,181,236,99,51,233,194,178,68,20,96,24,140,43,91,158,6]},"announce":[],"urlList":[]}}