{"title":"Windows 3.11 16 bit color","uid":5151929,"size":19537941,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4e0cad4fcafe7c100625c9bc5352fff7fae79e1f&amp;dn=Windows+3.11+16+bit+color&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"c2892958","files":3,"time":1257612221,"description":"Hi everyone!\n\nThis is a copy of windows 3.11 I have uploaded. It also includes a copy of the graphics drivers (as a .7z) that are already installed with windows 3.11(in case you want to change them for whatever reason) and a copy of DOSBOX which you need to run windows with. \n\nI have seen other copies of win3.11 around but they dont have the graphics drivers already installed / or are in swedish.\n\nThe purpose of this torrent is 2 fold. \n\nFirstly to allow you to see how far microsoft has come with the windows OS and \n\nSecondly to allow 16 bit emulation for some very old games.\n\nFor example Star Wars Chess (installed in this version of windows 3.11) cannot be played on 64 bit OS's. So if you are running windows 7 64 bit and want to play an old 16 bit game that requires windows to run, you cant play it. \n\nA good example is already included. Star Wars Chess cannot play with just DOSBOX - it needs windows to work, so booting up win3.11 first gives you a platform for these old games.\n\nPlease enjoy. Comments welcome. First Torrent ever uploaded :)\n\nKind Regards \nPeter &quot;1337&quot; A.\t\n\nPS Note : Instructions - \nInstall DOSBOX.\nExtract the Win3.11 to the root of your C drive (it is already in a win311 folder)\n\nRun dosbox\nType:\nmount c c:win311 (there is a backslash here between the : and the win311 - for some reason its not displaying)\ncd windows\nwin\nThis will run windows. Hope this makes it easier to use :)\n\nPete\n\nPPS\nSorry I forgot to install sound drivers on this torrent. Rather than do it for you I will provide instructions instead.\n\nFirst download this torrent with the win3.11 setup files. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/3392923/Windows.3.11.and.MS-Dos.6.22&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/3392923/Windows.3.11.and.MS-Dos.6.22&lt;/a&gt;\nNext extract the files to the win311 folder you already have up and running under a new folder called setup.\nIE you now have a setup directory inside the win311 directory with these files in it.\n\nStep 2\nBoot into win311 and then go to the control panel and then the drivers applet.\n\nStep 3\nAdd the &quot;creative labs sound blaster 1.5&quot;\nBrowse to the setup folder and hit OK.\n\nStep 4\nChoose Port 220 and interrupt 7.\n\nStep 5\nReboot and enjoy windows and Star Wars Chess with sound. \n\nSorry for not including sound to begin with. I dont normally bother with game sound as my Amps are pumping out MP3's too loud to notice :)\n\nPete\n\nPPPS\nFor those too lazy to apply sound I have uploaded anouther torrent with the sound included as well :)\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5152416/Windows_3.11_16_bit_color&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5152416/Windows_3.11_16_bit_color&lt;/a&gt;\n\nPete","torrent":{"xt":"urn:btih:4e0cad4fcafe7c100625c9bc5352fff7fae79e1f","amp;dn":"Windows+3.11+16+bit+color","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e0cad4fcafe7c100625c9bc5352fff7fae79e1f","infoHashBuffer":{"type":"Buffer","data":[78,12,173,79,202,254,124,16,6,37,201,188,83,82,255,247,250,231,158,31]},"announce":[],"urlList":[]}}