{"title":"Coast to Coast AM - Oct 29 2009 - Swine Flu, Europa, &amp; UFOs","uid":5144918,"size":55701616,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4e6425dd40dcd60b1643e683de8475a9281166ea&amp;dn=Coast+to+Coast+AM+-+Oct+29+2009+-+Swine+Flu%2C+Europa%2C+%26+UFOs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":-1,"time":1257122349,"description":"Swine Flu, Europa, &amp; UFOs\n\nDate: 10-29-09\nHost: George Noory\nGuests: Linda Moulton Howe, Rosemary Ellen Guiley\n\nInvestigative reporter Linda Moulton Howe presented material on four subjects: H1N1 (Swine Flu), solar activity, UFO/alien encounters in England, and research into Europa's oceans. She interviewed NASA Heliospheric Team Leader David Hathaway about the sun's continued quiescent cycle. He said he can't find another solar minimum in the past that has acted like the current one, and doesn't believe there'll be a solar maximum in 2012 as some have predicted-- rather the cycle will have a small peak in 2013. More here.\n\nIn her update on Swine Flu, she noted the seriousness of the pandemic, and how younger people could be particularly at risk for the illness. She spoke with Dr. Paul Glezen of Baylor College of Medicine, who said people born in the 1980s and 1990s or 2000s &quot;are not likely to have any pre-existing antibodies and are therefore very susceptible to this new H1N1 virus.&quot; He also warned of a new variation of the virus, H3NZ, which was discovered in the Southern Hemisphere and could spread north this winter. View the full Earthfiles report.\n\nIn her third segment, Linda discussed recent video footage from England that may show an aerial craft lifting a large animal. The video was shot by a retired auto mechanic named Derek Bridges (see related article below). She also interviewed a neighbor of Bridges, Kris Reed, who described a 2007 encounter with a strange aerial craft and an alien &quot;grey&quot; being who stuck its lizard-like tongue out at him. \nShe pondered whether there could be life on Jupiter's moon, Europa, in her last report, presenting an interview with Prof. Richard Greenberg of the University of Arizona. Europa, which has an ocean that is around 100 miles deep (and thought to contain twice as much water as Earth's oceans) could be a good candidate for multi-cellular life in its waters, as oxygen is known to be on the ocean's surface, said Greenberg. More here.\n\nDemons &amp; 'Mystery Place'\n\nFirst hour guest, author Rosemary Ellen Guiley talked about her research into demons, which she characterized as a broad class of interfering entities. She also gave an update on her investigations into a &quot;Mystery Place,&quot; an undisclosed location that can be compared to the Skinwalker Ranch in Utah for its panoply of paranormal activity. Strange aerial lights, poltergeists, imp-like creatures, dark gray &quot;blobby forms,&quot; and apparitions have all been seen or experienced on or near the property, she detailed.\n\n\nWebsite(s):\nearthfiles.com\nvisionaryliving.com\n\nBook(s):\nMysterious Lights and Crop Circles\nGlimpses of Other Realities, Volume 2\nThe Encyclopedia of Demons and Demonology\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:4e6425dd40dcd60b1643e683de8475a9281166ea","amp;dn":"Coast+to+Coast+AM+-+Oct+29+2009+-+Swine+Flu%2C+Europa%2C+%26+UFOs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e6425dd40dcd60b1643e683de8475a9281166ea","infoHashBuffer":{"type":"Buffer","data":[78,100,37,221,64,220,214,11,22,67,230,131,222,132,117,169,40,17,102,234]},"announce":[],"urlList":[]}}