{"title":"Evil Bong (legendas em portuguÃƒÂªs)","uid":5176826,"size":734820161,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4e6d9b9e1921e48b61fe50b3abebc72d7e78f06c&amp;dn=Evil+Bong+%28legendas+em+portugu%C3%83%C2%AAs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OscarAlhoII","files":-1,"time":1259017332,"description":"SE AS LEGENDAS NÃƒÆ’O APARECEREM, INSTALA ISTO:  &lt;a href=&quot;\nhttp://www.codecguide.com/download_k-lite_codec_pack_basic.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.codecguide.com/download_k-lite_codec_pack_basic.htm&lt;/a&gt;\n\n\nNerdy college student Alister McDowell (David Weidoff) moves in with spoiled rich kid Larnell (John Patrick Jordan), typical &quot;surfer-stoner&quot; Bachman (Mitch Eakins) and former baseball player Brett (Brian Lloyd). During Alister's stay, Larnell sees an ad for a large bong, in which the previous owner claims it was &quot;possessed&quot;. After receiving the bong and taking a couple of hits (with the exception of Alister, who doesn't smoke), Brett introduces Alister to his girlfriend Luann (Robin Sydney) and her friend Janet (Kristyn Green), who Alister develops a crush for.\nLater that night, Bachman, after taking way too many hits out of the bong, wakes up in a strip club where he meets Ooga Booga from Doll Graveyard and Ivan Burroughs (Phil Fondacaro) from Decadent Evil. He's introduced by one of the strippers (Kristen Cladwell) who has skull heads on the cups of her bra. When he comes near the bra, the skull heads start biting him in the neck and he bleeds to death. The next morning, the other roommates find Bachman dead on the couch. Alister tells to them that it's probably from the weed that came with the bong. Larnell also notices that the bong has changed. The trio then hide his body underneath a pile of trash in the basement, after nearly getting caught by Larnell's paralyzed-but-wealthy grandfather, Cyril (Jacob Witkin), who came by to tell Larnell that he just got remarried.\nLater on, the bong (voiced by Michele Mais) starts speaking to Larnell (to Larnell only, no one else hears) and tempts him to take a hit out of her. After doing so, he ends being in the same strip club as before. Here he sees Bachman (who seems to be fine), the Gingerdead Man, and his grandfather. Eventually a stripper gives Larnell a lap dance, and he's killed in a similar way that Bachman was killed. Back in the real world, Luann and Janet come over to play Trivial Pursuit. After playing the game, the group (again with the exception of Alister) take a hit from the bong. After Brett and Luann pass out, they wake up in the same strip club and they're greeted by Jack Attack of Demonic Toys, and Luann is taken away by the bouncer. Brett is then treated by another stripper (Brandi Cunningham), who happens to be Brett's ex-girlfriend Carla Brewster. She eventually uses her lip-cupped bra to bite off Brett's genitals, killing him.\nMeanwhile, when Allister starts figuring out what's going on, Janet falls prey to the bong and passes out. A man named Jimbo Leary (Tommy Chong) randomly enters the room and proclaims that the bong is his. He also explains that the bong (named Eebee) has a voodoo curse on it and that once you take enough hits from it, it brings you to the &quot;Bong World&quot; (the strip club) and kills you. In order to save Janet, Allister takes a hit from the bong and is instantly sent to the bong world. Meanwhile, Jimbo tries destroying the bong with a hammer, chainsaw, and (resorting to drastic measures) a bomb. Eebee unleashes marijuana smoke from her bong, causing Jimbo to inhale and pass out.\nMeanwhile in the Bong World, Eebee forces the strippers to seduce Allister, but he breaks them off. Once he finds a stoned Janet, they take vitamins (that Jimbo gave them) to make them sober again. Jimbo, who has just got sucked into the bong world, tells them to go ahead and escape while he takes care of Eebee. Jimbo comes up to Eebee and shows Eebee the time bomb now strapped to his chest. Jimbo activates the bomb and blows up Eebee and apparently Jimbo himself. Back in the real world, Alister and Janet wake up, with Larnell, Brett, Luann, and Bachman coming back to life. Jimbo, however, has been killed, along with the bong, which is now shattered into pieces. The last scene shows that Jimbo is now the king of the Bong World. His first rule of business is to have the strippers to have fun with the last of his Hot Wheels. During the end credits, Eebee's voice can be heard, saying that she come back as the...KING BONG!\n\n\nTommy Chong, da legendÃƒÂ¡ria dupla Cheech e Chong, protagonisa este filme de horror sobre um cachimbo de ÃƒÂ¡gua possuÃƒÂ­do por espÃƒÂ­ritos que comeÃƒÂ§am a aterrorizar alguns mocados. Um tributo aos filmes de horror-B!\n\n\n\n\n\n\n Evil Bong.avi\n700 MB\n\n1:24:05\n616x336\n145 KB/s\n23 fps\nAudio - 128 KB/s\n\n Evil Bong.srt\n73,8 KB","torrent":{"xt":"urn:btih:4e6d9b9e1921e48b61fe50b3abebc72d7e78f06c","amp;dn":"Evil+Bong+%28legendas+em+portugu%C3%83%C2%AAs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e6d9b9e1921e48b61fe50b3abebc72d7e78f06c","infoHashBuffer":{"type":"Buffer","data":[78,109,155,158,25,33,228,139,97,254,80,179,171,235,199,45,126,120,240,108]},"announce":[],"urlList":[]}}