{"title":"Tony Hawks Pro Skater 4 Portable - [Espera]","uid":6353638,"size":330375923,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4ef3262c930fcca097a806912e3effea963ee3d8&amp;dn=Tony+Hawks+Pro+Skater+4+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drewdollars","files":2,"time":1304077625,"description":"\n    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;RegSetup.exe&quot;\n3.Run &quot;THPS 4 - 1 Click.exe&quot;\n4.Enjoy.\n\nTony Hawk's Pro Skater 4 is a departure from the previous three games' Career mode, in which the player had a set amount of time in order to find and complete goals. THPS4 instead featured a Career mode more similar to Free-skate mode, in which there was no time limit to explore the level, the goals are usually offered to the player to attempt by characters found in the level. This Career mode would be later seen as the Story modes of Tony Hawk's Underground series, American Wasteland, Project 8 and Proving Ground.\n\nThe game builds on the success of the gameplay in the previous games in the series. All of the combos from the previous game make an appearance, as well as some new tricks that can be performed to better navigate parks and areas. It saw the introduction of the spine transfer and car skitching.\n\nThe &quot;hidden combos&quot; for turning some tricks into slight variations in Tony Hawk's Pro Skater 3 turned into a standard feature, albeit not as advanced as the system would turn out in the next game in the series, where it was finalized. Also included was the ability to do grind and lip extensions by tapping a direction and grind while grinding or lipping, which can also grant the player bigger combos as they can do a grind extension into a special move, for example. As with trick extensions, this would be standard in the next game in the series where it was much simpler to do. The game is also the only one in the series where the player does not have to buy tricks. Instead, the basic trick-set the player gets is allocated depending on what type of move set the player defines for their character.\n\nThere are also four characters that you have to buy in the game. They are: Jango Fett from Star Wars, Eddie the Head(The mascot featured in most Iron Maiden music videos)and Mike Vallely who is a professional proskater as well as a professional wrestler.\n\nDETAILS\n\nGenre: SkateBoarding\nDeveloper: Beenox\nPublisher: Aspyr\nRelease Date: Aug 27, 2003\n\nMINIMUM SYSTEM REQUIREMENTS\nOS: PIII 800MHz or equivalent\nRam: 256MB\nVideo Memory: 32MB\nHard Drive: 700MB ","torrent":{"xt":"urn:btih:4ef3262c930fcca097a806912e3effea963ee3d8","amp;dn":"Tony+Hawks+Pro+Skater+4+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ef3262c930fcca097a806912e3effea963ee3d8","infoHashBuffer":{"type":"Buffer","data":[78,243,38,44,147,15,204,160,151,168,6,145,46,62,255,234,150,62,227,216]},"announce":[],"urlList":[]}}