{"title":"THREE BRITISH FILM,S","uid":6410056,"size":1949330702,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5146c070963826fd65a6516e36ea66c5934fa404&amp;dn=THREE+BRITISH+FILM%2CS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OLDLIMEY4","files":3,"time":1305940006,"description":"\nThe Happiest Days of Your Life is a 1950 British comedy film directed by Frank Launder, based on the play by John Dighton. The two men also wrote the screenplay. It's one of a stable of classic British film comedies produced by Frank Launder and Sidney Gilliat for British Lion Film Corporation. The film was made on location and at Riverside Studios, London. In several respects, including some common casting, it was a precursor of the more anarchic St. Trinian's films of the 1950s.\n\nThe Titfield Thunderbolt is a 1953 British comedy film about a group of villagers trying to prevent British Railways from closing the fictional Titfield branch line. The film was written by T.E.B. Clarke and was inspired by the restoration of the narrow gauge Talyllyn Railway in Wales, the world's first heritage railway run by volunteers.\n\nIt starred Stanley Holloway, George Relph and John Gregson, and was directed by Charles Crichton. Michael Truman was the producer. The film was produced by Ealing Studios. It was the first Ealing comedy shot in Technicolor and one of the first colour comedies made in the UK.\n\nThe Million Pound Note \n\nIn 1903, American seaman Henry Adams (Gregory Peck) is stranded penniless in England and gets caught up in an unusual wager between two wealthy, eccentric brothers, Oliver (Ronald Squire) and Roderick Montpelier (Wilfrid Hyde-White). They get a bank to issue a one million pound note (Ã‚Â£1,000,000), which they present to Adams in an envelope (only telling him that it contains some money). Oliver believes that the mere existence of the note will enable the possessor to obtain whatever he needs, while Roderick contends that it would actually have to be spent for it to be of any use.","torrent":{"xt":"urn:btih:5146c070963826fd65a6516e36ea66c5934fa404","amp;dn":"THREE+BRITISH+FILM%2CS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5146c070963826fd65a6516e36ea66c5934fa404","infoHashBuffer":{"type":"Buffer","data":[81,70,192,112,150,56,38,253,101,166,81,110,54,234,102,197,147,79,164,4]},"announce":[],"urlList":[]}}