{"title":"The Sun Blindness - Like Pearly Clouds 2008 PSYCH ACID FOLK Clas","uid":6338611,"size":63237436,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5151a21a282d28d8470cd65f188483faf0f57efa&amp;dn=The+Sun+Blindness+-+Like+Pearly+Clouds+2008+PSYCH+ACID+FOLK+Clas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1303519860,"description":"Debut album from The Sun Blindness 'Like Pearly Clouds' from 2008. .\n\n&quot;While many new 'psych' proclaimed acts go a path of diet dread and mind-split affectation - little further than the recent, forced drug sound of Brian Jonestown Massacre or first-listen covers of 'Sister Ray' with delay pedals - locals The Sun Blindness are tripping some truly illuminating, positive territory. Beautifully 'up' in general, as if cruising for the perfect, slow-unfolding acid dawn - there's an old style, sensory exoticism to the duo that captivates without demand; free of self-serving sentiment, happy in itself and bent for real on cosmic harmony. A Byron Bay chew at NYE they're not, but a true, purple-hued spiritualist endeavour.\n\nLike Pearly Clouds is all that - huge and weightless, smiling stimulant music. Lots reminds of Spacemen 3, some of the Stone Roses' backwards track 'Full Fathom Five', bits of synth-swirling Country label mates The Rectifiers, and still less of Supergrass on the more stoned bits of their eponymous third album. Sunburst, vaporous guitars set the rhythm, accompanied at most by shakers - no drums - there's backwards tape work everywhere and keening, harmonic vocals in the middle. &quot;I want to sleep inside your mind&quot; they intone, &quot;Let's get together, Drop out forever&quot;, and &quot;Lazy living isn't very far away.&quot; Healing solvent of the best kind.&quot;\n\n","torrent":{"xt":"urn:btih:5151a21a282d28d8470cd65f188483faf0f57efa","amp;dn":"The+Sun+Blindness+-+Like+Pearly+Clouds+2008+PSYCH+ACID+FOLK+Clas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5151a21a282d28d8470cd65f188483faf0f57efa","infoHashBuffer":{"type":"Buffer","data":[81,81,162,26,40,45,40,216,71,12,214,95,24,132,131,250,240,245,126,250]},"announce":[],"urlList":[]}}