{"title":"Alanis Morissette - Hand In My Pocket (Acoustic)","uid":4992434,"size":142340100,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:51bb60c4caafb4aebdb0f2f9c76ebafca1538f2a&amp;dn=Alanis+Morissette+-+Hand+In+My+Pocket+%28Acoustic%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247109625,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Hand in My Pocket&quot; is a song written by Alanis Morissette and Glen Ballard, and produced by Ballard for Morissette's third album, Jagged Little Pill (1995). Its protagonist discusses the everyday troubles and worries that she encounters, but focuses on finding ways to stay relaxed and determined. It was released as the album's second single in 1995 and became Morissette's second number-one hit on Billboard's U.S. Modern Rock Tracks chart. &quot;Hand in My Pocket&quot; also received substantial airplay on pop radio, reaching the top five on the Top 40 Mainstream chart, but its success in the United Kingdom was limited.\n\nIn 2005, Morissette released Jagged Little Pill Acoustic, an acoustic version of Jagged Little Pill. &quot;Hand in My Pocket&quot; was its first U.S. single, and its video premiered in July 2005.\n\nJagged Little Pill Acoustic is the eighth album released by Alanis Morissette and an acoustic version of her album Jagged Little Pill (1995), released by Maverick Records in the United States on June 13, 2005. It was only available at North American Starbucks outlets until 26 July 2005, when it was made available in other retail stores. This limited availability led to a dispute between Maverick Records and HMV Canada, who retaliated by removing from sale Morissette's other albums for the duration of Starbucks' exclusive month-long sale. The album's single in the U.S. was &quot;Hand in My Pocket&quot;.\n\n&quot;Hand in My Pocket&quot; served as the theme song in the unaired pilot episode of the television show Dawson's Creek, but Morissette decided not to have it used as the theme after the show was picked up.\n\nThe song was covered by Rolf Harris on his 1997 album Can you tell what it is yet. It was parodied by ' Rockin Jock' but credit for this parody &quot; Evil Scotsman' this song usualy goes to Billy Connolly. The song has also been parodied by Amateur Transplants on the album Fitness to Practice as part of the song &quot;Snippets&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:51bb60c4caafb4aebdb0f2f9c76ebafca1538f2a","amp;dn":"Alanis+Morissette+-+Hand+In+My+Pocket+%28Acoustic%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51bb60c4caafb4aebdb0f2f9c76ebafca1538f2a","infoHashBuffer":{"type":"Buffer","data":[81,187,96,196,202,175,180,174,189,176,242,249,199,110,186,252,161,83,143,42]},"announce":[],"urlList":[]}}