{"title":"Coast to Coast AM - Sep 27 2009 - The Tricksters","uid":5105503,"size":57727791,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:529ca1ecc92f3d3006ed16f249c0af782036dc16&amp;dn=Coast+to+Coast+AM+-+Sep+27+2009+-+The+Tricksters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":4,"time":1254334490,"description":"The Tricksters\n\nDate: 09-27-09\nHost: George Knapp\nGuests: Christopher O'Brien\n\nGeorge Knapp welcomed author and paranormal investigator Christopher O'Brien, who discussed the legendary tricksters of mythology and how these entities may be manifesting in a myriad of ways that contemporary society describes as &quot;paranormal.&quot; According to tradition, he said, tricksters are amoral entities whose main function is to both break down the status quo and to introduce &quot;novelty and change into a static system.&quot; As its name suggests, O'Brien explained, the trickster is more often mischievous rather than evil, drawing confusion from those who encounter it.\n\nHaving examined the historical descriptions of tricksters in cultures throughout the world, O'Brien uncovered one prevailing trend: that the entity possessed the ability to shape shift. Based on that observation, he theorized that the trickster may be behind many of the staples of the paranormal world such as cattle mutilations, elementals like fairies and dwarfs, and even UFOs. Rather than an entity, per se, O'Brien speculated that the trickster is a force within the collective unconscious that takes on different characteristics depending on the culture observing it. He noted the bizarre airship wave of the late 1800's as a potential case of the trickster in action.\n\nO'Brien also voiced suspicions that that &quot;certain elements within our culture&quot; have discovered the nature of this trickster energy and are manipulating it for nefarious ends. Suggesting that this agenda has been ongoing for centuries, O'Brien noted that the emergence of monotheistic religions resulted in the trickster being &quot;cast as a demon&quot; so that it could be marginalized by those in power. However, he said, the trickster may actually be beneficial to mankind as its confounding nature could result in observers &quot;thinking outside of the box&quot; and coming up with revolutionary ideas which could change the world.\n\nArt Bell Update\n\nDuring the first hour, Art Bell phoned in to assure C2C listeners that he and his family are doing well despite the typhoon which struck the Philippines. He said that the nation got &quot;one month's worth of rain in six hours&quot; and that much of the Manila area is underwater. He described the situation as similar to Hurricane Katrina and that &quot;any help is welcome&quot; for the afflicted citizens of the Philippines.\n\nWebsite(s):\nourstrangeplanet.com\n\nBook(s):\nStalking the Tricksters\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:529ca1ecc92f3d3006ed16f249c0af782036dc16","amp;dn":"Coast+to+Coast+AM+-+Sep+27+2009+-+The+Tricksters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"529ca1ecc92f3d3006ed16f249c0af782036dc16","infoHashBuffer":{"type":"Buffer","data":[82,156,161,236,201,47,61,48,6,237,22,242,73,192,175,120,32,54,220,22]},"announce":[],"urlList":[]}}