{"title":"Agnes - Release Me","uid":5163038,"size":150632452,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:52b26c66465f74958a65fcc6daf22cd79208cd96&amp;dn=Agnes+-+Release+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258258521,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Release Me&quot; is a pop song recorded by Swedish singer Agnes taken from her third album Dance Love Pop. The track was written by Agnes Carlsson, Anders Hansson and Sharon Vaughn. It was released as the albums second single in Sweden, and as Agnes' debut single internationally.\n\nThe song has been critically appreciated for its swooping harmonies and Agnes' vocal talents. &quot;Release Me&quot; was another top ten hit for Agnes in Sweden and has also been charting in Belgium, Holland, Denmark, the UK and Ireland.\n\nIn July &quot;Release Me&quot; was released outside of Europe for the first time, in Australia, on Warner Music. The song was released in the United States on August 18th 2009.\n\nThe BBC's &quot;Chartblog&quot; said &quot;73% of why this is a great song rests with those amazing swooping harmonies. That's not to take anything away from Agnes's vocal talents, it's just her honeyed-rasp, set to a synth-disco backing, is not THAT startlingly new a sound. &quot;\n\nNick Levine of Digital Spy called &quot;Release Me&quot; &quot;far classier&quot; than other europop that is reaching the UK, like September and Velvet. He also said that &quot; the all-conquering chorus and thumping beats are present and correct, but this has lashings of strings and lavish production flourishes too.&quot;\n\nThe music video made for the European market was rejected by the American record company, Geffen/Interscope, and according to director Thomas Kloss she looked far too grown up. Therefore a new video was shot in Long Beach, Los Angeles in early September. The video was produced by Brett Marx. The new music video premiered one week after the new &quot;On and On&quot; video exclusive on September 30 on Popeater.com and one day after on Geffen's website andchannel.\n\nDance Love Pop is the third studio album by the Swedish singer, and Idol-winner Agnes. The album was released in Sweden in October 29, 2008 and features 10 tracks in total. Two tracks from the album were released as singles: &quot;On and On&quot; and &quot;Release Me&quot;, and the album peaked at number five on the Swedish Albums Chart. On April 1, 2009, a deluxe edition of the album titled Dance Love Pop: The Love Love Love Edition was released, featuring the original 10 tracks plus new song &quot;Love Love Love&quot;, remixes and music videos of the album's singles. The deluxe edition peaked at number 12 on the Swedish Albums Chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:52b26c66465f74958a65fcc6daf22cd79208cd96","amp;dn":"Agnes+-+Release+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52b26c66465f74958a65fcc6daf22cd79208cd96","infoHashBuffer":{"type":"Buffer","data":[82,178,108,102,70,95,116,149,138,101,252,198,218,242,44,215,146,8,205,150]},"announce":[],"urlList":[]}}