{"title":"The Prodigy - Invaders Must Die","uid":5002279,"size":115949572,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:549fc2d618433cb25c9129c210f39fb061e56962&amp;dn=The+Prodigy+-+Invaders+Must+Die&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247578026,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Invaders Must Die&quot; is the eighteenth single released by the British electronic band The Prodigy. It was released from the band's website as a free digital download on November 26, 2008. It was the first single from the album Invaders Must Die. The download was announced on November 24, in a newsletter sent to fans, and first aired on Zane Lowe's Radio 1 show as his 'Hottest Record in the World' on November 26. The song was co-produced by Does It Offend You, Yeah?'s James Rushent. Although not being a commercial single the track charted at 49 in the UK Singles Chart, whilst the Chase and Status Remix reached 53 in the Australian Aria Singles Chart and 7 in the Aria Dance Chart.\n\nThe music video features Noel Clarke walking around the British countryside and encountering or creating The Prodigy's &quot;ant&quot; logo. Among other places, he walks past the acoustic mirrors at Denge.\n\nInvaders Must Die is the fifth studio album by the electronic act The Prodigy which was released during February and March 2009 on the band's new label &quot;Take Me to the Hospital&quot;. The album was distributed by Cooking Vinyl. It is the first studio album released by the band since 2004's Always Outnumbered, Never Outgunned and is the first Prodigy album since 1997's The Fat of the Land to feature all three members of the band.\n\nDetails about the album were released on November 4, through The Prodigy's official newsletter. The band said that the album would go back to their &quot;old-school but cutting edge&quot; roots, and will feature collaborations with Dave Grohl (of Foo Fighters and Nirvana) and James Rushent (of Does It Offend You, Yeah?),[2] but would not feature any guest vocals. The album will be released as a CD, CD/DVD set, Double vinyl, digital download and a luxury 7-inch vinyl box set which will include five 7-inches, CD/DVD, bonus CD, poster, stickers and stencils.\n\nTo coincide with the release of the album, the band embarked on a nine date, UK arena tour, with support from Dizzee Rascal, Noisia and Fight Like Apes.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:549fc2d618433cb25c9129c210f39fb061e56962","amp;dn":"The+Prodigy+-+Invaders+Must+Die","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"549fc2d618433cb25c9129c210f39fb061e56962","infoHashBuffer":{"type":"Buffer","data":[84,159,194,214,24,67,60,178,92,145,41,194,16,243,159,176,97,229,105,98]},"announce":[],"urlList":[]}}