{"title":"Iggy Pop and Sum 41 - Little Know It All","uid":4986870,"size":124606468,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:54c4c46c2665d21b22390f2e2cdec8b2ae16845b&amp;dn=Iggy+Pop+and+Sum+41+-+Little+Know+It+All&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1246771187,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nThis video is the American version.\n\n\n&quot;Little Know It All&quot; is a song composed by pop-punk band Sum 41 for their performance with Iggy Pop on the album Skull Ring. This song was released as a single from the album. The song was performed live with Sum 41 on Letterman.\n\nThe single has two videos, one for America directed by Mike Piscitelli and one for Europe directed by Arni &amp; Kinski. In the American version of the video Sum 41 is performing with Iggy Pop in a club.\n\nSkull Ring is a 2003 album by Iggy Pop with backing collaborations by bands including The Stooges, The Trolls, Green Day, Sum 41, and Peaches.\n\nThe performers on most of the tracks on the album are The Trolls, Iggy's backing band from the Beat 'Em Up era, although members of his original band The Stooges also appear on some of the tracks.\n\nOne single, &quot;Little Know It All,&quot; was released from the album and featured Sum 41. A music video for the song received significant airplay.\n\nIggy Pop (born James Newell Osterberg, Jr. on April 21, 1947) is an American rock singer, songwriter, and occasional actor. Although he has had only limited mainstream success, Iggy Pop is considered an innovator of punk rock, garage rock, and other related styles. He is sometimes referred to by the nicknames &quot;the Godfather of Punk&quot; and &quot;the Rock Iguana&quot;, and is widely acknowledged as one of the most dynamic stage performers of all time. Pop began calling himself Iggy after his first band in high school, The Iguanas.\n\nSum 41 is a rock band from Ajax, Ontario. The current members are Deryck Whibley (lead vocals, rhythm guitar), Cone McCaslin (bass guitar, backing vocals), Steve Jocz (drums, backing vocals), and Thomas Thacker (lead guitar, backing vocals, keyboard)\n\nIn 1999, the band signed an international record deal with Island Records. Since then, the band has released four studio albums, all of which have been certified platinum in Canada. Their most successful album to date is All Killer No Filler, which is certified 3x platinum in Canada and platinum in the United States. The album was fueled by the single &quot;Fat Lip&quot;, which reached the top position on the Billboard Modern Rock chart, making it the band's most successful single. The second single from the album, &quot;In Too Deep&quot;, reached number-ten on the Modern Rock chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:54c4c46c2665d21b22390f2e2cdec8b2ae16845b","amp;dn":"Iggy+Pop+and+Sum+41+-+Little+Know+It+All","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54c4c46c2665d21b22390f2e2cdec8b2ae16845b","infoHashBuffer":{"type":"Buffer","data":[84,196,196,108,38,101,210,27,34,57,15,46,44,222,200,178,174,22,132,91]},"announce":[],"urlList":[]}}