{"title":"GHOST TOWN AAC H.264 5.1 BY WINKER","uid":5104946,"size":840766927,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5597fe5c93c3c5ea893d529069b1c02074df408b&amp;dn=GHOST+TOWN+AAC+H.264+5.1+BY+WINKER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alanwatson","files":-1,"time":1254297085,"description":"  \t\nImage\n\nDeadpan hilarity and quirky charm come alive in Ghost Town, starring Britain's favourite comedian Ricky Gervais (The Office) as social reject Bertram Pincus. Emmy award winner and seven times Bafta winner Gervais proves his Hollywood worth in this transatlantic feel good love story about a man, a woman and a ghost.\n\nPincus is a New York City dentist with horrendous people skills. When a routine surgery goes awry, Pincus is pronounced dead, but is miraculously revived seven minutes later. The ill-mannered Manhattanite suffers only one lasting after-effect; the ability to see and speak with the dead. Word soon gets out in the spirit community and Pincus is irritated to discover he's the go-to-guy for every phantom with unfinished business in the city.\n\nAt the forefront of the ghostly mob is recently deceased Frank Herlihy (Greg Kinnear - Little Miss Sunshine, Baby Mama), who is determined to stop the remarriage of his widow, Gwen (TÃƒÂ©a Leoni - Spanglish, Fun with Dick and Jane). The laughs unfold when the prickly and romantically inexperienced Pincus, smitten with Gwen, tries to woo her away from her betrothed - with hysterically awkward results.\n\nWith sharp performances and beautifully dry Gervais execution, Ghost Town won't fail to make viewers laugh out loud. With a host of special features including commentary from renowned director David Koepp and 'making Ghost Town', this is one DVD that should be in the collection of every Ricky Gervais fan.\n\n\nFormat : MPEG-4 at 1 140 Kbps\nLength : 800 MiB for 1h 38mn 5s 920ms\n\nVideo #0 : AVC at 976 Kbps\nAspect : 720 x 576 (1.778) at 25.000 fps\n\nAudio #0 : AAC at 160 Kbps\nInfos : 2 channels, 48.0 KHz\nLanguage : en","torrent":{"xt":"urn:btih:5597fe5c93c3c5ea893d529069b1c02074df408b","amp;dn":"GHOST+TOWN+AAC+H.264+5.1+BY+WINKER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5597fe5c93c3c5ea893d529069b1c02074df408b","infoHashBuffer":{"type":"Buffer","data":[85,151,254,92,147,195,197,234,137,61,82,144,105,177,192,32,116,223,64,139]},"announce":[],"urlList":[]}}