{"title":"Day 26 - So Good","uid":5154338,"size":157300740,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:55d1db49cf5c9fc252362aff4c70d01dc3013927&amp;dn=Day+26+-+So+Good&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1257762286,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nDay26 is a male R&amp;B/Hip Hop music group formed on August 26, 2007 by Sean &quot;Diddy&quot; Combs in a handpicked selection at the end of MTV's Making the Band 4. The group consists of Robert Curry, Brian Andrews, Willie Taylor, Michael McCluney, and Qwanell Mosley. The moniker is a tribute to the day when Andrews, McCluney, Mosley, Curry, and Taylor went from unknowns to stars. The group released their first album, Day26, on March 25, 2008, one week after their then label mates and Making the Band 3 winners Danity Kane released Welcome to the Dollhouse. The album's first single, &quot;Got Me Going&quot;, was released on the finale of Making the Band 4. The album went on to debut at number one on the billboard charts.\n\nMaking the Band 4 returned to MTV for another season and followed Day26, Danity Kane and Donnie Klang on the Making The Band tour. Season 3, Part 2 of Making The Band 4 debuted on February 12, 2009. The season followed Day26 as they recorded their second album, Forever in a Day, which was released April 14, 2009.\n\nForever in a Day is the second studio album by American R&amp;B band Day26, released on April 14, 2009.\n\nQue of the group stated in a Twitter message that they are shooting the video for &quot;Perfectly Blind&quot; today, May 31. Will of the group also stated in a video message that they were on the set of the video for &quot;So Good&quot; on June 2. Brian a day. On June 24, the Truth Is A Lie video premiered. On the same day the Girlfriend video premiered. Since its release on the iTunes Store, the album Forever in a Day (Bonus Track version) has reached #1 on the R&amp;B/Soul chart and the official Forever in a Day album has reach #27 on the same chart.The album debuted at number two on the Billboard 200, selling 113,000 copies in its first week of release, becoming the groups second top 5 album on the chart. The album slipped to number eight in its second week on the chart, selling 37,000 copies.[\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:55d1db49cf5c9fc252362aff4c70d01dc3013927","amp;dn":"Day+26+-+So+Good","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55d1db49cf5c9fc252362aff4c70d01dc3013927","infoHashBuffer":{"type":"Buffer","data":[85,209,219,73,207,92,159,194,82,54,42,255,76,112,208,29,195,1,57,39]},"announce":[],"urlList":[]}}