{"title":"2012 (2009)","uid":5171171,"size":1380678816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5632a8f7e73e5a3b1b8e8c63da9d3a5cff6940fd&amp;dn=2012+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheSyfer","files":2,"time":1258693284,"description":"I made a small error in creating this torrent but please don't let it put you off.\nThis is the actual 2012 (2009) release and it is one of the best quality torrents for this film.\nThe mistake i made when creating the torrent is i named the torrent 2021...\nJust a small typo that probably only a small number of you would realize.\nSo please don't start leaving comment on the torrent complaining about it, this was only my second torrent and I cant be bothered with immature behavior because someone made a mistake. \nGet over it.\n\n\nSPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER SPOILER\n\n\n\n\n\nIn 2009, American geologist Adrian Helmsley (Chiwetel Ejiofor) travels to India to meet his friend Satnam, who has discovered that neutrinos from a massive solar flare have penetrated the Earth and are causing the temperature of its core to increase rapidly. Adrian returns to Washington D.C. to inform White House Chief of Staff Carl Anheuser (Oliver Platt) and US President Thomas Wilson (Danny Glover) that this will instigate a chain of events that will bring about the end of the world. At the 36th G8 summit in 2010, other heads of state and heads of government are made aware of the situation. They collaborate to begin a secret project intended to ensure the continuity of human life, strategically choosing 400,000 people for admission on a series of gigantic arks to be constructed in the Himalayas. To help fund the venture, additional individuals are allowed to purchase tickets for one billion euros apiece.\n\nIn 2012, Jackson Curtis (John Cusack) is a writer in Los Angeles who works part time as a limousine driver for Russian billionaire Yuri Karpov. Jackson's ex-wife Kate (Amanda Peet) and their children Noah and Lily live with her new boyfriend, plastic surgeon and amateur pilot Gordon. Jackson takes Noah and Lily on a camping trip to Yellowstone National Park, where they meet Charlie Frost, a radio show host and conspiracy theorist. Charlie supports a theory that suggests the Mayans predicted the world would come to an end in 2012, and claims he has knowledge of the ark project and possesses a map of the arks' location. The family returns home as cracks begin to develop along the San Andreas Fault in California and earthquakes occur in the San Francisco Bay area. Jackson grows suspicious and rents a private plane to rescue his family. He collects his family and Gordon when the Earth's crust displacement begins and they escape Los Angeles as it collapses into the Pacific Ocean.\n\nAs millions begin dying in apocalyptic earthquakes worldwide, the group flies to Yellowstone to retrieve Charlie's map. The group narrowly escapes as the Yellowstone Caldera erupts. Charlie, who stayed behind to make a live broadcast of the eruption, is killed by the blast. Realizing the arks are in China, the group lands in Las Vegas, where they meet Yuri, his twin sons, girlfriend Tamara, and pilot Sasha. They join the group and secure a larger plane, the Antonov An-225, to head across the Pacific. Also bound for the arks aboard Air Force One are Anheuser, Adrian, and First Daughter Laura Wilson. President Wilson remained in Washington D.C. to address the nation one last time. He is soon killed by a tsunami that sends the USS John F. Kennedy crashing into the White House. With the Vice President dead and the Speaker of the House missing, Anheuser appoints himself acting Commander-in-Chief.\n\nSasha discovers that the plane doesnt have enough fuel to get to china, so they have to make a crash landing in the ocean. But as they get near the ground, they discover that they are indeed in china. The earths crusts have shifted.\n\nYuri, who has purchased ark tickets for himself and his sons, deserts the Curtis family, Gordon, and Tamara upon arriving in China. However, the abandoned group is picked up by Nima, a Buddhist monk. Together, they begin sneaking onto an ark through its hydraulics chamber with the help of Nima's brother Tenzin, a welder for the ark project. In his last moments, Satnam calls Adrian to inform him that a tsunami is engulfing India and heading towards the arks. Learning of this, Anheuser orders the arks be sealed before the boarding process is complete, trapping thousands outside. Adrian manages to convince the other G8 leaders to let the remaining people on board. As the ark's tailgate is lowered, Gordon is killed when he falls in between the gears, followed by Tenzin's large electrical power drill. Yuri sacrifices his life to get his two sons on in time, but the obstruction prevents the gate from closing, rendering the ship unable to start its engines. The tsunami arrives and begins to flood the ark, drowning Tamara and setting the ark helplessly adrift. Jackson and Noah work together to free the drill and its cable from the closing mechanism. The gate closes and the crew regains control of the ark, preventing a fatal collision with Mount Everest.\n\nA title appears that says &quot;Day 27 Month 00 Year 00&quot;\n\nWhen the floodwater from the worldwide tsunamis eventually recedes, satellite data shows that Africa rose in relation to sea level, and its Drakensberg mountains are now the highest on the planet. As the arks set sail for the Cape of Good Hope, Jackson reconciles with his family, and Adrian starts a relationship with Laura. The movie ends with a view of the Earth revealing all continents have merged, and are in the shape of the African continent.","torrent":{"xt":"urn:btih:5632a8f7e73e5a3b1b8e8c63da9d3a5cff6940fd","amp;dn":"2012+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5632a8f7e73e5a3b1b8e8c63da9d3a5cff6940fd","infoHashBuffer":{"type":"Buffer","data":[86,50,168,247,231,62,90,59,27,142,140,99,218,157,58,92,255,105,64,253]},"announce":[],"urlList":[]}}