{"title":"NCAA.Football.10_USA-XBOX360","uid":4997112,"size":6729846685,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:56687e97fa51169eceeadd2932ae1fe4c3f1d37c&amp;dn=NCAA.Football.10_USA-XBOX360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cheesey1423","files":72,"time":1247338290,"description":"NCAA.Football.10.USA-XBOX360\n\nFeatures\n\nNow you can settle who has the most school pride once and for all with NCAAÃ‚Â® Football 10. Whether you're playing head-to-head online, in Dynasty Mode against the CPU, or earning extra credits through skill, strategy, and sportsmanship, the all-new Season Showdown ensures that everything you do counts toward your goal of helping your school become the best in the nation. From all-new risk-reward strategic gameplay options to the revolutionary online create-a-school feature TeamBuilder, make a historic run for the national championship with NCAA Football 10.\n\n* All-new Season Showdown: In this new mode, every game counts as fans declare their loyalty to a favorite school and give the ultimate show of support in a nationwide competition. Credits accumulate in-game and credits can be earned for your school via new web-based games. Prove your school is number one with the Season Showdown.\n* All-new EA SPORTS TeamBuilder: Build your team with the online create-a-school feature for your very own personal team. Upload logos and choose from numerous customization options for uniforms, fields, rosters, and much more. TeamBuilder gives you the opportunity to design completely original teams with infinite possibilities, and share content with ease. Experience the excitement and pageantry of college football, defined by your own personalized creations.\n* And much more: New strategic playcalling, and new game planning add to the excitement of college football in NCAA Football 10.","torrent":{"xt":"urn:btih:56687e97fa51169eceeadd2932ae1fe4c3f1d37c","amp;dn":"NCAA.Football.10_USA-XBOX360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56687e97fa51169eceeadd2932ae1fe4c3f1d37c","infoHashBuffer":{"type":"Buffer","data":[86,104,126,151,250,81,22,158,206,234,221,41,50,174,31,228,195,241,211,124]},"announce":[],"urlList":[]}}