{"title":"star wars collection dvdrips","uid":5012371,"size":5083963722,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:567adfc09696be52bc894c6b907daa78d0d7349c&amp;dn=star+wars+collection+dvdrips&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".BONE.","files":-1,"time":1248058576,"description":"Star Wars: Episode I - The Phantom Menace\nDirector: George Lucas\nCountry: USA\nGenre: Action , Adventure , Fantasy , Sci-Fi\n \n \nPlot:The evil Trade Federation, led by Nute Gunray (Carson) is planning to take over the peaceful world of Naboo. Jedi's Qui-Gon Jinn (Neeson) and Obi-Wan Kenobi (McGregor) are sent to confront the leaders. But not everything goes to plan. The two Jedis escape, and along with their new Gungan friend, Jar Jar Binks (Best) head to Naboo to warn Queen Amidala (Portman), but droids have already started to capture Naboo and the Queen is not safe there. Eventually they land on Tatooine, where they become friends with a young boy known as Anakin Skywalker (Lloyd). Qui-Gon is curious about the boy, and sees a bright future for him. The group must now find a way of getting to Coruscant and to finally solve this trade dispute, but there is someone else hiding in the shadows. Are the sith really extinct? Is the Queen who she really says she is? and what's so special about this young boy? All these questions and more in the first chapter of the epic Star Wars saga.\n\n\n \nStar Wars: Episode II - Attack of the Clones\nDirector: George Lucas\nCast: Ewan McGregor, Natalie Portman,Hayden Christensen,Ian McDiarmid,Samuel L. Jackson,Jimmy Smits\nGenre: Action , Adventure , Fantasy , Sci-Fi\n \n \nPlot:As now-Senator PadmÃƒÂ© Amidala returns to Coruscant to vote on an important Senatorial matter, an assassination attempt on her life prompts the Jedi Council to send Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker to protect her and find out who the assassin is. As this is happening, a rogue Jedi named Count Dooku leads separatists on Geonosis to rebel against the Senate. Supreme Chancellor Palpatine moves for a vote for a Republic Army to protect the Republic, as there has not been a full-scale war since the formation of the Republic. As Obi-Wan's investigations lead him to Kamino, he finds a massive clone army being produced, with a bounty hunter - the last of the Mandalorians - named Jango Fett as the master clone. As he chases the elusive bounty hunter, Jango (and his cloned son Boba) leads Obi Wan to Geonosis, where he meets Count Dooku and finds a startling revelation about the former Jedi. As Anakin is left behind to protect PadmÃƒÂ©, his feelings for her grow into something more than friendship. From Naboo to Tatooine, it grows into love for her. But when a tragedy strikes Anakin's life, he begins slipping away from the Light Side of the Force, and perhaps from the Force itself.\n\n \nStar Wars Episode 3: Revenge Of The Sith\nDirector: George Lucas\nCast: Ewan McGregor, Natalie Portman,Hayden Christensen,Ian McDiarmid,Samuel L. Jackson,Jimmy Smits\nGenre: Action , Adventure , Fantasy , Sci-Fi\n \n \nPlot:It is three years after the Clone Wars. The leader of the droid army, General Grievous, has captured Chancellor Palpatine on board his ship, the Invisible Hand. Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker must fly through Coruscant safely, and enter the Invisible Hand so that they can rescue the captive Chancellor. Just when Palpatine is about to be released, Count Dooku shows up. Obi-Wan and Anakin both battle it out with him, but Obi-Wan ends up unconscious. Anakin slices off his head and kills him. Anakin carries Obi-Wan, and Palpatine follows him. They meet General Grievous face to face, and Anakin tries to fly the last half of the ship so that they can safely land on Coruscant. Later, Palpatine starts acting strange, constantly manipulating Anakin into believing that the Jedi Council is against him. Eventually, it is found out that he is the Dark Lord of the Sith. Jedi Master Mace Windu fights him, along with three other Jedi that accompany Windu. They all fail. Anakin becomes Darth Vader, believing that he can save Padme from death by becoming evil. After a fierce battle between Obi-Wan and Anakin, Anakin gets fried by the lava at Mustafar. Palpatine takes him to a medical facility, where he gets fake legs and a fake arm attached to him, along with a breath mask, and a helmet. And thus, Darth Vader was born...the Death Star is shown under construction, a weapon of mass destruction that is sure to be used in the future.\n\n \n\n \nStar Wars IV: A New Hope (1977)\nDirector:George Lucas\nGenre:Action | Adventure | Fantasy | Sci-Fi \nCast: Mark Hamill, Harrison Ford, Carrie Fisher, Peter Cushing, Alec Guinness...\nPlot:Part IV in a George Lucas epic, Star Wars: A New Hope opens with a rebel ship being boarded by the tyrannical Darth Vader. The plot then follows the life of a simple farmboy, Luke Skywalker, as he and his newly met allies (Han Solo, Chewbacca, Ben Kenobi, C-3PO, R2-D2) attempt to rescue a rebel leader, Princess Leia, from the clutches of the Empire. The conclusion is culminated as the Rebels, including Skywalker and flying ace Wedge Antilles make an attack on the Empires most powerful and ominous weapon, the Death Star.\n\n \n \n\n \nStar Wars: Episode V - The Empire Strikes Back (1980)\nDirector: George Lucas\nWriter: George Lucas, Leigh Brackett\nCast: Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Alec Guinness, Anthony Daniels, James Earl Jones, David Prowse, Peter Mayhew, Frank Oz...\nPlot: After receiving a vision from Obi-Wan Kenobi and fleeing the ice world of Hoth with his friends after an Imperial attack, Luke Skywalker travels to the marsh planet of Dagobah, where he is instructed in the ways of the Force by the legendary Jedi master Yoda. Meanwhile, Han Solo and Princess Leia make their way to planet Bespin, where they are greeted by Han's old friend, a shifty gambler named Lando Calrissian. Ambushed by the Empire shortly after their arrival, Han and his friends are imprisoned by Darth Vader. Luke leaves Dagobah to rescue his friends, and is met by Vader and a startling revelation.\n \n \n\n \nStar Wars: Episode VI - Return of the Jedi (1983)\nDirector: Richard Marquand\nWriter: George Lucas, Lawrence Kasdan\nCast: Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Alec Guinness, Anthony Daniels, James Earl Jones, David Prowse, Peter Mayhew, Frank Oz\nPlot:Darth Vader and the Empire are building a new, indestructible Death Star. Meanwhile, Han Solo has been imprisoned, and Luke Skywalker has sent R2D2 and C3PO to try and free him. Princess Leia - disguised as a bounty hunter - and Chewbacca go along as well. The final battle takes place on the moon of Endor, with its natural inhabitants, the Ewoks, lending a hand to the rebels. Will Darth Vader and the dark side overcome the rebels and take over the universe?\n","torrent":{"xt":"urn:btih:567adfc09696be52bc894c6b907daa78d0d7349c","amp;dn":"star+wars+collection+dvdrips","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"567adfc09696be52bc894c6b907daa78d0d7349c","infoHashBuffer":{"type":"Buffer","data":[86,122,223,192,150,150,190,82,188,137,76,107,144,125,170,120,208,215,52,156]},"announce":[],"urlList":[]}}