{"title":"IRON-MAN.DVDrip[vice]","uid":5156940,"size":611575976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:571bd7b5dc30f03fd216b407bc675891d26e0309&amp;dn=IRON-MAN.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1257906035,"description":"IRON MAN DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x272[wide screen]\nrun-time 02:06:01\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCAST\n\nRobert Downey Jr.\nTerrence Howard\nJeff Bridges\nGwyneth Paltrow\nLeslie Bibb\nFaran Tahir\nShaun Toub\n\nPlot\n\nTony Stark gambles at a Las Vegas casino, leaving his deceased father's friend and business partner, Obadiah Stane, to accept a prestigious award for him. As Stark leaves the casino with his entourage, he is approached by reporter Christine Everhart, whom he charms into a one-night stand at his Malibu house. When she awakens the next morning, Stark is gone and she is coldly greeted and helped on the way by Pepper Potts, his personal assistant.\n\nStark flies off to war-torn Afghanistan with his friend and company military liaison, Lieutenant Colonel James Rhodes, for a demonstration of Stark Industries' new weapon, the &quot;Jericho&quot; cluster missile. On the way back, however, his military convoy is attacked. In the firefight, his escort is wiped out and Stark himself is critically wounded by one of his own company's bombs.\n\nWaking up in an Afghan cave, he discovers an electromagnet embedded in his chest, placed there by fellow captive Dr. Yinsen. Powered by a car battery, it keeps shrapnel from working its way to his heart and killing him. Stark has been captured by a terrorist group known as the Ten Rings, whose leader, Raza, orders Stark to build a Jericho missile for him.\n\nInstead, during his three months of captivity, he and Yinsen begin secretly building a crude suit of armor, powered by a miniature &quot;arc reactor&quot; which also runs the electromagnet in his chest. Finally, the terrorists grow impatient and give Stark 24 hours to finish. Unfortunately, the terrorists become suspicious of their activities before the suit is fully activated, so Yinsen makes a suicidal attack in a desperate bid to buy time. Once the armor is ready, Stark charges through the caves. Near the entrance, a dying Yinsen tells him not to waste his life. Forever grateful to Yinsen, Stark burns all the munitions the terrorists have accumulated and then flies away, only to crash in the desert; Stark survives, but his suit is destroyed. After being rescued by Rhodes, Stark announces at a press conference that his company will no longer manufacture weapons. Stane tells him shortly thereafter that his decision is being blocked by the board of directors of Stark Industries.\n\nStark focuses his energies on building a better version of his power suit, while making an improved arc reactor for his chest. Once the new reactor replaces the old one, Potts gives Stark a gift: his first miniature reactor encased in glass and bearing the inscription, &quot;Proof that Tony Stark has a heart&quot;. During Stark's first public appearance since his return, he spots Potts wearing a dress gifted by him, and realizes that he has romantic feelings for his assistant. As they are about to share a kiss, Potts interrupts them by asking for a martini.\n\nWhile ordering the drinks, Stark is accosted by Everhart, who shows him pictures of Stark Industries weapons, including Jericho missiles, recently delivered to insurgents. He realizes that Stane has been supplying both the Americans and their enemies, and attempting to remove Stark from power. Enraged, Stark dons the power suit, flies to Afghanistan and rescues Gulmira, Yinsen's village, from the Ten Rings. While leaving, Stark attracts the attention of the United States Air Force, which dispatches two F-22 Raptors to try to identify the mysterious flying object. Rhodes is consulted about the nature of the object, but cannot offer help, and the fighters are ordered to destroy the target. During the resulting dogfight, Stark has time to reveal to Rhodes that he is the unidentified target. One of the planes is accidentally destroyed when it collides with Stark. The pilot ejects, but his parachute does not deploy, so Stark rescues him before escaping. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0371746/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0371746/&lt;/a&gt;\n\nplease seed and enjoy thanks\n\n\nscreen shots\nhttp://bayimg.com/oAeoJaAcM\nhttp://bayimg.com/oaEOLaACm\nhttp://bayimg.com/OaeOMAACm\n","torrent":{"xt":"urn:btih:571bd7b5dc30f03fd216b407bc675891d26e0309","amp;dn":"IRON-MAN.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"571bd7b5dc30f03fd216b407bc675891d26e0309","infoHashBuffer":{"type":"Buffer","data":[87,27,215,181,220,48,240,63,210,22,180,7,188,103,88,145,210,110,3,9]},"announce":[],"urlList":[]}}