{"title":"Oh God Dvdrip H264 Bookerdog.mp4","uid":5017732,"size":757484833,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:578cd95aa166b8e67e0a5931556912fd57321a00&amp;dn=Oh+God+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookerdog","files":-1,"time":1248302353,"description":"Category\tComedies, Religion\nStarring\tGeorge Burns, Paul Sorvino, Donald Pleasence, Ralph Bellamy, Teri Garr, John Denver, Barry Sullivan, Dinah Shore\nDirector\tCarl Reiner\nArt Director\tJack Senter\nComposer\tJack Elliott\nDirector of Photography\tVictor J. Kemper\nEditor\tBud Molin\nProducer\tJerry Weintraub\nScreenwriter\tLarry Gelbart\nDinah Shore, George Burns, John Denver, Paul Sorvino, Ralph Bellamy, Teri Garr - Director: Carl Reiner Suppose God personally recruited you to spread His word. That's what happens to supermarket manager John Denver in a graceful comedy classic blessed by the divine blend of three legendary icons of humor: George Burns, Director Carl Reiner and Screenwriter Larry Gelbart.\nJerry Landers (a terrifically surprising John Denver) is an average guy in every sense of the word. He lives a completely normal, dull life, working at the local supermarket (where everybody, of course, knows him and likes him) and never doing anything out of the ordinary. That's why no one is more surprised than he is when God chooses to make himself known to the world through Jerry by sending him a typewritten, misspelled note granting him an audience with the Supreme Being. Jerry doesn't believe his eyes when God turns out to be an old, scrawny man (who looks a lot like George Burns). First, God must convince Jerry that he really is whom he claims to be; as Jerry grow closer and closer to him, he starts growing apart from his family--his wife, played by Teri Garr, thinks he has lost all his marbles. As Jerry goes public with God's message, his faith is tested every step of the way, resulting in a very funny and meaningful trial scene. This wry, thoughtful comedy from Carl Reiner, based on the novel by Avery Corman, carries a serious message about religion, faith, and the way people care for the world they've been given. George Burns is delightful as the forthright, wisecracking God; his scenes with Denver are cinematic treasures.","torrent":{"xt":"urn:btih:578cd95aa166b8e67e0a5931556912fd57321a00","amp;dn":"Oh+God+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"578cd95aa166b8e67e0a5931556912fd57321a00","infoHashBuffer":{"type":"Buffer","data":[87,140,217,90,161,102,184,230,126,10,89,49,85,105,18,253,87,50,26,0]},"announce":[],"urlList":[]}}