{"title":"Monster In The Family [DVD 2006]","uid":5193293,"size":366929920,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5828fc38a0710aff61baba117eb58b2c6993b186&amp;dn=Monster+In+The+Family+%5BDVD+2006%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"r_bloodworth","files":1,"time":1259803645,"description":"In July 2004, one of Canada's most notorious criminals, Martin Ferrier, found himself free after spending much of the past 15 years in prison. With a media frenzy surrounding his release, Ferrier was back behind bars in less than 12 hours. Monster in the family reveals that the 6-foot-5, 275 pound prisoner is actually a relatively minor violent offender who has been demonized by the authorities, the media and, in an unlikely twist, by his own mother. Described as a &quot;wannabe serial killer&quot; and labeled an &quot;incurable psychopath&quot; and &quot;a serial rapist&quot;, Ferrier's July 2004 release made headlines across the country, even receiving a mention in Stephen Harper's 2004 federal election campaign. Throughout the film, writer/producer/director John Kastner contacts various authorities who know and have studied Ferrier throughout the years, many of whom disagree with the labels used to describe him. Martin's mother has led an unprecedented media campaign to try and declare her son as a dangerous offender and keep him behind bars for life. The documentary contains many surprising revelations about her troubling history with her son, as well as his relationship with the Peel Regional Police, and the shocking treatment Ferrier endured while imprisoned in a provincial segregation cell.\n\n2006\n46 minutes\n\n640x480\nXviD, Mp3","torrent":{"xt":"urn:btih:5828fc38a0710aff61baba117eb58b2c6993b186","amp;dn":"Monster+In+The+Family+%5BDVD+2006%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5828fc38a0710aff61baba117eb58b2c6993b186","infoHashBuffer":{"type":"Buffer","data":[88,40,252,56,160,113,10,255,97,186,186,17,126,181,139,44,105,147,177,134]},"announce":[],"urlList":[]}}