{"title":"Sezarbil - Dark God (2009)","uid":5192201,"size":79680216,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:58375cd50d9a23b10b7cdc3b59043d4222d1b060&amp;dn=Sezarbil+-+Dark+God+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Baphom3t","files":17,"time":1259765150,"description":"Sezarbil band was founded in January 1997 on the initiative of two former members of the band rozpadnuvÃ…Â¡ÃƒÂ­ Astaroth, Lord Sezarbila (guitar) and Charon (bass). Furthermore, the added Gemba (guitar), but the band after several months of operation under tragic circumstances leaving. Drum seized Antichrist and singing Raven. \n\nAt the end of October and November 1997, the band closed the Brno studio &quot;Eagle's Nest&quot; and created a demo CD &quot;The End of Faith ... Sacred occido, occidere. The band issued a demo CD / MC with the support manager WKM Production, Milan Fiala itself. Saw the light of day until the beginning of 1998. \n\nAfter testing the band goes to Brno Studies &quot;Danken George Lukas Studio&quot;, where filming material Split CD entitled &quot;Against all&quot;. In doing this, the ramparts are five, including the Immortality - instrumental taken from the test even when Gemba lived. The splitku are also band Maniac Butcher and Inferno. The black material published Pussy God Records in 1999 cost 666 pcs. \n\nIn the same study there is also other wicked thing bearing the name &quot;The Unknown Empire. This CD contains ten MC retreat and after some issues came up in almost a year late in 2000 with the company Leviathan Records. \n\nAs each pack, and Sezarbil undergone several personnel changes. For personal reasons, left the Antichrist and Charon. They have been replaced after a day of fasting Death music (drums) and Martes (bass), former members of Death Sentence. \n\nIn the summer of 2001 then leaving Martes and rotate Behemoth. At the end of 2001, leaving his place on drums and Death in his place comes bicmen Killy, who previously worked in a black metal project Heiglot, who founded the guitarist Lord Sezarbil. This report, however, does not last long. Under dramatic circumstances, and disagreement leave Sezarbil longtime singer Raven, and soon after the Behemoth and Killy. Raven's place went to new member - Vex, bass took Rosabis, both also members of the project Heiglot but futile search bicmena has brought nearly year-long break during which, however, Lord Sezarbil formed new songs to other material. \n\nIn the autumn of 2003 comes to hosting bicmen Tolbuchin. After playing a few gigs the band has been adopted. \n\nIn 2006, gives ex-Raven reissue the demo film &quot;The End of Faith ... Sacred occido, occidere&quot; + Live concert Bratislava 26.1.2001 (video) \n\nBand consists of: Lord Sezarbil (guitar), Rosabis (bass), Vex (vocals), Tolbuchin (drums). In this new formulation was filmed in a studio next wicked Forest board bearing the name &quot;Bleed for devil ...&quot; issued in January 2007 under the dark wings Murderous music production. This CD contains 8 songs. In late 2008, the band leaves the singer and bassist Vex Rosabis for personal reasons and are embarking on their post Raziel, which will not last long, however deadly pace, and thus leaves the band. Role bassist took Samoht. In 2009 the band further strengthens the dark creature Morion to post the second guitar.\n\nCurrent line-up \nLord Sezarbil (David Gregor) - Guitar, Vocals\nMorion - Guitar\nSamoth - Bass\nTolbuchin - Drums \n\nGenre = Black Metal\nFormat = mp3\nBit Rate = vbr\n\nTrack Listing\n1. Diabolis Inferi \n2. Temny Buh  \n3. Lucifer \n4. Sila Cernych Srdci \n5. Triumf Pekla \n6. Doba Temna \n7. Plameny Svobody \n8. Prisaha Jemu... \n9. Jezis Bastard  \n10. AVE!","torrent":{"xt":"urn:btih:58375cd50d9a23b10b7cdc3b59043d4222d1b060","amp;dn":"Sezarbil+-+Dark+God+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58375cd50d9a23b10b7cdc3b59043d4222d1b060","infoHashBuffer":{"type":"Buffer","data":[88,55,92,213,13,154,35,177,11,124,220,59,89,4,61,66,34,209,176,96]},"announce":[],"urlList":[]}}