{"title":"French Film Collection(Film 102) In Their Sleep (2010)","uid":6432941,"size":734015682,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:587c8867b1348aa2f9c237bc761111eef8d9717a&amp;dn=French+Film+Collection%28Film+102%29+In+Their+Sleep+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"forcefox","files":-1,"time":1306717818,"description":"ENGLISH SUBTITLES ARE AVAILABLE AT MY WEBSITE http://www.lovefrenchfilms.com/ IN THE FRENCH FILM SUBTITLES CATEGORY (I am not including subtitles with the films no more as I want people to get them from my website)\n\nWhile its content doesn\\\\\\\\\\\\\\'t reach the extremes of fellow French fare like Frontier(s), Martyrs, High Tension and Inside, In Their Sleep is shocking in its own right -- albeit in a less exploitive manner, a la Them.\nThe Plot\n\nA year after Sarah\\\\\\\\\\\\\\'s (Anne Parillaud) teenage son dies in a freak accident trying to sneak out of their new country home, she\\\\\\\\\\\\\\'s barely making her way through life, suffering from insomnia and losing herself in her job at a local hospital.\nOn her way home late one night, she hits a young man (Arthur Dupont) who darts out of the woods and in front of her car. Horrified, Sarah helps him into the vehicle, but rather than rush to a doctor, he tells her to just drive as fast as she can because he\\\\\\\\\\\\\\'s being chased. Sure enough, soon after she takes off, another car zooms dangerously close to them, but then mysteriously moves on.\n\nSarah\\\\\\\\\\\\\\'s battered and bruised passenger explains that his name is Arthur and he\\\\\\\\\\\\\\'s home alone while his parents are on vacation. He returned home that evening to find a burglar in the house, and having seen the man\\\\\\\\\\\\\\'s face, the prowler is now trying to kill him. Sarah\\\\\\\\\\\\\\'s maternal instinct kicks in when Arthur begs her to take him to her house, even though she has no phone to call the police.\n\nNot seeing the pursuer, she figures they\\\\\\\\\\\\\\'ll be safe until morning, when they can drive to the police station, but when the shadowy figure shows up, she soon finds herself in a life-or-death struggle to keep him out of her home. But as she starts to put the pieces of the puzzle together, Sarah begins to wonder if the man outside is more dangerous than the one inside.\n\nThe End Result\n\n\nArthur Dupont in \\\\\\\\\\\\\\'In Their Sleep\\\\\\\\\\\\\\'.\n\nÃ‚Â© IFC\nIn Their Sleep is a cleverly constructed, engrossing thriller that sputters only in the final 10 minutes, as it fails to pay off the exquisite tension built up over the previous hour-plus.\nThe paranoid story feeds on our fear of the unknown and plays on our expectations of the nature of evil. It thrusts the protagonist into a disorienting situation in which she ascertains certain truths, only to have them pulled out from under her, leaving her questioning everything around her. It\\\\\\\\\\\\\\'s a cat-and-mouse-and-cat scenario that questions who exactly is playing what role.\n\nSibling writers/directors Caroline and Eric du Potet use flashbacks to peel back the truth layer by layer, allowing the viewers to experience the shock of the revelation that Sarah feels in the story.\n\nUnlike many horror/suspense movies, there is a deep emotional core to In Their Sleep. Its treatment of the loss of a child and the desire to fill that void is moving and real. Thanks to strong performances and an understated directorial style that doesn\\\\\\\\\\\\\\'t tread too far into exploitive territory, the characters come off as sympathetic and human, even as they commit inhuman acts.\n\nPerhaps because you feel so emotionally invested in the film, the final climactic moments might feel like a bit of a let down -- or more appropriately, a punch in the gut -- although they adhere to In Their Sleep\\\\\\\\\\\\\\'s dark, uncompromising edge.","torrent":{"xt":"urn:btih:587c8867b1348aa2f9c237bc761111eef8d9717a","amp;dn":"French+Film+Collection%28Film+102%29+In+Their+Sleep+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"587c8867b1348aa2f9c237bc761111eef8d9717a","infoHashBuffer":{"type":"Buffer","data":[88,124,136,103,177,52,138,162,249,194,55,188,118,17,17,238,248,217,113,122]},"announce":[],"urlList":[]}}