{"title":"Wolfmother - Woman (Live)","uid":4987786,"size":147980292,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:59016e3b1fb808d848497e1cb2b62b748475c268&amp;dn=Wolfmother+-+Woman+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1246847348,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Woman&quot; is a song by Australian hard rock band Wolfmother, featured on their 2005 debut studio album Wolfmother. It was released as the band's fourth single in Australia on 17 June 2006, and later in the United Kingdom on 17 July. &quot;Woman&quot; won the award for Best Hard Rock Performance at the 49th Grammy Awards in 2007.\n\n&quot;Woman&quot; was featured in the soundtracks of The Game Plan, Major League Baseball 2K7, MotorStorm, Madden NFL 07, Tony Hawk's Project 8 and Pure, and is a playable song in Guitar Hero II. The song was remixed by MSTRKRFT, The Avalanches and JD Twitch, all of which appeared on one or more of the single's formats. The song was also used in promotional trailers during the second season of Prison Break. The song was used as the team entrance music for the Columbus Blue Jackets during the NHL 2008-2009 season. It is also on hit video game Saints Row 2.\n\nIn Australia, the song was ranked #45 on Triple J's Hottest 100 of 2004.\n\nWolfmother is the debut studio album by Australian hard rock band Wolfmother, originally released on 31 October 2005 in Australia. The album was later released internationally at various dates in 2006, with the addition of &quot;Love Train&quot; and a rearranged track listing. Wolfmother peaked at number three on the Australian ARIA Albums Chart and was certified five times platinum by the Australian Recording Industry Association. Six singles were released from Wolfmother's debut album: &quot;Mind's Eye&quot;/&quot;Woman&quot;, &quot;White Unicorn&quot;, &quot;Dimension&quot;, &quot;Woman&quot;, &quot;Love Train&quot; and &quot;Joker &amp; the Thief&quot;, the latter of which charted the highest at number eight on the ARIA Singles Chart. The album cover is taken from The Sea Witch by Frank Frazetta, though because it displays nudity the album is sold in Wal-Mart stores with an alternate cover featuring simply the band's white logo against a black background. It is the only album to feature co-founding members Chris Ross and Myles Heskett, who left the band in August 2008.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:59016e3b1fb808d848497e1cb2b62b748475c268","amp;dn":"Wolfmother+-+Woman+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59016e3b1fb808d848497e1cb2b62b748475c268","infoHashBuffer":{"type":"Buffer","data":[89,1,110,59,31,184,8,216,72,73,126,28,178,182,43,116,132,117,194,104]},"announce":[],"urlList":[]}}