{"title":"Democracy Now - 02 may 2011","uid":6361797,"size":449854776,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:594b1de14762c385e2a29d03fc5efc8974d97666&amp;dn=Democracy+Now+-+02+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1304356710,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 02, 2011\n\n- U.S. Forces Kill Osama Bin Laden In Pakistan\n- Eleven People Killed As Taliban Announces Spring Offensive In Afghanistan\n- Libya: Son Of Gaddafi Killed In NATO Strike, Pre-School For Down Syndrome Children Bombed\n- Scores Killed In Syrian Security Crackdown, Hundreds Arrested In House Raids\n- Yemen President Ali Abdullah Saleh Refuses To Sign Resignation Deal\n- Israel Withholds $90 Million In Tax Revenue Owed To Palestinian Authority\n- Left-Leaning Party Threatens Conservative Power In Canadian Election\n- U.S. Tornado Death Toll Tops 350\n- Thousands Call For Immigrant And Labor Rights In Nationwide Mayday Protests\n- Egypt Celebrates International Workers' Day For First Time Since 1952\n- San Francisco Newspaper Accuses Obama Administration of Intimidation\n\n\nSpecial reports\n\n- Jeremy Scahill on Killing of Bin Laden: Obama Has &quot;Doubled Down On Bush Administration Policy of Targeted Assassination&quot;\n\nThe manhunt for Osama Bin Laden is over. Nearly 10 years after the attack on the World Trade Center and Pentagon, U.S. forces are said to have assassinated the Saudi-born founder of Al Qaeda inside Pakistan. The U.S. operation was reportedly carried out by 25 Navy Seals under the command of the Joint Special Operations Command. At the time of his death, Bin Laden was reportedly living in a heavily fortified mansion just a mile from the Pakistani Army's principal military academy. We speak with Jeremy Scahill, the national security correspondent for The Nation magazine, who has followed the Iraq, Afghanistan conflicts closely as well as reported on the covert war inside Pakistan.\n\n\n- Talat Hamdani, Mother of 9/11 Victim: I Hope Death of Bin Laden Moves Country Toward Peace, Away From Revenge and Killing\n\nNew York City Police Cadet Mohammed Salman Hamdani died on Sept. 11 after he raced to the Twin Towers to help survivors. He earned a mention in the USA Patriot Act for his bravery, yet because he was a Muslim immigrant, the New York Post and others considered him a suspect until his DNA was discovered. We speak to his mother, a member of Sept. 11 Families For Peaceful Tomorrows, about the killing of Osama Bin Laden.\n\n\n- Did Pakistani Gov't Know Where Osama Bin Laden Was Hiding?\n\n&quot;The idea that Bin Laden got from Tora Bora to that house over the last seven or eight years without a single element of the Pakistani state knowing about it just doesn't ring true,&quot; said Pakistani journalist Pakistani Mosharraf Zaidi who has been reporting in Abbottabad. &quot;What rings even more hollow is the notion that somehow US military choppers, gunships could fly into Pakistan undetected.&quot; Pakistani writer Tariq Ali questions how Bin Laden could have been living inside a fortified compound within a mile of Pakistan's premier miltary academy.\n\n\n- &quot;One Killer Killing Another&quot;: Journalist and Activist Allan Nairn on Obama's Targeted Killing of Bin Laden\n\n&quot;Bin Laden is dead, but the world is still governed by bin Ladens. People cheer because they thought they saw justice, but this was not justice delivered by victims. This was one killer killing another,&quot; says Allan Nairn. &quot;... I think we need an American uprising, if we are to put a stop to this kind of killing of innocent people. We need an American Romero, someone like Archbishop Romero in El Salvador.&quot;\n\n\n- Ex-Defense Intelligence Analyst Joshua Foust: Death of Bin Laden Will Not Have Enormous Impact on Operations of Al Qaeda Affiliates Worldwide\n\nIn addition to Afghanistan, the United States is fighting Al Qaeda in the Arab Peninsula. We discuss the impact of Osama bin Laden's death there with Yemen expert and former Defense Intelligence analyst, Joshua Foust. &quot;From an operational standpoint, Osama bin Laden doesn't maintain very tight operational control over the different Al Qaeda franchises that are out there, including in Yemen, including in Somalia, and other places as well. So this is more of a symbolic victory,&quot; says Foust.\n\n\n- Ex-State Department Official Matthew Hoh: With Killing of Bin Laden, Why Are 50,000 U.S. Troops Still in Afghanistan?\n\nAfter two tours of duty in Iraq and serving in the State Department in Washington, D.C., Matthew Hoh became the United States' Senior Civilian Representative and political advisor in Afghanistan. He resigned five months into his contract, making him the highest-ranking U.S. government official to publicly quit over the war in Afghanistan. He joins us from Washington D.C. to discuss whether the death of Osama bin Laden means the end of that war. &quot;Everybody should be asking themselves today in the United States, if Osama bin Laden was hiding in an upscale villa an hour or two drive north, northeast of Islamabad, why do we have 50,000 troops in Afghanistan over the last two years?,&quot; says Hoh.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:594b1de14762c385e2a29d03fc5efc8974d97666","amp;dn":"Democracy+Now+-+02+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"594b1de14762c385e2a29d03fc5efc8974d97666","infoHashBuffer":{"type":"Buffer","data":[89,75,29,225,71,98,195,133,226,162,157,3,252,94,252,137,116,217,118,102]},"announce":[],"urlList":[]}}