{"title":"Autodesk SketchBook Pro 2011 [Win] mamed568","uid":6431427,"size":138930980,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:597a47c11f58c9709700a1c7c95c53c68f2f3ff0&amp;dn=Autodesk+SketchBook+Pro+2011+%5BWin%5D+mamed568&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mamed568","files":32,"time":1306665708,"description":"Features\n\nDesigned for use with tablet PCs or digitized pen tablets, AutodeskÃ‚Â® SketchBookÃ‚Â® Pro drawing and painting software is your digital sketchpad. It is easy to use with fast, reactive drawing and productivity-enhancing tools that help you express your ideas freely and boost production. Use it in any design process where pen and paper would traditionally be used, including:\n\n    Product concept design and ideation\n    Illustrations\n    Character studies\n    Set and level designs\n    Storyboarding\n    Annotation and review\n\nAutodesk Sketchbook Pro: A Natural Sketching Experience\n\t\nView Larger\n\t\n\nA Natural Sketching Experience\nSketchBook Pro is your virtual sketchbook. Designed specifically for pen-based interaction, SketchBook Pro enables you to transform your desktop computer, laptop, or tablet PC into a digital sketchpad. The intuitive interface makes it easy to access a host of tools and features, including pencils, markers, brushes, colors, guides, layers, and blending effects.\nAutodesk SketchBook Pro: Professional-Quality Tools\n\t\nView Larger\n\t\n\nProfessional-Quality Tools\nFamiliar brush types and realistic and completely customizable pencils, pens, markers, and airbrushes allow you to quickly and easily produce graphics. The power of drawing straight lines, rectangles, circles, and ellipses with draw modes or snapping-to guides are at your fingertips. Use the newly added Type options to easily add annotations and descriptions.\nAutodesk SketchBook Pro: Image Enhancements\n\t\nView Larger\n\t\n\nImage Enhancements\nThe look of your images can be fine-tuned by adjusting the colors, contrast, canvas size, and crop. Full-featured layers, including preserve transparency and blend modes, help you color and create.\nAutodesk SketchBook Pro: Any Creative Process\n\t\nView Larger\n\t\n\nAny Creative Process\nSketchBook Pro fits in virtually any creative workflow; load and view images and photographs for reference or mark up and annotate. SketchBook Pro lets you open and save images from a variety of image formats, including moving files directly in and out of AdobeÃ‚Â® PhotoshopÃ‚Â® software.","torrent":{"xt":"urn:btih:597a47c11f58c9709700a1c7c95c53c68f2f3ff0","amp;dn":"Autodesk+SketchBook+Pro+2011+%5BWin%5D+mamed568","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"597a47c11f58c9709700a1c7c95c53c68f2f3ff0","infoHashBuffer":{"type":"Buffer","data":[89,122,71,193,31,88,201,112,151,0,161,199,201,92,83,198,143,47,63,240]},"announce":[],"urlList":[]}}