{"title":"Master Converter 2.9","uid":6428289,"size":1513027,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:597b865f828ad6210d6df6204aa7418f18b10954&amp;dn=Master+Converter+2.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306556286,"description":"Master Converter 2.9\n\nYour one-stop source for all your conversion needs! Master Converter is an extremely easy-to-use program that can convert nearly 800 units in 39 categories, with the ability to add your own units and categories. Intuitive interface makes conversions quick and easy.\n\nMaster Converter is a powerful Windows utility designed to fill one specific purpose: quickly and easily convert units of measurement. The interface is extremely intuitive and user friendly, enabling even first-time users to convert from one unit to another without a hassle.\n\nMaster Converter is pre-configured to convert over 800 units in 42 categories. The categories include: length, area, volume, time, speed, acceleration, mass, density, force, energy, power, pressure, flow, data storage, data transfer, viscosity, temperature, magnetism, capacitance, charge, conductance, thermal conductivity, angle, angular velocity, luminance, illumination, numbers, fractions, radiation, and more.\n\nYou'll most likely find any unit you'll ever need already built in to Master Converter. If you find Master Converter is missing a unit you need, it's a snap to add your own custom units or your own custom categories! Master Converter will effortlessly grow to suit your needs.\n\nHome Page - http://www.savardsoftware.com/\n\n","torrent":{"xt":"urn:btih:597b865f828ad6210d6df6204aa7418f18b10954","amp;dn":"Master+Converter+2.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"597b865f828ad6210d6df6204aa7418f18b10954","infoHashBuffer":{"type":"Buffer","data":[89,123,134,95,130,138,214,33,13,109,246,32,74,167,65,143,24,177,9,84]},"announce":[],"urlList":[]}}