{"title":"Rollercoaster (Original Soundtrack, 1977)","uid":5182329,"size":72958734,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5a62c93ae74278edaaad843857e48013066d66ec&amp;dn=Rollercoaster+%28Original+Soundtrack%2C+1977%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"superclown","files":20,"time":1259306337,"description":"Now why would anyone rush out to see Star Wars in the summer of 1977 when they could go see Rollercoaster? With a madman on the loose trying to blow up various amusement park rides around the nation, with a government task force after him and a dedicated safety inspector (George Segal), why would anyone want to see the rebellion against the empire? Seriously, Rollercoaster was a very cheesy film, and it even featured Henry Fonda in a small role, and an even smaller role by a very young Helen Hunt. While it might not provide the right level of excitement to today's MTV-oriented ADD-suffering audience, I found the film to have it's share of moments. Musically, it provided a rather riveting soundtrack that blended the styles of the day with jazzy film scoring. No, I'm not referring to the abhorrent 10-minute sequence in the film with background music by the &quot;band&quot; Sparks; I'm referring to Lalo Schifrin's apropos (if not somewhat eclectic) underscore. \n\n&quot;Prologye, Montage&quot; gives you a good overall feel for the score - it showcases all of the different styles, from tense strings to smooth jazz to (dated) disco beats. The smooth jazz is a trademark of Lalo's style, and comes through wonderfully in &quot;Portrait of Harry&quot; and &quot;Another Side of Harry&quot;. The disco beats are featured in &quot;Rollercoaster&quot; and &quot;Merry-Go-Round&quot;. It's cheesy and fun, and you can't help but like it. The tense string motif in &quot;Reflections in the Window&quot; and &quot;Persistence&quot; certainly adds to the tension, but got a bit repetitive after a while. \n\nOne of the highlight tracks is &quot;Calliope of Death&quot;, which features a circus-like calliope with ominous strings. It reminded me a bit of the work Schifrin did on The Amityville Horror, and is a great mood-setter for the film. Another great cue is the &quot;Young Man's Theme&quot;, also known as &quot;Movement from String Quartette&quot; - it opens the film as a source cue, and before you know it, it's moved into the tense string motif mentioned above. It adds a slight touch of class, believe it or not! Speaking of source cues, &quot;Penny Arcade&quot; and &quot;Cotton Candy&quot; are two examples of cues that feature sound effects and background dialogue. It's not a bad thing, it adds to the atmosphere of the album. An interesting inclusion is &quot;Apple Turnover&quot;, a big-band jazzy number that runs almost four minutes - but is featured for less than four seconds in the final film. (It's the radio alarm clock that goes off - and is immediately silenced!) \n\nReleased through Lalo's personal label, Aleph Records, Rollercoaster already has my current bid for &quot;Guilty Pleasure Score of the Year&quot;. Of course, it's only February. But unless someone releases the score to Frogs, this one might be a winner! (Just kidding about Frogs - I haven't seen it yet.) Fortunately for us, Schifrin was able to clear the rights to the original soundtrack recording for the film, as opposed to going to the expense of doing a new recording. You don't necessarily have to have seen the film to enjoy this score - so go get it! \n\n","torrent":{"xt":"urn:btih:5a62c93ae74278edaaad843857e48013066d66ec","amp;dn":"Rollercoaster+%28Original+Soundtrack%2C+1977%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a62c93ae74278edaaad843857e48013066d66ec","infoHashBuffer":{"type":"Buffer","data":[90,98,201,58,231,66,120,237,170,173,132,56,87,228,128,19,6,109,102,236]},"announce":[],"urlList":[]}}