{"title":"Lorrie Morgan - Something In Red  (2nafish)","uid":5184158,"size":174135300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5ab0f3cd01f0275b50c96fd3769883875e665935&amp;dn=Lorrie+Morgan+-+Something+In+Red++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259392191,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nSomething in Red is an album by Lorrie Morgan. It reached #8 on the Billboard country albums chart, including the #3 &quot;We Both Walk,&quot; the #9 &quot;A Picture of Me (Without You)&quot; (a cover of a George Jones song from his 1972 album A Picture of Me (Without You)), the #4 &quot;Except for Monday,&quot; and the #14 title song. The duet with Dolly Parton, &quot;Best Woman Wins&quot;, appeared simultaneously on both Something in Red and Parton's album Eagle When She Flies.\n\nLoretta Lynn Morgan (born June 27, 1959, in Nashville, Tennessee), known professionally as Lorrie Morgan, is an American country music singer. She is the daughter of George Morgan, a country music singer who charted several hit singles between 1949 and his death in 1975. Lorrie Morgan charted her first single in 1978, although she did not break into the top of the U.S. country charts until her 1989 single, &quot;Trainwreck of Emotion.&quot; Since then, she has charted more than 25 singles on the Billboard Hot Country Singles &amp; Tracks charts, with three number one hits: &quot;Five Minutes,&quot; &quot;What Part of No&quot; and &quot;I Didn't Know My Own Strength.&quot; She has also recorded more than 15 studio albums. At various points in her life, Morgan has been married to three different country singers: Keith Whitley, Jon Randall and Sammy Kershaw.\n\nIn 1990, Morgan had her first number one single, &quot;Five Minutes.&quot; Morgan's second album, Something in Red, was released in 1991 and went platinum. The same year, she married her third husband, Brad Thompson, Clint Black's bus driver. Watch Me, her third album, was released on RCA's newest label, BNA Records; it contained the number-one single, &quot;What Part of No.&quot; Watch Me also was certified platinum, making Morgan the first female country artist to have three albums in a row to be certified platinum. Morgan's romantic life gained tabloid attention with Dallas Cowboys quarterback Troy Aikman following her second divorce.\n\nShe was voted, &quot;Female Vocalist of the Year,&quot; by the fans in TNN's Music City News Awards, in 1994. She would earn this honor again in 1996, 1997 and 1998. Morgan also appeared on Frank Sinatra's Duets II album, singing a version of &quot;How Do You Keep the Music Playing&quot; intertwined with Sinatra's, &quot;My Funny Valentine.&quot;\n\n1995 saw the release of Morgan's Greatest Hits CD, which produced her third and, to date, last number-one single in the song, &quot;I Didn't Know My Own Strength.&quot; The next year, Morgan was featured on the Beach Boys' now out-of-print album, Stars and Stripes Vol. 1, performing a cover of their 1964 hit, &quot;Don't Worry Baby.&quot; The Beach Boys provided the harmonies and backing vocals. 2006 Lorrie appeared on the album &quot;She was country when country wasn't cool-Barbara Mandrell.&quot;\n\nLorrie's latest album, A Moment in Time, was released on October 27 on the Stroudavarious label. It features 14 covers of traditional country favorites.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5ab0f3cd01f0275b50c96fd3769883875e665935","amp;dn":"Lorrie+Morgan+-+Something+In+Red++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ab0f3cd01f0275b50c96fd3769883875e665935","infoHashBuffer":{"type":"Buffer","data":[90,176,243,205,1,240,39,91,80,201,111,211,118,152,131,135,94,102,89,53]},"announce":[],"urlList":[]}}