{"title":"Celine Dion - Taking Chances","uid":5145274,"size":167153668,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5adc945f6fde8aaac2a0038cf03f245d380c7585&amp;dn=Celine+Dion+-+Taking+Chances&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1257228838,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Taking Chances&quot; is a single by songwriter Kara DioGuardi and ex-Eurythmics member Dave Stewart's band Platinum Weird, taken from their unreleased self-titled album. The song was originally released in February 2007, and later made famous by a cover version by CÃƒÂ©line Dion, released in September 2007. It was also featured in an episode of Fox Network's new show &quot;Glee&quot; with lead vocals by Lea Michele.\n\nCÃƒÂ©line Dion covered &quot;Taking Chances&quot; as the lead single and the title track from her 2007 English language album Taking Chances. The song premiered on the radio on September 10, 2007 and was released as a music download on September 18, 2007 in the United States and Europe. &quot;Taking Chances&quot; CD single was released on October 24, 2007 in Japan, between October 25 and November 12, 2007 in Europe, and on November 3, 2007 in Australia and New Zealand.\n\nDion's version was recorded on April 7, 2007 and produced by Grammy Award-winner John Shanks.\n\nKara DioGuardi also wrote and co-produced with Emanuel Kiriakou &quot;Surprise Surprise&quot; for the Taking Chances album. She has already written few songs for CÃƒÂ©line Dion in the past, including &quot;One Heart.&quot; The latter was co-written and co-produced by John Shanks and Kara DioGuardi, and released as a single in 2003. John Shanks also produced five other songs on Taking Chances.\n\nThe track &quot;Taking Chances&quot; was included later on the 2008 greatest hits My Love: Essential Collection.\n\nThe song was nominated for the Single of the Year at the Juno Awards of 2009.\n\nThe music video, directed by Paul Boyd, was filmed in three days, between September 15-17, 2007 in several different locations, in the Las Vegas area. The video is narrative heavy, as only one of the three shoot days was spent on performance. It includes a guest appearance by Platinum Weird member Dave A. Stewart. He described his cameo appearance as playing &quot;a kind of enigmatic 'boss' character from a James Bond movie,&quot; and also commented that it was about 100Ã‚Â°F during filming.\n\nThe video was released on October 16, 2007. Amazon.com and Columbia Records released also on September 10, 2007 the exclusive premiere of the new CÃƒÂ©line Dion song and in-studio video &quot;Taking Chances&quot; on Amazon's website.\n\nBoth, the music video and the recording sessions can be found on the Japan only released Ultimate Box.\n\nIn early 2008, the video was re-edited to fit the club remix, called Jason Nevins radio edit.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5adc945f6fde8aaac2a0038cf03f245d380c7585","amp;dn":"Celine+Dion+-+Taking+Chances","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5adc945f6fde8aaac2a0038cf03f245d380c7585","infoHashBuffer":{"type":"Buffer","data":[90,220,148,95,111,222,138,170,194,160,3,140,240,63,36,93,56,12,117,133]},"announce":[],"urlList":[]}}