{"title":"Firehouse - Don't Treat Me Bad","uid":4996362,"size":153837572,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5b3bd26674dee8ff181c9fbf9e4f846fec6b5b3b&amp;dn=Firehouse+-+Don%5C%27t+Treat+Me+Bad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247308265,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Don't Treat Me Bad&quot; is a song by FireHouse from their self-titled debut album. It was released as a single which went to #19 on the Hot 100, becoming the band's first charting single.\n\nFireHouse is the debut album of the band FireHouse. It was released in 1990 and launched the band into stardom. It was certified 2x Platinum in the United States, and Gold in Canada, Japan, and Singapore.\n\nThe album spawned three hit singles in &quot;All She Wrote&quot;, &quot;Don't Treat Me Bad&quot; and their signature love ballad, &quot;Love of a Lifetime&quot;.\n\nThe song Don't Walk Away was used in a scene of the 2008 movie The Wrestler, directed by Darren Aronofsky\n\nFireHouse is an American hard rock band formed in Charlotte, North Carolina in 1989. The band reached stardom during the early 1990s with hit singles like &quot;Don't Treat Me Bad&quot; and &quot;All She Wrote&quot;, as well as their signature ballads &quot;I Live My Life for You&quot;, &quot;Love of a Lifetime&quot;, and &quot;When I Look Into Your Eyes&quot;. At the 1992 American Music Awards, FireHouse won the award for Best New Hard Rock/Metal Band. They were chosen over Nirvana and Alice in Chains.\n\nDespite diminishing success in the United States as the decade progressed, the band remained very popular in Asia, mainly in countries like Japan, Thailand, and Singapore. FireHouse continued to release new material throughout the late 1990s and into the early 2000s, most of which has successfully charted in Japan. The band has also continued to tour internationally as of 2007, having participated twice in the annual Rock Never Stops Tour with other bands of the 1980s. FireHouse is estimated to have sold 7 million albums worldwide since their debut.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5b3bd26674dee8ff181c9fbf9e4f846fec6b5b3b","amp;dn":"Firehouse+-+Don%5C%27t+Treat+Me+Bad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b3bd26674dee8ff181c9fbf9e4f846fec6b5b3b","infoHashBuffer":{"type":"Buffer","data":[91,59,210,102,116,222,232,255,24,28,159,191,158,79,132,111,236,107,91,59]},"announce":[],"urlList":[]}}