{"title":"KILL BILL VOLUME 1&amp;2 IN H.264 BY WINKER","uid":5196996,"size":1892160061,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5c0abfc9d1d584b39710d62329842985087ab186&amp;dn=KILL+BILL+VOLUME+1%262+IN+H.264+BY+WINKER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alanwatson","files":-1,"time":1259966870,"description":"Hell hath no fury like a woman scorned! For the first time both parts of Quentin Tarantino's martial arts homage are available on this fantastic collection box set.\n\nKill Bill - Volume 1:\nIn part 1 of Quentin Tarantino's delirious revenge movie Uma Thurman plays 'The Bride', a woman seeking vengeance on those who massacred her wedding party...\n\nInspired by countless Japanese swordplay actionfests (the classic Lady Snowblood among them), yakuza gangster thrillers (offering a cameo opportunity to genre icon Sonny Chiba) and Chinese martial arts movies (hence the knowing appearance of Jackie Chan contemporary Gordon Liu), Quentin Tarantino borrows from the best in order to shape his deliciously over the top cinematographic style into a simple but effective plot.\n\nLook out too for 'Battle Royale' alumni Chiaki Kuriyama as Lucy Lui's weapon-wielding schoolgirl bodyguard and the gravel-voiced Shun Sugata (he of 'Ichi The Killer' fame who also appeared alongside Tom Cruise in 'The Last Samurai').\n\nHomage? Pastiche? 'Kill Bill' is not just for movie anoraks, complete with all the super-smooth tunes that you'd expect from a Tarantino soundtrack it's definitely the most outrageously entertaining film yet from cinema's king of cool!\n\nKill Bill - Volume 2:\n\nThe second part of Quentin Tarantino's deliriously stylish movie as The Bride (Thurman) continues her typically blood-soaked revenge quest...\n\nHaving killed two of the Deadly Viper Assassination Squad, The Bride continues her mission to avenge the three remaining names on her death list that turned her El Paso wedding party into bloody carnage and left her for dead. Her attention turns to Budd (Michael Madson), Elle Driver (Daryl Hannah) and finally the corpse littered path leads to Bill (David Carradine). However, an unexpected survivor complicates matters...","torrent":{"xt":"urn:btih:5c0abfc9d1d584b39710d62329842985087ab186","amp;dn":"KILL+BILL+VOLUME+1%262+IN+H.264+BY+WINKER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c0abfc9d1d584b39710d62329842985087ab186","infoHashBuffer":{"type":"Buffer","data":[92,10,191,201,209,213,132,179,151,16,214,35,41,132,41,133,8,122,177,134]},"announce":[],"urlList":[]}}