{"title":"Crocodile Physiks 604","uid":6442149,"size":90501991,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5c0dab093c38e96ed9ac63f2ccfc763d1cf43630&amp;dn=Crocodile+Physiks+604&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Philip1896","files":3398,"time":1307009198,"description":"ENGLISH\n-------\n\nCrocodile Clips develops and sells educational software and hardware. Our software is used worldwide, and is recommended by educationalists and governments for its &quot;constructional&quot; approach to teaching and learning. In some countries our software has been purchased for all state secondary schools.\n\nAs Crocodile Clips products are developed specifically for education, we focus on what teachers and students really need from the packages they use. Above all, we ensure that all of our products are both easy to use and engaging.\n\nOur product range includes: Sumdog - free online maths games, Yenka - a set of simulation and modelling tools for science, mathematics, computing and technology, and Absorb - a set of online courses.\n\nCrocodile Clips received a Queen's Award for Enterprise in 2000. The Award recognised the innovation demonstrated by Crocodile Clips in the development of its educational software.\n\nDEUTSCH\n-------\n\nCrocodile Clips entwickelt und vertreibt Bildungs-Software und Hardware. Unsere Software ist weltweit im Einsatz und wird von PÃƒÂ¤dagogen und Regierungen fÃƒÂ¼r ihre &quot;konstruktive&quot;-Ansatz fÃƒÂ¼r das Lehren und Lernen empfohlen. In einigen LÃƒÂ¤ndern unsere Software ist fÃƒÂ¼r alle staatlichen Gymnasien erworben.\n\nAls Crocodile Clips, die speziell fÃƒÂ¼r Bildung entwickelt werden, konzentrieren wir uns auf das, was Lehrer und SchÃƒÂ¼ler wirklich brauchen aus den Paketen die sie verwenden. Vor allem stellen wir sicher, dass alle unsere Produkte sowohl einfach zu bedienen und Eingriff sind.\n\nUnsere Produktpalette umfasst: Sumdog - kostenlose Online-Mathematik-Spiele, Yenka - eine Reihe von Simulations-und Modellierungs-Tools fÃƒÂ¼r Wissenschaft, Mathematik, Informatik und Technik, und nehmen - eine Reihe von Online-Kursen.\n\nCrocodile Clips erhielt einen Queen's Award for Enterprise im Jahr 2000. Die Auszeichnung wÃƒÂ¼rdigt die Innovation von Crocodile Clips in die Entwicklung seiner Lernsoftware demonstriert.\n\n\n\nLANGUAGE - SPRACHEN:     English, Deutsch","torrent":{"xt":"urn:btih:5c0dab093c38e96ed9ac63f2ccfc763d1cf43630","amp;dn":"Crocodile+Physiks+604","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c0dab093c38e96ed9ac63f2ccfc763d1cf43630","infoHashBuffer":{"type":"Buffer","data":[92,13,171,9,60,56,233,110,217,172,99,242,204,252,118,61,28,244,54,48]},"announce":[],"urlList":[]}}