{"title":"Charles Williams - The Sailcloth Shroud (pdf)","uid":5178072,"size":575672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c5d00ad63a05080b1d84f5cdaa51e113a81c903&amp;dn=Charles+Williams+-+The+Sailcloth+Shroud+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pigeye","files":1,"time":1259085194,"description":"The Sailcloth Shroud by Charles Williams -- pdf\n\n Charles Williams was an American writer of hardboiled crime fiction. He is regarded by critics as one of the finest suspense novelists of the 1950s and 1960s. His 1951 debut, the pulp paperback novel Hill Girl, sold over a million copies. A dozen of his books have been adapted for the screen, most popularly Dead Calm.\n--Wikipedia\n\n\n In The Sailcloth Shroud, Stuart Rogers, a charter yacht captain, is fixing up a forty-foot ketch called Topaz in the muggy harbor town of Southport, Texas. Two local detectives drop by to see Rogers. A man's dead body has turned up, his face smashed in. Rogers knows the man, and he's the second of two deck hands Rogers hired to bring the Topaz up from the Panama Canal to die. The first deck hand died en route of an apparent heart attack and was buried at sea. The police, knowing one man was murdered and having no way to determine how the other died, suspect Rogers of two murders. To make matters worse, the real killers are now after Rogers too, believing that he knows the whereabouts of a cache of money hidden by one of the dead men.","torrent":{"xt":"urn:btih:5c5d00ad63a05080b1d84f5cdaa51e113a81c903","amp;dn":"Charles+Williams+-+The+Sailcloth+Shroud+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c5d00ad63a05080b1d84f5cdaa51e113a81c903","infoHashBuffer":{"type":"Buffer","data":[92,93,0,173,99,160,80,128,177,216,79,92,218,165,30,17,58,129,201,3]},"announce":[],"urlList":[]}}