{"title":"Street-Fighter.The-legend-of-chun-li.2009.DVDrip[vice]","uid":5149963,"size":663952894,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5cf23ff31ced2599d4075efd3c8b68fe9c1380e5&amp;dn=Street-Fighter.The-legend-of-chun-li.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1257507894,"description":"STREET FIGHTER\nTHE LEGEND OF CHUN LI 2009 DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 01:37:22\nvideo bitrate 768\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCast\n* Kristin Kreuk as Chun-Li\n* Neal McDonough as M. Bison\n* Chris Klein as Charlie Nash\n* Michael Clarke Duncan as Balrog\n* Taboo as Vega\n* Robin Shou as Gen\n* Moon Bloodgood as Detective Maya Sunee\n* Edmund Chen as Xiang\n* Josie Ho as Cantana\n* Elizaveta Kiryukhina as Rose\n* Katherine Pemberton as Young Chun-Li\n* Cheng Pei-pei as Zhilan\nPLOT\n\nAs a child, Chun-Li moves from San Francisco to Hong Kong with her family. There, along with piano, she learns Wushu from her father, Xiang, a well connected businessman. One night, her home is attacked by Bison and his henchman Balrog. Chun Li's father fights them off until Balrog grabs a hold of a young Chun Li, forcing him to surrender.\n\nYears later, Chun-Li grows up and becomes a talented concert pianist. At the end of one of her concerts, she receives a scroll written in ancient Chinese text. On her way home, she sees a mysterious homeless man getting assaulted by street thugs. After the thugs leave, Chun Li tends to him and notices a spiderweb tattoo on his hand. Meanwhile, Xiang is shown working for Bison as a prisoner, only allowed to view pictures of his grown up daughter all. Back home, Chun Li's mother finally loses her battle to cancer as Chun Li and her servants mourn her loss at a funeral.\n\nElsewhere, Nash and Maya investigate the murder of several heads of criminal syndicate families in Bangkok. Chun Li on the side is meeting with a wise old lady in town who studies the scroll and tells her to find a man named Gen in Bangkok, revealing to her an image of the same spiderweb she saw tattooed on the homeless man's hand. With a new goal in mind, Chun Li leaves her home and heads to Bangkok. After days of searching for Gen without any luck, she sees a man being assaulted in an alley by thugs. Chun Li comes to his rescue and fights them. After a long battle ended by finishing them with a Bike Rack Drop Ultra move, Chun Li collapses in exhaustion. There, we see Gen pick her up to take her to his home.\n\nGen tells Chun Li that he knows how to find her father and that Bison has him, but that she also needs anger management. In response, she goes to an internet cafe to find out more about Bison, who is now holding the families of property owners hostage in order to force them to sign their property over to him. Upon leaving, one of the owners is asked to hand over the rights to a docking harbor, allowing the shipment of the &quot;White Rose&quot;. Chun Li overhears this. Meanwhile at Interpol, Nash figures out that Bison's headquarters are right across the street from the Police Station.\n\nLater that night, Cantana, one of Bison's secretaries, goes to a nightclub. Chun Li spies on her and notices her eyeing the girls in the club. Chun Li moves in and seductively dances with her before casually walking away into the bathroom. Cantana follows her and locks the bathroom door. Chun Li beats Cantana until Cantana reveals the location of the White Rose. Cantana's bodyguards come back and Chun Li escapes after fighting them off.\n\nWe are then told of Bison's origins. He is the son of Irish missionaries. He grew up an orphan having to steal fish from people in Thailand. In order to lose his conscience, he forced his daughter out of the womb of his wife prematurely. This transferred his conscience into her, thus Bison no longer had/has a conscience. Back at Gen's home, Bison's henchmen come after Gen and Chun Li. Gen fights them off until Balrog blows up his house with a RPG. With Gen gone and nowhere to be found, Chun Li runs off. She is then attacked by Vega, who she defeats soundly and hangs upside down over the side of a building.\n\nChun Li then heads to the harbor and interrogates an employee into telling her the arrival time of the White Rose. Later that night, this turns out to be a trap as several Shadaloo soldiers capture her. Chun Li is then taken back to Shadaloo headquarters and is reunited with her father. Bison tells her that Xiang outlived his usefulness and breaks his neck, killing him. Bison and Balrog leave Chun Li to the henchman to finish off. Chun Li however escapes when they try to swing her around from the ceiling like a pinata. As she runs away, she is shot in the waist by Balrog. Before Balrog could recapture her, the crowd begins throwing durians at him. This scares Balrog as he drives off in his Mercedes-Benz. Chun Li meanwhile, is rescued again by Gen, who narrowly escaped death and survived the explosion in his house. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0891592/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0891592/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:5cf23ff31ced2599d4075efd3c8b68fe9c1380e5","amp;dn":"Street-Fighter.The-legend-of-chun-li.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cf23ff31ced2599d4075efd3c8b68fe9c1380e5","infoHashBuffer":{"type":"Buffer","data":[92,242,63,243,28,237,37,153,212,7,94,253,60,139,104,254,156,19,128,229]},"announce":[],"urlList":[]}}