{"title":"Dave.I.D-Response-(Advance)-2011-SiRE","uid":6406237,"size":80005975,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5cf69fde46c038f992a9f20f2e7c63d73dbe8acf&amp;dn=Dave.I.D-Response-%28Advance%29-2011-SiRE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":14,"time":1305816733,"description":"Artist:  Dave.I.D\nTitle:    Response\nLabel:    K7\nGenre:    Drum &amp; Bass\nBitrate:  261kbit av\nTime:    00:40:20\nSize:    79.91 mb\nRip Date: 2011-05-18\nStr Date: 2011-06-13\n\n01. When Everything Is In It's Place                              3:34\n02. SumR                                                          4:40\n03. The Takeover                                                  3:46\n04. You Me Come For                                              4:48\n05. Oil                                                          3:39\n06. HIS                                                          4:58\n07. Now                                                          3:40\n08. Marvel                                                        4:24\n09. There's A Kingdom For That                                    3:46\n10. Mine                                                          3:05\n\nRelease Notes\n\nDave.I.D likes to think for himself. Always has done. Its the reason\nwhy his debut album didnt go quite according to his initial plan. He\nwas going to make, to use his own words, something pretty simple and\nstraightforward. But then he noticed lots of his friends were\ndiscovering new beliefs. Some even tried to convert him. I'm very\nopen-minded to different beliefs, but I question and see things\nslightly differently, he says. Without necessarily wanting to, he\nfound himself reflecting on existential questions. The album is a\nrecord of the time that it was made, and thats what was going on in my\nlife at the time. I didnt necessarily want to make the debut album\nlike that. I felt I had to make it\n\nThe cerebral inspiration catapulted him into musics outer rim. He\nbeamed back a dark, dense sometimes confrontational sound, but\nultimately compelling sound. But, in the end, it turned out to be a\nhappy accident because the resulting record, called Response\nappropriately enough, is mind-bendingly inventive, brilliantly\noff-kilter and constantly surprising. On HIS ethereal vocals echo\nover funereal synths. Its darkly evocative, like a forgotten gem by\n80s industrial heroes Chris &amp; Cosey. Elsewhere the clanging beats,\nnoirish chords and pugnacious melodies of When Everything Is In Its\nPlace recall harder edged industrial influences such as Einstrzende\nNeubauten\n\nCrucially, the tough sonics are paired with killer melodies: this is\ndeep, heavy music you can hum. The juddering rhythms on You Me Come\nFor underpin an anthemic chorus of warm digital fuzz and strangely\nuplifting vocal keens. Meanwhile, SumR is built around a baroque\nharpsichord riff, over which Dave flips and vaults with brooding\ntunefulness. And despite the industrial references, its definitely not\nsome retro homage. There are hints of Warp-style electronica,\nexperimental noise that echoes bands such as Liars, the sharp fusion of\nmind-busting innovation and melody which recalls TV On The Radio and\noblique nods to the post-dubstep scene, the latter a similarity of mood\nrather than a shared sound. In short, its a record that could only\nhave been made now\n\nDave i.d, started making music in earnest in 2006. Before that it was\njust messing around with computers in his bedroom. In the first place\nmaking music was a way of stopping myself going crazy, he explains\nIt was better than sitting in a room talking to myself. It was also\nan escape from the daily grind of studying to be an accountant. Ever\nsince I was at primary school I was good at maths, he explains. I\nwanted to do something with numbers, but I chose the most boring thing\nto do with numbers possible. In the end I gave it up because it was so\nboring\n\nHis first release, Why Werent The Message Sent, came at the\nbeginning 2009. Like the album, he made the track in a\n10-foot-by-ten-foot wooden cube sitting in the storage space of a\nformer art gallery. Its an old art project, which has a\nmulti-functional use he explains. At present I call it Daves\nStudio\n\nWorking alone is important to Dave.I.D. He doesnt think hed be an\neasy person to collaborate with. For me working alone is the only way\nI know how to work. To have something interfere with the way Im used\nto working might not have worked out. I imagine I would have lost\ninterest if someone else had got involved and started sprinkling their\nfairy dust on it. I like to do things a certain way\n\nHes reluctant to talk about influences, and hes got a point he\ndoesnt really sound like anyone else. That said, the records he was\nlistening to while making Why Werent The Message Sent and later\nResponse help make sense of his singular sound. I got into a lot of\nnoise bands like Ex Models. I felt a strong connection to the second\nand third Liars albums, They Were Wrong, So We Drowned (2004) and\nDrums Not Dead (2006). The Drift by Scott Walker is a great album\nI think those are the people that have had an effect on me musically\nThe common thread is a prioritisation of sound over melody. I got\nreally interested in stuff like that because textures are always more\nimportant to me than a tune, he confirms. But if you can use good\ntextures and still write a good tune then thats OK too\n\nAsk him about the future, and he responds instantly. My dream is for\nthis to be an option. Im ambitious. I want people to like what I do\nThe difference is that Im not going to sugar coat it for you. I dont\nhave that need. I really just like pleasing myself at the moment\n\nIts more of a passive statement than a modern update of Suicides\nconfrontational stance. Thing is, while pleasing himself hes made an\nalbum that fizzes and pops with creativity. Hes going to have to get\nused to other people being pretty pleased with it too\n\n","torrent":{"xt":"urn:btih:5cf69fde46c038f992a9f20f2e7c63d73dbe8acf","amp;dn":"Dave.I.D-Response-%28Advance%29-2011-SiRE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cf69fde46c038f992a9f20f2e7c63d73dbe8acf","infoHashBuffer":{"type":"Buffer","data":[92,246,159,222,70,192,56,249,146,169,242,15,46,124,99,215,61,190,138,207]},"announce":[],"urlList":[]}}