{"title":"HR basic Windows PiZ encoding","uid":5155394,"size":7303758,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5d1e42c592e76d7d2170dfa5f34fd57fd0c43607&amp;dn=HR+basic+Windows+PiZ+encoding&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HolyRoses","files":1,"time":1257814233,"description":"No frills basic (PSP, iPod, Zune) (480 x XXX) encoding for Windows.\n\nComes with batch file.  You will have to edit parameters in batch file for each encode.  This is not a GUI program.  If you do not possess the skills to open and edit text files then this is not for you.\n\nYou will have to enter in a minimum of the following values:\n\nencode_file\ndimensions\naspect\ntitle\noutput_file\n\nUse included spreadsheet to determine dimensions and aspect.  Only use the data from line 32, PSP data only for dimensions and aspect.  This spreadsheet is for many profile but script only setup for PSP dimensions.\n\nTo determine the original width and height you can run command ffmpeg -i &lt;source file&gt;  (do not include the &lt; &gt;)  or you can run mediainfo on the source file.\n\nExample included in batch file is for TV show.  Sample has threads set to 2, if you have a quad core cpu you should adjust this to 4 or until all of your cpu's are at max utilization.\n\nGives exact same PiZ encode as encode-handheld.pl but extremely limited logic.\n\nCould prove useful to some people.  It works fine, just no real logic.  If someone wants to add the advanced logic from encode-handheld.pl be my guest.  For simplicity sake there aren't variables for cropping or padding, although you can quickly add those in if you like.  Only one you would really want for PiZ would be cropping and that would be if you are coming from DVD or uncropped bluray source.\n\nOn Intel core 2 duo 2.8 ghz it runs at roughly 38-46 fps depending on pass.  Whopping 7fps on a 2.4ghz pentium 4.\n\nNote:  The default windows command prompt is not wide enough to prevent scrolling of the encode FPS.  To make it wider click the upper left pull down on the command window, select properties, select layout, adjust width to like 120 and height to 500.  Now it will not scroll as it processes.\n\nBase tools:\nffmpeg\nAtomicParsley\njhead\n\nWarning: There is no logic to prevent you from overfilling the description character count.  The max description is 255 characters including spaces and what not.  If you put in too large of a description you will screw up the atoms and it can't be fixed without rebuilding.\n\n\n-HR\n\n\nSome extra notes/findings:\n\nok, please realize that batch script is very basic.\n\nin helping someone else they got hung up on this line\n\nset aspect=16:9\n\ndont include any colons for this, ffmpeg only understands 16:9 and 4:3 in this notation.  for all others just put like 2.35, 1.86, etc.  just copy and paste the AR from line 32 in spreadsheet.\n\nThey also got hung up on the thumbnail.\n\nset jpg_dimensions=160x90\nset jpg_padtop=16\nset jpg_padbottom=14\n\nthat is for 16:9\n160/90 = 1.7777778\nyou then have to fill the remainder with pads.\n\nso for a 2.35 you would do 160/2.35 = 68\n160x68\npad 26 top and bottom\n\n\nnext major part is all itunes flags.  these are pre populate for a tv show as i would have release it.  they are not all applicable to a movie.\n\ni suggest making 2 batch file or 3, one for movie, one for tv show, one for music vid.  and only use atoms you want, make the rest of them = &quot;&quot;\n\nif doing a series you would have to make as many batch as there is to the series.  then call all the batch from another batch.\n\n\nanother update:\n\nI have noticed this version of ffmpeg ships with an inferior AAC encoder.  It does not come with libfaac compiled in.  You may want to search for another static compiled ffmpeg that has libfaac.  In tests with certain audio it produces weird static and warble like sounds.\n\nYou can see it was removed here: &lt;a href=&quot;\nhttp://ffmpeg.arrozcru.org/autobuilds/blog/2009/05/19/libfaac-removed/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ffmpeg.arrozcru.org/autobuilds/blog/2009/05/19/libfaac-removed/&lt;/a&gt;\n\nso get an older version from the main page here &lt;a href=&quot;\nhttp://ffmpeg.arrozcru.org/autobuilds/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ffmpeg.arrozcru.org/autobuilds/&lt;/a&gt;\n\nor use the links to find someone else who compiles ffmpeg for windows and leaves in libfaac. If you do use another binary that has libfaac compiled in you will have to change the acodec from aac to libfaac.  If you don't it will still use the freebie aac encoder.\n\nsmall update on batch file here: &lt;a href=&quot;\nhttp://ra&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ra&lt;/a&gt; p  id shar e.com/files/306279782/PiZ_encode_TV_Show.cmd\n\nthis update includes cropping support in the batch file.\n\n-HR\n","torrent":{"xt":"urn:btih:5d1e42c592e76d7d2170dfa5f34fd57fd0c43607","amp;dn":"HR+basic+Windows+PiZ+encoding","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d1e42c592e76d7d2170dfa5f34fd57fd0c43607","infoHashBuffer":{"type":"Buffer","data":[93,30,66,197,146,231,109,125,33,112,223,165,243,79,213,127,208,196,54,7]},"announce":[],"urlList":[]}}