{"title":"The Black Packet Vol 2:What Are They Trying To Sell (DVD Master)","uid":5161416,"size":4619314694,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5e753a43a4963ca176af6d362999c0b6177c5208&amp;dn=The+Black+Packet+Vol+2%3AWhat+Are+They+Trying+To+Sell+%28DVD+Master%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"brainphreak","files":-1,"time":1258169770,"description":"For more info including screenshots visit:\nhttp://www.brainphreak.net/theblackpacket/freedvds.html\n-------------------------------------------------------\n\nTHE BLACK PACKET Vol. 2\n&quot;Now What Are They Trying To Sell Me?&quot;\n\nPurpose: This DVD was intended to be burned and distributed to others to help educate them on the current methods of mass marketing and manipulation of children and adults. From the efforts to convince perfectly healthy adults that they are sick, to the brainwashing schemes used to cause children to &quot;nag&quot; their parents for toys, this DVD should be an eye opener for even the most skeptical.\n\nThis DVD is edited with profession menu navigation and is fully compliant with all standards in the US.\n\nDVD Contents:\n\n- 3 Full Movies\n     - The Merchants Of Cool: Marketing to Teenagers and Creating Trends\n     - Consuming Kids: The Commercialization Of Childhood\n     - Selling Sickness: How Big Pharmacuetical Companies Are Turning Us All Into Patients.\n\n- 1 &quot;Extra's&quot; Sub-Menu\n     - How Television Effects Your Brain Chemistry (Approx 4min)\n     - Urls for the Movies and Reminder to look at DVD contents in a PC.\n\n- DVD-ROM eXtra's (If put in a standard PC DVD-ROM):\n\n     - 10 E-Books\n            - &quot;The Deliberate Dumbing Down of America&quot; - Charlotte Iserbyt\n            - &quot;Media Control - The Spectacular Achievements of Propaganda&quot; - Noam Chomsky\n            - &quot;Propaganda (How The Media Molds Your Mind)&quot; - Edward Bernays\n            - &quot;The Chasm - Collectivism vs Individualism&quot; - G Edward Griffin\n            - &quot;Bias - A CBS Insider Exposes How the Media Distort the News&quot; - Goldberg\n            - &quot;The Best Democracy Money Can Buy&quot; - Greg Palast\n            - &quot;Mind Control, World Control - The Encyclopedia of Mind Control&quot; -  Keith\n            - &quot;Public School Kids Deliberately Dumbed Down&quot; - American Free Press\n            - &quot;Weapons Of Mass Deception&quot; - Shechter\n            - &quot;The Best Enemy Money Can Buy&quot; - Antony Sutton\n            \n\n     - 4 Audio Books\n            - The Revolution: A Manifesto - Ron Paul\n            - Predictive Programming - Alan Watt\n            - Invoking the Beyond - Vyzygoth with Collins Bros\n            - The Ultimate Revolution the Scientific Dictatorship - Aldous Huxley \n\n     - 5 Videos (FLV)\n            - How Television Works\n            - How The News Works\n            - How The Fake News Works\n            - Students Guide to University Part 1\n            - Students Guide to University Part 2\n        NOTE: I also included VLC media player for viewing the videos.\n\n     - Several Images mostly all from www.deesillustration.com\n\n\n\nThis DVD is in standard NTSC format and encoded at 2048 bitrate for compatibility.\nThis DVD &quot;should&quot; play in every standard Video DVD player in cars, homes, etc.\nThis DVD fits on a standard 4.7GB (4.38GB) Blank DVD.\nThis DVD is intended to be burned and GIVEN away but NEVER sold.\nThis DVD WILL wake people up if they watch it, no conspiracy nut stuff in here, just the facts.\n\nPlease visit www.theblackpacket.com for more information and free direct downloads, torrents, and links to streaming editions of tons of films, audio, and pdf's all relating to the &quot;truth&quot; outside the matrix.\n\nThanks to everyone at &quot;Conspiracy Central&quot; where I am sure I downloaded a large portion of these e-books and/or other content on this DVD. Thanks to all the filmmakers, authors, speakers, and artists who created the content I am lucky to share with others, I always stress the importance of supporting you. \n\nIf you would like to contribute ideas, time, projects, links, downloads, complaints, compliments, or anything else... Please do email me at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7f0b171a1d131e1c140f1e1c141a0b3f18121e1613511c1012&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; . All feedback is greatly appreciated, keep up the fight and be sure you dont forget to enjoy life while you are fighting the NWO and daily corruption, your health depends on it!\n\n=========================\n\nBurning instructions:\n\nYou will have a standard video_ts folder full of the video files. Additionally there are data files including PDF's, audio files etc. Any DVD burning program will generally allow you to burn the files as a video DVD. Just drag all files into the burning program making sure the video_ts files go in the correct video_ts directory. All files are in the correct directory structure and can be burned 'as is'. If you dont already have nero or something, then you can follow these directions for burning a video DVD: &lt;a href=&quot;\nhttp://www.gromkov.com/faq/faq2004-0026.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gromkov.com/faq/faq2004-0026.html&lt;/a&gt;\n\nIt also has a link to a free program for burning them. Good luck and burn a bunch! leave them somewhere, return them with your next DVD rental, and give copies to you friends and family!\n\nThis DVD is for INFORMATIONAL purposes and should be spread far and wide to help educate work towards a better future. \n\n\n=========================\n\n\nPLEASE HELP SEED THESE UNIQUE DVD'S. I MADE THEM MYSELF AND THEY ARE TOP QUALITY! PLEASE VIEW SCREENSHOTS IF NOT CONVINCED! &lt;a href=&quot;\nhttp://www.brainphreak.net/theblackpacket/freedvds.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.brainphreak.net/theblackpacket/freedvds.html&lt;/a&gt;\n\n=========================\n\n\nStay Tuned for more DVD's of equal or better quality and content, made specifically for handing out!\n\n\n- **brainphreak**\n\nwww.theblackpacket.com\t\t\n","torrent":{"xt":"urn:btih:5e753a43a4963ca176af6d362999c0b6177c5208","amp;dn":"The+Black+Packet+Vol+2%3AWhat+Are+They+Trying+To+Sell+%28DVD+Master%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e753a43a4963ca176af6d362999c0b6177c5208","infoHashBuffer":{"type":"Buffer","data":[94,117,58,67,164,150,60,161,118,175,109,54,41,153,192,182,23,124,82,8]},"announce":[],"urlList":[]}}