{"title":"Sisters Of Mercy - Detonation Boulevard","uid":5140511,"size":136323076,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5e8f389f939fbf5d248ce1e5c68dad81f8c5ab89&amp;dn=Sisters+Of+Mercy+-+Detonation+Boulevard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1256870472,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nVision Thing, the third and last album by British gothic rock band The Sisters of Mercy, was released in 1990, on band's own label Merciful Release (under distribution contract with EastWest).\n\nThe album was designed by songwriter and singer Andrew Eldritch as an attack on United States policies (the title comes from an oft-cited quote, said by George H. W. Bush).\n\nDescribed by Andrew Eldritch as 'a fine album'. Q magazine included it in their 'Fifty Best Albums of 1990' list. It appears that the majority of tracks on the album are based on the original demos, Eldritch being unhappy with the mixed versions and going back to basics.\n\nThe Sisters of Mercy are an English rock band that formed in 1980. After achieving early underground fame in UK, the band had their commercial breakthrough in mid-1980s and sustained it until the early 1990s, when they stopped releasing new recorded output as a strike against their record company. Currently, the band is a touring outfit only.\n\nThe group has released three original studio albums, of which the last was released in 1990. Each album was recorded by a different line-up; singer and songwriter Andrew Eldritch and the drum machines called Doktor Avalanche are the only points of continuity among the line-ups. Eldritch and Avalanche were also involved in The Sisterhood, a side-project connected with Eldritch's dispute with former members.\n\nThe group ceased recording activity in 1994, when they went on strike against their record company Time Warner, which they accused of withholding royalties and being incompetent. Although Time Warner eventually let the band go in 1997, they have not signed to another label, and have chosen not to go the independent label route, despite showcasing numerous new songs in their live sets.\n\nSince 1985, when the other original members left, The Sisters of Mercy has become the artistic vehicle of Andrew Eldritch. Ex-members of the group established the bands Ghost Dance and The Mission.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5e8f389f939fbf5d248ce1e5c68dad81f8c5ab89","amp;dn":"Sisters+Of+Mercy+-+Detonation+Boulevard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e8f389f939fbf5d248ce1e5c68dad81f8c5ab89","infoHashBuffer":{"type":"Buffer","data":[94,143,56,159,147,159,191,93,36,140,225,229,198,141,173,129,248,197,171,137]},"announce":[],"urlList":[]}}