{"title":"Oblivion with all DLC and Horse combat mod","uid":4995632,"size":4692051981,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5f9908524ec8d4df2430b7672b8b5cf801a4f789&amp;dn=Oblivion+with+all+DLC+and+Horse+combat+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DOB1026","files":7,"time":1247264058,"description":"This is Oblivion with all DLC including Shivering Isles, and a mod that allows you to cast spells on horseback and trample people with horses and another that makes leveled items grow more powerful as you do, so you no longer have to wait until you are a really high level to get good items.  These mods in my opinion fix two of Oblivion's most serious flaws, but are optional.\n\nSteps:\n1.  Mount Oblivion GOTY 1.iso and install Oblivion\n2. Go online and google &quot;oblivion 1.2.0416 patch&quot; and download, then install the patch(doesn't matter where you get it from)\n3. Google &quot;Oblivion script extender&quot; and download the latest version and extract it with WINRAR to the directory with Oblivion.exe in it.  There should now be a file named obse_loader.exe in that directory, make a shortcut to it on your desktop (only needed if you use horse combat mod)\n4. extract TES IV-Oblivion official plugins to your oblivion directory and run all of the setup.exes to install all of the plugins.\n5.Extract the two remaining rars ( the mods) into your &quot;oblivion/datafiles&quot;  directory, i.e C:Program FilesBethesda SoftworksOblivionData Files\n6. Load Oblivion Launcher.exe in the oblivion directory and when the launcher appears click on data files and make sure all of the boxes are checked in order to enable the mods\n7. Exit the launcher, DO NOT CLICK PLAY,( unless you chose not to install the horse combat mod, then you are free to click play) and then double click your shortcut to Obse_loader.exe\non your desktop to start playing. Remember to always start the game with obse_loader.exe and you now have a functional copy of oblivion\n","torrent":{"xt":"urn:btih:5f9908524ec8d4df2430b7672b8b5cf801a4f789","amp;dn":"Oblivion+with+all+DLC+and+Horse+combat+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f9908524ec8d4df2430b7672b8b5cf801a4f789","infoHashBuffer":{"type":"Buffer","data":[95,153,8,82,78,200,212,223,36,48,183,103,43,139,92,248,1,164,247,137]},"announce":[],"urlList":[]}}