{"title":"Command_and_Conquer_Generals + Zero Hour","uid":6451870,"size":1667756366,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6002afd8abf0de4be4aed92aa27b61aea78c48cc&amp;dn=Command_and_Conquer_Generals+%2B+Zero+Hour&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"smille_mc_Thug_Life","files":180,"time":1307454879,"description":"Command &amp; Conquer: Generals ÃƒÂ© um jogo em RTS (Real Time Strategy, ou EstratÃƒÂ©gia em Tempo Real) para computador]. Seguindo o princÃƒÂ­pio de retratar batalhas entre povos ou mundos da sÃƒÂ©rie Command &amp; Conquer, o jogo diferencia-se destes por retratar um conflito passado em tempos mais atuais (nÃƒÂ£o exatamente em nosso ano), e com lados conflitantes existentes em nosso mundo, como a China e os Estados Unidos, ou ainda passÃƒÂ­veis de existir como o GLA (Global Liberty Army - ExÃƒÂ©rcito de LibertaÃƒÂ§ÃƒÂ£o Global).\n\nModos de jogo\nSolo Play: Nesta modalidade, o jogador participa de batalhas contra um oponente comandado pelo computador, ou pode ainda aliar-se a um exÃƒÂ©rcito comandado pelo PC para enfrentar outros exÃƒÂ©rcitos. Essa modalidade pode ser jogada de trÃƒÂªs maneiras:\nTrainning: O jogador aprende os comandos bÃƒÂ¡sicos, como construir estruturas, criar unidades e comandar as tropas no cenÃƒÂ¡rio.\nSkirmish: O jogador escolhe o cenÃƒÂ¡rio e o oponente para travar uma batalha simples. Aqui poderÃƒÂ¡ ser escolhido o seu exÃƒÂ©rcito (China, USA ou GLA) e o do oponente, suas cores, a dificuldade do oponente (Easy, Medium, Brutal) e sua localizaÃƒÂ§ÃƒÂ£o do cenÃƒÂ¡rio. Este ÃƒÂºltimo ÃƒÂ© de grande importÃƒÂ¢ncia, pois existe uma gama infinita de cenÃƒÂ¡rios, oficiais e nÃƒÂ£o oficiais, que variam entre si de acordo com o nÃƒÂºmero de jogadores (2 a 8), quantidade de suprimentos, caracterÃƒÂ­sticas do terreno e pontos de apoio (bunkers, refinarias de ÃƒÂ³leos, etc).\nHistory: O jogador ÃƒÂ© ambientado num contexto, que varia de acordo com o exÃƒÂ©rcito escolhido. A partir desta ambientaÃƒÂ§ÃƒÂ£o, o jogador recebe sua 1Ã‚Âª missÃƒÂ£o para cumprir e que prosseguirÃƒÂ¡ atÃƒÂ© a 7Ã‚Âª missÃƒÂ£o. As missÃƒÂµes sÃƒÂ£o bastantes especÃƒÂ­ficas (escolta, interceptaÃƒÂ§ÃƒÂ£o, etc) e nÃƒÂ£o apenas destruiÃƒÂ§ÃƒÂ£o do inimigo. O cenÃƒÂ¡rio tambÃƒÂ©m ÃƒÂ© peculiar, nÃƒÂ£o sendo encontrado no modo Skirmish. Em algumas missÃƒÂµes nÃƒÂ£o ÃƒÂ© disponibilizado algumas unidades ou estruturas, devendo o jogador vencer apenas com o que tem em suas mÃƒÂ£os.\nMulti Player: Nesta modalidade, o jogador pode jogar com outras pessoas, em LAN (com computadores ligados entre sÃƒÂ­) ou em NET (com computadores ligados atravÃƒÂ©s da internet).\n[editar]FacÃƒÂ§ÃƒÂµes jogÃƒÂ¡veis\nUSA - Usam a mais alta tecnologia para desenvolver seu exÃƒÂ©rcito. Possui uma boa aviaÃƒÂ§ÃƒÂ£o, com vÃƒÂ¡rios up-grades, cavalaria pesada e leve (tanque Paladino e o jipe Humvee), sistema de defesa avanÃƒÂ§ado. O ponto fraco estÃƒÂ¡ na dependÃƒÂªncia de muita energia para sua defesa, que ÃƒÂ© provida pelos reatores, e tambÃƒÂ©m no alto custo de produÃƒÂ§ÃƒÂ£o dos blindado e aviÃƒÂµes.\nChina - Assim como o USA, a China tambÃƒÂ©m depende de energia produzida pelos reatores, assim caso eles forem destruÃƒÂ­dos, sua base ficarÃƒÂ¡ inativa. A China possui uma aviaÃƒÂ§ÃƒÂ£o mediana com os caÃƒÂ§a Mig,porÃƒÂ©m a cavalaria ÃƒÂ© uma das melhores do jogo, principalmente se levarmos em conta o fator custo/benefÃƒÂ­cio. A infantaria leve ÃƒÂ© produzida em dupla e, assim como a pesada tambÃƒÂ©m, recebe um acrÃƒÂ©scimo no poder quando em conjunto de 05 unidades ou mais.\nGLA - Diferente dos anteriores, o GLA nÃƒÂ£o depende de energia para sua base funcionar. Possui um excelente esquema de tÃƒÂºneis subterraneos,que permite deslocar tropas pelo mapa instantaneamente. Caso uma de suas construÃƒÂ§ÃƒÂµes for destruÃƒÂ­das, ela ainda consegue se reconstruir passado algum tempo. O GLA tambÃƒÂ©m possui algumas unidades sem correspondentes nos outros exÃƒÂ©rcitos, como o homem bomba.\n\nFoi lanÃƒÂ§ada apÃƒÂ³s algum tempo do lanÃƒÂ§amento do C&amp;C Gens, a sua expansÃƒÂ£o: Command &amp; Conquer: Generals Zero Hour. Essa expansÃƒÂ£o eliminou alguns bugs do jogo e adicionou algumas novidades:\nGenerais - foram adicionados 4 generais para cada paÃƒÂ­s, cada um com caracterÃƒÂ­sticas especÃƒÂ­ficas.","torrent":{"xt":"urn:btih:6002afd8abf0de4be4aed92aa27b61aea78c48cc","amp;dn":"Command_and_Conquer_Generals+%2B+Zero+Hour","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6002afd8abf0de4be4aed92aa27b61aea78c48cc","infoHashBuffer":{"type":"Buffer","data":[96,2,175,216,171,240,222,75,228,174,217,42,162,123,97,174,167,140,72,204]},"announce":[],"urlList":[]}}