{"title":"Kembar Siang","uid":6446862,"size":556692274,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:60b9d8945e558926a2e3dc5304910d284ade234d&amp;dn=Kembar+Siang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zaini711","files":-1,"time":1307296670,"description":"Satu lagi filem yang akan ditayangkan di pawagam pada 24 Februari 2011 ini adalah filem yang diberi judul Kembar Siang dan bergenre Komedi. Filem ini dibarisi pelakon hebat seperti Kamal Adli (Awal/Awi), Intan Ladyana (Ana/Ani), Mat Over (Pak Wan), Sabri Yunus (Pak Din Duda), Sathiya (Mohamad Rafi), Syanie (Mak Yam), Zul Handyblack (Meon), Zaibo (Hj Sabran), Rozita Che Wan (Jenab), Mazlan Pet Pet (Lan Sengau), Hamid Gurkha (Wak Sengau).\n\nKEMBAR SIANG menceritakan tentang kehidupan AWAL dan AWI sepasang kembar seiras. AWAL abang dan AWI adik. AWAL normal tetapi AWI sedikit terencat dan lurus bendul kerana pernah mengalami demam panas. Tetapi AWI mempunyai daya ingatan dan kemahiran mengira yang luarbiasa dan sering memberi tuisyen kepada MAZLI dan IZAN, anak sekolah yang sering menemaninya. AWAL dan AWI mewarisi rumah dan kedai runcit peninggalan arwah bapa mereka HAJI SABRAN. Pengurusan kedai runcit itu dilakukan oleh mereka berdua: AWAL jadi bos dan AWI jadi pekerja. Kedai runcit AWAL dan AWI mempunyai saingan dengan sebuah lagi kedai runcit di seberang jalan milik PAK DIN DUDA.\n\n\nPlease donate or support by visiting the website\n\n &lt;a href=&quot;\nHTTP://HANYA1.COM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nHTTP://HANYA1.COM&lt;/a&gt;","torrent":{"xt":"urn:btih:60b9d8945e558926a2e3dc5304910d284ade234d","amp;dn":"Kembar+Siang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60b9d8945e558926a2e3dc5304910d284ade234d","infoHashBuffer":{"type":"Buffer","data":[96,185,216,148,94,85,137,38,162,227,220,83,4,145,13,40,74,222,35,77]},"announce":[],"urlList":[]}}