{"title":"RESEED Night of the Demon - Demon (1981) 320CBR","uid":4988540,"size":118168803,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:60fca50998348822e030029854e2f5ac4e3d674a&amp;dn=RESEED+Night+of+the+Demon+-+Demon+%281981%29+320CBR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"degsey","files":18,"time":1246909567,"description":"Track Listing:\n\n   1. Full Moon\n   2. Night of the Demon\n   3. Into the Nightmare\n   4. Father of Time\n   5. Decisions\n   6. Liar\n   7. Big Love\n   8. Ride the Wind\n   9. Fool to Play the Hard Way\n  10. One Helluva Night\n\nLineup:\n\n    * Dave Hill\n    * Mal Spooner\n    * Les Hunt\n    * John Wright\n\n\nJust as the long hot summer of 1976 had given birth to Punk, the long, cold winter of 1979 spawned the now legendary, New Wave Of British Heavy Metal (NWOBHM), a movement of such magnitude that it is still being talked about more than twenty years later. Hard rocking, fast, loud, aggressive, NWOBHM captured the imagination of those disillusioned with disco, put-off by punk and nonplussed by the emerging New-Romantics. It also brought forth: Demon.\n\nFormed during the first wave of NWOBHM by lyricist/vocalist Dave Hill and guitarist Mal Spooner, with Paul Riley on bass, Clive Cook on guitar and John Wright on drums, the Midlands quintet hooked up with Clay Records supremo, Mike Stone, in 1980, to release their first single, 'Liar'. Issued on blood-red vinyl, in a limited edition run of just 5000 copies, Liar marked the beginning of an incredible story spanning two decades - and counting. \n\nJanuary 1981 saw the band venture into the studio to record their first album, 'Night of the Demon', whilst Clay Records struck a licensing deal with Carrere Records, to secure the album's release. Half tales of mystery and imagination, half straight-ahead rock, 'Night of the Demon' was both powerful and thoughtful - polished metal of the highest quality. Another single, 'Ride the Wind', also taken from the album, followed. The Demon machine was starting to gather momentum, which was infused with energy by the interest of Radio 1 DJ Tommy Vance. Invited to the BBC's studios at Maida Vale, in London, to record four tracks for broadcast on Tommy's Friday Rock Show, Demon produced one of the Radio 1 sessions of the year with rousing renditions of 'Full Moon'/'Night of the Demon', 'One Helluva Night', 'Father of Time' and 'Decisions'. As the second single from the album, 'One Helluva Night', was released, Riley and Cook left the band, to be replaced by Chris Ellis and Les Hunt, respectively. \n\nPlease seed to at least 1:1\n\nComments welcome.\n\nEnjoy\n\n","torrent":{"xt":"urn:btih:60fca50998348822e030029854e2f5ac4e3d674a","amp;dn":"RESEED+Night+of+the+Demon+-+Demon+%281981%29+320CBR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60fca50998348822e030029854e2f5ac4e3d674a","infoHashBuffer":{"type":"Buffer","data":[96,252,165,9,152,52,136,34,224,48,2,152,84,226,245,172,78,61,103,74]},"announce":[],"urlList":[]}}