{"title":"Biff Rose - Thorn in Mrs. Rose's Side &amp; Children of Light (Tw","uid":5182397,"size":72584265,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:618f51daa7ebd1a89767718ca91ae310722f909b&amp;dn=Biff+Rose+-+Thorn+in+Mrs.+Rose%5C%27s+Side+%26+Children+of+Light+%28Tw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"superclown","files":24,"time":1259311091,"description":"Paul &quot;Biff&quot; Rose is an American comedian and singer-songwriter.\n\nBorn in New Orleans, Rose first came to prominence as a banjo-toting standup comedian, profiled in Time magazine in 1965. By 1966 he moved to Hollywood, working as a comedy sketch writer with George Carlin for a host of television variety shows, ultimately working with some regularity on the Mort Sahl show. [1] Eventually, Rose moved back to songwriting.\n\nDavid Bowie covered the song &quot;Fill Your Heart,&quot; co-written by Rose and Paul Williams, on his album Hunky Dory (1971). The song was originally released by Tiny Tim as the B-side to his 1968 hit single, &quot;Tiptoe through the Tulips.&quot; Bowie played another Rose song, &quot;Buzz the Fuzz,&quot; in live performance [2]. Other Rose songs were covered by John Denver [3] and Pat Boone [4].\n\nFollowing the release of 1968's The Thorn in Mrs. Rose's Side, Rose made several memorable appearances on Johnny Carson's The Tonight Show from 1968 to 1970. [5][6]. He also performed his songs on The Smothers Brothers Comedy Hour[7], American Bandstand [8], and Hugh Hefner's Playboy After Dark [9]. He emceed the Atlantic City Pop Festival of 1969 [10], and the Atlanta Pop Festival of 1970 [11].\n\n1978's Roast Beef was produced by Mike Nesmith and recorded in a single take.\n\n2005 saw a revival of label interest in Rose's work. A US CD re-released his Tetragrammaton albums and singles, and a UK compilation covered Rose's work from 1968 through 1985.\n\nContents [hide]\n1 Musical Style \n2 Discography \n2.1 Full Length Releases \n2.2 Singles \n2.3 Compilations \n3 References \n4 External links \n \n\n[edit] Musical Style\nRose's early work consists of unaccompanied piano and vocals as well as more heavily orchestrated numbers. His lyrics have been described as romantic and humorous, while promoting a left-wing hippie philosophy [12]. His piano-playing has been described as jaunty, reminiscent of pre-World War II Broadway musicals. [13]\n\nRose's work of the past ten years differs from his early recordings. He has introduced spoken word and rap elements into his songs; some recordings experiment with extended song forms and eccentric instrumentation. He makes controversial use of racial stereotypes. In his web-based art, Christ and Hitler are referenced often, apparently as icons/personifications of good and evil. Many of his websites, such as www.Jewmanity.com, openly deal with race and religion. This has resulted on various online postings criticizing Rose of being antisemitic and racist [14]. It is said that Rose denies the charge.\n","torrent":{"xt":"urn:btih:618f51daa7ebd1a89767718ca91ae310722f909b","amp;dn":"Biff+Rose+-+Thorn+in+Mrs.+Rose%5C%27s+Side+%26+Children+of+Light+%28Tw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"618f51daa7ebd1a89767718ca91ae310722f909b","infoHashBuffer":{"type":"Buffer","data":[97,143,81,218,167,235,209,168,151,103,113,140,169,26,227,16,114,47,144,155]},"announce":[],"urlList":[]}}