{"title":"Ostrov (2006) (The Island)","uid":6359626,"size":4679905280,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:628d597bd1b4f689b1b2a0f86b6815a3220ac752&amp;dn=Ostrov+%282006%29+%28The+Island%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Colors`of`the`Wind","files":1,"time":1304285792,"description":"The Island\n\n\nAlthough not being a church movie as such, 'Ostrov' is drenched with Russian Orthodox spirituality from beginning to end. Also from an artistic viewpoint 'Ostrov' can be strongly recommended, with camerawork reminding one at times of Tarkovsky's masterpieces, a haunting soundtrack, and some impressive acting from Russian actors unknown in the West.\n\n'Ostrov' is the story of a young sailor, Anatoli, who during the German invasion of Russia in 1942 was given the option of shooting his captain Tikhon in order to live. He is then rescued by monks from a nearby monastery, one of the few that must have escaped Stalin's destruction of religion in the USSR. The rest of the story unfolds over 30 years later, when Anatoli is still doing self-imposed penance in the same monastery for his evil deed. He has become a 'fool for Christ' - a typically Russian Orthodox spiritual phenomenon. Although not being a priest or a monk, he has over many years through severe self-denial and humility obtained the gifts of clairvoyance, healing and exorcism, which he ministers to the laypeople who flock to him for help. In spite of these gifts, he is still plagued by his conscience for his shooting of Tikhon, and rows regularly to an unhabitated island to pray for forgiveness. The movie ends with some unforgettable scenes as Anatoli's life draws to a close.\n\nHaving said all of this, it is doubtful if 'Ostrov' could be appreciated by viewers who are unfamiliar with Orthodox Christian spirituality, especially in its Russian form. Its other-worldliness would simply be incomprehensible to the intensely materialistic and pleasure-seeking human masses of our time, except perhaps to some art movie fans who might appreciate at least its aesthetic value. All credit nonetheless to the creators of this masterpiece.","torrent":{"xt":"urn:btih:628d597bd1b4f689b1b2a0f86b6815a3220ac752","amp;dn":"Ostrov+%282006%29+%28The+Island%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"628d597bd1b4f689b1b2a0f86b6815a3220ac752","infoHashBuffer":{"type":"Buffer","data":[98,141,89,123,209,180,246,137,177,178,160,248,107,104,21,163,34,10,199,82]},"announce":[],"urlList":[]}}