{"title":"The Rite(2011)-Hyperdrive25","uid":6346622,"size":297878280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:62a1a4d95c0dc7c67b7279bbedc0d55a16b78b3e&amp;dn=The+Rite%282011%29-Hyperdrive25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hyperdrive25","files":4,"time":1303854894,"description":"           The Rite 2010 + English Subtitles + Official Trailer\n           ----------------------------------------------------\n\n\nThe Rite is an American supernatural horror film based on Matt Baglios The Rite: The Making of a Modern Exorcist, directed by Mikael HÃƒÂ¥fstrÃƒÂ¶m and written by Matt Baglio and Michael Petroni. It stars Anthony Hopkins as Father Lucas. It was released on January 28, 2011.\n\n\nPlot\n----\nMichael Kovak, disillusioned with his father, a mortuary owner, decides to enter a seminary school and abdicate his vows upon completion, thereby getting him a free college degree. Four years pass and Michael is being ordained to the diaconate at the seminary. However, after ordination he writes a letter of resignation to his superior, Father Matthew, citing a lack of faith.\n\nFather Mathew, apparently wanting to talk Michael out of his decision attempts to catch up to Michael on the street. He trips as he walks over a curb, causing a biker to swerve into the path of an oncoming car. The young woman, believing Michael to be a priest after seeing his clerical garb, asks him for absolution. Unable to refuse, Michael comforts her and performs the ritual absolving her sins. Seeing how calmly he handled the situation, Father Superior tells Michael he is called to be a priest, whether Michael believes this or not; he later approaches Michael with an invitation to travel to Rome in order to attend a class on exorcism. Michael reluctantly accepts after being told by Father Matthew that he will be levied a $100,000 student loan if he leaves immediately, but that if he still desires to resign from his position after taking the class, then he may be free to leave.\n\nDuring classes, he meets a young woman, Angelina, who is also taking the course. He soon learns that she is a reporter who has been asked to cover the course for an article in a newspaper. Realizing Michael is a skeptic and is very tentative in his faith, Father Xavier later asks Michael to see a friend of his, Father Lucas, who is a renowned exorcist. Michael agrees and meets Father Lucas at his home, where he sees one of the priest's patients: a pregnant sixteen-year-old girl. It is later revealed that she was raped by her father, which led to her possession. However, Michael remains skeptical, even after witnessing several preternatural events, such as the girl coughing up three long nails and fluently speaking English. She pointedly reminds Michael of the last patient he performed embalming on and of his loathing for his father.\n\nHe later speaks with Angelina again, who asks him to relay the information that he gets from Father Lucas to her, as she has tried to get an interview with him many times now but has been refused, and Michael declines. Meanwhile, the possessed girl's condition worsens, which prompts Father Lucas and Michael to have her taken to a hospital for further care. There, Father Lucas performs another exorcism on the girl while Michael observes; they leave the hospital room together with Michael leaving the hospital and Father Lucas staying overnight outside of the girl's room. Late that night, she miscarries, and the baby dies from cardiac arrest and the mother via blood loss. Disheartened, Father Lucas feels he has failed her. After Michael sees this he decides to confer with Angelina.\n\nAfter the death of the young woman, Father Lucas begins behaving strangely, exhibiting signs of demonic possession. Michael and Angelina later find him sitting outside of his house in the rain. Father Lucas takes them into his house and, knowing himself to be possessed, tells Michael that he needs to find Father Xavier in order to perform the exorcism. Angelina and Michael try desperately to contact and find Father Xavier; however, they learn that he is out of contact for 3 days.\n\nLearning this, Michael decides to perform the exorcism on his own. After constant rebuking by the demon and a long, drawn out fight, Michael regains his once lost faith and is able to force the demon to reveal its name, which is Baal. He completes the exorcism and the demon leaves Father Lucas. Successful, Michael leaves Rome, returning to America and to his life. The final scene of the film shows Michael, now Father Michael Kovak, entering a confessional and beginning to hear a girl's confession, revealing that he has found his calling as a priest and did not resign.\n...................................................................................\n\nThis file can be played on any DIVX/MP4 Player. Just burn the files onto a CD using\nNero or Ashampoo Burning Studio.\n\nTo Play the file on your PC you need to install VLC player or SMPlayer.\n\nDownload VLC Media Player: http://www.videolan.org/\n\nDownload SMPlayer: http://smplayer.sf.net/\n\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!**********************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n\n\nP.S. If you like the film, please be sure to leave a comment. Thanks! :)\n\n\n\n\n","torrent":{"xt":"urn:btih:62a1a4d95c0dc7c67b7279bbedc0d55a16b78b3e","amp;dn":"The+Rite%282011%29-Hyperdrive25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62a1a4d95c0dc7c67b7279bbedc0d55a16b78b3e","infoHashBuffer":{"type":"Buffer","data":[98,161,164,217,92,13,199,198,123,114,121,187,237,192,213,90,22,183,139,62]},"announce":[],"urlList":[]}}