{"title":"BDtoAVCHD v1.4.0 - Create an AVCHD disc from a Blu-Ray or MKV","uid":6338998,"size":22373888,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:63ae1321c3f23c92619cf4269d98c934ae03df33&amp;dn=BDtoAVCHD+v1.4.0+-+Create+an+AVCHD+disc+from+a+Blu-Ray+or+MKV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thexai","files":1,"time":1303575913,"description":"BDtoAVCHD is a tool to create AVCHD discs from Blu-Ray or HD MKV files. As output we get the folder structure ready to burn to a DVD5 or DVD9. The software compresses the video to achieve the desired overall size of 4.7 GB or 8.5 GB with the highest possible quality.\n\nThe AVCHD format allows you to play the same type of content that a Blu-Ray and holding high definition (1080p) but on DVD5 or DVD9 media. Ideal for backing Blu-Ray with smaller size and maintaining high quality.\n\nBDtoAVCHD is created with the idea that is very simple and quick to use and obtain the best possible quality in a DVD5, so unnecessary conversions are avoided whenever possible. You do not need any codec installed as avisynth, ffdshow or Haali media splitter and records obtained are compatible with almost any Blu-ray player or PS3.\n\nKEY FEATURES\n\n   * Finds the main .m2ts file for the movie by just selecting the BDMV folder or Blu-Ray root\n   * Extract all information from the audio tracks, video and subtitles: length, language, format, etc.\n   * Extract chapter information or allows to add it.\n   * Select default audio track based on the most appropriate language preferences and criteria for the best quality but can also be set manually.\n   * Calculates the video bitrate to fill the DVD5 / DVD9 (most of the times gets between 99-100% of total capacity).\n   * Converts audio (only if necessary): PCM to AC3, DTS-HD MA to DTS Core, DTS to AC3, etc.\n   * Detect delays in the original audio tracks and transfers them to the final work.\n   * Re-compress the video using x264 64-bit if your computer supports.\n   * Do not use external codecs like avisynth or ffdshow or Haali splitter in the process of video conversion.\n   * Allows you to select a forced subtitle track is selected by default when playing the disc.\n   * Allows you to program multiple conversions in the queue and execute them one after another automatically.\n   * Multitasking: you can gradually add new jobs in queue while others are processed.\n   * Various output sizes: DVD5 / DVD9 / USB 4GB / BD-25 and Custom.\n   * Ability to create a BD-25 without re-compressing video (BDRemux).\n   * MKV as alternate output: allows to convert Blu-Ray to MKV recoding the video or without recoding (BDremux).\n\n\nNEW IN VERSION 1.4.0\n\n   * New: MKV as alternate output format. Allows to convert Blu-Ray to MKV, recoding the video (CRF) or creating a BDremux.\n   * Improved: for AVCHD output is used the new parameter --bluray-compat instead of --open-gop bluray, --aud, --nalhrd vbr and --b-pyramid strict. This also always checks compliance of ref and b frames with AVCHD.\n   * Improved: accepting as input MKV files with header compression.\n   * Fixed: when converting a Blu-Ray with the main file split into several .m2ts parts and selecting the TrueHD audio was kept AC3 core only.\n   * Mkvextract updated to version v4.6.0 and Mkvmerge added.\n   * x264 updated to revision r1936.\n   * Small fixes and general improvements.\n\n\n\n","torrent":{"xt":"urn:btih:63ae1321c3f23c92619cf4269d98c934ae03df33","amp;dn":"BDtoAVCHD+v1.4.0+-+Create+an+AVCHD+disc+from+a+Blu-Ray+or+MKV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63ae1321c3f23c92619cf4269d98c934ae03df33","infoHashBuffer":{"type":"Buffer","data":[99,174,19,33,195,242,60,146,97,156,244,38,157,152,201,52,174,3,223,51]},"announce":[],"urlList":[]}}