{"title":"Jordin Sparks - S.O.S. (Let  The Music  Play)","uid":5160362,"size":120152068,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:64580ba9f18ddf62d3030cd3d45edd97f12f7519&amp;dn=Jordin+Sparks+-+S.O.S.+%28Let++The+Music++Play%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258107283,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;S.O.S. (Let the Music Play)&quot; is a song performed by R&amp;B and pop recording artist Jordin Sparks. It is the second single from her second studio album titled Battlefield. The song was released first in Australia on September 4, 2009 followed by US radio on September 29, 2009.It was released in the UK on October 12, 2009.\n\nThis uptempo electropop song contains a sample of &quot;Let The Music Play&quot; by Shannon. It combines 1980s synths with modern techno-dance beats. Sparks explained why she decided to go in a dancier direction with this song: &quot;I'll always be the ballad girl from American Idol, but I wanted to try something new, though not so far that people wouldn't believe me.&quot; The video was shot in Los Angeles, California on August 10, 2009, with Chris Robinson serving as the director. He also worked with Sparks on the &quot;No Air&quot; music video.\n\nThe video was shot in Los Angeles, California on August 10, 2009, with Chris Robinson serving as the director. He previously worked with Sparks on the music video for &quot;No Air&quot;. The video shows Sparks dancing while wearing a gold dress and long gold nails. In interluding scenes in the video she can be seen dancing in a club wearing a black dress and hoodie.\n\nReview were generally positive with critics praising Sparks' attempt at dance-pop. Nick Levine of Digital Spy said &quot;Two excursions into dance-pop territory, the stomping, Shannon-sampling 'SOS (Let The Music Play)' and the boyfriend-baiting 'Emergency (911)', also do the business&quot;. The New York Times said &quot;intriguingly, the music on that song ('Emergency 911'), and another club track, 'S.O.S. (Let the Music Play)', evokes the brazen dance-pop of Lady Gaga.&quot; A critic from Rolling Stone criticized the album and said that Sparks' album &quot;falls flat on 'S.O.S. (Let the Music Play),' a piece of bland disco that wishes it were 'Just Dance.'&quot; The Guardian appeared to praise Sparks for attempting a song that was more urban, stating that the &quot;squelchy electronics and a relatively earthy lyric ('Look in her eyes, she's mentally undressing him') give 'SOS' an urban hue.&quot; \n\nEntertainment Weekly commented that &quot;second single 'S.O.S. (Let the Music Play)', with its refrain copped from Shannon's 1983 dance classic, may not be thrillingly original, but resistance is futile when Sparks, showing heretofore unseen vocal dexterity, takes to the dance floor to ward off a vixen who's barking up the wrong boyfriend.&quot; In the New York Post's review of the album it was said that &quot;there are a lot of vocal and tonal departures on this disc, nowhere more so than with the thumpin' 'S.O.S. (Let The Music Play)'. This straight-outta-the-80s track (which will be her next single) is my fave on the whole album -- it's techno-summer perfection. And the hook is divine, despite its unexpected ancestry.&quot;\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:64580ba9f18ddf62d3030cd3d45edd97f12f7519","amp;dn":"Jordin+Sparks+-+S.O.S.+%28Let++The+Music++Play%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64580ba9f18ddf62d3030cd3d45edd97f12f7519","infoHashBuffer":{"type":"Buffer","data":[100,88,11,169,241,141,223,98,211,3,12,211,212,94,221,151,241,47,117,25]},"announce":[],"urlList":[]}}