{"title":"Wells-World Brain(origins of WWW and wikipedia)(1938)","uid":5169900,"size":1330180,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64ad0b5c41e73d422d43eb85a24869ea876f99b7&amp;dn=Wells-World+Brain%28origins+of+WWW+and+wikipedia%29%281938%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"red_gonzo","files":1,"time":1258628910,"description":"This is H. G. Wells' amazing book of historic importance World Brain (1938) which pioneered an idea of a permanent world encyclopaedia which has literally come to fruition in our modern age as the World Wide Web (WWW) and even more as online encyclopaedias such as Wikipedia or similar. The concept of a &quot;world brain&quot; was under continuous evolution and development in the mind of Wells from 1908 onwards. First crystallised in his book &quot;Salvaging Civilisation&quot; (1921), it continued evolving following the publication of the present work - at which point he gave it a new name, &quot;The World Mind&quot;. The &quot;World Brain/World Mind&quot; notion is essentially that of producing needed and reliable intelligence to support strategic societal planning. Wells envisages a multi-national and world-wide institution which would have functional capabilities going well beyond the facilitative and co-ordinative activities of such existing international agencies as UNESCO. &quot;World Brain&quot; takes many ideas directly from John Amos Comenius, who, over 300 years ago, proposed that a well-educated and informed citizenry would not only prevent the occurence of wars, but also result in a flowering of creative cultural activities, and help to develop a beneficial form of world citizenship. In several instances throughout the book, Wells presents his idea of a universal, evolving encyclopedia that would help people become better informed citizens of the world. As he writes: &quot;There is no practical obstacle whatsoever now to the creation of an efficient index to all human knowledge, ideas and achievements, to the creation, that is, of a complete planetary memory for all mankind. It foreshadows a real intellectual unification of our race. The whole human memory can be, and probably in a short time will be, made accessible to every individual. In what is also of very great importance in this uncertain world where destruction becomes continually more frequent and unpredictable, is this, that...it need not be concentrated in a one single place. It need not be vulnerable as a human head or a human heart is vulnerable. It can be reproduced exactly and fully, in Peru, China, Iceland, Central Africa, or wherever else.... It can have at once, the concentration of a craniate animal and the diffused vitality of an amoeba.&quot; It was the emergence of internet that has finally made his vision possible. World Brain was the first brick in a global networked brain that is also linked to eliminating poverty and war. The Jules Verne of his day, Wells envisioned the foundations of a global network system that would gather together all possible human knowledge for the purpose of improving the society. 140 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:64ad0b5c41e73d422d43eb85a24869ea876f99b7","amp;dn":"Wells-World+Brain%28origins+of+WWW+and+wikipedia%29%281938%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64ad0b5c41e73d422d43eb85a24869ea876f99b7","infoHashBuffer":{"type":"Buffer","data":[100,173,11,92,65,231,61,66,45,67,235,133,162,72,105,234,135,111,153,183]},"announce":[],"urlList":[]}}