{"title":"Lassie Singers - Die Lassie Singers Helfen Dir (1991)","uid":4993723,"size":289154568,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:64b9b864ad1bc9e4540246f8a2abcf0a29728d70&amp;dn=Lassie+Singers+-+Die+Lassie+Singers+Helfen+Dir+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"manesi","files":16,"time":1247171735,"description":"Lassie Singers - Die Lassie Singers Helfen Dir (1991)\n\nFLAC - fully tagged\n\nEnjoy! \n\n\n\nMein Freund hat mit mir Schluss gemacht \nFalsche Gedanken \nFrauen am Rande des Nervenzusammenbruchs \nWarum nette MÃƒÂ¤dchen niemals glÃƒÂ¼cklich werden kÃƒÂ¶nnen \nChartbreaker \nDie PÃƒÂ¤rchenlÃƒÂ¼ge \nDu, du, du \nDas letzte Biest am Himmel \nLassie Song \nWir wollen gar nicht besser sein \nJeder ist in seiner eigenen Welt \nDas traurige Liebeslied \nJohnny, Jim und Jack \nGeh in den Keller \nDie grosse Liebe\n\n\n\n\nLassie Singers 1988 - 1998\n\n\nNicht vergessen: MÃƒÂ¤nno! \nSie waren der griechische Chor in den Dramen der neunziger Jahre:\nAb heute sind die Lassie Singers auf Abschiedstournee. \n\nVon Richard Oehmann\nFeuilleton Junge Welt 03.11.1998\n\n\nSie sahen nicht aus wie Twiggy, wollten nicht fremdbestimmt arbeiten und ihren Lippen entschlÃƒÂ¼pfte auch mal ein unbeherrschtes Wort. Die Lassie Singers waren nicht allein die Rettung fÃƒÂ¼r jene, die gerne im Auto Lieder grÃƒÂ¶len und auÃƒÅ¸er Comedian Harmonists, Ideal und &quot;Die Gedanken sind frei&quot; kein vernÃƒÂ¼nftiges deutsches Liedgut kannten, nicht allein Trost fÃƒÂ¼r alle zÃƒÂ¶gerlichen BerufsanfÃƒÂ¤nger in der Sinnkrise, fÃƒÂ¼r alle, denen Erwachsenwerden schwer fiel.\n\nDiese Damen waren nichts weniger als der griechische Chor der neunziger Jahre. Heute erst, da ihre JugendsÃƒÂ¼nde &quot;Wir sind dagegen, wir sind dafÃƒÂ¼r&quot; verÃƒÂ¶ffentlicht ist, wird offenbar, wie prÃƒÂ¤zise die Band die Beklemmungen und unheilvollen Ahnungen einer Generation zum Ausdruck brachte: Da nÃƒÂ¤mlich sprachen sich die SÃƒÂ¤ngerinnen bereits 1991 gegen die Scheidung von Mutter Beimer, gegen Cola light und Karaoke aus. \n\nNichts von dem konnte verhindert werden, und daran ist schon das ganze Drama zu erkennen. Der Chor selbst, der nur danebenstehen und an den Schaurigkeiten der Welt verzweifeln muÃƒÅ¸, wird zur tragischen Figur und geht schlieÃƒÅ¸lich an dem ganzen Jammer, den er zu besingen hat, zu Grunde. Die Band, die sich bereits aufgelÃƒÂ¶st hatte und schon in Vergessenheit geraten wollte, bedauert mittlerweile ihr schnÃƒÂ¶des, klammheimliches Verschwinden, nimmt daher nochmal die Strapazen einer Abschiedstournee auf sich und sagt ordentlich &quot;TschÃƒÂ¼ss&quot; zu den AnhÃƒÂ¤ngern. \n\nDabei soll noch einmal zum Ausdruck kommen, was die Band diesem Jahrzehnt beschert hat: neuen Mut zu Trallalala, Peinlichkeit und Melancholie. Und zwar genau in dieser Reihenfolge. \n\nAlmut Schummel und C.C. HÃƒÂ¼gelsheim alias Almut Klotz und Cristiane RÃƒÂ¶singer haben die Gruppe mit dem doofen Namen einst zusammen mit Funny van Dannen im Kreuzberger FischbÃƒÂ¼ro gegrÃƒÂ¼ndet. Weil sie keine Ausbildung hatten, nahmen sie eben diesen ScheiÃƒÅ¸ auf sich, schleppten sich durch die Unbill des MusikgeschÃƒÂ¤fts, reisten von Club zu Club, warben fÃƒÂ¼r ihre Platten und wurden doch nicht reich. \n\nNun bestreiten Frau Klotz und Frau RÃƒÂ¶singer konsequenterweise auch den Heimgang des hellsichtigsten Damenchors der entmauerten Republik. 15 Tage dauert die Abschiedsreise, da herrscht mindestens dreimal &quot;Schnitzelalarm&quot;, wenn der Tourbus an der RaststÃƒÂ¤tte FrankenhÃƒÂ¶he vorbeikommt, in MÃƒÂ¼nchen wartet das &quot;Hotel daheim&quot; und in &quot;sexy Hamburg&quot; der Hans-Albers-Platz mit seinen Ski-AnzÃƒÂ¼gen. \n\nEs gibt Immenses zu erinnern. In einer Branche, wo Frauen entweder glamourÃƒÂ¶s oder Groupie zu sein haben, krÃƒÂ¤hten die Lassie Singers ein herzhaftes &quot;MÃƒÂ¤nno!&quot; in die Runde, das man niemals vergessen kann. \n\nDie erste Platte &quot;Die Lassie Singers helfen Dir&quot; markierte, auch wenn viele Texte von schiefgelaufenen Beziehungen kÃƒÂ¼ndeten, die neue Heiterkeit des jungen Jahrzehnts. Die simpel-groÃƒÅ¸artigen Akkorde von Hermann Hermanns Gitarre und der mehrstimmige Gesang erzeugten die erbarmungslosesten OhrwÃƒÂ¼rmer seit Franz Beckenbauer. Hier wurde gereimt, zitiert und gealbert wie selten. \n\nViele Themen hatten schon so lange ihrer lyrischen Aufarbeitung geharrt, nun ging alles in einem Aufwasch: die Abrechnung mit dem PÃƒÂ¤rchentum in &quot;PÃƒÂ¤rchenlÃƒÂ¼ge&quot; und &quot;Alle netten MÃƒÂ¤dchen&quot;, der Zorn ÃƒÂ¼ber eitle MÃƒÂ¤nner in &quot;Mein Freund hat mit mir SchluÃƒÅ¸ gemacht&quot; sowie die Klarstellung, woran Frauen wirklich tÃƒÂ¤glich zu leiden haben in &quot;Frauen am Rande des Nervenzusammenbruchs&quot;. \n\nPolitische Ereignisse werden dagegen auf der Bedeutungsstufe von Zahnschmerzen abgehandelt: &quot;Zu allem UnglÃƒÂ¼ck stÃƒÂ¼rzt auch noch die Mauer ein und mein Ex aus'm Osten will bei mir rein.&quot; Der Zitatenschatz ist sehr Sixties-orientiert, man merkt es an Namen wie Emma Peel, Wilma Feuerstein und Fury, aber auch Helge Schneider hinterlÃƒÂ¤ÃƒÅ¸t bereits Spuren im Textblatt. \n\nAuf der zweiten Platte erst kommt die graue Eminenz der Neunziger, Mutter Drombusch, mit ihrem berÃƒÂ¼hmten Satz &quot;Sei Motor!&quot; zur Geltung. Das Werk selbst, &quot;Sei ÃƒÂ  gogo&quot; aus dem Jahre '92, wird ein Meilenstein der neuen Ungezwungenheit, denn Frustriertsein ist wieder liedkompatibel. Die SchwermÃƒÂ¼tigen aus der Vergangenheit, Bettina Wegener und Rainer-Werner Fassbinder, existieren nur noch als Phrase, der wahre Kummer kulminiert im biologischen Feldversuch im eigenen Zimmer (&quot;Ist das wieder so 'ne Phase?&quot;). \n\n&quot;Mein zukÃƒÂ¼nftiger Exfreund&quot; nimmt Jeff Goldblums &quot;my future exwife&quot; aus &quot;Jurassic Park&quot; vorweg, und zudem dokumentiert die Platte das Aufkommen von Zitronenbieren sowie die Entdeckung der Schatzstadt Hamburg als angeblich besten Partyort des Landes. \n\n1995 erfolgt der Versuch der Eleganz: die CD &quot;Stadt, Land, Verbrechen&quot;. Der Klang ist edler, die Fotos sind gestellter und die Gitarre von F.J. KrÃƒÂ¼ger verhilft zu ungewohnt schneidiger aber keineswegs notwendiger Rockigkeit. \n\n\n\n&quot;Der Mensch wird immer grÃƒÂ¶ÃƒÅ¸er, fitnessiert sich immer mehr&quot;, doch die groÃƒÅ¸e Party scheint vorbei, &quot;Sex ist kein Thema mehr&quot;, man bleibt zu Hause und betreibt Gesellschaftsspiele oder beobachtet den Nachbarn, der &quot;Murmeln im Sack&quot; hat. Es herrscht &quot;stille Grundtrauer&quot;, MÃƒÂ¼digkeit, Langeweile und Sehnsucht nach dem Landleben. Das Verb &quot;verschlagen&quot; findet Eingang in die Popgeschichte, und bei &quot;Es ist so schade&quot; triumphiert noch einmal die Akkordkombination C-a-F-G. \n\nEin Jahr spÃƒÂ¤ter geht der Katzenjammer erst richtig los. Die mÃƒÂ¤nnlichen Mitmenschen haben die Band verlassen, Klotz und RÃƒÂ¶singer schreiben ihre StÃƒÂ¼cke ÃƒÂ¶fter alleine, weshalb der Humor nurmehr ein Adjutantendasein fÃƒÂ¼hrt. Die CD &quot;Hotel Daheim&quot; hÃƒÂ¶rt sich latent bedauerlich an: &quot;SÃƒÂ¼ÃƒÅ¸es WÃƒÂ¼hlen in Vergeblichkeit&quot;, &quot;kein Geld&quot; und Angst vor dem Alter. Liebe wird sowieso &quot;oft ÃƒÂ¼berbewertet&quot;, und wenn man gelernt hat, sich &quot;selbst Hotel zu sein&quot;, kriegt man auch diese dÃƒÂ¼stere Phase rum. \n\nAber egal, in welche tristen TÃƒÂ¤ler sich die Lassie Singers zwischendurch verlaufen haben, ihre Konzerte sorgten stets dafÃƒÂ¼r, daÃƒÅ¸ der abfÃƒÂ¤llige Unterton beim Aussprechen des Wortes &quot;nett&quot; verschwunden ist. &quot;Die sind soooooo nett&quot;, war das hÃƒÂ¤ufigste Fan-Fazit nach der Show. Man wollte diese MÃƒÂ¤dels sofort fÃƒÂ¼r zden Freundeskreis annektieren, mit ihnen Stadt-Land-Verbrechen spielen oder &quot;Danke fÃƒÂ¼r diesen guten Morgen&quot; singen. \n\nDie Lassies sorgten als groÃƒÅ¸e Schwestern von Tocotronic dafÃƒÂ¼r, daÃƒÅ¸ schon vor deren &quot;Wir sind hier nicht in Seattle, Dirk&quot; die Welt bereit war fÃƒÂ¼r die gute Idee, unzickige deutsche Popmusik zu hÃƒÂ¶ren. \n\nNun, am Ende der holprigen Karriere, sind die Lassie Singers bei Nostalgie und Misanthropie angelangt. Zwei CDs auf dem soeben von Klotz und RÃƒÂ¶singer gegrÃƒÂ¼ndeten Label &quot;Flittchenrecords&quot; maulen noch mal nach. \n\n&quot;The best of&quot; ist die Geschenkidee fÃƒÂ¼r alle armen Schweine, die wieder nichts mitgekriegt haben, und &quot;The Rest of&quot; bietet LS-Hardcore, JugendsÃƒÂ¼nden, erste verschrobene Aufnahmen einschlieÃƒÅ¸lich quietschendem Wellensittich und zwei SpÃƒÂ¤twerke. \n\nEinst hatten die Lassie Singers in ihrem gesungenen Credo angekÃƒÂ¼ndigt, daÃƒÅ¸ sie bald in allen Bars zu hÃƒÂ¶ren und echte Stars sein werden. &quot;Und dann werdet ihr euch wundern!&quot; hieÃƒÅ¸ es. Gewundert haben wir uns nicht, aber sehr gefreut, und das ist ja wohl viel, viel bessser, oder? \n\nAlso, tschÃƒÂ¼s! Seid Hotels! Und nehmt eure Zigaretten mit! Lassie Singers:\nBest of (Time to say tschÃƒÂ¼ss), Rest of (beide auf Flittchenrecords/EfA","torrent":{"xt":"urn:btih:64b9b864ad1bc9e4540246f8a2abcf0a29728d70","amp;dn":"Lassie+Singers+-+Die+Lassie+Singers+Helfen+Dir+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64b9b864ad1bc9e4540246f8a2abcf0a29728d70","infoHashBuffer":{"type":"Buffer","data":[100,185,184,100,173,27,201,228,84,2,70,248,162,171,207,10,41,114,141,112]},"announce":[],"urlList":[]}}