{"title":"Shakira feat. Alejandro Sanz - La Tortura (Remix)","uid":5102819,"size":117032964,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:650169c6ea719c5831e570de7bc97b54a73f81e9&amp;dn=Shakira+feat.+Alejandro+Sanz+-+La+Tortura+%28Remix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1254127439,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;La Tortura&quot; (English: The Torture) is a Latin pop-Reggaeton song performed by singers Shakira and Alejandro Sanz. It was recorded for Shakira's sixth studio album FijaciÃƒÂ³n Oral Vol. 1, released in June 7, 2005. The song achieved large-scale success on different radio and chart formats, becoming the most famous Spanish language track of both singers worldwide and the fourth most successful song in Shakira's career. The song won two Latin Grammy Awards at the 2006 Ceremony for Song of the Year and Record of the Year.\n\nSince its release as a single, the song has become one of the most important Latin songs to move into the mainstream English-speaking culture in the U.S. and Canada. The music video of the song was nominated for Best Female Video, Best Dance video and Viewer's Choice Award on the 2005 MTV Video Music Awards, during which Shakira performed with Sanz (notably, the first time a guest performed a song entirely in a language other than English). &quot;La Tortura&quot; reached a position on the top 30 (#23) of Billboard's Hot 100 in less than twenty weeks after its release and was ranked #60 in the Year End Chart. The song was certified Platinum by RIAA for over 1,000,000 digital sales. The video became the first Spanish music video to be nominated at the MTV Video Music Awards.\n\nThe track debuted at #1 in Spain Singles Chart and was a huge hit all over Europe, reaching the top ten in almost all the countries. In Switzerland, the song was in the top five for fifteen consecutive weeks, although it never reached the top position. In Hungary, the song spent 8 exclusive weeks at number 1 position. &quot;La Tortura&quot; wasn't released as an official single in the United Kingdom until December 2006, bundled with the release of Illegal and charted at #34 on the UK Singles Chart. The song also broke the record on the Billboard's Hot Latin Tracks chart, appearing at #1 more than any other single (a total of 25 non-consecutive weeks). As a result, it was featured in the 2007 edition of Guinness World Records. &quot;La Tortura&quot; was chosen as the fifth favorite song of the world in a global survey made by Sony Ericsson, in which 700,000 music fans of 66 countries contributed.\n\nAt Billboard magazine's year-end chart (that shows the hottest songs of the year); &quot;La Tortura&quot; was announced as the #1 song on the Hot Latin Tracks chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:650169c6ea719c5831e570de7bc97b54a73f81e9","amp;dn":"Shakira+feat.+Alejandro+Sanz+-+La+Tortura+%28Remix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"650169c6ea719c5831e570de7bc97b54a73f81e9","infoHashBuffer":{"type":"Buffer","data":[101,1,105,198,234,113,156,88,49,229,112,222,123,201,123,84,167,63,129,233]},"announce":[],"urlList":[]}}