{"title":"Street-Kings.DVDrip[vice]","uid":5151644,"size":506550729,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:654fa7fc4c6ebe1b0e301010d460bcad5310648e&amp;dn=Street-Kings.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1257554794,"description":"ACTION\nSTREET KINGS DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 01:44:17\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCast\n\n* Keanu Reeves as Detective II Tom Ludlow\n* Forest Whitaker as Captain III Jack Wander\n* Hugh Laurie as Captain II James Biggs\n* Chris Evans as Detective I Paul Diskant\n* Jay Mohr as Sergeant II Mike Clady\n* Terry Crews as Detective II Terrence Washington\n* Naomie Harris as Linda Washington\n* Martha Higareda as Grace Garcia\n* John Corbett as Detective I Dante Demille\n* Amaury Nolasco as Detective I Cosmo Santos\n* Clifton Powell as Sergeant I Green\n* Cedric the Entertainer (as Cedric 'The Entertainer' Kyles) as Winston &quot;Scribble&quot;\n* Common as a Deputy Sheriff impersonating &quot;Coates&quot;\n* Cle Shaheed Sloan (as Cle Sloan) as a Deputy Sheriff impersonating &quot;Fremont&quot;\n* Noel Gugliemi (as Noel G.) as Quicks\n* The Game as Grill\n* Daryl Gates (as Daryl F. Gates) as Chief Gates\n* Angela Sun as Julie Fukashima\nPlot\n\nA disillusioned LAPD detective, Detective II Tom Ludlow (Keanu Reeves), rarely plays by the rules and is haunted by the death of his wife. All of the cops in Ludlow's unit, including the unit's commander, Captain III Jack Wander (Forest Whitaker), bend and break the rules of conduct on a regular basis. Their intention is often to deal with crime in a manner that they perceive to be more efficient, which leads them to routinely lie, falsify reports and manipulate evidence to cover up for their wrong-doings.\n\nThe movie starts with Tom Ludlow waking up, having been drinking the night before. Working undercover, he meets with Korean gangsters (whom he believes have kidnapped two Korean schoolgirls) in a parking lot, who are looking to buy a machine gun from him. After a vicious beatdown, the Koreans then proceed to steal Tom's car. Tom however planned on this and has the cops locate the vehicle via GPS. Upon arrival at their hideout, Tom storms in and kills the four gangsters inside, and then locates the missing children. Using a pair of rubber gloves, he then proceeds to cover up what really happened. While the other officers in his unit congratulate him, he is confronted by his former partner, Detective II Terrence Washington (Terry Crews). Washington no longer approves of the corruption and deception and has gone straight, reporting the problems to Captain II James Biggs (Hugh Laurie), of internal affairs, who starts an investigation against Ludlow.\n\nUpset at Washington for &quot;snitching&quot;, Ludlow follows him to a convenience store to confront him. However, Washington is executed in the store in an apparent robbery, with Ludlow present. Though Ludlow is innocent, the circumstances can heavily implicate him in the murder. The DNA of two criminals known as Fremont and Coates is found at the scene, as well as cash and drugs in Washington's possession. It is assumed that Washington himself was corrupt, despite his seemingly changed attitude, and that he had been stealing drugs from the department's evidence room and selling them to Fremont and Coates. Ludlow teams up with Detective I Paul &quot;Disco&quot; Diskant (Chris Evans), who has been assigned to the case to join him in his personal investigation. Their search for the two involves some tough interrogation of other criminals, which eventually leads them to a house in the hills where they discover the bodies of the real Fremont and Coates buried in a shallow grave. The condition of the bodies makes it apparent that they were killed well before Washington's murder.\n\nLudlow and Disco, posing as cops who are willing to take over Washington's activity of stealing and selling drugs, are able to set up a meeting with the two criminals masquerading as Fremont and Coates. The meeting goes bad when Disco recognizes the two; he pulls his weapon and he is shot and killed. Ludlow manages to kill both men and escapes back to his girlfriend's house, where a news report reveals the criminals were Sheriff's deputies.\n\nShortly afterward, Ludlow is subdued at his girlfriend's house by Detective I Cosmo Santos (Amaury Nolasco) and Detective I Dante Demille (John Corbett), two fellow officers from his unit who admit that they planted Fremont and Coates' DNA and the drugs at the scene of Washington's murder, to prevent him from testifying against them in Biggs' investigation. The two cops take Ludlow out to the house where the two bodies were found earlier, for execution. However, Ludlow manages to kill both of them. He then heads to Washington's house to take care of their supervisor, Sergeant II Mike Clady (Jay Mohr), whom he later captures and places in the trunk of his car. Ludlow is also piecing together the puzzle as he goes; he eventually learns that he has been a pawn in a plan masterminded by Captain III Wander. Ludlow shows up at Wander's house in order to kill him, when Wander reveals that he has incriminating evidence on just about everybody in the department, as well as judges, councilmen and politicians. With so many people in Wander's pocket, he has been able to quickly move up the department's ranks as well as bury his unit's corruptions. Wander tries to convince Ludlow that he is his friend and best officer, and tries to bribe him with a large amount of stolen money and incriminating documents hidden in a wall of his home. However, Ludlow, in the end, kills Wander. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0421073/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0421073/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:654fa7fc4c6ebe1b0e301010d460bcad5310648e","amp;dn":"Street-Kings.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"654fa7fc4c6ebe1b0e301010d460bcad5310648e","infoHashBuffer":{"type":"Buffer","data":[101,79,167,252,76,110,190,27,14,48,16,16,212,96,188,173,83,16,100,142]},"announce":[],"urlList":[]}}