{"title":"Coast to Coast AM - Apr 28 2011 - UFO Crash &amp; Cosmic Explosion","uid":6358727,"size":55368568,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:65d24019ea085c70b22b9390c428161ea53d4c64&amp;dn=Coast+to+Coast+AM+-+Apr+28+2011+-+UFO+Crash+%26+Cosmic+Explosion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":5,"time":1304248620,"description":"Coast to Coast AM - Apr 28 2011 - UFO Crash &amp; Cosmic Exp  \n \n\nInvestigative reporter Linda Moulton Howe presented a 3-part report on a UFO crash near Aztec, New Mexico in 1948. The crash recently received attention when it was apparently referred in the 'Hottel memo,' one of the FBI's released documents on their new 'Vault' website. She interviewed researcher Scott Ramsey, who along with Suzanne Ramsey and UFO investigator Frank Warren have written a book, The Aztec Incident: A Recovery in Hart Canyon, which will come out later this year.\n\nRamsey discussed the Hottel memo's link to a crashed disc in Hart Canyon (see sketch below), burned alien bodies, and earlier UFO books by Frank Scully, and William Steinman which reported on the 1948 incident near Aztec. According to witnesses, the metallic craft, which was about 100 ft. in diameter had a staircase that came out, and portholes from which they viewed about 14-16 charred bodies of small beings that weighed around 40 lbs. each, and had 4-fingered hands, Ramsey recounted. Amid much military secrecy, the craft was reportedly taken to Los Alamos, he noted. More here.\n\nIn her last report, Linda discussed the discovery of a strange cosmic explosion in March 2011 that has baffled astronomers. Longer than a typical gamma-ray burst, there has been conjecture that it could represent a black hole eating up a star. She spoke with astronomer Andrew Fruchter, who compared the explosion to a &quot;blazar&quot; (blazing quasi-stellar object). Further details.\nExtreme Weather\n\nIn the first hour, two guests talked about the recent extreme weather, including the massive tornadoes in Alabama and the South. First, author Whitley Strieber noted that the US had a very cold winter but the cold air didn't reach very far south, so the Gulf and Caribbean waters have stayed warm and because of this &quot;we could have a very explosive storm season...in April and May.&quot; Researcher Mitch Battros talked about the influence of space weather, and in particular a recent coronal mass ejection on the sun which he believes could play a part in the weather disruptions.\n\nNews segment guest: Christian Wilde\nWebsite(s):\n\nearthfiles.com\nunknowncountry.com\nearthchangesmedia.com\n\nBook(s):\n\nMysterious Lights and Crop Circles\nGlimpses of Other Realities, Volume 2\nThe Coming Global Superstorm\nHybrids\nSolar Rain\n \n \nthanks to my sorce","torrent":{"xt":"urn:btih:65d24019ea085c70b22b9390c428161ea53d4c64","amp;dn":"Coast+to+Coast+AM+-+Apr+28+2011+-+UFO+Crash+%26+Cosmic+Explosion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65d24019ea085c70b22b9390c428161ea53d4c64","infoHashBuffer":{"type":"Buffer","data":[101,210,64,25,234,8,92,112,178,43,147,144,196,40,22,30,165,61,76,100]},"announce":[],"urlList":[]}}