{"title":"licence to kill","uid":6408852,"size":47282681682,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:65d58a9a1f5545fc953ddaa3842911edaa2a0c38&amp;dn=licence+to+kill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ostapnick","files":474,"time":1305905361,"description":"Licence to Kill (1989) is the sixteenth official entry in the James Bond series, and the first one not to use an Ian Fleming novel\\'s title as its title. While enjoying a generally positive critical reception, it was the first James Bond film to be given a PG-13 rating in the United States and also the first to gain a 15 rating in the United Kingdom, being noted as significantly darker and more violent than its predecessors. Due to these issues, as well as marketing problems including a last minute title change, Licence to Kill had poor US box office returns, making just USD$34,667,015, barely more than its estimated USD$32,000,000 budget, though it performed well overseas.\nThis was Timothy Dalton\\'s second and final performance in his brief tenure in the lead role. Legal wrangling over control of the series and James Bond character resulted in a six year long delay in production of the next Bond film which resulted in Dalton deciding to not pursue a return. It is also the final Bond film for actors Robert Brown (as M) and Caroline Bliss (as Moneypenny), screenwriter Richard Maibaum, title designer Maurice Binder, cinematographer Alec Mills, producer Albert R. Broccoli (he would later act as a consulting producer for GoldenEye before his death) and director John Glen.","torrent":{"xt":"urn:btih:65d58a9a1f5545fc953ddaa3842911edaa2a0c38","amp;dn":"licence+to+kill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65d58a9a1f5545fc953ddaa3842911edaa2a0c38","infoHashBuffer":{"type":"Buffer","data":[101,213,138,154,31,85,69,252,149,61,218,163,132,41,17,237,170,42,12,56]},"announce":[],"urlList":[]}}