{"title":"ALTA-1309 Report Series","uid":4997805,"size":276760,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65eb9d3074dd92baf1e83d61ddc0f66e3c4f0983&amp;dn=ALTA-1309+Report+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":3,"time":1247364311,"description":"Since its conception in the late 1990's, the Web Bot Project has made a large number of very accurate and insightful predictions regarding coming events. Originally designed to track stock market trends, the Web Bot uses a system of spiders that crawl the Internet looking for patterns of behavior, trends and chatter pertaining to coming events. This tool is believed to be able to forecast the future by tapping into the collective unconscious mind of society. The technology captures the &quot;Oh my God! Did you see on TV just now...&quot; kind of emotive waves that sweep around the planet.  It doesn't catch $50 lotto winners.\n\nWhat becomes obvious when reading about the technology is that it sometimes reads a bit like the I Ching (the Chinese Book of Changes) because the technology doesn't come out and say &quot;go look for a terrorist attack over there&quot;. What it does is gives phrases that would be associated with how people talk about an event, or more accurately, how they change their speech to reflect their thought processes because of an event (after). \n\nFor more info about the technology and previously predictions, see http://peoplenomics.com/history.htm\n \n--------------------------------------------------------\n \nALTA 1309 Report Series Details:\n \nThis series began data collection on August 20, 2008 and has a target date range of February 2010 for shorter term detail values with the additional goal of extending the long range view of the modelspace out to end of September of 2010.\n \nThe immediacy target of this ALTA 1309 series is November of 2009.\n \nThe data set acquisition targets are in the range of 90+ million reads as per the earlier series where our bandwidth and processing limitations just skirted this level. \n \n--------------------------------------------------------\n \nStandard Warning: Read this as if your sanity depended on it.\n \nBe advised that here we attempt to gnaw about the broad outline of developing events in phenomenal world by a method of our own devising involving the use of shifting lexical patterns among other aberrant thoughts.\n \nBe advised that the entire ALTA report series are based on this technique.\n \nBe advised that these reports are prepared for entertainment purposes only, and any correlation between anything that may appear within any of our reports and the developing circumstances of your life or planetary environment is entirely within your own perception. Your mind is not under our control, and therefore not our responsibility.","torrent":{"xt":"urn:btih:65eb9d3074dd92baf1e83d61ddc0f66e3c4f0983","amp;dn":"ALTA-1309+Report+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65eb9d3074dd92baf1e83d61ddc0f66e3c4f0983","infoHashBuffer":{"type":"Buffer","data":[101,235,157,48,116,221,146,186,241,232,61,97,221,192,246,110,60,79,9,131]},"announce":[],"urlList":[]}}