{"title":"Priscilla Renea - Dollhouse","uid":5163140,"size":128380932,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:66d59ee6e0254a2c4112e1cc594dd54ccf487c77&amp;dn=Priscilla+Renea+-+Dollhouse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258267403,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Dollhouse&quot; is an electropop song by American pop singer-songwriter Priscilla Renea from her debut album, Jukebox. Produced by Benny Blanco and Lil Ronnie, it was released as the album's first single in late 2009 in North America. The song is an uptempo dance song with influences of neo-electro and synthpop. The main idea behind the song is relationship independence and was written as an uptempo empowerment anthem that declares independence from an insensitive, indifferent partner.\n\nThe music video was released to Renea'sChannel on August 17, 2009, the same day the song was released for digital download.\n\nThe video depicts Renea and her partner shrunk down to size and living in a dollhouse. Renea in the video is depicted as a picture-perfct girl wearing bright red and green dresses who is unhappy with her lover. Within the video she expresses her anger and resentment at him up to a point where she cannot stand it anymore and breaks free of his clutches, growing back to normal size and having him sent away. There are many scenes of Renea singing on a life-sized chair while still the size of a doll, in parts of the dollhouse she lives in, and one scene where she is life-sized again, putting her now ex-boyfriend in a box to be sent away, which ends the music video.\n\n&quot;Dollhouse&quot; is an uptempo electro pop song with strong uses of synthesizers, keyboards and heavily synthesized drum machine. Influences derive from electronic music, synthpop and neo-electro with an ethereal sound very similar to Lily Allen's 2008 hit single &quot;The Fear&quot;. Set in common time, the song has a hook, is moderately fast, and composed in the key of F major and has a metronome of 136 beats per minute. Renea's voice spans from D flat to B flat.\n\nThe song's lyrics, written by Renea, Benny Blanco and Lil Ronnie, have been interpreted as an empowerment anthem about relationship independence. The song's protagonist sings in first person perspective while condemning her insensitive partner for many faults including lack of interest and straying away from their love.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:66d59ee6e0254a2c4112e1cc594dd54ccf487c77","amp;dn":"Priscilla+Renea+-+Dollhouse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66d59ee6e0254a2c4112e1cc594dd54ccf487c77","infoHashBuffer":{"type":"Buffer","data":[102,213,158,230,224,37,74,44,65,18,225,204,89,77,213,76,207,72,124,119]},"announce":[],"urlList":[]}}