{"title":"The Killers - A Dustland Fairytale","uid":5009449,"size":176537604,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:675dfd32345514e75a4786f1ba7d3b659590e85e&amp;dn=The+Killers+-+A+Dustland+Fairytale&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247916462,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;A Dustland Fairytale&quot; is a song by American rock band The Killers. The song is said to be about frontman Brandon Flowers' parents.\n\nOn May 11, The Killers performed &quot;A Dustland Fairytale&quot; live on the Late Show with David Letterman with a complete orchestra. \n\nThe song was released as the third single from the band's third studio album Day &amp; Age in North America. In the United Kingdom, Europe and Australia, the third single released was&quot;The World We Live In&quot;.\n\nIt will be the 4th single from Day &amp; Age in the UK and will be released on August 10th. \n\nThe video was directed by Anthony Mandler who also directed Killers videos for &quot;Tranquilize&quot; and &quot;When You Were Young&quot; It was released on US iTunes on June 8, 2009.\n\nThe video premiered in the UK on June 16 at 11.40pm on Channel 4. \n\nThe video shows an old man named Joe White, smoking with a tattoo of the number 7 on one of his fingers. It then reflects on a younger man, &quot;Joey&quot;, showing the same 7 on the finger, dressed in a leather jacket, white shirt and leather pants and about to fight a member of another gang, &quot;Billy&quot;, for his own gang, the &quot;Sevens&quot;. Throughout the video, it shows the younger man dating a brunette girl, then there is a flashback of Joey looking at the brunette girl through her window, as she turns around and kisses Billy, while it shows the older man going to all the locations shown, reflecting on the memories of his youth. Interspersed with this is a letter that the man has, showing that he has just been released from prison, which gives a clue to the result of the initial fight - he kills Billy. The final shot is of an older Joe visiting a house, ringing the doorbell to find an older brunette woman answer the door, and they embrace.\n\nDay &amp; Age is the third studio album by American rock band The Killers, released on November 24, 2008 in the UK, Canada and the US. Frontman and lead vocalist Brandon Flowers states that it is the band's &quot;most playful record.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:675dfd32345514e75a4786f1ba7d3b659590e85e","amp;dn":"The+Killers+-+A+Dustland+Fairytale","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"675dfd32345514e75a4786f1ba7d3b659590e85e","infoHashBuffer":{"type":"Buffer","data":[103,93,253,50,52,85,20,231,90,71,134,241,186,125,59,101,149,144,232,94]},"announce":[],"urlList":[]}}