{"title":"Digital Talking Parrot Screensaver 1.0.13 [ak]","uid":6410717,"size":2549411,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6837995cc8b76b2b12a4d8099f14b4469cf1a012&amp;dn=Digital+Talking+Parrot+Screensaver+1.0.13+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1305963211,"description":"Digital Talking Parrot Screensaver 1.0.13\n\nDigital Talking Parrot is the first intelligent, interactive screensaver. This cute and friendly animated 3D Screensaver is based on the latest multimedia technologies in voice changing. Digital Talking Parrot sings on start up and talks while your screen goes to wait. It can also mimic bird songs and repeat the words or phrases that you teach it.\n\nParrot remembers whatever it hears and will repeat it later in a funny voice that you can alter. You can teach Parrot to talk with different voices, and decide which words it should remember, and which it should not. You can choose the background from 5 different wild nature scenes, including a lake, a waterfall and a wind scene.\n\nBy changing the pitch and vibration of Parrot's voice, you can make it talk in the funniest voice to entertain you while you are not actively using your computer.\n\nHere are some key features of &quot;Digital Talking Parrot&quot;:\nÃ‚Â· Digital Talking Parrot though can talk, laugh, sing, mimic bird's songs, and imitate human sounds thanks to available phrases in this free screensaver. The best (or the &quot;worse&quot;) is that the virtual pet remembers whatever it hears and will say out later. It is really a lovely virtual pet for your PC.\nÃ‚Â· You can teach Digital Talking Parrot to talk with the voices you want, to remember and say out whatever you want. You also can teach this virtual pet what to remember and what not to.\nÃ‚Â· You can also change background where you want Digital Talking Parrot to be at. Currently this free screensaver has 4 backgrounds to choose: Green, Lake, Room, and Waterfall.\nÃ‚Â· You can easily make it &quot;shut up&quot; or not to &quot;hear&quot;, by turning off speakers or microphone.\n\nRequirements:\nÃ‚Â· 1GHz compatible processor\nÃ‚Â· 256 MB RAM\nÃ‚Â· Full Duplex Sound Card\nÃ‚Â· DVD drive (optional)\nÃ‚Â· CD drive (optional)\nÃ‚Â· webcam (optional)\nÃ‚Â· speakers (optional)\nÃ‚Â· CD Writer &amp; Printer (optional)\n\nHome Page - http://free-screensaver.audio4fun.com/free-virtual-pet.htm\n\n","torrent":{"xt":"urn:btih:6837995cc8b76b2b12a4d8099f14b4469cf1a012","amp;dn":"Digital+Talking+Parrot+Screensaver+1.0.13+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6837995cc8b76b2b12a4d8099f14b4469cf1a012","infoHashBuffer":{"type":"Buffer","data":[104,55,153,92,200,183,107,43,18,164,216,9,159,20,180,70,156,241,160,18]},"announce":[],"urlList":[]}}