{"title":"[WIN - MULTi] WinPenPack 3.5.2 - Flash Drive 2GB [Tntvillage.Sca","uid":5188981,"size":745983881,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:685dcde5e9200ca9d9b4b76c000ed79ff2d1ad5a&amp;dn=%5BWIN+-+MULTi%5D+WinPenPack+3.5.2+-+Flash+Drive+2GB+%5BTntvillage.Sca&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pir84u","files":2,"time":1259596795,"description":"[WIN - MULTi] WinPenPack 3.5.2 - Flash Drive 2GB [Tntvillage.Scambioetico]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=WinPenPack%203.5.2%20-%20Flash%20Drive%202GB&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Pir8&amp;sb=1&amp;sd=0&amp;cat=0\n\n WinPenPack 3.5.2\n\n Visit this link: http://i54.photobucket.com/albums/g109/pir8/sw/page_update.png\n\n - Software Sheet - \n\nNome: winPenPack Flash 2Gb v3.5.2\nOs: Windows ALL \nLingua: MULTI                                  \nVersione: 3.5.2 FLASH 2GB\nGenere: Software portatile pen drive\nProduzione: WinPenPack\nLicenza: Freeware\n\n\n - Product Information - \n\nwinPenPack is an applications environment of Free Softwares, modified for being run and used from an USB pendrive, without need of installation. The removable device, so, is no more a simple data container, but becomes a really self-contained environment, within programs and documents are homogeneously integrated.\n&quot;Portable&quot; softwares included into winPenPack does not need to be installed, does not write their settings into host PC, and can be easily carried between multiple computers through any external device, as removable hard disks or USB pendrives.\nAfter inserting the USB pendrive into a free USB port of host PC, user will have immediately available a collection of pre-configured and ready to use programs, subdivided in categories and executable through a practical menu, analogue to Windows menu Start, the winPenPack Launcher. User will feel as is working on its own PC, with web browsers, e-mail clients, image and drawing editors, chat clients, PC maintenance and security, school, development. All he needs, always available. All these features make winPenPack extremely useful in any field.\n\n\n Visit this link: http://i54.photobucket.com/albums/g109/pir8/sw/logo1.png\n\n - Application List - \n\nDocuments management\nGUIPdftk + Pdftk (software toolkit which performs a range of manipulations on PDF files)\nX-SumatraPDF (.pdf reader)\nX-muCommander (file manager)\nX-OpenOffice.org (office suite, Microsoft Office open source alternative)\nX-Scribus (desktop publishing)\n\nPersonal Information management\nMoney Manager Ex (finance manager software)\nX-ANote (sticky-notes)\nX-Planner (project management tool)\nX-Sunbird (calendar with agenda functions)\n\nWeb management\nWeb Server PAMPA (Web Server - Windows GUI that manages as a stand-alone application an AMP environment: Apache, MySQL and PHP)\nX-FileZilla (FTP client)\nX-Kompozer (Html editor for web pages creation)\nX-WinSCP (secure FTP transfert)\n\nGraphics\nJPEGView (image viewer)\nX-Blender (3D graphics and animations)\nX-Gimp (image manager and elaboration)\nX-Inkscape (vectorial graphics)\nX-PosteRazor (any dimension poster creation and print)\nX-Zphoto (flash-based photo album generator)\n\nInternet\nX-MagicMailMonitor (mail monitor)\nX-Thunderbird (e-mail client)\nX-Pidgin (instant messenger with MSN, ICQ, AIM and much more compatibility)\nX-Miranda IM (multipaltform instant messenger, with MSN, Jabber, Yahoo, AIM, ICQ compatibily)\nX-Firefox (internet browser)\nX-QuteCom (softphone which allows you to make free PC to PC video and voice calls, and to integrate all your IM contacts in one place)\nX-RSSOwl (RSS reader)\nX-WackGet (download manager)\nX-WinHTTrack (website copier)\n\nMultimedia\nAnt Movie Catalog (movie manager that help you to manage a collection of movies DVD, CD, VideoCD, DivX, and tapes)\nCheckmate Mp3 Checker (it can analize errors in Mp3 files)\nX-Audacity (audio editor)\nX-BonkEnc (CD ripper, audio encoder and converter for various formats)\nX-CDex (CD Ripper, CDex can extract the data directly from an Audio CD)\nX-CdDaXTractor (audio CD extractor)\nX-EasyTag (utility for viewing and editing tags for MP3, MP2, MP4/AAC, FLAC, Ogg Vorbis, MusePack, Monkey's Audio and WavPack files)\nX-MP3Gain (analyzes and adjusts mp3 files so that they have the same volume)\nX-Screamer Radio (internet radio player)\nX-MediaPlayerClassic (great Windows Media Player substitute)\nX-VideoLAN (multimedia player)\nX-DivFix++ (complete rewrite of &quot;DivFix&quot; program which tries to fix/rebuild AVI's index section for proper video play)\nX-DivXRepair (DivX repair)\nX-dvdisaster (CD/DVD data recovery)\nX-VirtualDub (video editing, DivX included)\nX-WinFF (video converter)\nX-CdrTools FrontEnd (CD/DVD burner)\nX-Juice (Podcast reader)\nX-xVideoServiceThief (tool for downloading your favourite video clips from a lot of video websites)\n\np2p - File sharing\nX-DcPlusPlus (Direct Connect client)\nX-Halite (Bit Torrent client)\nX-HttpFileServer (file server, file sharing through web)\nX-MetMedic (.met files editor, p2p)\nX-Mule (p2p)\n\nSecurity\nSteganos LockNote (simple text writer with cryptation)\nInstallFix Security Suite (privacy and security Windows tools)\nX-ClamWin (antivirus)\nX-DCFirewall (firewall)\nX-Eraser (secure and programmable files and folder delete)\nX-FreeOTFE (virtual disk creation protected by password)\nX-KeePass (store and protect your passwords)\nX-NeoCrypt (single/multiple files/folder cryptography)\n\nSystem\nCrystal CPUID (shows detailed information about the processor, chipset, bios and cache)\nCrystal Disk Info (HDD health monitoring utility)\nDaphne (task manager)\nDiskCleaner (search and delete for temporary and unvailing files)\nDrive Cleanup Wizard (permanently delete useless, .bak, .tmp, temporary internet files from the computer)\nX-7Zip (file compressor/decompressor)\nX-Abakt (backup tool)\nX-DriverBackup! (drivers backup and restore)\nX-JKDefrag (disk defragmentation tool)\nJkDefragStarter (JKDefrag GUI)\nX-ProcessController (real time process controller)\nX-Pserv.cpl (active system services viewer)\nX-StartupManager (program that provides you the possibility to manage the Windows startup procedure)\nX-Synkron (allows to synchronize two differents hd or folders)\nX-TightVNC (virtual network computing)\nX-WinDirStat (disk usage statistics viewer)\nX-xpy (allows to change some functions of Windows XP)\n\nDevelopment\nRegedt33 (advanced registry editor)\nwinMd5Sum (MD5 checksum calculator)\nX-InnoSetup (installation setup creation)\nX-ISTool (Innosetup plugin)\nX-Notepad++ (text editor enhanched)\nX-RegShot (allows to notice the differences in Windows registry following the installation of a program)\nX-SciTE (text editor for developers)\nX-UniExtract (allows to extract/show the content of setup.exe files)\nX-UPXShell (executable and .dll compressor)\nX-WinMerge (visual text file differencing and merging tool)\n\nUtilities\nAnt Renamer (files renamer)\nX-CamStudio (it allows to capture desktop activity and save it as .avi file)\nX-Lightscreen (it allows to saving and catalog screenshots in .png, .jpg and .bmp format)\nSpeedCrunch (calculator)\nVirtuaWin (virtual desktop management)\nX-AstroGrep (alternative hard disk files and folders searcher)\nX-Ditto (extension to the standard windows clipboard)\nX-Magnifying Glass (magnificator glasses)\nX-TaskSwitchXP (Windows task manager alternative)\nX-Translate.Net (client to most popular translating services available online)\nX-WeatherNotify (show weather in status bar or in a window)\n\nTools\nX-Cafe (it allows you to open, with a double click of mouse, the documents with the programs of pendrive USB, without any change of Windows registry)\nEjectUSB (utility to close all programs running from a specified drive and attempt ejection)\n\nLibraries\nFFmpeg\nGNU Aspell\nGhostscript\nGTK+ for Windows\nLAME Encoder\nJava Runtime Environment (JRE)\nPython\n\n\nDescription of produced material\n\n   1.winPenPack\n      winPenPack is an applications environment of Free Softwares, modified for being run and used from an USB pendrive, without need of installation. It is a really self-contained environment, within programs, .xml and config files, documents are homogeneously integrated.\n      Portable softwares included into winPenPack does not need to be installed, does not write their settings into host PC, and can be easily carried between multiple computers through any external device, as removable hard disks or USB pendrives.\n      Programs are subdivided in categories and executable through a practical menu, to Windows menu Start, the winPenPack Launcher. winPenPack suites are available in the following editions: Flash Essential, Flash 2Gb, Flash School, Flash Web and Flash Game.\n\n   2.X-Software\n      X-Softwares, distributed in .zip or .exe format or hosted by our or other authorized mirrors, are created and developed by winPenPack Team. Each X-Software is composed by a launcher, X-Launcher, that allow to modify, as one likes, program startup options for let it portable, that runs an existing not natively portable program, through an .ini configuration file. X-Softwares, X-Launchers and .ini files created for portabilize programs are exclusive work of winPenPack development Team, and constitute integrant part of winPenPack.\n\n   3.winPenPack launcher\n      winPenPack Launcher is the menu for launching applications collected in winPenPacks, created by winPenPack Team for the project.\n\n   4.Portable software\n      Portable Softwares are programs that are executed on host PC without leaving tracks of their execution. Generally, they don't reside in our site, but they are present as direct links to files hosted on the developer/distributor site. These softwares are just identified and indicated in related pages for a possible download.\n\n   5.Website and documentation\n      The winPenPack official domain is winpenpack.com with mirror on winpenpack.it, winpenpack.org, winpenpack.info, winpenpack.eu and winpenpack.net. The project is hosted also on SourceForge. The site hosts all winPenPacks, programs, source code, configuration files and all documentation created by winPenPack development Team, collaborators, community members.\n\n   6.Source code and development\n      You can contribute to the growth of the project by further developing winPenPack components. The complete source code is available in the respective download pages (X-Launcher source code, winPenPack Launcher source code, winPenPack source code - SourceForge repository). To collaborate to the development of winPenPack components, please refer to related forum sections (X-Softwares development, winPenPack menu development).\nGeneral license guidelines and copyright\n\nThe project collects documents, scripts, ideas and material protected by author's rights and software released under different licenses. Every component, program, launcher, configuration (.xml .ini) and documentation file is subject to its own license and copyrighted by respective authors. Materials and softwares created by winPenPack Team, except where indicated, are released under GNU General Public License. X-Launcher and winPenPack launcher, original works of Development Team and integrated parts of winPenPack, are released under GNU General Public License. On X-Softwares, the program associated to the launcher is property of its own author, winPenPack just portabilizes it, and is covered by its own license. The Portable Softwares, included in winPenPack collections or indicated in the download section of website, are property of their authors and are covered by their own licenses. The documentation and all website contents, except where indicated, are released under Creative Commons License (Attribution-Noncommercial-No Derivative Works 3.0).\nVisit this info link: http://creativecommons.org/licenses/by-nc-nd/3.0/deed.it  Visit this link: http://i.creativecommons.org/l/by-nc-nd/3.0/88x31.png\n\n Visit this link: http://img45.Imageshack.us/img45/7181/avastfinaloe8.jpg\nUpdated to 28/11/2009 Version &quot;091128-1&quot;\n\n\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:685dcde5e9200ca9d9b4b76c000ed79ff2d1ad5a","amp;dn":"%5BWIN+-+MULTi%5D+WinPenPack+3.5.2+-+Flash+Drive+2GB+%5BTntvillage.Sca","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"685dcde5e9200ca9d9b4b76c000ed79ff2d1ad5a","infoHashBuffer":{"type":"Buffer","data":[104,93,205,229,233,32,12,169,217,180,183,108,0,14,215,159,242,209,173,90]},"announce":[],"urlList":[]}}