{"title":"Black Sun Rising- The Day Before","uid":5183782,"size":289361754,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:68a3865f4724ab20fcb294695ec405a05367204f&amp;dn=Black+Sun+Rising-+The+Day+Before&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Black1az","files":9,"time":1259370122,"description":"\nAfter being pushed back and delayed many times, Arizona Emcee Black One is set to release a free amended version of his highly anticipated album &quot;Black Sun Rising&quot; on various sites including Arizonabeats.com and Black one's myspace. The free version will feature Black one's popular two singles from the album &quot;It's Time&quot; and &quot;City Lights&quot;. It will also feature never heard before music from the artists but it yet to be determined if the the songs on the free version will be featured on the actual retail release slated for this December. &quot;I mainly just want to throw something out there to know that we are still making great music. The fans have been patient all year waiting for my album and Tucson Don's EPIC to drop, it's time we gave them something to say thanks. I have made over 50 songs for the album so it's tough to say what is going to make the final cut or not with that said that doesn't mean the music shouldn't be heard&quot; The news of the release comes on the heels for Black 1's latest mixtape &quot;Postcards From Tucson&quot; which has been Released on various torrents site but will be available more widely next week. Black plans to follow up the mixtape with a sequel as well as a mixtape with fellow H2 member Tucson Don, whose album EPIC is also looking to be released in December. &quot;Black Sun Rising: The Day Before&quot; Will be available for Free Download on Various Sites on Black Friday November 27th.\n\n\n1. City Lights Produced By OcNotes\n2. It's Time Produced By BestPaul\n3. Black 1- So Many Things Produced By RTC Shogun\n4. Sunset To Sunrise Produced By Defaced Property\n5. Turn by Turn Produced By Bestpaul\n6. Set Us All Free Produced by Jaron Ikner\n7. Almost Famous featuring Tucson Don and Audio produced By Jaron Ikner\n8. Like The SunShine (incomplete)\n9. Forever Is a Long Time (original version)","torrent":{"xt":"urn:btih:68a3865f4724ab20fcb294695ec405a05367204f","amp;dn":"Black+Sun+Rising-+The+Day+Before","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68a3865f4724ab20fcb294695ec405a05367204f","infoHashBuffer":{"type":"Buffer","data":[104,163,134,95,71,36,171,32,252,178,148,105,94,196,5,160,83,103,32,79]},"announce":[],"urlList":[]}}