{"title":"Redes - The Grid - Miniserie Completa DVDRip Spanish","uid":5012643,"size":2196518054,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:68b44336423b0d795f3c94b2eb4b64f77d3896f9&amp;dn=Redes+-+The+Grid+-+Miniserie+Completa+DVDRip+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":4,"time":1248078282,"description":"The Grid se centra en una cÃƒÂ©lula de una organizaciÃƒÂ³n terrorista que opera a nivel mundial y en un equipo de agentes antiterroristas americanos e ingleses que tienen por objetivo el detenerlos. Nos presenta el coste emocional que nos deja una guerra con vÃƒÂ­ctimas y lo que luchan aquellos que combaten estos actos de terrorismo.\n\nÃƒÅ¡nica en cuanto a su forma de tratar un tema tan delicado como el terrorismo, The Grid, nos muestra ambos lados de un conflicto terrorista. Aunque se centra principalmente en los agentes antiterroristas y en su trabajo consiguiendo informaciÃƒÂ³n de los servicios de inteligencia y siguiendo las pistas que logran conseguir; tambiÃƒÂ©n explora las motivaciones de los terroristas y el impacto que estas acciones violentas tienen en sus familias.\n\nLa trama de esta miniserie arranca con un atentado mortal con gas sarÃƒÂ­n en Londres. La directora de la Agencia Antiterrorista americana, Maren Jackson, (Julianna Margulies, Urgencias) decide formar un grupo de agentes de alto nivel para ayudar en la investigaciÃƒÂ³n de este atentado. Para ello, enlista al agente del FBI Max Canary (Dylan McDermott, El Abogado) y la analista de la CIA, Raza Michaels (Piter Marek), originaria de Oriente Medio. Tambien en este equipo especial estÃƒÂ¡ Emily Tuthill (Jemma Redgrave, Regreso a Howards End), directora de operaciones de la agencia britÃƒÂ¡nica MI6; y Derek Jennings (Bernard Hill, El seÃƒÂ±or de los anillos), el director de la unidad antiterrorista del MI5.\n\nPor su parte, del lado de los terroristas estÃƒÂ¡ Muhammad (Alki David) que es el jefe de una nueva organizaciÃƒÂ³n terrorista; Kaz Moore (Barna Moricz) que es un extremista checheno que trabaja con ÃƒÂ©l; y el doctor Raghib Mutar (Silas Carson) un devoto doctor musulmÃƒÂ¡n de El Cairo, que se debate entre su interpretaciÃƒÂ³n espiritual de la fÃƒÂ© musulmana y el punto de vista de Muhammad, mucho mÃƒÂ¡s violento y radical.\n\nLos productores de The Grid apostaron desde un principio por la autenticidad y la credibilidad como una acciÃƒÂ³n prioritaria. Por ello, para ayudar a dar forma a las historias y a los personajes de esta miniserie, mantuvieron continuas entrevistas con agentes antiterroristas y expertos de la Casa Blanca, el Departamento de Estado, la Agencia de Seguridad Nacional, la CIA y el FBI.\n\nAdemÃƒÂ¡s, estudiaron los orÃƒÂ­genes del terrorismo y las motivaciones existentes tras un acto de terrorismo, las familias y la educaciÃƒÂ³n que han recibido esos terroristas y las continuas luchas entre los ÃƒÂ¡rabes tolerantes y el mundo musulmÃƒÂ¡n que se opone a ellos. Para asegurarse de no caer en estereotipos negativos, los productores consultaron con acadÃƒÂ©micos y expertos para verificar y profundizar entre la mayorÃƒÂ­a de los ÃƒÂ¡rabes normales y los ÃƒÂ¡rabes responsables de terrorismo.\n\nEste interÃƒÂ©s por hacer a The Grid, una serie lo mÃƒÂ¡s realista posible, se extendiÃƒÂ³ tambiÃƒÂ©n a los actores, que visitaron las oficinas centrales del FBI y pasaron mucho tiempo hablando con agentes retirados con una gran experiencia en acciones antiterroristas. AdemÃƒÂ¡s, el reparto recibiÃƒÂ³ clases de cultura religiosa musulmana y los productores fueron muy cuidados al contratar a actores bilingÃƒÂ¼es para los papeles de ÃƒÂ¡rabes, respetando los diferentes dialectos regionales dÃƒÂ©cada personaje.\n\nEl resultado de todos estos esfuerzos es una de los retratos mÃƒÂ¡s dramÃƒÂ¡ticos y realistas de la guerra y del terrorismo que se haya creado jamÃƒÂ¡s para una serie de televisiÃƒÂ³n.","torrent":{"xt":"urn:btih:68b44336423b0d795f3c94b2eb4b64f77d3896f9","amp;dn":"Redes+-+The+Grid+-+Miniserie+Completa+DVDRip+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68b44336423b0d795f3c94b2eb4b64f77d3896f9","infoHashBuffer":{"type":"Buffer","data":[104,180,67,54,66,59,13,121,95,60,148,178,235,75,100,247,125,56,150,249]},"announce":[],"urlList":[]}}