{"title":"DwellClick V 2.0.4 with SK patcher","uid":6439846,"size":2530299,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:698031edb40f795d2bd87228c306c5f9fee69d80&amp;dn=DwellClick+V+2.0.4+with+SK+patcher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"polisdavid","files":-1,"time":1306945911,"description":"Official Web Site: &lt;a href=&quot; http://dwellclick.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://dwellclick.com/&lt;/a&gt;\n\nDwellClick is the app that clicks for you. You point, it clicks . DwellClick will drag for you. Press Fnfor the pop-up panel or point at windows, resizersand scroll bars to auto drag. Save thousands of clicks per day. Drag hands-free with total control. Empower your mouse, rest your hands\n\nWhat is dwell clicking?\n\nDwell clicking enables clickless operation of your computer. Just point with your mouse or trackpad, and DwellClick clicks for you.\nWhy use DwellClick?\n\nBy avoiding the repetitive clicking action, you protect your hands from the damage that can build up with long-term computer use. And it's fast, and a pleasure to use.\n\nCustomers really love DwellClick's auto drag feature. And you can effortlessly double click, control-click, drag items and select text, all click-free, with the slick pop-up panel.\n\nFeatures\n\n Auto Click. Relieve your hands from the strain of thousands of clicks each day. It's stress-free mousing.\n\nAuto Drag.\nYour mouse will know when it's on a window, resize area or scroll bar, and grab it for you.\n\nPop-up panel.\nOne tap of the Fn key brings up the pop-up panel for double click, drag and control-click. (New in 2.0)\n\n Modifier keys. \n\nModifier key to go with the next click or drag. Tap twice to lock it on. (New in 2.0)\n\nAudio and visual feedback.\n\nSubtle animation and sound cues confirm and reinforce your actions.\n\nQuick Drag.\n Drag items by quickly moving the mouse just as DwellClick clicks. This takes time to master but rewards practice.\n\nDrag lock.\nTap the Fn key while dragging to lock the drag. Tap again to release. It's hands-free dragging with total control. (New in 2.0)\n\nMulti-touch aware.\nwellClick knows when you are performing a gesture and gets right out of your way.\nSystem Requirements:\n\nMac Intel OS X.6 or better\n\n--- PLEASE SEED --\n","torrent":{"xt":"urn:btih:698031edb40f795d2bd87228c306c5f9fee69d80","amp;dn":"DwellClick+V+2.0.4+with+SK+patcher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"698031edb40f795d2bd87228c306c5f9fee69d80","infoHashBuffer":{"type":"Buffer","data":[105,128,49,237,180,15,121,93,43,216,114,40,195,6,197,249,254,230,157,128]},"announce":[],"urlList":[]}}