{"title":"SHAMELESS-THE CHRISTMAS AND NEWYEAR SPECIALS IN H.264 BY WINKER@","uid":5145210,"size":1570701751,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6cd5b69bc8217dd72f5b608754da273a53416f42&amp;dn=SHAMELESS-THE+CHRISTMAS+AND+NEWYEAR+SPECIALS+IN+H.264+BY+WINKER%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alanwatson","files":-1,"time":1257224473,"description":"Suitable for 18 years and over\n\nTitles Comprise:\n\nChristmas Special: Events kick off with the miraculous appearance of a lorry-load of lifted meat, swiped by Kev (Dean Lennox Kelly) and Lip (Jody Latham). It looks like full stomachs are a dead cert for all of Chatsworth's residents, but the meat is contaminated and the estate quickly sealed off by the army. As the armed squaddies descend en masse, so do Veronica's (Maxine Peake) mum Carole (Marjorie Yates) and Tourettes-suffering, arsonist brother Marty (Jack Deam).\n\nThey've got nowhere to stay because Marty burned the house down. With &quot;no room at the inn&quot; they force themselves on Fiona (Anne-Marie Duff) and Steve (James McAvoy) for Christmas. Mosquito helicopters hover overhead while Frank (David Threlfall) leads a full-blown riot below. And the snow starts to gently fall as his valium-fuelled lover Shelia (Maggie O'Neill) goes into labour for the holy birth.\n\nNew Year Special: When five year-old Liam denounces religion at his RC Primary School and is subject to a home-visit by his teacher and the local priest, sister Debbie has to think fast. But shaving his head and pretending that he is dying of cancer is NOT one of Debbie's better ideas. In fact, by the time the rest of the Gallagher clan realise what's going on and try to set the record straight, the news has leaked out into the wider community and Debbie's lie lands the family in true Gallagher-style catastrophe. Could things get any worse for Debbie?\n\nIt's a Merry Christmas and a Happy New Year, Shameless style. ","torrent":{"xt":"urn:btih:6cd5b69bc8217dd72f5b608754da273a53416f42","amp;dn":"SHAMELESS-THE+CHRISTMAS+AND+NEWYEAR+SPECIALS+IN+H.264+BY+WINKER%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cd5b69bc8217dd72f5b608754da273a53416f42","infoHashBuffer":{"type":"Buffer","data":[108,213,182,155,200,33,125,215,47,91,96,135,84,218,39,58,83,65,111,66]},"announce":[],"urlList":[]}}