{"title":"Linkin Park - New Divide","uid":4989490,"size":155684868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6e061021c87aede65af35f14f6f29152e560540a&amp;dn=Linkin+Park+-+New+Divide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1246960677,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;New Divide&quot; is a single written by Linkin Park for Michael Bay's film Transformers: Revenge of the Fallen. The song serves as the film's theme, and was released as a single on May 18, 2009.\n\nOn May 14, Shinoda revealed that they were currently recording an accompanying music video for the song. The video, shot on location at Paramount Studios May 13 and 14, is set in an Egyptian cave and was directed by Mr. Hahn, the band's DJ. When discussing the video, Shinoda stated &quot;[Mr. Hahn's] planning on using a lot of really interesting cutting-edge visual techniques, blurring the line between our performance and some kind of digital/mechanical reality.&quot; Chester Bennington confirmed that the video is related to the Transformers: Revenge of the Fallen movie, saying on his blog, &quot;Honestly, I don't know what's going on in the video. We're in a tomb rocking out and there's a huge dead Transformer.&quot; Linkin Park has released two behind the scenes videos of the music video. Both photos and footage of the video shoot were posted on Shinoda's blog site. The video premiered on the band's Myspace site on June 11th. Two weeks later, New Divide had 3,569,562 views.\n\nThe music video features scenes taken from the movie, along with shots of the band inside the Tomb of the Primes (The 7 original Transformers) while performing the song. A lot of special effects are also seen and the video is heavily edited in places making use of thermal cameras and using flying food parts as texture around a lot of the thermal imagery. Despite many rumors of the female in the video being Megan Fox and even vocalist Chester Bennington's wife Talinda, she is a hired actress with similar features to Megan Fox. According to Talinda, she is only shown in the thermal lens to look more like Fox. Bassist Dave Farrell is not seen in shots of the whole band performing, he had hurt his wrist during the first day of filming so it is presumed this is the reason for his lack of appearance in the video.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6e061021c87aede65af35f14f6f29152e560540a","amp;dn":"Linkin+Park+-+New+Divide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e061021c87aede65af35f14f6f29152e560540a","infoHashBuffer":{"type":"Buffer","data":[110,6,16,33,200,122,237,230,90,243,95,20,246,242,145,82,229,96,84,10]},"announce":[],"urlList":[]}}