{"title":"Inside Out - No Spiritual Surrender 7 Inch","uid":5019980,"size":12523945,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e159015cb6f35b195f535a13429489d343f0e19&amp;dn=Inside+Out+-+No+Spiritual+Surrender+7+Inch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"blick666","files":4,"time":1248415571,"description":"Inside Out existed from August 1988 to roughly fall of 1991, releasing a single 7&quot; EP, No Spiritual Surrender, in 1990, on Revelation Records (later converted to six song CD). They played up and down the West Coast and even toured the East Coast once before their breakup in 1991. They had written material for a second record, to be titled &quot;Rage Against the Machine&quot; (whence the name for de la Rocha's next band came), but the band broke up shortly after their guitarist, Vic DiCara, left the band to become a Hare Krishna monk. Just before his departure Inside Out performed on California radio station KXLU showcasing a number of new songs including the song &quot;Rage Against The Machine&quot; which had become a staple in their recent live sets. The quality of the recording on the show, while adequate for a radio broadcast, is not on par with that of the band's demo and EP recordings. Copies of their live radio appearance, their pre-No Spiritual Surrender demo, as well as various live sets, have circulated the tape trading underground and file sharing world for years as popular items.","torrent":{"xt":"urn:btih:6e159015cb6f35b195f535a13429489d343f0e19","amp;dn":"Inside+Out+-+No+Spiritual+Surrender+7+Inch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e159015cb6f35b195f535a13429489d343f0e19","infoHashBuffer":{"type":"Buffer","data":[110,21,144,21,203,111,53,177,149,245,53,161,52,41,72,157,52,63,14,25]},"announce":[],"urlList":[]}}