{"title":"MailHub 1.1RC23 [K]'d","uid":6439560,"size":4737869,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:6e3f63d04c0bcb15e7b2c9fbfcd72b19522714c8&amp;dn=MailHub+1.1RC23+%5BK%5D%5C%27d&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1306941002,"description":"Official Web Site: http://www.hungerfordroad.com/\n\nMailHub is the new timesaving \\'smart\\' plug-in for Apple Mail which upgrades the performance of your inbox.\n\nMaintaining an organized workspace is a vital part of increasing our efficiency but when it comes to our inboxes, many of us find managing them hard. Also, the prospect of wading through the backlog of month?s or maybe even a year?s worth of old emails, to file, action or delete them can be a daunting prospect.\n\nMailHub can help.\n\nMailHub is a plug-in for Apple Mail which uses \\'smart\\' technology to help organize email more effectively. MailHub makes it easy to achieve and maintain a streamlined, uncluttered inbox saving you time and increasing your productivity by allowing you to file, delete or process email without interrupting work flow.\n\n* the intelligent software within MailHub learns about your filing preferences from\n  the point of installation and continues to learn ?as you file?, auto-suggesting \n  folders to file to as you use it.\n\n* MailHub allows you to file or delete, not only by individual email, but also by\n  thread or sender too. In this way email from a particular contact or thread can \n  be easily assigned to projects and filed en-masse to a mail box (or deleted) in \n  one click, radically reducing time spent on mail administration.\n\n* MailHub also allows the creation of new mail boxes ?on the go? allowing you to \n  organize your inbox naturally as email arrives - no more breaking your work flow\n  to file.\n\n* Finally MailHub allows you to set reminders and actions against emails directly \n  from your inbox so once an email is filed it is ?out of sight? but not out of\n  mind? and you won?t forget a vital task at a later date.\n\nPre-cracked courtesy of Bloppo\nRegister with any digit\n\nSystem Requirements: \n\nMac OS X 10.6 or later\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:6e3f63d04c0bcb15e7b2c9fbfcd72b19522714c8","amp;dn":"MailHub+1.1RC23+%5BK%5D%5C%27d","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e3f63d04c0bcb15e7b2c9fbfcd72b19522714c8","infoHashBuffer":{"type":"Buffer","data":[110,63,99,208,76,11,203,21,231,178,201,251,252,215,43,25,82,39,20,200]},"announce":[],"urlList":[]}}