{"title":"The McMasters (1970)","uid":5168516,"size":629215088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6f07a72301694478be78895e9350e6336155b0fe&amp;dn=The+McMasters+%281970%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0doktor1","files":-1,"time":1258554202,"description":"Synopsis\n\nBenjie returns to his hometown in the South after fighting for the North and meets with hostility from Kolby, a bigoted rancher who lost his arm while fighting for the Confederacy, and Russell, Kolby's ranch hand. Neal McMasters, a rancher who reared Benjie from childhood, offers him a half-share of his ranch. No one will work for Benjie because he is black, and McMasters is almost forced to sell Benjie's land, but Benjie's kindness to an Indian, White Feather, is reciprocated when members of his tribe arrive to help with the roundup. In further gratitude, White Feather presents Robin, his sister, to Benjie for his wife. Kolby leads some of the townsfolk in a drunken attack on McMasters and Benjie, and Robin is raped. The Indians refuse Benjie's plea for help, arguing that a black landowner is no better than the white landowners who stole their land. Despite pleas from Spencer, a liberal rancher, Kolby organizes another attack in which McMasters is killed and the house burned. Benjie is about to be hanged when the Indians launch a counterattack and kill Kolby. Benjie decides to stay on at the ranch with Robin.\n\n***********************************************************************************\n            After the wedding... they were given a real fine reception.\n***********************************************************************************","torrent":{"xt":"urn:btih:6f07a72301694478be78895e9350e6336155b0fe","amp;dn":"The+McMasters+%281970%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f07a72301694478be78895e9350e6336155b0fe","infoHashBuffer":{"type":"Buffer","data":[111,7,167,35,1,105,68,120,190,120,137,94,147,80,230,51,97,85,176,254]},"announce":[],"urlList":[]}}