{"title":"The Limits of Control 2009 LIMITED DVDR-MPTDVD","uid":5160576,"size":4701484492,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6fa4bac6e907d0e7f3059732454a80c2a2651218&amp;dn=The+Limits+of+Control+2009+LIMITED+DVDR-MPTDVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alderbaran","files":-1,"time":1258119613,"description":"The.Limits.of.Control.LIMITED.DVDR-MPTDVD\n=========================================\n\nrelease date : 07/11/2009\ngenre : Crime | Drama | Thriller\nruntime : 116 minutes\nimdb url  : http://www.imdb.com/title/tt1135092/\nimdb rating : 6.7/10\nsource : Retail R1 NTSC DVD9\nPackage Type : IMG\nSample  : Yes\nEncode : CCE 6-Pass @ 4810 kbps\nLanguage : en 5.1\nSubtitle : en/es/fr\nExtra : stripped\n=========================================\n\nJim Jarmusch has been the cinema's deadpan poet of lives in transit, from his breakthrough feature Stranger Than Paradise (1984) to Broken Flowers (2005). Limits of Control pretty much consists of deadpan and transit as it follows--make that contemplates--the mission of an enigmatic hitman through some picturesque but sparsely populated corners of Spain. Whom this &quot;Lone Man&quot; (Isaach De BankolÃƒÂ©) is supposed to kill and why are matters not shared with the viewer. Neither is the content of the various minuscule messages Lone Man periodically receives, reads, then swallows. Presumably they cue the next stage of his itinerary, which includes encounters with John Hurt as a guitar-toting philosophe who disdains the word &quot;bohemian,&quot; Tilda Swinton as a platinum-blonde-wigged femme fatale emulating Rita Hayworth in The Lady from Shanghai (and reminding us that that glorious movie made no sense either), and Pas de la Huerta as a young woman called, with incontrovertible aptness, &quot;Nude.&quot; Throughout, De BankolÃƒÂ©'s magnificent carven-ebony features register little, not even exasperation that every conversation begins with someone saying to Lone Man, &quot;You don't speak Spanish, do you?&quot;--in Spanish.\n\nMost of the little that's said in Limits of Control is stuff like &quot;Everything is subjective ... Reality is arbitrary ... Life is a handful of dust&quot; (though that gets translated as &quot;Life is a handful of dirt&quot;). You've gathered by now that no way is this a thriller, although it teases against the outline of one. Its hipster self-consciousness includes name-dropping (Eliot, Rimbaud, Hitchcock; the title is from William Burroughs), homage (Citizen Kane, Contempt, De Chirico), and quite a bit of cutting from paintings to actual scenes that resemble them, and vice versa. It's all impeccably shot by Christopher Doyle, who knows just how to light De BankolÃƒÂ© and his dark monochrome outfits against dark monochrome backgrounds, and make us glad he does. Otherwise, Limits of Control pales in comparison to Jarmusch's other film centered on a taciturn black assassin, Ghost Dog: The Way of the Samurai (1999), with Forest Whitaker. There the minimalist narrative took on an aura of ritual, devotion, and genuine mystery. The rituals being observed in Limits of Control feel empty and played out.","torrent":{"xt":"urn:btih:6fa4bac6e907d0e7f3059732454a80c2a2651218","amp;dn":"The+Limits+of+Control+2009+LIMITED+DVDR-MPTDVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fa4bac6e907d0e7f3059732454a80c2a2651218","infoHashBuffer":{"type":"Buffer","data":[111,164,186,198,233,7,208,231,243,5,151,50,69,74,128,194,162,101,18,24]},"announce":[],"urlList":[]}}