{"title":"Twisted Sister - You Can't Stop Rock &amp; Roll","uid":5141444,"size":178757636,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:702e45531e45dcc8e3002af4e636cd5bd873d320&amp;dn=Twisted+Sister+-+You+Can%5C%27t+Stop+Rock+%26+Roll&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1256963423,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nYou Can't Stop Rock 'n' Roll is Twisted Sister's second full-length album, released on June 27, 1983.\n\nIn June 1982, the group released its first EP, Ruff Cuts, on the Secret Records label. This was followed shortly by their first studio album, Under the Blade, produced by Pete Way of UFO. Despite rather low production quality, the album was an underground hit in the UK, providing the band with sufficient name recognition to open for such metal acts as MotÃƒÂ¶rhead. The album had an overall raw metal sound and included &quot;Tear It Loose&quot;, a very fast speed metal song featuring a guitar solo by &quot;Fast&quot; Eddie Clarke of MotÃƒÂ¶rhead. Another single, the future hit &quot;We're Not Gonna Take It&quot;, was planned for release, but Secret Records went out of business before Snider was able to complete the lyrics. &quot;We're Not Gonna Take It&quot; later became one of its top singles.\n\nSomewhere around this time, Twisted Sister updated its feminized image with a more grotesque look that distinguished them from other glam metal bands of the era. The group was now regarded more as a weird-looking heavy metal band because its look and music, although still reminiscent of pop/glam styles, were growing closer to heavy metal's leather and chains image.\n\nAfter an appearance on the music TV program The Tube, Atlantic Records approached the band and signed them. Atlantic was one of the labels that had turned Twisted Sister down in the Club Days period. Their first LP under Atlantic, You Can't Stop Rock 'n' Roll, produced by Stuart Epps, was released in 1983 and included the UK #19 hit &quot;I Am (I'm Me)&quot;. From a production standpoint, the album sounded better than its predecessor, and it was every bit as heavy. Upon the success of the album the company decided to promote the band more heavily. A music video was made for the title track of You Can't Stop Rock'n'Roll, which was to become the first of a series of comedic videos that popularized the band.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:702e45531e45dcc8e3002af4e636cd5bd873d320","amp;dn":"Twisted+Sister+-+You+Can%5C%27t+Stop+Rock+%26+Roll","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"702e45531e45dcc8e3002af4e636cd5bd873d320","infoHashBuffer":{"type":"Buffer","data":[112,46,69,83,30,69,220,200,227,0,42,244,230,54,205,91,216,115,211,32]},"announce":[],"urlList":[]}}