{"title":"Fifa 10 [PAL][Wii][Robin-M]","uid":5196227,"size":4700240067,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:713ee364f1510713e8825d09334b47417e47ab93&amp;dn=Fifa+10+%5BPAL%5D%5BWii%5D%5BRobin-M%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Robin__Meng","files":-1,"time":1259938526,"description":"Naam: Fifa 10\nGrootte: 3.61 GiB\nRegio: PAL\nUploader: Robin__Meng\n\nDeze game heb ik op mijn eigen Wii getest en het werkt daarop perfect!\n\n\n\nTrouw lijkt in de voetbalwereld niet meer te bestaan. Elke speler of trainer ruilt tegenwoordig zijn 'oude vertrouwde' club heel gemakkelijk in voor een beter betaalde baan. Gelukkig weet Electronic Arts wel wat 'trouw' betekent en brengt de ontwikkelaar nog altijd elk voetbalseizoen een nieuwe editie van FIFA uit. Zo ook voor het seizoen 2009-2010. FIFA 10 kent, net zoals zijn voorgangers, weer talloze tweaks die het spelgenot en het realisme een flinke boost geven. De belangrijkste features zijn als volgt:\n\n    * De KNVB en EA hebben eindelijk een overeenstemming bereikt. Met als resultaat dat de volledige selectie van het Nederlands elftal na acht jaar afwezigheid eindelijk weer onderdeel uitmaakt van FIFA 10.\n    * Verbeterd dribbel- en botssysteem, waardoor de speler eenvoudiger over het voetbalveld manoeuvreert. Bovendien maakt dit de directe confrontaties met een tegenstander minder voorspelbaar.\n    * De reactiesnelheid van de voetballers is uitgebreid met circa vijftig bewegingen, waardoor ze o.a. nog beter positie kiezen, zich meer concentreren op de bal en bij elke actie hun snelheid aanpassen.\n    * De speler is in staat de bal op eenvoudige wijze te stoppen. Ook kan hij een bal preciezer afgeven, waardoor de ontvanger meer tijd heeft om bijvoorbeeld de verdediging te ontlopen.\n    * Een verdedigende speler haalt voortaan alles uit de kast. Hij gebruikt slidings om voorzetten te blokkeren en deinst er zelfs niet voor terug om met een omhaal uit te verdedigen.\n    * De AI van de keeper is onder handen genomen. Hij loopt voortaan sneller en dynamischer uit. Hij kiest bovendien beter positie en wacht het juiste moment af. Ook kent hij enkele nieuwe acties.\n\n","torrent":{"xt":"urn:btih:713ee364f1510713e8825d09334b47417e47ab93","amp;dn":"Fifa+10+%5BPAL%5D%5BWii%5D%5BRobin-M%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"713ee364f1510713e8825d09334b47417e47ab93","infoHashBuffer":{"type":"Buffer","data":[113,62,227,100,241,81,7,19,232,130,93,9,51,75,71,65,126,71,171,147]},"announce":[],"urlList":[]}}