{"title":"The Swell Season - Strict Joy (2009) [Lossless/FLAC] w/ Bonus Di","uid":5188495,"size":691564615,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:717507888b9e411c79bf8995eb819e0160ed5bf0&amp;dn=The+Swell+Season+-+Strict+Joy+%282009%29+%5BLossless%2FFLAC%5D+w%2F+Bonus+Di&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cenkota","files":31,"time":1259577111,"description":"Email me if you are looking for an album in Lossless/FLAC (even obscure ones). I'd be willing to send you a link to it if you would share the album on publicbt/thepiratebay after you finish downloading it. My email: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;fa999f948e8895939e89cbba9d979b9396d4999597&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;381515151515151515151515151515151515151515151515151515151515151515151515151515151515151515151515151515151515151515151515151515151515&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;-------\n\n\nLossless/FLAC\nIncludes: Log/Cue\n\nalbum info\nDisc 1\n\n1. Low Rising\n2. Feeling the Pull\n3. In These Arms\n4. The Rain\n5. Fantasy Man\n6. Paper Cup\n7. High Horses\n8. The Verb\n9. I Have Loved You Wrong\n10. Love That Conquers\n11. Two Tongues\n12. Back Broke\n\n\nDisc 2 (Live)\n\n1. All The Way Down\n2. Lies\n3. This Low\n4. Drown Out\n5. When Your Mind's Made Up\n6. I Have Loved You Wrong\n7. Falling Slowly\n8. Leave\n9. What Happens When The Heart Just Stops\n10. Lay Me Down\n11. Once\n12. If You Want Me\n13. Broken Hearted Hoover Fixer Sucker Guy\n14. Fitzcarraldo\n\nAfter the relative success of the indie film &quot;Once&quot;, and the Oscar award winning\nsuccess of the ballad from the film, &quot;Falling Slowly&quot;, this dynamic duo\nconsisting of Glen Hansard of the Frames and Czech singer/songwriter Mark?a\nIrglov?were riding high on the wings of exposure. The on-screen chemistry in\nthe film also was completely relevant in their musical chemistry as well with\nthe release of their debut album, under the moniker The Swell Season.\n\nThe album was a realistic look and portrayal of the more personal relationship\nthe two shared. Glen Hansard, nearly twice the age of his counterpart, had even\nonce said &quot;I had been falling in love with her for a long time, but I kept\ntelling myself she's just a kid&quot;. The love affair coupled with the undeniable\ntalents of both musicians and their incredible songwriting skills made for one\nof the best releases of the year. Glen Hansard's brash, fragile, and convincing\nIrish voice and simplistic, softly strummed guitar work coupled with Irglova's\ninnocent, angelic, restrained voice and beautiful piano skills made for an\nendearing and incredible listening experience.\n\nNow, three years later, Hansard and Irglova are no longer romantically involved,\nbut return with another different outlook on their personal relationship with\ntheir latest album, entitled &quot;Strict Joy&quot;. The familiar gloom and despair\nreturns, but with a slight hint of optimism sparsely spread throughout. In fact,\nthe album starts in a somewhat upbeat tone with the track &quot;Low Rising&quot;. It's a\njazzy number played at a slow tempo, complete with horns and a fairly\ninteresting bassline and bluesy guitar riffs not entirely unlike something you'd\nhear for Glen Hansard's other project, The Frames. Despite the outward\nappearance of an uplifting track, the lyrics are still obviously representative\nof Hansard's inner turmoil with lyrics like &quot;I want to sit you back and talk, I\nwant to pull back the veils and find out what I've done wrong&quot;.\n\nThe general uplifting feel continues with the second track &quot;Feeling the Pull&quot;, a\nshort piano driven track with harmonica and Hansard's voice convincingly\nswooning over top. It's not until the third track &quot;In These Arms&quot; that the duo\nbegan to settle into their own niche, and familiar territory. Slow,\nsoftly-strummed guitar chords and Hansard's delicate voice carry the verse, and\nthen Irglova's gentle spurts of cascading piano notes and soft vocals\ncomplementing him in the chorus singing &quot;Maybe I was born to hold you in these\narms&quot;. It's a beautiful track, and one of the highlights of the album.\n\nThe album maintains that general feel throughout. &quot;The Rain&quot; displays Hansard's\ngenuine songwriting ability in it's finest form. &quot;Fantasy Man&quot; is a primarily\nacoustic number and the first track on the album that gives Marketa Irglova\nprimary vocal duties. &quot;High Horses&quot; is a genuinely haunting and atmospheric\ntrack and a welcome departure from their general formula. The same heartache and\ndespair is relevant, but the song features some incredible vocal passages, then\na slow building instrument buildup towards the end that almost explodes into a\nhuge wall of sound and before anti-climatically fading into softness once more\nas it ends. &quot;I Have Loved You Wrong&quot; is another highlight. A slow, brooding bass\nline complements another primarily Irglova sung track that carries on hushed and\nentrancing, until Hansard finally lends his vocal duties in the beautiful climax\nwhere both singers repeat the line &quot;Every now and then on my mind&quot; as the music\ncuts out and their intertwining vocals are all that's left, making for one of\nthe more emotional and heartfelt moments of the album.\n\n&quot;Two Tongues&quot; is easily one of the more emotionally fragile and heartbreaking\nsongs of the album and once again the pair's vocals build to a chorus where you\ncan almost feel bitterness between the two as they deliver their lines. And\n&quot;Back Broke&quot; closes the album with another hushed acoustic ballad that ends the\nalbum on another note of melancholy, fragile despair.\n\nOverall, the album is extremely strong and entrancing. The way their vocals and\nguitar and piano parts interweave with one another perfectly make it truly\npleasant on the ears, and the backdrop of swelling strings and choir vocals\nspread throughout provide atmosphere and an entrancing effect that pulls you in\nand won't release it's grasp until the very end. This album is meant for dreary\ndays, but it's easy to find comfort in two people who display heartache so\nconvincingly and with such beauty.","torrent":{"xt":"urn:btih:717507888b9e411c79bf8995eb819e0160ed5bf0","amp;dn":"The+Swell+Season+-+Strict+Joy+%282009%29+%5BLossless%2FFLAC%5D+w%2F+Bonus+Di","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"717507888b9e411c79bf8995eb819e0160ed5bf0","infoHashBuffer":{"type":"Buffer","data":[113,117,7,136,139,158,65,28,121,191,137,149,235,129,158,1,96,237,91,240]},"announce":[],"urlList":[]}}