{"title":"WinRAR v4.01 Final (x86-x64) - it","uid":6444996,"size":3449040,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:71c8b70c89827ff7bf57add7861907aa229deb69&amp;dn=WinRAR+v4.01+Final+%28x86-x64%29+-+it&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":-1,"time":1307106041,"description":"NovitÃƒÂ  di WinRAR \nVersione 4.01 \n\nAggiunto il supporto per la dimensione dei file memorizzata in formato binario in un archivio TAR.\nAlcuni archivi TAR utilizzano, per file piÃƒÂ¹ grandi di 8 GB, il formato binario per salvare la dimensione di un file, invece del solito formato ottale. \nProblemi risolti: \nIl comando &quot;Ripara&quot; falliva la ricostruzione corretta di un archivio RAR danneggiato che conteneva anche solo un file la cui dimensione compressa superava i 4 GB.\nQuesto problema non incideva sulla riparazione basata sulle informazioni di recupero. Il problema accadeva solo se non venivano trovate le informazioni di recupero e WinRAR eseguiva una ricostruzione della struttura dell'archivio danneggiato. \nAnche se l'opzione &quot;Non estrarre i percorsi&quot;, nella sezione &quot;Avanzate&quot; del pannello d'estrazione, veniva selezionata, WinRAR scompattava comunque i file con il relativo percorso se veniva invocato dal menu contestuale di &quot;Esplora risorse&quot;. \nDopo aver inserito una Parola chiave errata per un file ZIP criptato, qualche volta WinRAR ignorava i tentativi seguenti d'inserire una Parola chiave corretta. \nL'operazione attivata con l'&quot;Assistente&quot; non permetteva di creare un archivio auto-estraente e multi-volume quando si comprimeva un singolo file o cartella senza estensione. \nL'operazione &quot;Importa la configurazione da un file&quot; non ripristinava, per un profilo di compressione di WinRAR, un commento multi-linea. \nDurante la conversione di archivi RAR multi-volume con il formato del nome del tipo nome1.nome2.part#.rar, l'operazione di &quot;Converti archivio&quot; rimuoveva erroneamente la parte &quot;.nome2&quot;. \nRAR poteva andare in errore quando creava un archivio con l'opzione -agNNN se NNN assumeva un valore uguale o superiore a 110. \nWinRAR non visualizzava correttamente i nomi dei file in formato non-Inglese per archivi in formato 7-Zip se non utilizzavano un code-page predefinitio. Era solo un problema di visualizzazione: i file venivano scompattati regolarmente. \n","torrent":{"xt":"urn:btih:71c8b70c89827ff7bf57add7861907aa229deb69","amp;dn":"WinRAR+v4.01+Final+%28x86-x64%29+-+it","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71c8b70c89827ff7bf57add7861907aa229deb69","infoHashBuffer":{"type":"Buffer","data":[113,200,183,12,137,130,127,247,191,87,173,215,134,25,7,170,34,157,235,105]},"announce":[],"urlList":[]}}