{"title":"Nadia Ali - Love Story","uid":5152695,"size":149344260,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:72437e91a649310dc0e2b18cb26536392df7f280&amp;dn=Nadia+Ali+-+Love+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1257652218,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nNadia Ali (born August 3, 1980 in Libya) is an American singer and songwriter of Pakistani descent, the former front-woman and songwriter of the band iiO, whose breakthrough 2001 hit Rapture reached #2 on the UK Singles chart and topped dance charts all over the world.\n\nBusy touring, Nadia did not release anything until 2008 with &quot;Crash And Burn&quot;, which was released on June 17, 2008 to iTunes. The song was produced by Fritzy, and the EP included remixes by Dean Coleman, DJ Shah, Sultan &amp; Ned Shepard, Astro &amp; Glyde, Justin Thomas, Kered &amp; Kiraly and Dilamani &amp; Rassek. &quot;Crash and Burn&quot;, has become a club smash, reaching the top 10 on Billboard's Hot Dance Club Play Chart.\n\nNadia's MySpace page features the album version of &quot;Is It Love?&quot; from iiO's debut album; &quot;Something To Lose&quot;, &quot;Give It Up&quot; &amp; &quot;Kiss You&quot; remixed by Lance Jordan, which were first recorded with iiO; the album version of &quot;Who Is Watching&quot;; and &quot;The One&quot; remixed by Fritzy. On her official website, she also samples &quot;At The End&quot;, mixed by Lance Jordan.\n\nOn February 10, 2009, Nadia released her follow-up single to Crash and Burn, called &quot;Love Story&quot; exclusively on BeatPort. It was subsequently released on iTunes the following month. Produced by Sultan and Ned Shepard, the single includes a number of remixes, by Andy Moor, Sultan and Ned Shepard and The Starkillers. Nadia has also released her first music video since iiO's At The End in 2002, and has been a hit onThe video, directed by Phil Di Fiore, features Nadia in a number of outfits and rooms, with backup dancers behind her. The single proved to be a club success, reaching number one on Billboard's Hot Dance Club Play Chart in April 2009.\n\nOn March 23, BeatPort released &quot;Love Story (Part 2)&quot; exclusively. This set features remixes from Fritzy &amp; Stylz, the Scumfrog, Dresden &amp; Johnston and Victor Franco. The EP also became available on iTunes, but is titled as &quot;Love Story (Les Remixes Noirs).\n\nNadia was featured on MTV Iggy in March, where she recorded 3 live acoustic videos performing &quot;Rapture&quot;, &quot;Crash and Burn&quot; and &quot;Love Story&quot;. They were posted on the website on March 30, 2009.\n\nHer next single to follow was called &quot;Fine Print&quot;, released July 1, 2009 on Beatport, then on August 1 on other digital retailers, with remixes from tyDi, Serge Devant, Alex Sayz and Carl Tricks. Nadia announced that the single preceded her album, &quot;Embers&quot;, along with a release date of September 15 on all digital retailers.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:72437e91a649310dc0e2b18cb26536392df7f280","amp;dn":"Nadia+Ali+-+Love+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72437e91a649310dc0e2b18cb26536392df7f280","infoHashBuffer":{"type":"Buffer","data":[114,67,126,145,166,73,49,13,192,226,177,140,178,101,54,57,45,247,242,128]},"announce":[],"urlList":[]}}