{"title":"HerbjÃƒÂ¸rg Wassmo - Dina - 1, 2 og 3 Norsk","uid":5105325,"size":3627478615,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:739a49b4e75ca3aba247177453626f7b2fba8052&amp;dn=Herbj%C3%83%C2%B8rg+Wassmo+-+Dina+-+1%2C+2+og+3+Norsk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"schneide240","files":733,"time":1254325426,"description":"1 Dinas Bok \n\nOmtale\nEn grusom hendelse tidlig i livet fÃƒÂ¸lger Dina gjennom livet, og former hennes sinn. Hun blir et merkverdig, frodig, men ogsÃƒÂ¥ farlig og utsatt menneske som fÃƒÂ¥r stor makt over dem som omgir henne. Men sterkest styres hun av Det Gamle Testamentets lover og regler. En sterk og frodig kvinne stÃƒÂ¥r frem i et nordnorsk landskap og miljÃƒÂ¸ fra det forrige ÃƒÂ¥rhundre.\n\nFra bokomslaget\nDette er fÃƒÂ¸rste lydbok i serien om Dina. Denne sterke og merkverdige kvinneskikkelsen stÃƒÂ¥r levende fram i nordnorsk landskap og miljÃƒÂ¸ pÃƒÂ¥ 1800-tallet. Dinas bok er en roman om svik og skyld, om sorg og lidelse og en umettelig sanselig livsutfoldelse, som fÃƒÂ¥r en overraskende utgang. En fryktelig hendelse i Dinas tidlige barndom forfÃƒÂ¸lger henne hele livet og former hennes sinn. Hun blir et merkverdig og pÃƒÂ¥ mange mÃƒÂ¥ter ogsÃƒÂ¥ farlig og utsatt menneske, som fÃƒÂ¥r stor makt over skjebnen til de som omgir henne. Men sterkest styres hennes egen skjebne av Det gamle testamentes kompromisslÃƒÂ¸se og ubarmhjertige lover.\n\n\n2 Lykkens SÃƒÂ¸nn \n\nOmtale\nEn elleve ÃƒÂ¥r gammel gutt blir vitne til et drap. Moren dreper sin russiske kjÃƒÂ¦reste. Sannheten om hvorfor lyngen rundt mannen ble farget rÃƒÂ¸dt, kan ikke gutten fortelle til noen. Men de ubesvarte spÃƒÂ¸rsmÃƒÂ¥lene blir mange. Har et vitne skyld? Er det lÃƒÂ¸gn nÃƒÂ¥r sannheten forties? Har moren rett til ÃƒÂ¥ ofre hvem hun vil? Gutten er Benjamin, sÃƒÂ¸nn til Dina pÃƒÂ¥ Reinsnes. Romanens handling fÃƒÂ¸lger hans utvikling fra gutt til mann. Selv om Dina i stÃƒÂ¸rstedelen av boken er fravÃƒÂ¦rende, er hun hele tiden sterkt til stede i Benjamins liv. Det er siste halvdel av 1800-tallet, og handlingen utspilles pÃƒÂ¥ Reinsnes, i TromsÃƒÂ¸ og i KÃƒÂ¸benhavn.\n\nFra bokomslaget\nDette er andre lydbok i serien om Dina. Gutten er Benjamin, sÃƒÂ¸nn til Dina pÃƒÂ¥ Reinsnes. Romanens handling fÃƒÂ¸lger hans utvikling fra gutt til mann. Selv om Dina i stÃƒÂ¸rste del av boken er fravÃƒÂ¦rende, er hun hele tiden sterkt til stede i Benjamins liv. En elleve ÃƒÂ¥r gammel gutt blir vitne til et mord: Moren dreper sin russiske kjÃƒÂ¦reste. Sannheten om hvorfor lyngen rundt mannen blir farget rÃƒÂ¸d kan ikke gutten fortelle til noen. Men de ubesvarte spÃƒÂ¸rsmÃƒÂ¥lene blir mange. Har et vitne skyld? Er det lÃƒÂ¸gn nÃƒÂ¥r sannheten forties? Har moren rett til ÃƒÂ¥ ofre hvem hun vil?\n\n\n3 Karnas Arv\n\nOmtale\nBenjamin er ferdig utdannet doktor, og bringer sin datter Karna med seg fra KÃƒÂ¸benhavn og hjem til Reinsnes. Karna har epilepsi, og synger og bruker Bibelen til ÃƒÂ¥ kurere seg selv. I 1878 vender Dina hjem fra Berlin og blir grunder pÃƒÂ¥ Strandstedet, et nordnorsk samfunn i sterk vekst, samtidig som Anders sliter og vil berge Reinsnes mot den nye tida. En roman om svik, sjalusi, kjÃƒÂ¦rlighet, musikkens betydning og ÃƒÂ¥ holde ut sine valg.\n\nFra bokomslaget\nKarna er den lille morlÃƒÂ¸se datteren til Benjamin, Dinas sÃƒÂ¸nn. Karna har &quot;fallesyken&quot;, sÃƒÂ¥ folk holder avstand. Hun synger og bruker bibelen til ÃƒÂ¥ kurere seg selv for denne &quot;gaven&quot;. Seksten ÃƒÂ¥r gammel fÃƒÂ¥r hun en arv hun ikke kan bÃƒÂ¦re alene. Dina vender hjem fra Berlin etter mange ÃƒÂ¥rs fravÃƒÂ¦r og blir grÃƒÂ¼nder pÃƒÂ¥ Strandstedet, et nordnorsk samfunn i stor forandring i 1870- og 80-ÃƒÂ¥rene. Dette er tredje lydbok i trilogien om Dina, med romanene &quot;Dinas bok&quot;, &quot;Lykkens sÃƒÂ¸nn&quot; og &quot;Karnas arv&quot;.","torrent":{"xt":"urn:btih:739a49b4e75ca3aba247177453626f7b2fba8052","amp;dn":"Herbj%C3%83%C2%B8rg+Wassmo+-+Dina+-+1%2C+2+og+3+Norsk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"739a49b4e75ca3aba247177453626f7b2fba8052","infoHashBuffer":{"type":"Buffer","data":[115,154,73,180,231,92,163,171,162,71,23,116,83,98,111,123,47,186,128,82]},"announce":[],"urlList":[]}}