{"title":"Rob Thomas - Someday  (2nafish)","uid":5186449,"size":156246020,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7570e4eefa6033657c4f0c7233646541b291bee3&amp;dn=Rob+Thomas+-+Someday++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259494356,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nSomeday is a song released from Rob Thomas' sophomore album, Cradlesong.\n\nIt was released as the album's third single in September 2009 only in digital format. The impact on the pop radio stations will be in December 1.\n\nIt debuted at #93 on the Billboard Hot 100, move to #89 on it'second week and has since reached #82.\n\nThe music video was released on 15 September 2009 and is directed by Alan Ferguson. 'Someday' music video captures Rob Thomas wandering through a parade in downtown New York City. The coolest part was just filming the parade,&quot; Rob told Entertainment Weekly about the shooting process. &quot;We had a lot of fans come down, and we dressed them all up and had a bunch of gigantic floats flying around.&quot;\n\nThe video received heavy rotation on the VH1, where it's video had 118 executions, so far.\n\nCradlesong is the sophomore solo album from Rob Thomas: lead singer of Matchbox Twenty. The first single &quot;Her Diamonds&quot; is already a big hit in Australia, peaking at #3. Cradlesong made its debut on the US charts at number 3 selling 122,000 copies.\n\nOn March 2, 2009, Clark Collis of Entertainment Weekly interviewed Thomas, where he confirmed he has since shelved his initial efforts to evoke &quot;The Rhythm of the Saints&quot;, and claimed the album is scheduled for a June 30 release. Having played half the forthcoming album to Entertainment Weekly, it was reported that many of the lyrics on &quot;Cradle Song&quot; center around troubled relationships, and three more song titles were revealed: &quot;Meltdown&quot; (described as &quot;INXS-esque power pop&quot; that stood out as &quot;a possible first single&quot;), &quot;Fire on the Mountain&quot; (an &quot;epic, tribal drum-driven&quot; track inspired by Dave Eggers' book &quot;What Is the What: The Autobiography of Valentino Achak Deng&quot;) and the melancholic country-leaning &quot;Getting Late&quot; (suggested as the &quot;set's likely closer&quot; and what Thomas described as &quot;a little ditty about death.&quot; in the vein of Tom Petty and Willie Nelson.) The proper magazine article added that &quot;Someday&quot; is a power ballad with a tinkling piano introduction reminiscent of 80's band Damn Yankees.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7570e4eefa6033657c4f0c7233646541b291bee3","amp;dn":"Rob+Thomas+-+Someday++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7570e4eefa6033657c4f0c7233646541b291bee3","infoHashBuffer":{"type":"Buffer","data":[117,112,228,238,250,96,51,101,124,79,12,114,51,100,101,65,178,145,190,227]},"announce":[],"urlList":[]}}