{"title":"New Zealand Mix 02 for Movers May2007 (remastered)","uid":6441175,"size":132183649,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:75db3d158b3a04f6825c7807bea1f6338bb194d3&amp;dn=New+Zealand+Mix+02+for+Movers+May2007+%28remastered%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"nz_flyboy","files":17,"time":1306986975,"description":"Part 2 of compilation of New Zealand music I made in 2007 (there was so much great stuff I coudn't fit it onto one disc.  This has a more bump n grind, hip hop, dance flavour.  This will burn onto a CD if you allow overburning (and remove 2 second track gaps)- ie it is around 81 minutes long.\n\nFeatures tracks from:  Rhombus, One Million Dollars, Shapeshifter, Che Fu, Del Ray System, Fat Freddys Drop, The Nomad, Recloose, and unplifing jazz from Nathan Haines.    Respect to all the artists featured, and remember- if you enjoy their music, please support them by buying their CDs or seeing them live .\n\nNOTE: This is a remastered version of a previously released torrent.\nRecently when creating another couple of NZ mixes from .wav files, it became clear that the audio quality was better than mixes created from .mp3s.  Hence I then remastered the 'lovers' and 'movers' 2007 NZ mixes from original .wavs (and made a few other minor edits)- resulting in them sounding clearer than the earlier .mp3 sourced ones.\nFurthermore- since the earlier torrent mixes were hosted by The Pirate Bay, whos trackers have subsequently been shut down- this remastered version has been released using a variety of other trackers and with DHT enabled.\n\nTo date- this mix is part of a set of 5 NZ mixes.  They are:\nNZ Mix 01 for Lovers May07 (remastered)\nNZ Mix 02 for Movers May07 (remastered)\nNZ Mix Dec05 (more popular less funk, the only mix here not sourced from .wav)\nNZ Mix Dec09 CD1of2 for K' (newer roots funk soul mix made for a friend)\nNZ Mix Dec09 CD2of2 Xmas (no xmas music- just made at that time)\n\nWatch out for more compilations in the near future.  Enjoy!","torrent":{"xt":"urn:btih:75db3d158b3a04f6825c7807bea1f6338bb194d3","amp;dn":"New+Zealand+Mix+02+for+Movers+May2007+%28remastered%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75db3d158b3a04f6825c7807bea1f6338bb194d3","infoHashBuffer":{"type":"Buffer","data":[117,219,61,21,139,58,4,246,130,92,120,7,190,161,246,51,139,177,148,211]},"announce":[],"urlList":[]}}