{"title":"Moses [PAL-DVDR Nordic][Verifire]","uid":5161071,"size":4681768041,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7630dc7e1577963de860fc08f433d19edf57bf8d&amp;dn=Moses+%5BPAL-DVDR+Nordic%5D%5BVerifire%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"verifire","files":-1,"time":1258148008,"description":"Hi there...\n\nI also decided to upload this story of Moses, from the &quot;Bible Collection&quot; -series. Subtitles are Swedish, Danish, Norwegian and Finnish.\nThere are some gems in that series, but there are some rhinestones as well. I won't mention which ones I'm thinking of, but some of them made me physically ill. Seriously.\n\nThis, however, did not, even though it doesn't rank as the best of the movies, it's absolutely watchable. It's made into a DVD-ISO, which means you can just (double?) -click on the finished file, and it'll mount and burn onto a blank DVDR in any program you've got assigned for this on your computer. Which in turn makes it easier to watch it in the living-room with your family, or in an auditorium or church + you can just leave the file there, seeding, for others.. :-) I now give the word to a person I found on Amazon.com, namely:\n\nAlejandra Vernon &quot;artist &amp; illustrator&quot;\n\n&quot;Though this television production doesn't have the epic grandeur of &quot;The Ten Commandments&quot; [Praise be to God for that.. V.], it is a marvelous telling of the story of Moses, with some superb acting; there are a few liberties taken to flesh out the script, but the heart of the Biblical account is intact, with a memorable portrayal by Ben Kingsley as the prophet who was &quot;clumsy with words&quot; but led his people to freedom.\nOther terrific performances come from David Suchet as Aaron, Sonia Braga as Zipporah, and Philip Stone as Jethro, and as the &quot;bad guys&quot;, Frank Langella, who with his sonorous voice makes an effective Pharaoh, and Maurice Roeves as Zerack, the man who is a continual kvetch.\n\nFilmed in sub-saharan Quarzazate and Agadir, Morocco, it is visually beautiful, with the excellent cinematography by Raffaele Mertes; I like the neutral palette, and the artifacts and costuming that give it an authentic look of ancient times. Added to the atmosphere is the wonderful score by Marco Frisina.\nThe effects are good, from the parting of the sea to the tablets of the law, and other than a short sequence of violence (which includes a swift depiction of sacrificing an animal) after the golden calf incident, it is family friendly. [Well, those are the laws of life and death. How much more &quot;family friendly&quot; can a movie be, without turning into &quot;Sound of Music&quot;? V.] Total running time is 184 minutes.\nThis is a film that stands up to a lot of repeated viewing; it is so full of eternal truths, and content that is applicable to our lives today.&quot;\n\nAnd there you have it. If you want to borrow it..\n\nEnjoy! :-)\n\nLove from Verifire.\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;1c6a796e757a756e79717d75705c7b717d7570327f7371&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n&quot;Personally I've found the hope of deliverance and enlightenment through Yeshua Ha'Mashiach to be the greatest mystery and riddle, shrouded in the shadows of shame, but revealed to those who seek the Truth, no matter the cost.&quot;","torrent":{"xt":"urn:btih:7630dc7e1577963de860fc08f433d19edf57bf8d","amp;dn":"Moses+%5BPAL-DVDR+Nordic%5D%5BVerifire%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7630dc7e1577963de860fc08f433d19edf57bf8d","infoHashBuffer":{"type":"Buffer","data":[118,48,220,126,21,119,150,61,232,96,252,8,244,51,209,158,223,87,191,141]},"announce":[],"urlList":[]}}