{"title":"4.1 Wii Themes and Channels","uid":6404088,"size":255726903,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:765dd27a65a60886332b08fe0a41410ccd073487&amp;dn=4.1+Wii+Themes+and+Channels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"WiiNerd","files":1,"time":1305751574,"description":"Wii System Menu 4.1 Themes + some extra channels and apps.\n\n\n\nWii Themes:\n\nBakugan, Batman, Black Pirate 1 &amp; 2, Blackmage, call of duty, car theme,\nchicago bears, code geass, dallas cowboys, dbz2, derek rose, deathklok,\ndisneys cars, dukes of hazzard, fntasy, fire wii, ghostbusters, jurassic park,\nlime, loonytoons, mad world, mad world 3, majorasmask, mario, mariojeb, matrix,\nmgs theme, muse, nightmareb4xmas, oldschool nintendo, orig 4.1 theme, outlaw,\npink wii, robot chicken, rockband, scarface, seinfeld, shadowtheme2, smash bros.,\nsnoopy, spongebob3, steel wii, terminator, the conduit, the simpsons3, tmnt, \ntoxic toons, white wii, yu-gi-oh, zelda 2 final\n\n\nWii Channels:\n\nDark Homebrew Channel, Facebook, Homebrew Browser, Multi-Mod Manage,\nMyMenuify, Priiloader SILENT Shortcut Channel, The Homer Channel, \nThe Pirate Channel, Hotmail, WiiEarth\n\nYou must have the internet channel for hotmail and facebook channels to work\n\n\nApps.:\n\nMMM, mymenuify, priiloader, Priiloader Shortcut (Silent Mod), \nhomebrew_browser, WiiEarth\n\n\nInstall thee priiloader before you try any themes it is posable to BANNER BRICK your Wii with a theme. If you do banner brick your Wii with themes and you have priiloader installed just hold the power down until the Wii shuts off then turn it back on and hold in reset until your Wii boots priiloader. Load the HBC Forwarder.dol and the Homebrew channel will load. Find and load the mymenuify app. and change to a working theme (orig. 4.1 theme.app) and your Wii will be UNBRICKED. This method for unbricking a Wii only works for a banner brick.\n\n\n\n","torrent":{"xt":"urn:btih:765dd27a65a60886332b08fe0a41410ccd073487","amp;dn":"4.1+Wii+Themes+and+Channels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"765dd27a65a60886332b08fe0a41410ccd073487","infoHashBuffer":{"type":"Buffer","data":[118,93,210,122,101,166,8,134,51,43,8,254,10,65,65,12,205,7,52,135]},"announce":[],"urlList":[]}}