{"title":"Hostel Part 2(2007)DVDRip.AC3(ENG)-DROCK","uid":6400910,"size":733523968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76976956386d3fe33830dc3b9113b9bf4623a86a&amp;dn=Hostel+Part+2%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1305660557,"description":"Three American students studying art in Rome are drawn into a grim world of torture and suffering in director Eli Roth's blackly comic sequel to the horror hit that shocked the world. Beth (Lauren German), Whitney (Bijou Phillips), and Lorna (Heather Matarazzo) have ventured outside of their stateside surroundings in order to get a more worldly appreciation of the arts. But sketching nudes all day can take its toll on even the most talented artist, and when class is over the three girls jump at the opportunity to experience Europe firsthand. As they set out on the train for an impromptu weekend trip, however, the coeds are surprised to cross paths with the beautiful model they had just been sketching. It appears that she, too, is preparing for a vacation that promises to be both relaxing and rejuvenating, and a generous invitation to join her at a remote hostel surrounded by soothing hot springs ultimately proves too tempting for the adventurous Americans to pass up. Unfortunately for the unsuspecting students, one person's idea of relaxing can be another's worst nightmare. Now on an unavoidable collision course with two American businessmen who long to get an edge on their competition by experiencing the thrill of the kill and a scythe-wielding woman who maintains her youthful visage using the Elizabeth Bathory method, these unsuspecting students are about to fall into a trap that remains one of the sadistic and wealthy elite's most well-guarded secrets. \n\nRipped with Autogk.\n\nLength: 1 Hour 35 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:76976956386d3fe33830dc3b9113b9bf4623a86a","amp;dn":"Hostel+Part+2%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76976956386d3fe33830dc3b9113b9bf4623a86a","infoHashBuffer":{"type":"Buffer","data":[118,151,105,86,56,109,63,227,56,48,220,59,145,19,185,191,70,35,168,106]},"announce":[],"urlList":[]}}