{"title":"War of the Worlds (2005) Jaguar-Rip [Bit-Byte]","uid":5016915,"size":842133295,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:769be898e9a92d84e90b87eb2a8c8462de6e98ff&amp;dn=War+of+the+Worlds+%282005%29+Jaguar-Rip+%5BBit-Byte%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"post_bezorger","files":7,"time":1248224101,"description":" &lt;a href=&quot;http://img150.imageshack.us/img150/5627/thewaroftheworlds2005cd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img150.imageshack.us/img150/5627/thewaroftheworlds2005cd.jpg&lt;/a&gt;\nGeneral\nComplete name                    : War of the War of the Worlds (2005) - Jaguar-Rip.mkv\nFormat                           : Matroska\nFile size                        : 802 MiB\nDuration                         : 1h 51mn\nOverall bit rate                 : 1 003 Kbps\nWriting application              : HandBrake 0.9.3\n\nVideo\nID                               : 1\nFormat                           : MPEG-4 Visual\nFormat profile                   : Simple@L3\nFormat settings, BVOP            : No\nFormat settings, QPel            : No\nFormat settings, GMC             : No warppoints\nFormat settings, Matrix          : Default (H.263)\nCodec ID                         : V_MPEG4/ISO/ASP\nCodec ID/Info                    : Advanced Simple Profile\nDuration                         : 1h 51mn\nBit rate                         : 855 Kbps\nWidth                            : 720 pixels\nHeight                           : 556 pixels\nDisplay aspect ratio             : 16/9\nFrame rate                       : 25.000 fps\nResolution                       : 24 bits\nColorimetry                      : 4:2:0\nScan type                        : Progressive\nBits/(Pixel*Frame)               : 0.085\nStream size                      : 683 MiB (85%)\nWriting library                  : XviD 1.1.2 (UTC 2006-11-01)\n\nAudio\nID                               : 2\nFormat                           : MPEG Audio\nFormat version                   : Version 1\nFormat profile                   : Layer 3\nCodec ID                         : A_MPEG/L3\nCodec ID/Hint                    : MP3\nDuration                         : 1h 51mn\nBit rate mode                    : Constant\nBit rate                         : 128 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 44.1 KHz\nResolution                       : 16 bits\nStream size                      : 102 MiB (13%)\nWriting library                  : LAME3.98\nLanguage                         : English\n\n\n\n\n\n\nRay Ferrier (Tom Cruise) is a divorced union container crane operator with few skills as a father. \nRay's ex-wife (Miranda Otto) drops off their rebelious but coming of age teenage son Robbie (Justin Chatwin), \nand meek 10-year old daughter Rachel (Dakota Fanning) for a weekend visit with their father in New Jersey. \n(Filmed in Bayonne in the shadow of the worlds longest arch bridge.) \nRay is a self-absorbed individual who feels imposed upon by having to baby sit his own children. \nThen something happens that will change their entire lives. An unusual and violent lightning storm hits the town. \nIn the intersection down the street, Ray sees a huge three-legged war machine rise from beneath the street. \nThe machine begins to fire and incinerate everything and everybody. \nThe Martians have begun the war by attacking Earth with only one goal in mind, \ndestroying everything in sight. Ray becomes a real father when he decides to protect his children and take them to their mother house. \nRay grabs his handgun and a few supplies and steals a minivan from his friends service station, begging the friend to come with them, \nbut leaving him behind when he doesn't understand the danger and refuses to get in. \nThe mother and her new husband have already left for Boston so the Ferriers hole up in their house. \nOvernight, the Martians show up around their and cause great destruction. \nA news van is outside and the reporter informs Ray the Machines are in all cities. \nThey decide to try to make it to Boston They start running for their lives and are just ahead of the Martians, \nwhen they get caught up in a frantic mob of people in upstate NY who are also fleeing the machines. \nThe mob tries to get in the car or take it away from them. In a Mexican standoff, \nRay relinquishes the car to an armed gunman in exchange for letting him get Rachel out of the car. \nRay drops his gun which is picked up by another mobmember who shoots the other gunman. \nThey manage to get on a ferry as several more machines rise in the distance and the ferry leaves before it's full. \nA machine rises from the river and overturns the ferry but the Ferriers swim to shore. \nRobbie follows an Army unit into battle against Ray's wishes but he cannot stop him. \nRay and Rachel are taken in by a sole man holed up in the basement of his rural house. \nMachines are all around and they send a camera tentical into the basement where they are holed up to look for humans which they avoid by moving and hiding. \nThen some Martians come in personally to investigate, but they're called back to the ship before they find the humans. \nRay and the homeowner dispute over how to handle the situation. The machines have increased in number and are everywhere, \nand they can not be destroyed by our military. \nThey make it to Boston and the Martians start dying from various sickness caused by germs that humans are built up immunity to, \nbut the Martians don't have. &lt;a href=&quot;\nhttp://img182.imageshack.us/img182/5209/thumbs20090722113230.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img182.imageshack.us/img182/5209/thumbs20090722113230.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:769be898e9a92d84e90b87eb2a8c8462de6e98ff","amp;dn":"War+of+the+Worlds+%282005%29+Jaguar-Rip+%5BBit-Byte%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"769be898e9a92d84e90b87eb2a8c8462de6e98ff","infoHashBuffer":{"type":"Buffer","data":[118,155,232,152,233,169,45,132,233,11,135,235,42,140,132,98,222,110,152,255]},"announce":[],"urlList":[]}}