{"title":"Chuck Missler - Daniel","uid":5183322,"size":2555877376,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7706f87d3667b6672f1aaab360261c40ed483598&amp;dn=Chuck+Missler+-+Daniel+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1259349275,"description":"The Book of Daniel contains the most amazing prophecies of the Bible, and is one of the most authenticated books of the Old Testament. The numerous detailed prophecies of the period of Gentile dominion make this one of the most important foundational studies for anyone who takes the Bible seriously.\n\nThis DVD set covers:\nDaniel 1; Dare to be a Daniel - Introduction to the Book. Background, authentication, etc\nDaniel 2; Nebuchadnezzar's Dream - The poly-metallic image; an overview of all the Gentile dominion on the Planet Earth. Daniel and his three friends avoid death penalty and get promoted\nDaniel 3; Bow or Burn - Nebuchadnezzar's ego trip; the worship of his image\nDaniel 4; Nebachadnezzar's lesson in pride - The only chapter in the Bible written by a Gentile king\nDaniel 5; The Fall of Babylon - The &quot;handwriting on the wall&quot; and the fall of Babylon to the Persians\nThe Mystery of Babylon - Babylon in Bible prophecy; it's ultimate destruction; an update on current events; the &quot;Mystery Babylon&quot; of Revelation\nDaniel 6; Daniel in the Lion's Den - How Daniel avoided the &quot;mark of the beast.&quot;\nDaniel 7; The Times of the Gentiles - The four empires which climax Gentile dominion on the Earth\nDaniel 8; The Ram and the Goat - The succession of the Persian and Greek Empires and the rise of Alexander the Great\nDaniel 9A; The 69 Weeks - The Angel Gabriel predicts the precise day on which Jesus presented Himself as the &quot;Meshiach Nagid&quot; (The Messiah the King)\nDaniel 9B; The 70th Week of Daniel - The mysterious interval between the 69th and 70th &quot;weeks&quot; of Daniel and the final seven years of world history\nDaniel 10; The Dark Side - The spooky glimpse of the spiritual warfare that lies behind world events\nDaniel 11; The Silent Years- The amazing prediction of the conflicts between the Ptolemaic and Seleucid Empires and the emergence of the final World Leader\nDaniel 12 - The Climax of All History\n &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/DVD20.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/DVD20.html&lt;/a&gt;\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\nMAYBE SLOW BUT SURE! PLEASE ASSIST IN BANDWIDTH!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Getting The Message Out, Openly!\n","torrent":{"xt":"urn:btih:7706f87d3667b6672f1aaab360261c40ed483598","amp;dn":"Chuck+Missler+-+Daniel+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7706f87d3667b6672f1aaab360261c40ed483598","infoHashBuffer":{"type":"Buffer","data":[119,6,248,125,54,103,182,103,47,26,170,179,96,38,28,64,237,72,53,152]},"announce":[],"urlList":[]}}