{"title":"Democracy Now - 03 jun 2011","uid":6446783,"size":449606841,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:770aee6b2b4fe6bd1ce4fcc2c6ea1cf48a2b9585&amp;dn=Democracy+Now+-+03+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1307294765,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 03, 2011\n\n- NATO Strikes Hit Tripoli\n- Clashes Continue in Yemeni Capital\n- 23 Civilians Reported Dead in Syria Gov't Attacks\n- Exiled Syrian Opposition Calls for Assad Departure\n- E. Coli Strain Could Be Deadliest; Bacterium Would Be Legal in U.S.\n- U.S. to Probe Hacking of Email Accounts\n- Pentagon: Cyber-Attacks Could Constitute Act of War\n- Panel: &quot;War on Drugs&quot; a Failure\n- Civil Rights Groups Challenge Georgia Anti-Immigrant Law\n- Ex-Black Panther, Political Prisoner Geronimo Pratt Dies at 63\n\n\nSpecial reports\n\n- Seymour Hersh: Despite Intelligence Rejecting Iran as Nuclear Threat, U.S. Could Be Headed for Iraq Redux\n\nIn his latest article for the New Yorker magazine, Pulitzer Prize-winning investigative journalist Seymour Hersh says the United States might attack Iran based on distorted estimates of Iran's nuclear and military threat - just like it did with Saddam Hussein's government in Iraq. Hersh reveals that despite using Iranian informants and cutting edge surveillance technology, U.S. officials have been unable to find decisive evidence that Iran has been moving enriched uranium to an underground weapon-making center.\n\n\n- Seymour Hersh on the Arab Spring, &quot;Disaster&quot; U.S. Wars in Afghanistan and Pakistan, and the Looming Crisis in Iraq\n  \nVeteran investigative reporter Seymour Hersh assesses the popular uprisings sweeping the Middle East and North Africa amidst ongoing U.S. wars in Afghanistan, Iraq and Pakistan. Despite touted gains and an upcoming U.S. military withdrawal deadline in Iraq, Hersh says: &quot;Whatever you're hearing, Iraq is going bad ... It's sectarian war, and the big question will be whether we pull out or not.&quot; On the uprisings, Hersh says Saudi Arabia-fearing an overthrow of the regional order-is driving the embattled regimes' attempts to crush the protests.\n\n\n- WikiLeaks Cables Reveal &quot;Secret History&quot; of U.S. Bullying in Haiti at Oil Companies' Behest\n\nThe Nation magazine, in partnership with the Haitian weekly newspaper, HaÃƒÂ¯ti LibertÃƒÂ©, has launched a series of reports based on more than 19,000 classified U.S. diplomatic cables released by WikiLeaks. Called &quot;The PetroCaribe Files,&quot; the series begins with an exposÃƒÂ© of how the United States-with pressure from Exxon and Chevron-tried to interfere with an oil agreement between Haiti and Venezuela that would save Haiti, the poorest country in the Western Hemisphere, $100 million per year. &quot;It is really amazing to see an ambassador pushing around a president, and all his officials telling them what to do, trying to tell them what Haiti's interests are. It is the epitome of arrogance,&quot; says the report's co-author, Kim Ives. We are also joined by veteran Haiti correspondent, Dan Coughlin.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:770aee6b2b4fe6bd1ce4fcc2c6ea1cf48a2b9585","amp;dn":"Democracy+Now+-+03+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"770aee6b2b4fe6bd1ce4fcc2c6ea1cf48a2b9585","infoHashBuffer":{"type":"Buffer","data":[119,10,238,107,43,79,230,189,28,228,252,194,198,234,28,244,138,43,149,133]},"announce":[],"urlList":[]}}