{"title":"Angels &amp; Demons (2009) [dvdrip] eng subs","uid":4989213,"size":738663051,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7815fe717f2792075c05971c84e7e8b3b52fac11&amp;dn=Angels+%26+Demons+%282009%29+%5Bdvdrip%5D+eng+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jmb2012","files":2,"time":1246943017,"description":"When a murder of a physicist, Leonardo Vetra, finds a symbolist, Robert Langdon, and Mr. Vetra's daughter, Vittoria, on an adventure for a secret brotherhood, The Illuminati. Clues lead them all around the Vatican, including the four alters of science, Earth, Air, Fire and Water. An Assassin, working for the Illuminati, has captured four cardinals, and murders each, painfully. Robert and Vittoria also are searching for a new very destructive weapon that could kill millions.  Written by XXDustfingerXX\n\nDespite his notorious relationship with the Church, Harvard symbologist Robert Langdon is once again called upon to decipher the clues to a catastrophic conspiracy. The Pope has died, and before conclave can begin to determine his successor, the four preferitti (primary hopefuls for the papacy) are kidnapped. An ominous threat of their hourly demise, along with the complete annihilation of Vatican City, is issued as an elaborate revenge scheme for a persecuted group known as the Illuminati. With their meager time limit steadily counting down, Langdon, accompanied by beautiful physicist Vittoria Vetra, must travel throughout Rome to unravel the carefully hidden signs that will lead them to a terrifying adversary, a harrowing discovery, and the shocking truth. Written by The Massie Twins\n\nThe Pope died and the conclave has been called for. Four candidates were chosen. However, before the voting, the 4 candidates are killed one by one. The killer leaves clues that seem to say that he/she is from the Illuminati. Strangely though, the Illuminati was long thought to be extinct. Who is the mastermind? Who revived the Illuminati? What do they want? Written by Ryanking\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0808151/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0808151/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7815fe717f2792075c05971c84e7e8b3b52fac11","amp;dn":"Angels+%26+Demons+%282009%29+%5Bdvdrip%5D+eng+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7815fe717f2792075c05971c84e7e8b3b52fac11","infoHashBuffer":{"type":"Buffer","data":[120,21,254,113,127,39,146,7,92,5,151,28,132,231,232,179,181,47,172,17]},"announce":[],"urlList":[]}}