{"title":"Independence Day(1996)DVDRip.AC3(ENG)-DROCK","uid":6409156,"size":733551141,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:79411fb59bd0e2575841603539b207847ecdd7c0&amp;dn=Independence+Day%281996%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1305915639,"description":"A group of intrepid humans attempts to save the Earth from vicious extraterrestrials in this extremely popular science-fiction adventure. Borrowing liberally from War of the Worlds, Aliens, and every sci-fi invasion film inbetween, director Roland Emmerich and producer and co-writer Dean Devlin present a visually slick, fast-paced adventure filled with expensive special effects and large-scale action sequences. The story begins with the approach of a series of massive spaceships, which many on Earth greet with open arms, looking forward to the first contact with alien life. Unfortunately, these extraterrestrials have not come in peace, and they unleash powerful weapons that destroy most of the world's major cities. Thrown into chaos, the survivors struggle to band together and put up a last-ditch resistance in order to save the human race. As this is a Hollywood film, this effort is led by a group of scrappy Americans, including a computer genius who had foreseen the alien's evil intent (Jeff Goldblum), a hot-shot jet pilot (Will Smith), and the President of the United States (Bill Pullman). While some critics objected to the film's lack of originality and lapses in logic, the combination of grand visual spectacle and crowd-pleasing storytelling proved irresistible to audiences, resulting in an international smash hit.\n\nRipped with Handbrake.\n\nLength: 2 Hours 33 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:79411fb59bd0e2575841603539b207847ecdd7c0","amp;dn":"Independence+Day%281996%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79411fb59bd0e2575841603539b207847ecdd7c0","infoHashBuffer":{"type":"Buffer","data":[121,65,31,181,155,208,226,87,88,65,96,53,57,178,7,132,126,205,215,192]},"announce":[],"urlList":[]}}