{"title":"Probot - Shake Your Blood   (2nafish)","uid":5179242,"size":112136196,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:794c96feeb772e5ba053b5dcc70b3c608256a75f&amp;dn=Probot+-+Shake+Your+Blood+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259107424,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nProbot was a heavy metal side project of ex-Nirvana drummer and Foo Fighters lead-singer Dave Grohl. An album was recorded out of the material and released in February 2004. It featured one single entitled &quot;Shake Your Blood.&quot;\n\nA single would be found in the track &quot;Shake Your Blood.&quot; Although Grohl recorded the guitar and drums himself, Lemmy performed his own bass and wrote the lyrics to &quot;Shake Your Blood.&quot; He noted, &quot;I wrote the lyrics in about ten minutes. . . It's rock &amp; roll, you know. It's not one of those complicated things.&quot; The song bears strong resemblance to Lemmy's style and was considered &quot;a terrific MotÃƒÂ¶rhead clone&quot; by Adrien Begrand of PopMatters.\n\nThe &quot;Shake Your Blood&quot; music video was filmed in November 2003 and released shortly thereafter. It features an appearance by 66 women from the SuicideGirls adult entertainment website. In the video, the band is represented with Dave Grohl on drums, Lemmy on lead vocals and bass, and Wino (who sang on the Probot track &quot;The Emerald Law&quot;) on lead guitar. Lemmy regarded the performance as &quot;just like a tour in the '60s, when things were a lot more fun.&quot; The video gained significant airplay upon its release on Headbangers Ball and is ranking #2 in the list of the best metal videos of the new millennium in a vote carried out by MTV2.\n\nThe song was featured in Chuck (TV series) season 2, episode 9 'Chuck Versus the Sensei'.\n\nThe Foo Fighters performed &quot;Shake Your Blood&quot; live with Lemmy at their 2006 Hyde Park (UK) show. &quot;My Tortured Soul&quot; was performed live on Headbangers' Ball in 2004, with Eric Wagner on lead vocals, Grohl on drums, Wino on lead guitar, Greg Anderson (of Goatsnake and Sunn O)))) on rhythm guitar, and Foo Fighters producer Nick Raskulinecz on bass guitar. This performance is available on the compilation album MTV2 Headbangers Ball, Vol. 2. Soulfly has also been known to play &quot;Red War&quot; live as recently as 2009. &quot;Ice Cold Man&quot; has also been played by Cathedral on their 2004 tour.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:794c96feeb772e5ba053b5dcc70b3c608256a75f","amp;dn":"Probot+-+Shake+Your+Blood+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"794c96feeb772e5ba053b5dcc70b3c608256a75f","infoHashBuffer":{"type":"Buffer","data":[121,76,150,254,235,119,46,91,160,83,181,220,199,11,60,96,130,86,167,95]},"announce":[],"urlList":[]}}