{"title":"(R&amp;B) Billy 'The Kid' Emerson - Red Hot (The Sun Years)","uid":6353247,"size":210234504,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7a8cabf29c4cac02fe5e8297dbe67a78f3001a94&amp;dn=%28R%26B%29+Billy+%5C%27The+Kid%5C%27+Emerson+-+Red+Hot+%28The+Sun+Years%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":-1,"time":1304068166,"description":"While pianist and singer Billy &quot;The Kid&quot; Emerson had a long career issuing classic singles for Sun, Vee-Jay, and Chess, most of which were rocked up R&amp;B and blues sides with decided gospel -- but definitely secular -- overtones, his real forte was as a songwriter, and he penned dozens of songs for artists like Junior Wells, Willie Mabon, Wynonie Harris, and Buddy Guy, and while he cut several great sides for his first label Sun Records in the early to mid-'50s, it was cover versions of those songs by the likes of Elvis Presley (who cut Emerson's &quot;When It Rains It Pours,&quot; for instance) that made Emerson such a valuable commodity at the label. One of his songs, &quot;Red Hot,&quot; the title song of this wonderful 33-track survey of Emerson's Sun years (which also includes his key Vee Jay and Chess singles as a plus), was an offhand rockabilly masterpiece, and was covered brilliantly by Billy Lee Riley at Sun and later by Bob Luman at Imperial. Emerson really wasn't a rockabilly singer, but through songs like &quot;Red Hot,&quot; he certainly left his mark on the genre. Bear Family Records has done their usual exhaustive restoration on this set, and the sound is fresh and bright, and one wonders why Emerson wasn't more of a front page star. A fiery piano player, a joyous singer, and a songwriter with the twin understanding of what made people want to dance and what made them want to cry, he certainly deserves to be better known. This set, which is a darn near perfect introduction to his work, might change that.\n\n\nmp3   320kbps\n\n","torrent":{"xt":"urn:btih:7a8cabf29c4cac02fe5e8297dbe67a78f3001a94","amp;dn":"%28R%26B%29+Billy+%5C%27The+Kid%5C%27+Emerson+-+Red+Hot+%28The+Sun+Years%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a8cabf29c4cac02fe5e8297dbe67a78f3001a94","infoHashBuffer":{"type":"Buffer","data":[122,140,171,242,156,76,172,2,254,94,130,151,219,230,122,120,243,0,26,148]},"announce":[],"urlList":[]}}