{"title":"Jorgen: the perfect human","uid":4993399,"size":104667136,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7cebeb76b37fdc87f7638aa420b9e2b579d7dd7b&amp;dn=Jorgen%3A+the+perfect+human&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1247159133,"description":"Like Life in Denmark, Good and Evil, and Notes on Love, sensible anthropological study is apparently on the programme, and in Leth's award-winning breakthrough it assumes an elegant, highly amusing form. Spanning a period of 22 years these films revolve skittishly around human nature, and apart from the more documentary Life in Denmark, each has actor Claus Nissen as Leth's artful alter ego. Nissen and Maiken Algren are in an empty white room with only the essential props for each scene. A bed, bedding, a table, chairs. &quot;We are going to see the perfect human being in action&quot;, we hear, and Leth's voice puts descriptive or puzzled words to the little actions the film exhibits: the man touches his face investigatively, fills a pipe, cuts his nails, and gets undressed, but he does peculiar things, too: he jumps as if he is weightless, snaps his fingers in strange ways, and dances with exaggerated movements and no music. &quot;Today, too, I had an experience that I hope I shall understand in a few days' time&quot;, he ponders. The whole film is staged with great clarity in its picture compositions with several characteristic zooms to indicate the bodily parts of the perfect human being, and emphasis on the light, boundless nothingness of the room. The soundtrack reveals tones of a clarinet touching on the stylistically consistent visuals. At its premiere at the Carlton cinema The Perfect Human was shown before Jean-Luc Godard's La Chinoise.  Written by Anonymous ","torrent":{"xt":"urn:btih:7cebeb76b37fdc87f7638aa420b9e2b579d7dd7b","amp;dn":"Jorgen%3A+the+perfect+human","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cebeb76b37fdc87f7638aa420b9e2b579d7dd7b","infoHashBuffer":{"type":"Buffer","data":[124,235,235,118,179,127,220,135,247,99,138,164,32,185,226,181,121,215,221,123]},"announce":[],"urlList":[]}}