{"title":"Simpsons 21 season &quot;Pranks and Greens&quot; RUS postscoring","uid":5186939,"size":281053746,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7db5174978bd72bd2045fe2d6bd6fc9e66718f46&amp;dn=Simpsons+21+season+%5C%22Pranks+and+Greens%5C%22+RUS+postscoring&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"longret","files":1,"time":1259511825,"description":"After Bart is apprehended for playing pranks on the teachers of Springfield Elementary, Principal Skinner reveals to Bart that he is not the greatest prankster to ever walk the halls of that school. Bart is shocked by this revelation and sets out to discover the identity of this prankster. After sifting through countless back issues of the school paper, he discovers that there is a two week gap in its publication dating back 10 years, and that there is a substantial change in Principal Skinner's demeanor and appearance before and after the gap. Groundskeeper Willie tells Bart that he was once the school swim instructor, and that Principal Skinner was once fun-loving and laid-back until an incident dubbed &quot;Night of the Wigglers.&quot; Here, a prankster locked Skinner in a pool full of earthworms for an entire weekend. This experience changed Skinner's personality for the worst. Willie then tells Bart that the prankster was named Andy Hamilton.\n\nMeanwhile, Marge is harshly criticized by other Springfield mothers for serving unhealthy snacks at their &quot;Midday Mommies&quot; meeting. She burns the family's junkfood, to Homer's horror. The family purchases organic food, which is very expensive and has a short shelf life (much to Homer's chagrin), at a local market. Unfortunately, Marge meets with more criticism when she uses non-stick bakeware and plastic drinking bottles. The other mothers storm away and Marge realizes that she misses eating junk food. Homer catches Marge eating from his stash of candy and the two of them indulge in junk food together. They then agree to only make the kids eat healthy.\n\nBart meets Andy Hamilton (voiced by guest star Jonah Hill) and discovers that he is unemployed and lives with his mother. When Lisa suggests Andy is a loser, Bart gets him a job as Krusty's assistant but is angry when Andy quits after one day. Bart gets him rehired and goes to check Andy's progress. When a truck full of earthworms drives into the studio, Bart is terrified that Andy is repeating the &quot;Night of the Wigglers&quot; prank. He discovers, however, that it is part of the show and that Andy has been hired as a writer for Krusty's show and has a girlfriend, much to Bart's delight. Despite Andy's success, Lisa still thinks he is a loser.\n\nFeatured music in this episode is a movement from Sergei Prokofiev's Lieutenant Kije.\n\n\nPostscoring by longret\nXDDDDDDDDDDDDDDDDDDDDDDDDDDD","torrent":{"xt":"urn:btih:7db5174978bd72bd2045fe2d6bd6fc9e66718f46","amp;dn":"Simpsons+21+season+%5C%22Pranks+and+Greens%5C%22+RUS+postscoring","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7db5174978bd72bd2045fe2d6bd6fc9e66718f46","infoHashBuffer":{"type":"Buffer","data":[125,181,23,73,120,189,114,189,32,69,254,45,107,214,252,158,102,113,143,70]},"announce":[],"urlList":[]}}