{"title":"Amerie - Heard 'Em All","uid":5146931,"size":149207044,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7de3557d4aad0ac4bf1812e8660dcb0d6ed215d0&amp;dn=Amerie+-+Heard+%5C%27Em+All&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1257318542,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Heard 'Em All&quot; is a single by American R&amp;B recording artist Amerie from her fourth studio album, In Love &amp; War, scheduled for a North American release in September 2009. It will be the first official single following &quot;Why R U&quot; in the US, but will serve as the second single in some European countries, such as the UK. The official remix of the song features rapper Lil Wayne with both versions being featured on the album. Its release was confirmed by Def Jam's official site.\n\nThe music video for &quot;Heard 'Em All&quot; was shot in the Santa Clarita desert in California in August 2009. The video will be directed by Anthony Mandler, who has also shot videos for Rihanna, Beyonce, The Killers, Utada Hikaru, Fergie, Nelly Furtado, and Eminem. The video will be Mad Max-themed with a huge budget and pyrotechnics involved.\n\nIn August 2009, the song leaked featuring only Amerie on vocals. Later that month, an amended version surfaced featuring rapper Lil Wayne, this was later deemed as the official version but will not be used in the video. In September 2009, a rock remix of the song, sampling AC/DC's &quot;Back In Black&quot; and featuring labelmate Kain was released for promo.\n\nAmerie Mi Marie Rogers (born January 12, 1980 in Fitchburg, Massachusetts), known professionally as Amerie, is a two time Grammy nominated American singer, songwriter, producer and actress. She debuted in 2002 with the album All I Have, primarily produced by Rich Harrison.\n\n&quot;1 Thing&quot;, the lead single from her second album, Touch released in 2005, introduced elements of D.C.'s go-go, and became her biggest hit to date.\n\nHer third album Because I Love It, had an international only release in 2007.\n\nAmerie will be releasing her fourth studio album titled In Love &amp; War on November 3, 2009. The lead single is &quot;Why R U&quot;, and the Dual second singles are &quot;Heard 'Em All&quot; and &quot;Pretty Brown&quot; featuring 'Trey Songz'. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7de3557d4aad0ac4bf1812e8660dcb0d6ed215d0","amp;dn":"Amerie+-+Heard+%5C%27Em+All","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7de3557d4aad0ac4bf1812e8660dcb0d6ed215d0","infoHashBuffer":{"type":"Buffer","data":[125,227,85,125,74,173,10,196,191,24,18,232,102,13,203,13,110,210,21,208]},"announce":[],"urlList":[]}}