{"title":"Hardcore Mix","uid":5167586,"size":62327019,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:800b8eaf747b4c8ad8b586ca289f1c84bdb157fc&amp;dn=Hardcore+Mix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"speedyb","files":2,"time":1258495364,"description":"I'm sick of the crap you lot are calling Hardcore these days.\n\nTake a listen to this mix, don't listen to the mixing it's \nawful. Don't listen to the audio quality. Don't listen to \nanything except for the music itself. \n\nPut it on your iPod, in your car, on your hi-fi at home, \njust sit back, and listen. Listen to what Hardcore \nshould really be about. Fast beats, mental sounds, the\nsort of feelings that make arenas full of thousands of \npeople jump around like fucking lunatics.\n\nIf all you listen to is the shitty trance remixes most DJ's\nand producers are putting out these days, you have no idea\nwhat it felt like to be bouncing about next to a total\nstranger back in the day. Talking to people you have never\nmet before in your life and will never meet again.\n\nHardcore was never about the money, it was about pure\nenjoyment. Modern producers have taken that away from the\nscene, pumping out rubbish releases one after the other. \n\nIt's time for the ravers to take it back to the good old \ndays. There's a lot of upcoming talent in the scene, taking\nback what Hardcore used to be about. Don't let the big cats\nat the top push you aside. Keep striving for the rush that \nmade you love Hardcore in the first place. If you manage a\nrelease and it doesn't make you rich, so fucking what? \nSo long as one person, one single, mental raver enjoys it, \nthat's what it's all about. \n\nRegards, \n\nBP","torrent":{"xt":"urn:btih:800b8eaf747b4c8ad8b586ca289f1c84bdb157fc","amp;dn":"Hardcore+Mix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"800b8eaf747b4c8ad8b586ca289f1c84bdb157fc","infoHashBuffer":{"type":"Buffer","data":[128,11,142,175,116,123,76,138,216,181,134,202,40,159,28,132,189,177,87,252]},"announce":[],"urlList":[]}}