{"title":"Allods Online Europa CBT1 Full Client","uid":5162741,"size":2320019651,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:80b9b36811712312d2ece8309d5820422da16e35&amp;dn=Allods+Online+Europa+CBT1+Full+Client&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1258237531,"description":"Allods Online is a massively multiplayer online role-playing game, set in the fantasy space opera universe of Sarnaut.\n\nIt is the fourth opus of the Rage of Mages series which started in the mid-90s, conquering the minds of millions of gamers around the world, and covers over 12 years of storyline in the making.\nYou can choose to enter the deep storyline, puzzling out relationships between the two factions at war, races and characters, and plumbing the depths of the mysteries at work in this unique setting. Or you can focus on developing your character, maximising his abilities, crafting, getting very rare items and enchanting them via the runes system to become the best in both duels and space Astral battle ship confrontations.\nThroughout the game, you will discover and fight your way in dungeons, castles and temples as a raid or as a group.\nAt high level, you can build your own Astral space ship and take off to explore the Astral with your party, looking for adventures, raids or if you want, become a pirate and board other ships to steal their loot. You will also discover many unique encounters such as Astral demons, ship versus ship battles, boarding other ships or even just annoying them during your journeys in the Astral.\n\nThe guild system greatly increases your opportunities and enhances your game experience in co-operative game play through specific raid encounters, some even being contested.\nWhether you enjoy solo questing and discovering a world with lots of player versus environment content, or bashing other players with the player versus player mechanisms (and of course the ship versus ship in the Astral space), Allods Online is a lot of fun for all kinds of players. You can always stand aside all battles and just meet your friends in game and chitchat about whatever you like.\nIt is all up to you.\n\nAllods Online is free and you can play as long as you wish. All you need is a gPotato.eu account.\n\n\nFor more information: http://e n . a l l o d s . g p o t a t o . e u/","torrent":{"xt":"urn:btih:80b9b36811712312d2ece8309d5820422da16e35","amp;dn":"Allods+Online+Europa+CBT1+Full+Client","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80b9b36811712312d2ece8309d5820422da16e35","infoHashBuffer":{"type":"Buffer","data":[128,185,179,104,17,113,35,18,210,236,232,48,157,88,32,66,45,161,110,53]},"announce":[],"urlList":[]}}