{"title":"Kiss - Lick It Up","uid":5102672,"size":139505668,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8255640507506fb03cc8f04298e2a9a3db25e995&amp;dn=Kiss+-+Lick+It+Up&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1254111037,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Lick It Up&quot; is a glam metal song by the American hard rock band Kiss. It is the title track on their 1983 album of the same name.\n\nWritten by guitarist/vocalist Paul Stanley and guitarist Vinnie Vincent, the song was released as the first single from the album in 1983.\n\nA video was made to promote the single. It was the first video to feature the band without its famous makeup. The video premiered on MTV on September 18, 1983 in a half-hour special hosted by J. J. Jackson. Despite all the hype and promotion for the single, it stalled at #66 on the American Billboard Hot 100 charts, although it broke into the Top 40 in several other countries.\n\n&quot;Lick It Up&quot; has been played by the band on most of their tours since its release, and was on the Kiss live albums Alive III and Kiss Symphony: Alive IV. The song also appears on 2001s The Box Set. As of 2008, it is currently the only song from the bands' non-makeup era that is still in their setlist.\n\nThe guitar bridge after the second iteration of the chorus was intended to be a full-fledged guitar solo; however, it is said that the solo recorded by Vinnie Vincent was not approved for the song, and he was asked by Gene Simmons to make another solo. Upset, Vincent made a bridge followed by a brutal breakdown instead.\n\nAlthough Paul Stanley is credited with lead vocals on the song, Gene Simmons performs some clearly audible vocal interjections throughout the song.\n\nLick It Up is an album by the U.S. hard rock/heavy metal band Kiss. On the day of the album's release, Kiss appeared on MTV without their trademark makeup. It was the first public appearance without makeup by Kiss since the very early days of the band. The album cover had bassist/band co-founder Gene Simmons sticking out his long trademark tongue to show fans that the quartet were still Kiss, with or without makeup. Lick It Up was certified Platinum on December 19, 1990.\n\nWhile the title track remains a regular staple on the band's live performances, the rest of the album is seldom played live.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8255640507506fb03cc8f04298e2a9a3db25e995","amp;dn":"Kiss+-+Lick+It+Up","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8255640507506fb03cc8f04298e2a9a3db25e995","infoHashBuffer":{"type":"Buffer","data":[130,85,100,5,7,80,111,176,60,200,240,66,152,226,169,163,219,37,233,149]},"announce":[],"urlList":[]}}