{"title":"Coast to coast AM 2011-05-02 Gun Ownership &amp; Geomagnetic Fields","uid":6365059,"size":55452519,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:82a74fa90a8bac976bed357e6982b74daec129ce&amp;dn=Coast+to+coast+AM+2011-05-02+Gun+Ownership+%26+Geomagnetic+Fields&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":5,"time":1304475937,"description":"Coast to coast AM 2011-05-02\nGun Ownership &amp; Geomagnetic Fields\n\nDate: 05-02-11 \nHost: George Noory \nGuests: Rollin McCraty, John R. Lott \nIn the first half of the show, research scientist John Lott talked about various issues related to gun ownership. When you have a ban on guns, it's the law-abiding citizens who turn in their guns, not the criminals, and &quot;rather than reducing crime it makes it easier for criminals to go and commit crimes because they don't have to worry about...citizens able to defend themselves,&quot; he argued. \n\nThe big benefit of having a gun is to keep the criminal away, he continued, especially for those who are weaker physically, whom criminals tend to prey on. He also noted that in the UK (where there is heavy gun control) there are significantly more burglaries when residents are at home, as opposed to the US, where criminals case out a place to make sure no one is there, as they don't want to risk getting shot at. Lott was critical of alternative weapons such as mace or a taser, citing their unreliability. \n\n-------------------------\n\n\nIn the latter half, Dr. Rollin McCraty discussed the interaction between the Earth's geomagnetic fields and the human heart and brain, and how disturbances in these fields deeply impact our health and well-being, and conversely how collective emotions alter Earth energies. 1,600 members of the Global Coherence Initiative participated in a long-running experiment, and a correlation was found between physical and psychological states and geomagnetic and solar factors, he reported. &quot;When the geomagnetic field is disturbed...we feel more anxious, more fatigued, and more mentally confused,&quot; he detailed. \n\nMcCraty described geomagnetic fields as flux lines that vibrate in different frequencies like guitar strings, based on their interactions with solar winds. These frequencies can overlap with that of the human heart when it's in a coherent mode, he said, &quot;so in other words, the Earth is singing away at the same frequency that our heart and cardiovascular system operate on.&quot; He spoke of current projects which include Earth Monitoring Stations-- sensors designed to (metaphorically) measure &quot;the heart rhythms and brainwaves of planet Earth,&quot; and Global Care Rooms-- an online environment/experiment to reduce suffering in specific regions. \n\nNews segment guests: Jon Rappoport, Paul Williams \n\nWebsite(s): \nheartmath.org\nglcoherence.org\njohnrlott.blogspot.com\nBook(s): \nMore Guns, Less Crime\n","torrent":{"xt":"urn:btih:82a74fa90a8bac976bed357e6982b74daec129ce","amp;dn":"Coast+to+coast+AM+2011-05-02+Gun+Ownership+%26+Geomagnetic+Fields","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82a74fa90a8bac976bed357e6982b74daec129ce","infoHashBuffer":{"type":"Buffer","data":[130,167,79,169,10,139,172,151,107,237,53,126,105,130,183,77,174,193,41,206]},"announce":[],"urlList":[]}}