{"title":"Democracy Now - 23 may 2011","uid":6416193,"size":452726575,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:83473646a448b43fb0e093470c0acf825522377f&amp;dn=Democracy+Now+-+23+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1306169881,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 23, 2011\n\n- Obama Mirrors Bush Stance on Israeli Control of West Bank\n- Israel Approves New Settlement Construction in East Jerusalem\n- Thousands Protest U.S. Drone Strikes in Pakistan\n- Pakistani Forces Re-Take Naval Base\n- Obama Visits Europe, G8 Protests Begin\n- Spanish Governing Party Loses Regional Elections; Protesters Vow Continued Actions\n- 11 Killed in Syrian Gov't Attack on Funeral\n- 20 Killed in Iraq Violence\n- Yemeni President Rejects Transition Proposal\n- Zelaya Reaches Deal for Return to Honduras\n- U.S. Military Accused of Burying Agent Orange in South Korea\n- United Nations Begins Japan Nuclear Probe\n- 89 Killed in Missouri Tornado\n\n\nSpecial reports\n\n- Massey Energy Guilty: West Virginia Probe Finds Coal Giant Systemically Failed to Comply With Law\n\nAn independent state probe in West Virginia concludes that mining giant, Massey Energy, was responsible for the April 2010 explosion that killed 29 underground coal mining workers. It echoes preliminary findings by federal investigators earlier this year that Massey repeatedly violated federal rules on ventilation and minimizing coal dust to reduce the risk of explosion, and rejects Massey's claim that a burst of gas from a hole in the mine floor was at fault. The report also notes Massey's strong political influence, which it uses &quot;to attempt to control West Virginia's political system&quot; and regulatory bodies. We speak with J. Davitt McAteer, who oversaw the probe and is a former top federal mine safety official.\n\n\n- Fight over Coal Mining is a &quot;Fight about Democracy&quot;: New Film with Robert Kennedy, Jr., Chronicles Campaign to Halt Mountaintop Removal\n\nWe speak with environmental activist Robert Kennedy, Jr., and filmmaker Bill Haney about the new documentary, The Last Mountain, which premiered this year at the Sundance Film Festival. The film chronicles the fight against coal mining across Appalachia and Massey Energy's devastating practice of mountaintop removal to extract layers of coal. &quot;They have to break the law to do this. They cannot survive in the marketplace without violating the law. They violate labor laws. They violate health and safety laws. And by their own records, they've had some 67,000 violations of just one of the environmental statutes,&quot; says Kennedy of the coal giant that has tremendous political influence at the state and federal level. &quot;It's not just about the environmental destruction, it's also about subverting democracy.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:83473646a448b43fb0e093470c0acf825522377f","amp;dn":"Democracy+Now+-+23+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83473646a448b43fb0e093470c0acf825522377f","infoHashBuffer":{"type":"Buffer","data":[131,71,54,70,164,72,180,63,176,224,147,71,12,10,207,130,85,34,55,127]},"announce":[],"urlList":[]}}