{"title":"Senyales.Del.Futuro.DVDRIP.Ac3.SPANiSH.Rip.","uid":5013551,"size":1404068622,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:84dda12cd95202e52d31f541e38a90d3463a2e03&amp;dn=Senyales.Del.Futuro.DVDRIP.Ac3.SPANiSH.Rip.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gamolama","files":1,"time":1248114008,"description":"Direccion: Alex Proyas. Pais: USA. Ano: 2009. Duracion: 121 min. Genero: Thriller, ciencia-ficcion. Interpretacion: Nicolas Cage (John Koestler), Rose Byrne (Diana Wayland), Chandler Canterbury (Caleb Koestler), Lara Robinson (Lucinda Embry/Abby Wayland), Ben Mendelsohn (Phil Beckman), D.G Maloney, Nadia Townsend (Grace Koestler), Adrienne Pickering (Allison), Danielle Carter (Miss Taylor 1959). Guion: Ryne Pearson, Richard Kelly, Juliet Snowden, Stiles White, Stuart Hazeldine y Alex Proyas. Produccion: Alex Proyas, Todd Black, Jason Blumenthal y Steve Tisch. Musica: Marco Beltrami. Fotografia: Simon Duggan. Montaje: Richard Learoyd. Diseno de produccion: Steven Jones-Evans. Vestuario: Terry Ryan. Estreno en USA: 20 Marzo 2009. Estreno en Espana: 8 Abril 2009. SINOPSIS Ano 1958, unos ninos guardan en una capsula del tiempo varios documentos. Uno de ellos contiene extranos numeros. En el presente, John (Nicolas Cage), un profesor de astronomia, encuentra el documento sin entender su significado. Descubrira que son fechas en las que han ocurrido cosas terribles e intentara evitar que se cumplan las predicciones futuras.\nSeÃƒÂ±ales Del Futuro ","torrent":{"xt":"urn:btih:84dda12cd95202e52d31f541e38a90d3463a2e03","amp;dn":"Senyales.Del.Futuro.DVDRIP.Ac3.SPANiSH.Rip.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84dda12cd95202e52d31f541e38a90d3463a2e03","infoHashBuffer":{"type":"Buffer","data":[132,221,161,44,217,82,2,229,45,49,245,65,227,138,144,211,70,58,46,3]},"announce":[],"urlList":[]}}