{"title":"Glad","uid":5104172,"size":236718165,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8595edb544564bbaed00df98202b0cb5d1b09eb9&amp;dn=Glad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"freedomp","files":52,"time":1254239359,"description":"A Brief History of GLAD \nImpeccably arranged vocals; layered harmonies; instrumental and vocal versatility, and strong ties to the local church-- these are the hallmarks of GLAD. GLAD, the band, began on the campus of West Chester State University near Philadelphia, PA in the early '70's. Formed as a progressive Christian rock band with classical/jazz leanings and an emphasis on complex vocals, GLAD has always borrowed from a wide range of musical genres. The band made its first two records for Myrrh/Word between 1978 and 1980. On their second outing, Beyond a Star, the group began to dabble with an a cappella sound (&quot;The Reason&quot;). In '81 the group signed with Benson Records (now Benson Music Group) which would become their home for thirteen years and twelve recordings. Over time the group's sound evolved into a sophisticated pop/jazz style, with one a cappella offering on each recording. As an experiment, in 1988, the group recorded an entire album of a cappella -- a mixture of original tunes and elaborately re-arranged hymns. The public responded in a big way by purchasing over 300,000 copies of The Acapella Project, and GLAD began to alternate their &quot;band&quot; and a cappella recordings.\n\nSkipping forward a few years-- in 1995 and 1996 GLAD made several bold strokes-- with Color Outside the Lines in the band mode; A Cappella Gershwin, a recording of masterfully arranged compositions by George and Ira Gershwin; and another fine addition to the series which began as &quot;just an experiment&quot;, The A Cappella Project III. In 1998 came A Cappella Worship- Volume I, a recording of God-exalting worship songs which marked the return of the team that launched the first A Cappella Project -- George King, as executive producer; Ed Nalle, as producer; and Bob Kauflin, as lead arranger (3 original songs penned by Bob, and a total of seven arrangements). More recently, the group released A Cappella Worship- Volume II inspired primarily by the writings of John Piper and the worship music of Sovereign Grace Ministries (formerly PDI). Glad's most recent efforts are Voices of Christmas (released September 26, 2000), an eclectic and engaging offering of well known carols and original songs, and Pure and Holy Passion, the group's first band offering in six years.\n\nGlad continues to tour at the rate of about fifty concerts per year. The group's concert ministry has two primary thrusts: 1) to effectively communicate the Gospel of Jesus Christ while emphasizing themes such as God's sovereignty and delighting in God, and; 2) sharing with audiences about the child development work of Compassion International.\n\nYou can  purchase their other albums here: http://glad-pro.com/","torrent":{"xt":"urn:btih:8595edb544564bbaed00df98202b0cb5d1b09eb9","amp;dn":"Glad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8595edb544564bbaed00df98202b0cb5d1b09eb9","infoHashBuffer":{"type":"Buffer","data":[133,149,237,181,68,86,75,186,237,0,223,152,32,43,12,181,209,176,158,185]},"announce":[],"urlList":[]}}