{"title":"Greg Bear - Darwins Radio","uid":4995045,"size":443581983,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8700d8c3fe5f395c453bffab6dee0192d6994c89&amp;dn=Greg+Bear+-+Darwins+Radio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thefc","files":15,"time":1247237955,"description":"\n\nGreg Bear's powerfully written, brilliantly inventive novels combine cutting-edge  \nscience and unforgettable characters, illuminating dazzling new technologies -- \nand their dangers. Now, in Darwin's Radio, Bear draws on state-of-the-art biological and anthropological research to give us an ingeniously plotted thriller that everything we believe about human origins and destiny -- as civilization confronts the next terrifying step in evolution.\nA mass grave in Russia that conceals the mummified remains of two women, both with\n child -- and the conspiracy to keep it secret... a major discovery high in the Alps:\n the preserved bodies of a prehistoric family -- the newborn infant possessing \ndisturbing characteristics... a mysterious disease that strikes only pregnant women,\n resulting in miscarriage. Three disparate facts that will converge into one \nscience-shattering truth.\nMolecular biologist Kaye Lang, a specialist in retroviruses, believes that ancient \ndiseases encoded in the DNA of humans can again come to life. But her theory \nsoon becomes chilling reality. For Christopher Dicken -- a &quot;virus hunter&quot; at the\n Epidemic Intelligence Service -- has pursued an elusive flu-like disease that strikes down expectant mothers and their offspring. The shocking link: something that has slept in our genes for millions of years is waking up. Now, as the outbreak of this terrifying disease threatens to become a deadly epidemic,\n Dicken and Lang, along with anthropologist Mitch Rafelson, must race against time to assemble the pieces of a puzzle only they are equipped to solve. An evolutionary puzzle that will determine the future of the human race... if a future exists at all.","torrent":{"xt":"urn:btih:8700d8c3fe5f395c453bffab6dee0192d6994c89","amp;dn":"Greg+Bear+-+Darwins+Radio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8700d8c3fe5f395c453bffab6dee0192d6994c89","infoHashBuffer":{"type":"Buffer","data":[135,0,216,195,254,95,57,92,69,59,255,171,109,238,1,146,214,153,76,137]},"announce":[],"urlList":[]}}