{"title":"THE TUDORS  SEASON ONE-DISC 3 EPISODES 8-10  BY WINKER@KIDZCORNE","uid":5160246,"size":2187648131,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:87749a69a0fb20ca368097db98385f499d1da483&amp;dn=THE+TUDORS++SEASON+ONE-DISC+3+EPISODES+8-10++BY+WINKER%40KIDZCORNE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alanwatson","files":-1,"time":1258101046,"description":"my internet will be restricted nightly between 18:00 and 19:45 pm\n\n\n\nepisode 8. &quot;Truth and Justice&quot;\n\nThe Pope's legate Cardinal Campeggio arrives to hear the case for King Henry VIII's divorce from Katherine of Aragon. Cardinal Wolsey intimidates Campeggio: &quot;Let me make certain things plain to you. If you do not grant the King his divorce, papal authority in England will be annihilated!&quot; Wolsey has assured Henry that the divorce will be granted, but the Pope and Campeggio are not so easily swayed. A desperate Wolsey begs Queen Katherine to abdicate the marriage, but she ultimately refuses. Wolsey's enemies circle; Anne Boleyn plants more doubt in Henry's mind about Wolsey, who soon threatens Campeggio both physically and politically. A Legatine Court convenes at Blackfriar's Church, and both Henry and Katherine plead their cases.\n\n\nepisode 9. &quot;Look to God First&quot;\n\nThe legatine trial on the legitimacy of King Henry's marriage to Katherine continues despite the queen's refusal to attend, but the papal envoy receives notice to return to Rome and place the evidence to the judgement of the Curia. The king engages in frantic diplomacy with the French king, but he aligns with the Holy Roman Emperor instead. The pope procrastinates and Henry, goaded by the conspirators Thomas Boleyn, the Duke of Norfolk and Charles Brandon, strips Wolsey of his temporal power and properties, bans him from court and instructs him to resume his now sole role as Archbishop of York. Thomas More reluctantly succeeds Wolsey as Chancellor of the realm and Princess Margaret falls ill with tuberculosis and dies. Anne Boleyn subtly and opportunely asks the king to reacquaint himself with the subject of Lutheranism.\n\n\nepisode 10. &quot;The Death of Wolsey&quot;\n\n\nWolsey, now acting solely as the Archbishop of York and living in relative poverty, is repudiated by Anne Boleyn and writes to Queen Katherine instead, trying to gain her support. Thomas More uses his new powers as Chancellor and starts actively persecuting prominent Lutherans. King Henry finds his new Privy Counsellors less proficient than Wolsey was in running the country. He also starts finding elements much to his liking in the teachings of Luther, and dispatches Thomas Cromwell to various faculties of theology, hopefully to obtain favourable opinions regarding his intended divorce. Wolsey's secret communication with the Queen is uncovered and he is arrested and charged with high treason; his fall from grace complete, Wolsey laments his decadent lifestyle and commits suicide en route to London. Anne Boleyn engages Henry in a sexual encounter, but forces him to perform coitus interruptus after which a furious Henry storms off.","torrent":{"xt":"urn:btih:87749a69a0fb20ca368097db98385f499d1da483","amp;dn":"THE+TUDORS++SEASON+ONE-DISC+3+EPISODES+8-10++BY+WINKER%40KIDZCORNE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87749a69a0fb20ca368097db98385f499d1da483","infoHashBuffer":{"type":"Buffer","data":[135,116,154,105,160,251,32,202,54,128,151,219,152,56,95,73,157,29,164,131]},"announce":[],"urlList":[]}}