{"title":"Windows XP Powertoys Complete --BloXoR--","uid":5009044,"size":19857328,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:87835e09783bfb1c52c35617014360dc9acef1e6&amp;dn=Windows+XP+Powertoys+Complete+--BloXoR--&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BloXoR","files":15,"time":1247884226,"description":"Windows powertoys for windows XP 100% clean\n\nColor Control Panel Applet\n\nProfessional-level photographers and designers know that getting consistent, accurate color from file to screen to print and beyond is a requirement for great results. This new tool helps you manage Windows color settings in one place.\n\nSyncToy\n\nWith new sources of files coming from every direction (such as digital cameras, e-mail, cell phones, portable media players, camcorders, PDAs, and laptops), SyncToy can help you copy, move, and synchronize different directories.\n\nRAW Image Thumbnailer and Viewer\n\nAre you a serious photographer? Now you can organize and work with digital RAW files in Windows Explorer (much as you can with JPEG images). This tool provides thumbnails, previews, printing, and metadata display for RAW images.\n\nClearType Tuner\n\nThis PowerToy lets you use ClearType technology to make it easier to read text on your screen, and installs in the Control Panel for easy access.\n\nHTML Slide Show Wizard\n\nThis wizard helps you create an HTML slide show of your digital pictures, ready to place on your Web site.\n\nOpen Command Window Here\n\nThis PowerToy adds an &quot;Open Command Window Here&quot; context menu option on file system folders, giving you a quick way to open a command window (cmd.exe) pointing at the selected folder.\n\nAlt-Tab Replacement\n\nWith this PowerToy, in addition to seeing the icon of the application window you are switching to, you will also see a preview of the page. This helps particularly when multiple sessions of an application are open.\n\nTweak UI\n\nThis PowerToy gives you access to system settings that are not exposed in the Windows XP default user interface, including mouse settings, Explorer settings, taskbar settings, and more.Version 2.10 requires Windows XP Service Pack 1 or Windows Server 2003.\n\nPower Calculator\n\nWith this PowerToy you can graph and evaluate functions as well as perform many different types of conversions.\n\nImage Resizer\n\nThis PowerToy enables you to resize one or many image files with a right-click.\n\nCD Slide Show Generator\n\nWith this PowerToy you can view images burned to a CD as a slide show. The Generator works downlevel on Windows 9x machines as well.\n\nVirtual Desktop Manager\n\nManage up to four desktops from the Windows taskbar with this PowerToy.\n\nTaskbar Magnifier\n\nUse this PowerToy to magnify part of the screen from the taskbar.\n\nWebcam Timershot\n\nThis PowerToy lets you take pictures at specified time intervals from a Webcam connected to your computer and save them to a location that you designate.\n\n\nThis, i know is freeware but it doesnt require the WGA (Windows Genuine Advantage) Validation to download from Microsoft \n\nEnjoy and seed!","torrent":{"xt":"urn:btih:87835e09783bfb1c52c35617014360dc9acef1e6","amp;dn":"Windows+XP+Powertoys+Complete+--BloXoR--","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87835e09783bfb1c52c35617014360dc9acef1e6","infoHashBuffer":{"type":"Buffer","data":[135,131,94,9,120,59,251,28,82,195,86,23,1,67,96,220,154,206,241,230]},"announce":[],"urlList":[]}}