{"title":"The Prodigy - Warrior's Dance","uid":4989304,"size":119607300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:892303c4c081cb223a1fd03d971f53b57a0e3355&amp;dn=The+Prodigy+-+Warrior%5C%27s+Dance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1246947603,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Warrior's Dance&quot; is the twentieth single released by the British electronic band The Prodigy on May 11, 2009, and it will be the second commercial single from the album Invaders Must Die after &quot;Omen&quot; and the free &quot;promo&quot; single &quot;Invaders Must Die&quot;.\n\nThe track's chorus is a sample of &quot;Take Me Away&quot; by Final Cut with True Faith. It also contains beat samples from &quot;Let The Warriors Dance&quot; by Addis Posse.\n\nThe digital single was released on April 17 in Australia, exclusively on iTunes, although only the &quot;Edit&quot; version with none of the remixes is also be available. When released on iTunes Australia the song was titled incorrectly and the download was actually a song from Placebo, this issue was fixed later on.\n\n3 remix versions of Warrior's Dance will be sold on the Prodigy's own store, as digital downloads in MP3 format. An extra remix will be exclusive to iTunes. The song peaked at #9 on the UK Singles Chart.\n\nThe music video was posted on the band's Myspace andpage on April 3, 2009, after being postponed from an exclusive broadcast on Channel 4 the week before. It was directed by Corin Hardy.\n\nIt features an animation resembling stop motion of three humanoid cigarette packets branded with various Prodigy logos (representing the three members of the band) starting a miniature rave within a pub with other cigarette packages, eventually causing a fire on top of a table. The three Prodigy cigarette boxes then exit the house, leaving the rest of the dancing cigarette packages to continue burning. A man enters the pub to 'open up' the next morning, puzzled to find all the burnt cardboard remains.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:892303c4c081cb223a1fd03d971f53b57a0e3355","amp;dn":"The+Prodigy+-+Warrior%5C%27s+Dance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"892303c4c081cb223a1fd03d971f53b57a0e3355","infoHashBuffer":{"type":"Buffer","data":[137,35,3,196,192,129,203,34,58,31,208,61,151,31,83,181,122,14,51,85]},"announce":[],"urlList":[]}}