{"title":"Coast.to.Coast.AM.July.03.2009-komie","uid":4987178,"size":54997125,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:89d19a34bd6ef524369d0b7420a95bc66bf31826&amp;dn=Coast.to.Coast.AM.July.03.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":5,"time":1246802176,"description":"Mysteries, Monsters &amp; Open Lines\n\n \n\nDate:\n07-03-09\n\nHost:\nGeorge Noory\n\nGuests:\nEd Craft, Lisa Carmody, Open Lines\n\n\nDuring the first half of the program, George Noory spoke with investigator and author Ed Craft about Mysteries &amp; Monsters. Craft shared his research into an enormous pterosaur-like flying animal that lives in the Congo region of Africa. The Congomatu, a name given by locals that means &quot;destroyer of boats,&quot; reportedly comes out at dusk to attack villagers, carry off young children, and overturn boats. Craft suggested that pterosaur cryptids, like Congomatu, may have survived through the epochs (unlike other dinosaurs) because they could fly away from danger. He thinks the Jersey Devil may be related to pterosaurs as well.\n\nCraft provided details from an encounter he had with the Florida Swamp Ape while on a Boy Scout campout. According to Craft, he heard a &quot;blood-curdling scream&quot; then saw a hairy 6-ft tall creature walking through the sawgrass. He said the animal appeared &quot;more ape than human&quot; and did not seem interested in him. Craft entertained the idea that what he saw could have been an escaped primate from a zoo. He also briefly mentioned his work on UFOs and disclosure issues.\n\nCraft was joined in the second half-hour by his co-author Lisa Carmody, &quot;The Deaf Anomalist,&quot; who discussed her interest in anomalous investigation and research. Carmody said she had always wanted to be a ghost hunter, and especially hoped to find scientific explanations for paranormal phenomena. She has been to the Tower of London, where some have claimed to see the ghost of Anne Boleyn, as well as to sacred sites in Uisneach, Ireland. Carmody also presented some background info on the Mothman legend.\n\nOpen Lines followed. The final half-hour of the show featured 'Scariest Moments' calls from 2/18/05.\nWebsite(s):\n#\nBook(s):\n# Mysteries &amp; Monsters","torrent":{"xt":"urn:btih:89d19a34bd6ef524369d0b7420a95bc66bf31826","amp;dn":"Coast.to.Coast.AM.July.03.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89d19a34bd6ef524369d0b7420a95bc66bf31826","infoHashBuffer":{"type":"Buffer","data":[137,209,154,52,189,110,245,36,54,157,11,116,32,169,91,198,107,243,24,38]},"announce":[],"urlList":[]}}