{"title":"City of Light.avi","uid":5012623,"size":76572514,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8a8c32062e6b1a7cfbf1e6a809b37bbda47b2e7b&amp;dn=City+of+Light.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mtadesse","files":1,"time":1248077657,"description":"$22 billion project to link Arabia and Africa\nBin Laden's brother to build &quot;City of Light&quot;\n\nDJIBOUTI (Horn Of Africa)\n\nOsama bin Laden's half-brother is planning to build a bridge over the Red Sea creating a man-made link between the Middle East and Africa, with new cities at either end of the bridge.\n\nBuilding on engineering feats such as the Channel Tunnel between England and France, the Panama Canal linking the Atlantic to the Pacific and the Suez Canal joining the Mediterranean and the Red Sea, the proposed bridge would link Yemen to Djibouti.\n\nCosting 22 billion dollars (14 billion euros), stretching around 28.5 kilometers (18 miles) and encompassing a six-lane motorway and a four-track railway, the bridge would be of Biblical proportions.\n\nAnd the man behind it bears a familiar name, too -- Tarek bin Laden, half-brother of the leader of Al-Qaeda.\n\nTarek, a Saudi construction magnate, has been lobbying the Yemen and Djibouti governments to back the project, which would create a direct link between Arabia and east Africa, without the need to travel by the Sinai peninsula.\n\nDjibouti Prime Minister Dileita Mohamed Dileita said his government was not actively involved.\n\nThe plan envisages building new cities at either end of the bridge -- which would itself in fact be a combination of bridges, with a stop off point in the center of the &quot;Bab ed Mandeb&quot; (Gates of Hell) straights at Perim Island.","torrent":{"xt":"urn:btih:8a8c32062e6b1a7cfbf1e6a809b37bbda47b2e7b","amp;dn":"City+of+Light.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a8c32062e6b1a7cfbf1e6a809b37bbda47b2e7b","infoHashBuffer":{"type":"Buffer","data":[138,140,50,6,46,107,26,124,251,241,230,168,9,179,123,189,164,123,46,123]},"announce":[],"urlList":[]}}