{"title":"Rootjoose - Rhubarb - 1997 - TJ","uid":5180119,"size":61575566,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8b499d8cfa8b9c3c76d116ff13eef7a7e03d7c1f&amp;dn=Rootjoose+-+Rhubarb+-+1997+-+TJ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"therarewoollyone","files":14,"time":1259191834,"description":"I had no idea anybody wanted this album until my computer temporarily died and I wanted to listen to it and couldn't find it bloody anywhere...so now its fixed, and here we go: Enjoy...\n\nRootjoose - Rhubarb - 1997\n\nFiles:\nRhubarb / 01 The Joose Is Coming Soon.mp3\t2.8 MB\nRhubarb / 02 Pie In The Sky.mp3\t\t4.5 MB\nRhubarb / 03 The Parradiddle Song.mp3\t4.7 MB\nRhubarb / 04 Never Knew You.mp3\t\t4.2 MB\nRhubarb / 05 Taxman.mp3\t\t\t4.7 MB\nRhubarb / 06 Mr Fixit.mp3\t\t\t4.1 MB\nRhubarb / 07 Holiday.mp3\t\t\t5.4 MB\nRhubarb / 08 Long Way.mp3\t\t\t4.6 MB\nRhubarb / 09 Inspiration.mp3\t\t\t6.9 MB\nRhubarb / 10 Place So Near.mp3\t\t3.4 MB\nRhubarb / 11 Can't Keep Living This Way.mp3\t4.1 MB\nRhubarb / 12 Anniversary.mp3\t\t5.5 MB\nRhubarb / 13 Virtually Fat Free.mp3\t\t3.8 MB\n\n58.72 MB in 13 files.\n\n\nFrom Wikipedia:\n\nRootjoose were a funk rock band from Cornwall. They purveyed a lively style of music reminiscent of &quot;surf-rock&quot; bands such as contemporaries Reef, their live performances gaining them some popularity in the South West of England during the late 1990s. Performances including lightshows and semi-choreographed &quot;comedy&quot; dances enlivened crowds.\n\nSigned to Rage Records, the band released Rhubarb, their debut album, in 1997. Local legend has it that the album even outsold the Spice Girls, the girl-band who were at the time at the height of their popularity, in Cornwall.\n\nBand members Rob Elton, Jamie Crowe, Fez (James Hardaker) and Harry Collier achieved minor-celebrity status in the South West and appeared on local and at one point national television with the band. Coming first in the national Battle of the Bands competition, an event sponsored by Capital Radio, the band performed at Earls Court.\n\nTheir most notable track - Mr Fixit - reached number 54 of the UK music charts during the late 90s. Other singles included Can't Keep Living This Way, which made number 73 and Long Way, which made number 68. The band was perhaps unlucky: just as it was tipped to break through into the mainstream, its record company went bankrupt. The band was unable to get a new deal, as the fashion at the time was for introspective indie music rather than their more upbeat style; the band eventually called it a day in 2001. However, the story does not end there, as Harry Collier, bassist/vocalist for the band, went on to form piano-led pop-rockers Kubb who released their debut album, Mother, in 2005. Jamie Crowe &amp; Rob Elton, former Rootjoose guitarists have now gone on to form dance band rairbirds, probably one of the only live bands of that ilk around.","torrent":{"xt":"urn:btih:8b499d8cfa8b9c3c76d116ff13eef7a7e03d7c1f","amp;dn":"Rootjoose+-+Rhubarb+-+1997+-+TJ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b499d8cfa8b9c3c76d116ff13eef7a7e03d7c1f","infoHashBuffer":{"type":"Buffer","data":[139,73,157,140,250,139,156,60,118,209,22,255,19,238,247,167,224,61,124,31]},"announce":[],"urlList":[]}}