{"title":"O Quarto de Madeira | Derevyannaya komnata (1995)","uid":6404567,"size":734044160,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8bf0babc16e6a9b64061a38f862fad043eb50757&amp;dn=O+Quarto+de+Madeira+%7C+Derevyannaya+komnata+%281995%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MaoriS","files":1,"time":1305769313,"description":"O protagonista de O Quarto de madeira ÃƒÂ© um director de documentÃƒÂ¡rios que mora em uma cabana isolada na floresta com sua esposa igualmente estÃƒÂ³ica. O director ÃƒÂ© obcecado com a gravaÃƒÂ§ÃƒÂ£o de eventos marginais presentes na vida. ComeÃƒÂ§a a explorar estes eventos atravÃƒÂ©s da sua cÃƒÂ¢mera onde acaba por se envolver e por fim, torna-se uma vÃƒÂ­tima de sua prÃƒÂ³pria curiosidade.\nA narrativa, que ÃƒÂ© desprovida de qualquer parcela convencional, parece inteiramente baseada na improvisaÃƒÂ§ÃƒÂ£o dos intÃƒÂ©rpretes. Mas hÃƒÂ¡ indÃƒÂ­cios suficientes para sugerir que o filme ÃƒÂ© entendido como um conto preventivo sobre os artistas que ficam muito intimamente envolvidos nas suas matÃƒÂ©rias. Na verdade, o cineasta fica tÃƒÂ£o prÃƒÂ³ximo daquilo que vÃƒÂª que no final ele perde todo o desapego a si mesmo se torna-se um objecto e uma vÃƒÂ­tima do seu projecto.\n\n\nThe Wooden Room\nDerevyannaya komnata\nRÃƒÂºssia\n1995\n65 Min\nBlack and White\nRusso\n\nAn eccentric documentary maker is fixated by recording marginal events.\n\nThe protagonist of The Wooden Room is a documentary director who lives in an isolated hut in the forest with his equally stoical wife. The director is obsessed with recording marginal events in life. The closer to these events he comes with his camera, the more he becomes involved; in the end, he also falls victim to them. The film, with no dialogue and almost no sound, is an experimental meditation on the complex, continually changing relationship between a film maker and his subject. Yevgeni Yufit: 'There are many works of art dedicated to ecology and nature preservation - the natural surroundings of people. But the ecology of the human psyche that is influenced by contemporary circumstances is a subject that is usually ignored by art - and by cinema in particular. In its own way, The Wooden Room studies the negative influence of civilisation on human consciousness.'","torrent":{"xt":"urn:btih:8bf0babc16e6a9b64061a38f862fad043eb50757","amp;dn":"O+Quarto+de+Madeira+%7C+Derevyannaya+komnata+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bf0babc16e6a9b64061a38f862fad043eb50757","infoHashBuffer":{"type":"Buffer","data":[139,240,186,188,22,230,169,182,64,97,163,143,134,47,173,4,62,181,7,87]},"announce":[],"urlList":[]}}