{"title":"FILM - ARANCIA MECCANICA - S.KUBRICK 1971","uid":5014084,"size":1476519720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8bf700b594262bb3d78cffae1442f53db206832e&amp;dn=FILM+-+ARANCIA+MECCANICA+-+S.KUBRICK+1971&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sonny_68","files":3,"time":1248133195,"description":"ARANCIA MECCANICA - 1971 - S.KUBRICK\nSPETTACOLARE COPIA DEL CELEBRE FILM\nAUDIO/VIDEO 10/10\nIMPERDIBILE !!!!\n\nRICORDATI DI RIMANERE IN SEED !!!!\n\nAlex ÃƒÂ¨ un giovane senza arte nÃƒÂ© parte, figlio di proletari e dedito a furti, stupri e omicidi. Fa capo a una banda di spostati, denominati drughi. Dopo aver usato violenza alla moglie di uno scrittore finisce in carcere. Viene sottoposto ad angherie ma si fa amico un prete. Pur di essere scarcerato accetta il &quot;trattamento lodovico&quot;, che consiste nell'assistere a filmati di violenza. Quando esce scopre che i genitori hanno subaffittato la sua stanza. Senza poter reagire, dovrÃƒÂ  subire violenza da alcuni mendicanti vendicativi, dai drughi diventati poliziotti e dallo scrittore che ha perso la moglie e che ora si trova su una sedia a rotelle. Tenta il suicidio e all'ospedale riceve una visita di cortesia da parte del primo ministro. Ambientato nel futuro, ormai alle porte, e tratto da  Arancia ad orologeria di Anthony Burgess. Geniale traversata di generi (fantascienza, storico, drammatico, comico, grottesco, orrore), un film che mostra la violenza per esserne un contro-manifesto. Accolto da polemiche e ovazioni al suo apparire, ÃƒÂ¨ stato sequestrato per molti anni in Francia, mentre in Gran Bretagna non puÃƒÂ² essere ancora proposto nÃƒÂ© al cinema nÃƒÂ© in videocassetta. L'ambiguitÃƒÂ  del personaggio era necessaria per mostrare le diverse violenze della medicina, della polizia, della politica e della gente comune. Quando Alex viene guarito, non puÃƒÂ² gestire le proprie scelte. Diventa docile non per volontÃƒÂ  ma per allergia (sente nausea quando cerca di usare violenza, anche se cerca di difendersi). La piÃƒÂ¹ grande prova al cinema di Malcolm McDowell che ha ideato alcune scene storiche, tra cui quella dello stupro a tempo di I'm singing in the rain. Le musiche di Beethoven e Rossini rielaborate da Walter Carlos e le immagini grandangolo di John Alcott accrescono l'immersione nell'incubo. Doppiaggio italiano all'altezza dell'originale.  &lt;a href=&quot;\nhttp://italian.imdb.com/title/tt0066921/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://italian.imdb.com/title/tt0066921/&lt;/a&gt;","torrent":{"xt":"urn:btih:8bf700b594262bb3d78cffae1442f53db206832e","amp;dn":"FILM+-+ARANCIA+MECCANICA+-+S.KUBRICK+1971","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bf700b594262bb3d78cffae1442f53db206832e","infoHashBuffer":{"type":"Buffer","data":[139,247,0,181,148,38,43,179,215,140,255,174,20,66,245,61,178,6,131,46]},"announce":[],"urlList":[]}}