{"title":"Best of 2001 Vol 2 Promo Only (Vob files) [Video Album]","uid":5165599,"size":7418361458,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8c8a28e7683398eb4efae9d70ba8aeea478fcd6c&amp;dn=Best+of+2001+Vol+2+Promo+Only+%28Vob+files%29+%5BVideo+Album%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"towerelect","files":40,"time":1258389862,"description":"RE SEED to remove the now sadly defunct Demonoid Tracker and include new public ones.   Note a major film company is employing hackers to distrupt TPB trackers so if your trackers are reporting error messages then just add more public ones until the error goes away.   We can not allow Hollywood to control the Net and tell us what we can or can not do.   The copyright laws are not designed to interfere with legal bit torrent distribution and how dare one Hollywood company, allready mega rich with our money tell us what we can or can not do on the internet.\n\nThey call these albums PROMOTIONAL... well HELLO I am promoting them the best way I can, for FREE on the Internet.  Wise up Music industry and stop fighting your own customers and give us VJ's what we want, and that is NOT physical media in DVD or Karaoke Disc format, but tracks like this, good to go right from disc onto our hard drives.   Drop all DRM and other obsolete nonsense like Macrovision protection and 4:3 ratio support and get with the times.  These people from Hollywood really take the biscuit for ingnorence.\n\nSource Original Promo Only DVD9 ripped into useable tracks with DVD Decrypter 'cause no video DJ plays DVD's anymore HELLO anyone listening out there?\nMixed screen Ratio cause everyone uses obsolete CRT 4:3 TV's right?  (Eh WRONG)\n320kps stereo Audio\nPlease see torrent files for track listing details.\n\nEnjoy, Oh should be on the net until the End of November on or about the 26th then no more seeding from me until March of 2010, sorry but moving house and country.\n\nRigmar Radio","torrent":{"xt":"urn:btih:8c8a28e7683398eb4efae9d70ba8aeea478fcd6c","amp;dn":"Best+of+2001+Vol+2+Promo+Only+%28Vob+files%29+%5BVideo+Album%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c8a28e7683398eb4efae9d70ba8aeea478fcd6c","infoHashBuffer":{"type":"Buffer","data":[140,138,40,231,104,51,152,235,78,250,233,215,11,168,174,234,71,143,205,108]},"announce":[],"urlList":[]}}