{"title":"Coast.to.Coast.AM.July.05.2009-komie","uid":4988506,"size":55671640,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8cb896e97d774c2866e526bc9f6a2f82271ec231&amp;dn=Coast.to.Coast.AM.July.05.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":5,"time":1246907695,"description":"Crop Circles &amp; UFOs\n\n\n\nDate:\n07-05-09\n\nHost:\nGeorge Noory\n\nGuests:\nEd Sherwood, Kris Sherwood, James McCanney\n\n\nInternationally known UFO and crop circle experts Ed &amp; Kris Sherwood talked about interactive UFO experiences (close encounters of the 5th kind), as well as their research into crop formations and their meanings. Ed shared his long history of UFO and ET encounters which began at the age of 9. During his first encounter, he was paralyzed and terrified, but then the ET telepathically said &quot;don't be afraid&quot; and &quot;do you remember?&quot; After this, his fear subsided and he saw things that pertained to his past lives. He said he's had 40 daylight sightings of UFOs over Santa Monica (video clip), some within minutes of a meditation/invitation to ET intelligence.\n\nThe Sherwoods believe that most crop circles since 2001 are man-made, and their designers are acting in a deceptive manner, spreading disinformation. However, prior to 2001, there were several hundred crop formations that were not made by humans, but rather came from a &quot;natural/supernatural&quot; source that partially invoked the collective energy of our own consciousness. Ed cited a 1990 formation that had pictograms similar to meteorological symbols, and referenced weather patterns shortly before and after its creation. Sound may also play a role in genuine crop circles, he added.\n\nKris Sherwood discussed the intriguing phenomenon known as Marine Lightwheels, which could be thought of as crop circles of the sea. Numerous Navy crew members have reported seeing glowing wheels of light and geometric patterns in the water, sometimes when bioluminescent plankton are present. It's possible the lightwheels could be related to a kind of magnetic discharge. For more on the Sherwoods, see the documentary UFOs &amp; ET Contact Part 1, 2, 3, 4, 5, 6, 7, 8 or visit their You Tube channel.\n\nSolar &amp; Space Activity\n\nFirst hour guest, maverick physicist James McCanney talked about how sunspot activity has returned to the sun after a long absence, and also commented on a report which alleges that the Russians are ordering flight changes because magnetic shifts downed airliners. He found this unlikely as the recent plane crashes (Air France, Yemeni Airways) were over geologically dissimilar areas.\nWebsite(s):\n# cropcircleanswers.com\n# jmccanneyscience.com\nBook(s):\n# Planet-X, Comets and Earth Changes\n# Principia Meteorologia - The Physics of Sun-Earth Weather\nCD(s):\n# The James McCanney Science Hour - At the Crossroads","torrent":{"xt":"urn:btih:8cb896e97d774c2866e526bc9f6a2f82271ec231","amp;dn":"Coast.to.Coast.AM.July.05.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cb896e97d774c2866e526bc9f6a2f82271ec231","infoHashBuffer":{"type":"Buffer","data":[140,184,150,233,125,119,76,40,102,229,38,188,159,106,47,130,39,30,194,49]},"announce":[],"urlList":[]}}