{"title":"Yogic Asanas For Heart - Yogacharya Arun Kumar","uid":5189340,"size":557944874,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8d38561e25df061393c584437cac74eb3c511e72&amp;dn=Yogic+Asanas+For+Heart+-+Yogacharya+Arun+Kumar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rtindru","files":1,"time":1259607666,"description":" &lt;a href=&quot;http://www.infinitedimension.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.infinitedimension.org/&lt;/a&gt;\n\nFounder and Volunteers\n\nFounder\nYogacharya Arun Kumar, an Electronic Engineer by Education, is a New Age Guru, teacher and Trainer. He joined Sivananda Yoga Vedanta Dhanvantari Ashramam in 1990 and received his training in Yoga, Meditation and higher knowledge from his Guru Swami Vishnudevananda for almost three years. Subsequently he got training on various aspects of Yoga, Meditation and Healing Sciences from various institutions. He has trained thousands of people from all-walks of life from all religious, linguistic backgrounds and nationalities. \n\nFor two years he trained many of the top International Cricketers including Rahul Dravid, Venkatesh Prasad, Asish Kapoor, Iqbal Siddiqui, Srilankan players like Chaminda Vaas, Ravindra Pushpakumara, Eric Upsantha, and many other International and national players from many countries. He joined Apollo Group of Hospitals as Yoga, Meditation and Stress Management consultant in the year of 1996 and continuing till date. He entered the field of healing in 1991 with Yogic healing.\n\nHe is associated with SAAOL of New Delhi, which organizes a program known as By-passing the by pass surgery for cardiac patients. Thousands of patients are benefited by this program. He is a visiting faculty with IFMR and ACME and conducts regular training programmes in NACEN, Anna Institute of Management, RBI staff training college and many other such training institutions.\n\nHe helps many corporates by conducting stress management, self management, pranic management and other yoga, meditation, breathing, and HR related programs for the employees. He also specializes in breath healing, om therapy, Tibetan yogic techniques such as Fountain of Youth and Kumnye.\n\n\nHe has founded Infinite dimension charitable Trust to propagate yoga, Meditation, different modes of healing sciences and therapies, dance, music, art, craft etc. as therapies among common public as well as the poorest of the poor.\n\nYogic Asanas For Heart helps you overcome stress, and also improves blood supply and re-vitalizes your body and mind. It truly helps and the best judge of this is you.\n\nTry it to benefit from its great effects.\n\nA Proud release from India.","torrent":{"xt":"urn:btih:8d38561e25df061393c584437cac74eb3c511e72","amp;dn":"Yogic+Asanas+For+Heart+-+Yogacharya+Arun+Kumar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d38561e25df061393c584437cac74eb3c511e72","infoHashBuffer":{"type":"Buffer","data":[141,56,86,30,37,223,6,19,147,197,132,67,124,172,116,235,60,81,30,114]},"announce":[],"urlList":[]}}