{"title":"U2 - I'll Go Crazy If I Don't Go Crazy Tonight (Live)","uid":5171391,"size":142163972,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8d9300148ddbc9e824df7cb7f5150563453d8386&amp;dn=U2+-+I%5C%27ll+Go+Crazy+If+I+Don%5C%27t+Go+Crazy+Tonight+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258708423,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I'll Go Crazy If I Don't Go Crazy Tonight&quot; is the fifth song from U2's 2009 album No Line on the Horizon. The song was released as the album's third single in a digital format on 25 August 2009 and in a physical version released on 7 September 2009. Two music videos were made, one directed by David O'Reilly, and one by Alex Courtes. The song is currently at #32 on the UK Singles Chart and at #7 on the Irish Singles Chart.\n\nThe first music video received its world premiere on 17 July 2009 through U2'schannel. Directed by David O'Reilly and designed by Jon Klassen, it is the band's first animated music video since 1995's &quot;Hold Me, Thrill Me, Kiss Me, Kill Me&quot;, and is one of the few not to feature the band. It depicts several people in a city undergoing hardships, and the events that interconnect them and bring them happiness as they decide to make changes in their lives. The video was entered in the 2009 Ottawa International Animation Festival.\n\nThe second music video was directed by Alex Courtes and produced by Malachy Mcanenny. While the O'Reilly video plays over the studio version of the song, the Courtes version is the single edit. It consists of a live performance taken from the U2 360Ã‚Â° Tour, filmed at Camp Nou in Barcelona, Spain, on 2 July 2009.\n\n&quot;I'll Go Crazy If I Don't Go Crazy Tonight&quot; was first played on 4 March 2009 on the Late Show with David Letterman, one of three performances of the song during No Line on the Horizon promotional appearances.\n\nRedanka's &quot;Kick the Darkness&quot; remix arrangement of the song was played throughout the U2 360Ã‚Â° Tour. Club feel lighting accompanied the song, while Larry Mullen, Jr. walked around the outer stage playing a djembe. The performance in this unfamiliar style was intended to disorient the audience as the band moved from the &quot;personal&quot; first half of the concert into the &quot;political&quot; second half. (The only time the album version was performed during the tour was a concert in Barcelona where it was performed two times. For the first time the band played the remix and, then, as one of the encores, the album version was performed for a video shoot.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8d9300148ddbc9e824df7cb7f5150563453d8386","amp;dn":"U2+-+I%5C%27ll+Go+Crazy+If+I+Don%5C%27t+Go+Crazy+Tonight+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d9300148ddbc9e824df7cb7f5150563453d8386","infoHashBuffer":{"type":"Buffer","data":[141,147,0,20,141,219,201,232,36,223,124,183,245,21,5,99,69,61,131,134]},"announce":[],"urlList":[]}}