{"title":"Joboshare.MP4.Converter.v2.9.7.0606.Incl.Keygen-Lz0","uid":6457082,"size":6215374,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8e38aef88bc456cfe1fe5cd2e464c7bb73c216be&amp;dn=Joboshare.MP4.Converter.v2.9.7.0606.Incl.Keygen-Lz0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1307616230,"description":"Joboshare MP4 Converter 2.9.7.0606 \n\nJoboshare MP4 Converter is a professional MP4 Video converter that can convert various video formats to MP4 (MPEG4) video. It can convert AVI to MP4, convert MPEG to MP4, WMV to MP4 and supports almost all popular video files including AVI, MPEG, DivX, MOV, RM, WMV, 3GP, VOB, H.264/MPEG-4 AVC, VCD, DV and so on. It also can convert audio to MP3, AAC, M4A with ease, super fast speed and excellent quality.\n\nJoboshare MP4 Converter supports multiple portable media player (MP4 player) and mobile players such as iPhone, iPod, PSP, Apple TV, Archos AV500, Archos AV700, Archos Gmini402, iRiver PMP-100, Creative Zen Vision etc. with excellent playback quality. Joboshare MP4 Converter provides you with very flexible video editing options such as the output resolution, bit rate, frame rate, aspect ratio to customize output video quality.\n\nKey Features\n\nConvert almost all popular video formats to MP4\nSupport AVI, MPEG, DivX, MOV, RM, WMV, 3GP, VOB, H.264/MPEG-4 AVC, VCD, DV and so on.\nJoboshare MP4 Converter acts as AVI to MP4, MPEG to MP4, WMV to MP4 converter and etc.\n\nConvert audio formats to MP3\nJoboshare MP4 Converter is also powerful mp3 converter software to convert audio from all popular audio formats, extract audio from video and convert to MP3, M4A, WMA.\n\nSupport H.264/MPEG-4 AVC, H.264/PSP AVC Video (.mp4) conversion.\n\nSupport different players\nConvert video or movie to playback on mobile players or MP4 players, such as iPhone, iPod classic, iPod shuffle, iPod nano, PSP, Apple TV, Archos AV500, Archos AV700, Archos Gmini402, iRiver PMP-100, Creative Zen Vision etc.\n\nSuper fast conversion speed to save your time\nSuper fast conversion speed provided as it full supports Intel Pentium D Dual-Core Processor and AMD Athlon 64 X 2 Dual-Core Processor which ensures full use of your CPU.\n\nSupport batch conversion\nConvert more than one file at a time.\n\nTrim file length\nAllow you to capture your favorite video clips from your video files.\n\nPowerful output settings\nProvide you with various video and audio settings to adjust output quality.\n\nUser-friendly UI\nSimple GUI and very EASY to use\n\nSupport Windows Vista\n\nMulti-language support\nJoboshare MP4 Converter has two languages for choosing, Simplified Chinese and English.\n\nHome Page - http://www.joboshare.com/mp4-converter.html\n\n","torrent":{"xt":"urn:btih:8e38aef88bc456cfe1fe5cd2e464c7bb73c216be","amp;dn":"Joboshare.MP4.Converter.v2.9.7.0606.Incl.Keygen-Lz0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e38aef88bc456cfe1fe5cd2e464c7bb73c216be","infoHashBuffer":{"type":"Buffer","data":[142,56,174,248,139,196,86,207,225,254,92,210,228,100,199,187,115,194,22,190]},"announce":[],"urlList":[]}}