{"title":"Proxifier v3.0 Standard Edition","uid":6406538,"size":3902600,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8e68d7c88df2dc5602d81ffd2fea5482ad0ed7c1&amp;dn=Proxifier+v3.0+Standard+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"oxyuranus","files":2,"time":1305825007,"description":"Proxifier is a program that allows network applications that do not support working through proxy servers to operate through an HTTPS or SOCKS proxy or a chain of proxy servers.\n\nThere are many network applications that do not support working through proxy servers and thus cannot be used behind a LAN or firewall(s). These can compromise corporate privacy and lead you to many other restrictions. Proxifier solves all of these problems and gives you the opportunity to work with your favorite software without any restrictions. Additionally, it lets you gain extra control over network security, create a proxy tunnel and add more power to network functionality. \n\nWith Proxifier you can work with any Internet client (browsers, FTP, IRC, BitTorrent, messengers, telnet, SSH, video/audio, games...) through a network that is separated from Internet by a firewall (only one open port is required for a proxy tunnel to bypass firewall).\n\nProxifier will provide you with added privacy in all your Internet activities. An example is sending and receiving email through a proxy server or by chaining multiple proxy servers together. Proxifier supports all mail clients while allowing you to remain anonymous.\n\n","torrent":{"xt":"urn:btih:8e68d7c88df2dc5602d81ffd2fea5482ad0ed7c1","amp;dn":"Proxifier+v3.0+Standard+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e68d7c88df2dc5602d81ffd2fea5482ad0ed7c1","infoHashBuffer":{"type":"Buffer","data":[142,104,215,200,141,242,220,86,2,216,31,253,47,234,84,130,173,14,215,193]},"announce":[],"urlList":[]}}