{"title":"In tranzit (2007)(ENG)(NL SUBS) 2Lions-Team","uid":5183576,"size":4594397578,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8e95080a3153a46c4935ab63baede27eede57cc9&amp;dn=In+tranzit+%282007%29%28ENG%29%28NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1259360820,"description":"In tranzit (2007)       \n\n \n  Rusland / Verenigd Koninkrijk\nDrama / Oorlog\n91 minuten\n\ngeregisseerd door Tom Roberts\nmet Thomas Kretschmann, Vera Farmiga en Daniel BrÃƒÂ¼hl\n\nIn de chaotische nasleep van de Tweede Wereldoorlog wordt een groep Duitsers per ongeluk naar een door vrouwen beheerd Sovjet-gevangenkamp gestuurd. Daar aangekomen krijgen de bewakers de taak om de SS-officieren uit de groep te halen, maar dat blijkt nog niet zo simpel. Er begint een genadeloos kat en muis spel waarbij niemand ontzien wordt. Maar beide partijen leren van elkaar en komen er achter dat niets is wat het lijkt. Vooroordelen verdwijnen en liefde wordt op de meest onwaarschijnlijke plaatsen gevonden.\n \n\nEnglish\n\nIn the winter of 1946, in Leningrad, a group of German prisoners of war are sent to a female transit camp by the cruel Russian Commander Pavlov. When they arrive, the Russian female soldiers show the hostility to the enemies that have killed their husbands, families and friends; only Dr. Natalia and the cook treat the prisoners with dignity. Natalia has an agreement with Commander Pavlov to keep her former lover, who was wounded on the head during the war and is slow, in the camp instead of sending him to an institution in Siberia. Pavlov assigns Natalia to disclose members of the SS infiltrated in the group of prisoners. Natalia and the prisoner Max feel a great attraction for each other while the prisoner Klaus tries to convince Max to denounce a couple of prisoners to satisfy the Russian. Natalia convinces the businessman Yakov to organize an orchestra with the prisoners; they are invited to play in a ball, where the lonely women that survived the war dance with the Germans. After the ball, Natalia convinces Officer Elena to let the prisoners spend the night with the women. Natalia has one night stand with Max and while he sneaks back to the quarters, he is attacked by Klaus and saved by Natalia that discovers who Klaus actually is. \n\nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail Pal\nAudio : english\n\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\nOorlog\n \n\n \n \nWeblink : http://www.moviemeter.nl/film/38751\nWeblink : http://www.imdb.com/title/tt0785012\n\n***************************************** \n\nBrought to you by \n \n2Lions Team \n\n\n\nmeer zien?? \nKom dan eens kijken op ons forum \n          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\t\n","torrent":{"xt":"urn:btih:8e95080a3153a46c4935ab63baede27eede57cc9","amp;dn":"In+tranzit+%282007%29%28ENG%29%28NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e95080a3153a46c4935ab63baede27eede57cc9","infoHashBuffer":{"type":"Buffer","data":[142,149,8,10,49,83,164,108,73,53,171,99,186,237,226,126,237,229,124,201]},"announce":[],"urlList":[]}}