{"title":"Dave Matthews Band - Why I Am","uid":5157282,"size":142829572,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8f0d6f7cd83363d38d879ff258793b97aa35a662&amp;dn=Dave+Matthews+Band+-+Why+I+Am&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1257931398,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nDavid John Matthews (born January 9, 1967) is a South African-American Grammy Award-winning musician. He is best known as the lead vocalist, songwriter, and guitarist for the Dave Matthews Band.\n\nMatthews had originally envisioned someone else singing his songs, but instead decided to use his own vocals. After writing his first few songs, including &quot;I'll Back You Up&quot;, &quot;The Song that Jane Likes&quot; and &quot;Recently&quot;, he began to consider starting his own band. Matthews formed Dave Matthews Band in early 1991 with Boyd Tinsley, LeRoi Moore, Carter Beauford, Stefan Lessard, and Peter Griesar (who left the band in 1993) while working at Miller's. The band's first show was on April 20, 1991, at the Earth Day Festival in Charlottesville.\n\nMatthews focused primarily on his work with Dave Matthews Band from 1990 to 2003. Since that period, he has occasionally ventured outside the band in various solo performances and records.\n\nMatthews sang on the track &quot;Sing Along&quot; on Blue Man Group's second album The Complex in 2003. Later that year he released a solo album, &quot;Some Devil&quot;, which went platinum; its single, &quot;Gravedigger&quot;, won a Grammy Award in 2004. To support the album, Matthews toured with a group of musicians (most of whom performed on &quot;Some Devil&quot;) under the name Dave Matthews &amp; Friends.\n\nMatthews is also a close friend of BÃƒÂ©la Fleck. Matthews appears as a guest vocalist on BÃƒÂ©la Fleck and the Flecktones' 1998 release Left of Cool and both Fleck and Flecktones bassist Victor Wooten have made numerous appearances both live and studio with DMB (e.g. Wooten soloed in the second part of The Maker, and also in #41 on the 1998 live album Live in Chicago). The Flecktones also opened for DMB on several tours. Matthews performed a duet with Emmylou Harris on &quot;My Antonia&quot; on her 2000 album, Red Dirt Girl. They also appeared together on the musical television show CMT Crossroads, where the two performed Matthews' &quot;Gravedigger&quot; and the folk song &quot;Long Black Veil.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8f0d6f7cd83363d38d879ff258793b97aa35a662","amp;dn":"Dave+Matthews+Band+-+Why+I+Am","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f0d6f7cd83363d38d879ff258793b97aa35a662","infoHashBuffer":{"type":"Buffer","data":[143,13,111,124,216,51,99,211,141,135,159,242,88,121,59,151,170,53,166,98]},"announce":[],"urlList":[]}}