{"title":"Democracy Now - 28 apr 2011","uid":6351320,"size":444810392,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:900b6e4f55c50a8d798e2468e9d0f80c2ff3fe41&amp;dn=Democracy+Now+-+28+apr+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1304007880,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Apr 28, 2011\n\n- Storms Kill 178 in Southern U.S.\n- Palestinian Factions Reach Unity Deal\n- NATO Strike Kills 12 Libyan Rebels\n- Syrian Forces Raid Daraa; U.N. Resolution Fails\n- 12 Reported Dead as Yemen Forces Attack Protest\n- Bahrain Protesters Sentenced to Death\n- Tibetans Elect New Political Leader\n- White House Releases Obama's Birth Certificate\n- Trump: &quot;Very Proud of Myself&quot; for Obama Birth Certificate Disclosure\n- Obama Addresses Wall Street Donors\n- Indiana, Florida Lawmakers OK Anti-Abortion Bills\n- Supreme Court Strikes Blow to Class Actions\n\n\nSpecial reports\n\n- 5 Years After U.S.-Backed Clashes, Palestinian Factions Fatah, Hamas Reach Unity Deal\n\nThe rival Palestinian political organizations, Fatah and Hamas, have reached an agreement to end a nearly five-year internal schism, form an interim government, and hold a general election within a year. The two sides have been locked in a bitter conflict since Fatah and the Bush administration tried to overthrow Gaza's Hamas-led government in 2006 after Hamas won Palestinian national elections. Israel and the United States say they'll reject any peace talks with a Palestinian government that includes Hamas. We speak with Saree Makdisi, Professor of English and Comparative Literature at UCLA and the author of several books including &quot;Palestine Inside Out: An Everyday Occupation.&quot;\n\n\n- DOJ Drops Probe of Whistleblower Who Exposed Bush-Era Domestic Spying, Thomas Tamm: &quot;The Bottom Line Is I Don't Think I Ever Broke The Law&quot;\n\nIn a national broadcast exclusive, we speak with Thomas Tamm, the former U.S. Justice Department attorney who helped expose the Bush administration's domestic warrantless eavesdropping program that intercepted private email messages and phone calls of U.S. residents without a court warrant. On Tuesday, news broke that the Justice Department dropped its long-running criminal investigation of Tamm. The relatively quiet end to the investigation into Tamm's warrantless wiretapping leak marks a sharp contrast to the controversy his information generated during the second half of the Bush administration about whether the government had overstepped its legal authority in response to the 9/11 terror attacks.\n\n\n- Former CIA Analyst Ray McGovern: Petraeus Will Expand Pro-War Agenda As New CIA Director\n\nPresident Obama is expected to announce a major shuffling of his national security team today. Under his plan, CIA Director Leon Panetta will move to the Pentagon to replace the retiring Robert Gates. Gen. David Petraeus will become the new head of the CIA. U.S. Marine General John Allen will be nominated to become the U.S. commander in Afghanistan, a position currently held by Petraeus. And Ryan Crocker will be nominated to be U.S. Ambassador to Afghanistan. Leon Panetta has headed the CIA for the past two years and has led a massive escalation of the use of unarmed drones in Afghanistan and Pakistan. Many analysts say the nomination of David Petraeus to head the CIA will further increase the militarization of the spy agency. We speak with Ray McGovern, former senior CIA analyst and co-founder of Veteran Intelligence Professionals for Sanity.\n\nRay McGovern, former senior CIA analyst whose duties included preparing the President's Daily Brief and chairing National Intelligence Estimates, and co-founder of Veteran Intelligence Professionals for Sanity.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:900b6e4f55c50a8d798e2468e9d0f80c2ff3fe41","amp;dn":"Democracy+Now+-+28+apr+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"900b6e4f55c50a8d798e2468e9d0f80c2ff3fe41","infoHashBuffer":{"type":"Buffer","data":[144,11,110,79,85,197,10,141,121,142,36,104,233,208,248,12,47,243,254,65]},"announce":[],"urlList":[]}}