{"title":"Democracy Now - 31 may 2011","uid":6437926,"size":456982446,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:900f1d837563be550e4cbc2b001d3e1796e656d8&amp;dn=Democracy+Now+-+31+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1306861322,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 31, 2011\n\n- Germany Announces Plans To Close Nuclear Plants Amid Massive Protests\n- Afghanistan Warns NATO To End Attacks On Homes Following Spike in Civilian Deaths\n- Ousted President Manuel Zelaya Returns to Honduras\n- Yemen Security Forces Kill 50 Demonstrators at Peaceful Sit-In\n- NATO Bombing Of Libya Continues Following Peace Talks\n- Egyptian Blogger Appears Before Military Prosecutors\n- Egyptian Opens Rafah Border Crossing With Gaza\n- Missing Journalist Reportedly Held By Pakistan Intelligence Agency\n- Oxfam: Global Food Prices To Double By 2030\n- Report: Death Toll From Haiti Earthquake Far Lower Than Originally Projected\n- Poet and Musician Gil Scott Heron Dies at 62\n\n\nSpecial reports\n\n- Out of Exile: Exclusive Report on Ousted Honduran President Zelaya's Return Home 23 Months After U.S.-Backed Coup\n\nIn a Democracy Now! global broadcast exclusive, we take you on the plane of ousted Honduran President Manuel Zelaya as he and his family return home after almost two years in exile. We speak with Zelaya, ousted Honduran foreign minister Patricia Rodas, Honduran exile RenÃƒÂ© Guillermo Amador, and former Colombian senator Piedad CÃƒÂ³rdoba, one of the many representatives of Latin American countries who accompanied Zelaya home. We also speak to Father Roy Bourgeois of School of the Americas Watch on the role U.S.-trained generals played in the 2009 coup. &quot;This military coup had real connections to the School of the Americas. The two top generals, the key players in this military coup-the head of the air force, the head of the army-were graduates of the School of the Americas,&quot; said Bourgeois. [includes rush transcript]\n\n\n- Zelaya's Son Hector: The Honduran Resistance Helped Pave the Way for Our Return\n\nWe speak with HÃƒÂ©ctor Zelaya, son of former Honduran President Manuel Zelaya, as he accompanies his father home after the military coup d'ÃƒÂ©tat that led to his ouster on June 28, 2009. &quot;I [can] not think of any president that went into exile and defeated the exile in the first three years. I am grateful for our people and all the resistance in my country,&quot; HÃƒÂ©ctor Zelaya says, &quot;because of their fight against the coup and getting their rights and fighting for their rights. We have our president back in his country and back in his house today.&quot;\n\n\n- Zelaya's Daughter Pichu Recalls the Honduran Military's Brutal Kidnapping of Her Father in 2009\n\nIn the early morning hours of June 28, 2009, masked soldiers raided the Zelaya home in Tegucigalpa, Honduras. President Zelaya's daughter Xiomara Hortensia &quot;Pichu&quot; Zelaya hid under the bed as soldiers fired shots into the home. Following the coup she went into exile and hadn't seen her home until Saturday. &quot;When my dad heard the gunshots, he went out of his room and went to my room and told me to get dressed up because the military were coming,&quot; Pichu Zelaya says. &quot;And I heard the gunshots and everything. He told me to hide.&quot;\n\n\n- Exclusive Interview with Manuel Zelaya on the U.S. Role in Honduran Coup, WikiLeaks and Why He Was Ousted\n\nShortly after Manuel Zelaya returned to his home this weekend for the first time since the 2009 military coup d'etat, he sat down with Democracy Now! for an exclusive interview. He talks about why he believes the United States was behind the coup, and what exactly happened on June 28, 2009, when hooded Honduran soldiers kidnapped him at gunpoint and put him on a plane to Costa Rica, stopping to refuel at Palmerola, the U.S. military base in Honduras. &quot;This coup d'etat was made by the right-wing of the United States,&quot; Zelaya says. &quot;The U.S. State Department has always denied, and continues to deny, their any ties with the government with the coup d'etat. Nevertheless, all of the proof incriminates the U.S. government. And all of the actions that were taken by the de facto regime, or the contista regime, which are those who carried out the coup, favor the industrial policies and the military policies and the financial policies of the United States in Honduras.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:900f1d837563be550e4cbc2b001d3e1796e656d8","amp;dn":"Democracy+Now+-+31+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"900f1d837563be550e4cbc2b001d3e1796e656d8","infoHashBuffer":{"type":"Buffer","data":[144,15,29,131,117,99,190,85,14,76,188,43,0,29,62,23,150,230,86,216]},"announce":[],"urlList":[]}}