{"title":"Hellogoodbye - Here (In Your Arms)","uid":5171136,"size":134334468,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9101f01ad21d641f64112f5f289f198e5fff12ce&amp;dn=Hellogoodbye+-+Here+%28In+Your+Arms%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258690325,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Here (In Your Arms)&quot; is the lead single from Hellogoodbye's first full length album Zombies! Aliens! Vampires! Dinosaurs! (2006). It peaked at #14 on the U.S. Hot 100, #3 on U.S. Hot Dance Airplay, #9 U.S. Pop 100, and #6 on U.S. Hot Digital Songs. On May 21, the song reached #5 on the UK Singles Chart and on May 27th the song rose to #4. \n\nOn numerous occasions during live shows, the band substitutes the second verse of the song with the first verse of &quot;Digital Love&quot; by Daft Punk.\n\nDJ Chris Moyles performed a parody of the song called &quot;Beer in Your Arms&quot; on his show on BBC Radio 1.\n\nSouth African singer Nicholis Louw recorded an Afrikaans version, &quot;Hier Naby Jou&quot; (Here Next to You).\n\nWizard Rock band Ministry of Magic also recorded a filk of the song, titled &quot;Here In Your Car&quot;, about Harry Potter and Ron Weasley's friendship as they are flying from London to Hogwarts in the Weasleys' enchanted blue Ford Anglia.\n\nThe video is set at Camp Holadios, a fictional summer camp. While the band members are all staying there, Forrest becomes interested in chasing a girl who is also at camp. The music video has a very interesting aesthetic, as campers play with pogs. At the end of the video, the sign states &quot;Summer of '91&quot;. It also is reminiscent of the film Wet Hot American Summer. One of the references to this movie is when Forrest puts on the headband and sunglasses similar to the change that &quot;Coop&quot; undergoes to win the affection of a girl with the same name, &quot;Katie&quot;. The camps name is hellogoodbye in Spanish.\n\nHellogoodbye (styled as hellogoodbye) is a power pop band that was formed in Huntington Beach, California in 2001 by singer Forrest Kline. They are signed to Drive-Thru Records and released their first full-length album Zombies! Aliens! Vampires! Dinosaurs! in 2006, in addition to their previously released EP Hellogoodbye and DVD OMG HGB DVD ROTFL.\n\nZombies! Aliens! Vampires! Dinosaurs! is the first full-length album from Hellogoodbye. It was released on August 8, 2006 by Drive-Thru Records. Recording of the album finished in March 2006. The cover artwork was done by LeDouxville. Selling 40,057 units within its first week, the album debuted at #13 on the U.S. Billboard 200 albums chart, at #1 on the U.S. Independent albums chart and on #1 at the U.S. Internet albums chart.\n\nThe Japanese release additionally features two live versions of &quot;Here (In Your Arms)&quot; and &quot;Homewrecker&quot;.\n\nAs of April 2007, the album has sold 343,569 copies in the United States. It was released in the United Kingdom on May 21, 2007, where it debuted at #17 on the UK Albums Chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:9101f01ad21d641f64112f5f289f198e5fff12ce","amp;dn":"Hellogoodbye+-+Here+%28In+Your+Arms%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9101f01ad21d641f64112f5f289f198e5fff12ce","infoHashBuffer":{"type":"Buffer","data":[145,1,240,26,210,29,100,31,100,17,47,95,40,159,25,142,95,255,18,206]},"announce":[],"urlList":[]}}