{"title":"Lady Sovereign - So Human","uid":4986923,"size":111771652,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:91ae149627eee481bce0e0f4cd9ac23609c35af4&amp;dn=Lady+Sovereign+-+So+Human&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1246777758,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;So Human&quot; is a single by the English rapper Lady Sovereign. The song was the second single off her second album Jigsaw. The single was released on April 6, 2009 (2009-04-06) and has so far reached 38 on the UK Singles Chart. The song was written by Louise Harman (Lady Sovereign) and Gabriel Olegavich. The song was produced by Lukasz Gottwald, Benjamin Levin and Robert Smith. The song samples The Cure single &quot;Close to Me&quot;. No U.S. release has been announced as of yet.\n\nThe video starts off with Sovereign standing in front of a white wall with a splash of yellow paint on it. Then it goes to Sovereign on the red carpet being interviewed, after the paparazzi take many pictures of her a model walks on and tries to steal the spotlight so she trips her over. She then steals a camera of the paparazzi and throws it away from him. She then appears on two magazine covers one called &quot;Crazed&quot; and another called &quot;Any Other Magazine&quot;. She then appears on a couch with a psychiatrist sitting next to her and she takes notes on everything Sovereign says. the psychiatrist eventually breaks down in tears and hugs Sovereign. She then appears on two new magazines one called &quot;Vague&quot; and the other called &quot;Spender&quot;. She then talks to a guy who is viewing art at a gallery and then she walks off because he bores her. When she walks off she lets her friends sneak in and they have a party. She then ends it by going everywhere she has already been in the video and the person next to her mimes the words off the song.\n\nDigitalspy.co.uk gave the song 4 out of 5 stars and a very positive review. They started by talking about Lady Sovereign but eventually went onto talking about the song by saying &quot;it's a perky urban pop tune about having bad days and not beating yourself up about it. Sovereign remains as straight-talking and listenable as ever - &quot;I need a bag of green to make this go away,&quot; she raps at one point - making this a welcome reminder of her talents&quot;.\n\nOrange UK gave the song 4 out of 5 stars and gave a positive review and welcomed Lady Sovereign back onto the music scene. They said that &quot;'So Human' sees Sovereign applying her no-nonsense straight-talking wit to one of British pop's most prized possessions. The result is a perky, poppy urban track that just about sidesteps novelty territory and is all the better for it. Welcome home m'Lady&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:91ae149627eee481bce0e0f4cd9ac23609c35af4","amp;dn":"Lady+Sovereign+-+So+Human","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91ae149627eee481bce0e0f4cd9ac23609c35af4","infoHashBuffer":{"type":"Buffer","data":[145,174,20,150,39,238,228,129,188,224,224,244,205,154,194,54,9,195,90,244]},"announce":[],"urlList":[]}}