{"title":"2012 - Day After Tomorrow Drive-in Double Feature","uid":6422922,"size":4611584102,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:91e229ae1f45f60018b05b5dede716bf72ec05a0&amp;dn=2012+-+Day+After+Tomorrow+Drive-in+Double+Feature&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"InaraS","files":-1,"time":1306363688,"description":"                             Drive-In Double Feature 16\nFeature #1                                                                     &lt;a href=&quot; http://www.imdb.com/title/tt1190080/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt1190080/&lt;/a&gt;\n2012\n\nDr. Adrian Helmsley, part of a worldwide geophysical team investigating the effect on the earth of radiation from \n\nunprecedented solar storms, learns that the earth's core is heating up. He warns U.S. President Thomas Wilson that the \n\ncrust of the earth is becoming unstable and that without proper preparations for saving a fraction of the world's \n\npopulation, the entire race is doomed. Meanwhile, writer Jackson Curtis stumbles on the same information. While the \n\nworld's leaders race to build &quot;arks&quot; to escape the impending cataclysm, Curtis struggles to find a way to save his family.\n\n Meanwhile, volcanic eruptions and earthquakes of unprecedented strength wreak havoc around the world. \n\nFeature #2\nDay After Tomorrow\n\nAs Paleoclimatologist named Jack Hall was in Antartica, he discovers that a huge ice sheet has been sheared off. But what \n\nhe did not know is that this event would trigger a massive climate shift that would effect the world population. \n\nMeanwhile, his son, Sam was with friends in New York to attend an event. There they discover that it has been raining \n\nnon-stop for the past 3 weeks, and after a series of weather related disasters that occurred over the world. Everybody \n\nsoon realizes that the world is going to enter a new ice age, as the rest of the world population tries to evacuate to \n\nthe warm climates of the south. Jack makes a daring attempt to rescue his son and his friends who are stuck in New York, \n\nwho have to survive not only a massive wave, but freezing cold temperatures that could possibly kill them. \n\n\n                                DOUBLE FEATURE FEATURES\n\n               You can just hit &quot;PLAY ALL&quot; to get the whole experience (trailers,adds,intermission) \n\n                or go to &quot;select title&quot; to see what you want. Grab some popcorn, cuddle close and get   \n\n                                      some drinks and ENJOY THE SHOW!\n\n","torrent":{"xt":"urn:btih:91e229ae1f45f60018b05b5dede716bf72ec05a0","amp;dn":"2012+-+Day+After+Tomorrow+Drive-in+Double+Feature","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91e229ae1f45f60018b05b5dede716bf72ec05a0","infoHashBuffer":{"type":"Buffer","data":[145,226,41,174,31,69,246,0,24,176,91,93,237,231,22,191,114,236,5,160]},"announce":[],"urlList":[]}}