{"title":"PC Tools Privacy Guardian 4.5.0.138 Multilingual [ak]","uid":6413697,"size":12814441,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:91f4efe8ad02f1a59675924a8f13535c0f898534&amp;dn=PC+Tools+Privacy+Guardian+4.5.0.138+Multilingual+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306090194,"description":"PC Tools Privacy Guardian 4.5.0.138 Multilingual\n\nPrivacy Guardian is safe and easy-to-use internet privacy software that securely deletes online Internet tracks and program activity records that are stored in your browser and other hidden files on your computer.\n\nPrivacy Guardian guarantees your internet privacy by ensuring all traces of your online Internet and computer activities are permanently erased and unrecoverable on your PC. Information from every website you visit is stored on your computer and recorded in hidden WindowsÃ‚Â® locations including temporary files, cookies, system registry and the index.dat file. Web browsers only provide partial privacy protection by allowing some temporary Internet files and cookies to be deleted, but they do not clean data out of all the hidden files nor do they delete the data securely.\n\nPrivacy Guardian also restores valuable hard drive space and speeds up system performance by cleaning out old and unused temporary records. It allows you to simply and securely erase privacy sensitive files from WindowsÃ‚Â®, Microsoft Office, Netscape, WindowsÃ‚Â® Media Player and Internet Explorer.\n\nPrivacy Guardian is simple to install and easy to use. It is suitable for Microsoft Internet Explorer, Netscape, Opera and Mozilla Firefox Internet browsers and can be set to automatically protect your privacy at regular intervals. With Privacy Guardian installed on your computer you will never have to worry about prying eyes again.\n\nHome Page - http://www.pctools.com/privacy-guardian\n\n\n","torrent":{"xt":"urn:btih:91f4efe8ad02f1a59675924a8f13535c0f898534","amp;dn":"PC+Tools+Privacy+Guardian+4.5.0.138+Multilingual+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91f4efe8ad02f1a59675924a8f13535c0f898534","infoHashBuffer":{"type":"Buffer","data":[145,244,239,232,173,2,241,165,150,117,146,74,143,19,83,92,15,137,133,52]},"announce":[],"urlList":[]}}