{"title":"La Isla - Archivos de una tragedia (Uli Stelzner, 2009).avi","uid":6413287,"size":927487258,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:94fc80aa4ed0a83e260e8af6dbf7d74a38b71bb5&amp;dn=La+Isla+-+Archivos+de+una+tragedia+%28Uli+Stelzner%2C+2009%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pedrord","files":1,"time":1306073459,"description":"La isla archivos de una tragedia\n\nGuatemala: a finales del siglo XX el ejÃƒÂ©rcito y la policÃƒÂ­a asesinan y secuestran a cientos de miles de personas. Sin embargo este genocidio sin precedentes en la historia americana mÃƒÂ¡s reciente permanece aun sin castigo. Un sistema de terror e impunidad basado en el silencio y la supuesta falta de pruebas.\n\nPero, en 2005, trÃƒÂ¡s una violenta explosiÃƒÂ³n en la capital, se descubre accidentalmente el archivo secreto de la policÃƒÂ­a nacional. En el complejo de la actual academia de policÃƒÂ­a se ubicaba antes La Isla, una cÃƒÂ¡rcel secreta de los temidos comandos de la policÃƒÂ­a nacional y asÃƒÂ­ es que aparecen mÃƒÂ¡s de 80 millones de documentos. El director es hasta la fecha el ÃƒÂºnico cineasta a quien le ha sido autorizado filmar un largometraje en el archivo. La pelÃƒÂ­cula dibuja, a travÃƒÂ©s de una extraordinaria interacciÃƒÂ³n visual y emocional, la historia de una tragedia y trae a la luz las pruebas para esclarecer crÃƒÂ­menes inconcebibles. De igual manera retrata a una joven generaciÃƒÂ³n de trabajadores que desean liberarse del asfixiante abrazo de su propia historia aun no esclarecida.\n\n\nOfficial Selection in the Amsterdam Festival 2009, the most important in documentaries in Europe.\n\nla isla archives of a tragedy\n\nat the end of the 20th century, in guatemala army and police kill and abduct hundreds and thousands of people. but the unprecedented genocide in americas modern history goes unpunished. to this day a system of terror and impunity relies on silence being kept and the lack of evidence.\n\nbut in july 2005 a huge explosion in the guatemalan capital leads to the discovery of the historic archive of guatemala's national police. on the grounds of todays police academy used to be located the island, the secret prison of notorious policia nacional squads. And here millions of documents appeared. aided by an extraordinary visual and emotional interaction, the film traces the story of a tragedy and finds prove for inconceivable atrocities. it is also a movie about a young generation of archive workers willing to free their society from the stranglehold of its own history.","torrent":{"xt":"urn:btih:94fc80aa4ed0a83e260e8af6dbf7d74a38b71bb5","amp;dn":"La+Isla+-+Archivos+de+una+tragedia+%28Uli+Stelzner%2C+2009%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94fc80aa4ed0a83e260e8af6dbf7d74a38b71bb5","infoHashBuffer":{"type":"Buffer","data":[148,252,128,170,78,208,168,62,38,14,138,246,219,247,215,74,56,183,27,181]},"announce":[],"urlList":[]}}