{"title":"The Breakfast Club  (1985)  DVD-R  PAL","uid":5018076,"size":4680847360,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:95127f1ac4aeff3cbbabf73114df0edaa9d8f5ad&amp;dn=The+Breakfast+Club++%281985%29++DVD-R++PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Coolguy33","files":-1,"time":1248319064,"description":"The Breakfast Club (1985)\n\n\n\nDirected by John Hughes \nProduced by John Hughes\nNed Tanen \nWritten by John Hughes \nStarring Emilio Estevez\nAnthony Michael Hall\nJudd Nelson\nMolly Ringwald\nAlly Sheedy\nPaul Gleason \nMusic by Keith Forsey \nCinematography Thomas Del Ruth \nEditing by Dede Allen \nDistributed by Universal Pictures \nRelease date(s) February 15, 1985 \nRunning time 97 min \nCountry United States \nLanguage English \n\n\n\nThe Breakfast Club is a 1985 American teen film written and directed by John Hughes. The storyline follows five teenagers (each representing a different clique in high school) as they spend a Saturday in detention together and come to realize that they are all deeper than their respective stereotypes. The film has become a cult classic and has had a tremendous influence on many coming-of-age films since then.\n\nThe plot follows five students at fictional Shermer High School in the widely used John Hughes setting of Shermer, Illinois, as they report for Saturday detention on March 24, 1984. While not complete strangers, the five teenagers are all from a different clique or social group.\n\nThe students pass the hours in a variety of ways. Gradually they open up to each other and reveal their inner secrets (for example, Allison is a compulsive liar and Brian and Claire are ashamed of their virginity). They also discover that they all have strained relationships with their parents and are afraid of making the same mistakes as the adults around them. However, despite these developing friendships, the students are afraid that once the detention is over, they will return to their very different cliques and never speak to each other again.\n\nAt the request and consensus of the students, Brian is asked to write the essay Mr. Vernon assigned earlier (the subject of which was to be a synopsis by each student detailing &quot;who you think you are&quot;), which challenges Mr. Vernon and his preconceived judgments about all of them. Brian does so, but instead of writing about the actual topic he writes a very motivating letter that is in essence, the main point of the story. He signs the essay as &quot;The Breakfast Club&quot; and leaves it at the table for Mr. Vernon to read when they leave. There are two versions of this letter, one read at the beginning and one at the end, and they are slightly different; illustrating the change in the student's judgments of one another, and their realization that they truly have things in common.\n\nAndrew Clark: (Emilio EstÃƒÂ©vez) Andrew is the film's athlete, in detention for beating a fellow student and taping his buttocks together. Andrew, like Claire, is ashamed of being in detention and is used to the better end of social life at school. Andrew hates his father for pushing him so hard to succeed and even wants his knee to give so his father could not drive him to be the best athlete. At the beginning of the film, he asks Claire out but she declines. He shares a kiss with Allison, after she is given a makeover by Claire. \n\nClaire Standish: (Molly Ringwald) The princess of the group, she is in detention for skipping class to go to the mall. She is used to being sheltered by her group of friends and doting parents who only pamper her in order to spite each other, a fact of which she is painfully aware. Claire is caught between her parents who seem to use her to get back at each other. Claire eats sushi for lunch. She and Bender kiss at the end of the film, after much conflict between the two. \n\nJohn Bender: (Judd Nelson) The criminal of the group, in detention for pulling a false fire alarm. John Bender starts many of the events throughout the film. While he is hostile at first towards the others in the room with him, he defends Allison against Mr. Vernon (&quot;She doesn't talk, sir.&quot;). Despite Bender's constant needling of the others in detention, they lie to Vernon to protect John after he escaped his solitary confinement (exacted when he allowed himself to get caught in the gymnasium while the others ran for it) and snuck back into the library through a ceiling vent. At home, John is a victim of child abuse, particularly by his father, who administered a cigar burn to his arm for spilling paint in the garage. His antics and smart mouth wind up earning him an extra eight weekends of detention. \n\nAllison Reynolds: (Ally Sheedy) The basket case of the group, she is in detention apparently because she had nothing better to do. She is the most socially isolated and claims to have no friends. Throughout the film she shows signs of kleptomania when stealing various items such as locks and Brian's wallet. She hides her face under her hair and the hood of her parka when frightened, and amuses herself by using her flakes of dandruff as snow on a picture she draws. For the first half of the film she is quiet, save for occasional squeaks of fear and a few random outbursts, but later on she opens up, particularly to Andrew. Allison's lunch consists of a sandwich made with Pixy Stix powder and Cap'n Crunch cereal. She disgusts the others while making and eating it. She is the least hesitant to talk openly about her home life and is not afraid of being different. At home, Allison is a victim of child neglect by her parents, and as a result carries a large bag with her to school every day in case she feels like running away. She claims to be in therapy, but because of her compulsive lying it is unknown if her claim is true (considering that she had previously convinced Claire that she was a nymphomaniac who was sleeping with said therapist). She shares a kiss with Andrew after Claire gives her a makeover. \n\nBrian Johnson: (Anthony Michael Hall) The &quot;brain&quot; of the group, who is in detention for bringing a flare gun to school. At home, Brian is pressured by his parents to be a perfect academic. Brian's younger sister is being raised to be exactly like her mother. Every grade has to be an A, regardless of what the subject is. In an effort to get some relief, he takes shop on the mistaken assumption it will be easy. Brian, assigned to create a ceramic elephant lamp that will light when the trunk is pulled, receives an F when the lamp fails to light. In despair, he brings a gun to school with suicidal intent. It turns out to be a flare gun, which goes off in Brian's locker, destroying the locker and the elephant, and landing Brian in Saturday detention. He tries to keep peace in the group. Brian lies about having a girlfriend in Canada to escape ridicule for being a virgin. \n\nPrincipal Richard &quot;Dick&quot; Vernon: (Paul Gleason) The aggravated principal who mainly dislikes Bender because of his smart mouth and threats. In the movie, he is seen reading the private school files, for which Carl the janitor blackmails him $50. Despite this, he bonds with Carl, confessing various fears about the current generation. &quot;Someday these kids are gonna be running the country. This is the thought that wakes me up in the middle of the night.&quot; \n\nCarl Reed: (John Kapelos) The school janitor who tells the kids he is the eyes and ears of the school. He hears all of their conversations. A brief shot at the beginning of the movie reveals he was once voted &quot;Man of the Year&quot; when he attended the high school years before. Although Bender mocks Carl a bit (as he does with everybody), they end the day on a friendly note, Bender mentioning that he'll see him next week. Carl seems, however, to be on friendly terms with Bender from the beginning. \n\n\n\nLanguage: English 5.1\n\nSubs:     English, French, German, Swedish, Danish, Norwegian, Finnish, Czech,\n          Hungarian, Dutch, Polish, Italian, Spanish, Arabic, Croation, Greek,\n          Hebrew, Portuguese, Turkish, Icelandic\n\nAspect Ratio: 1.78:1\nWidescreen 16:9\nPAL\n\n","torrent":{"xt":"urn:btih:95127f1ac4aeff3cbbabf73114df0edaa9d8f5ad","amp;dn":"The+Breakfast+Club++%281985%29++DVD-R++PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95127f1ac4aeff3cbbabf73114df0edaa9d8f5ad","infoHashBuffer":{"type":"Buffer","data":[149,18,127,26,196,174,255,60,187,171,247,49,20,223,14,218,169,216,245,173]},"announce":[],"urlList":[]}}