{"title":"Grind.wmv","uid":4993722,"size":847597669,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:955715848aafec66280f123cf4668cc85359a197&amp;dn=Grind.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"[psp]","files":1,"time":1247171730,"description":"While the rest of his high school graduating class is heading to the same old grind of college, skateboarder Eric Rivers and his best friends, Dustin, a goal-oriented workaholic, and misfit slacker Matt have one last summer roadtrip together to follow their dream of getting noticed by the professional skateboarding world--and getting paid to skate. When skating legend Jimmy Wilson's skate demo tour hits town, the boys figure that as soon as he sees their fierce tricks, he'll sign them up for his renowned skate team immediately, right? Unfortunately, the guys are intercepted by Jimmy's road manager and they can't get their foot in the door, much less their boards. But they do get some free advice: keep skating, stay true to yourself, and stay in the game--if you're good, you'll get noticed. Following their dream-- and Jimmy's national tour--Eric, Dustin and Matt start their own skate team, reluctantly sponsored by Dustin and his college fund. After recruiting laid-back ladies man Sweet Lou to join their crew and provide the wheels for their tour, team Super Duper launches the ride of their lives in an outrageous road trip from Chi-town to Santa Monica. The professional scene doesn't exactly welcome nobody skaters, but these outsiders stick together through extreme misadventures. In their quest to go pro, they meet professional vert skating champions Bucky Lasek, Bob Burnquist and Pierre Luc Gagnon, skate pro Bam Margera and his crew Preston Lacy, Ehren Danger McGhehey and Jason Wee Man AcuÃƒÂ±a, as well as sexy skate chick Jamie as they grind handrails across America and force the skateboarding world to give 'em a piece of the action","torrent":{"xt":"urn:btih:955715848aafec66280f123cf4668cc85359a197","amp;dn":"Grind.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"955715848aafec66280f123cf4668cc85359a197","infoHashBuffer":{"type":"Buffer","data":[149,87,21,132,138,175,236,102,40,15,18,60,244,102,140,200,83,89,161,151]},"announce":[],"urlList":[]}}