{"title":"Belltech Photo Editor Max 2.0-serial incl","uid":5004846,"size":2528329,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:955994d80a6396871a3712c534546b793ad58739&amp;dn=Belltech+Photo+Editor+Max+2.0-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jmb2012","files":2,"time":1247677471,"description":"Belltech Photo Editor Max 2.0 is a professional quality image edit program for Windows. Edit images in several ways, apply effects to enhance communication and share easily. Put text, lines, arrows, translucent shapes to illustrate your ideas easily and effectively. Save your work in popular image formats (jpg, gif, bmp, png) or email it or paste to your presentations, manuals, marketing materials, web pages. \n\n  Product Highlights:\n\n    * Professional image editing: You can also use this application for professional image editing. Open your image, adjust brightness/contrast, resize, rotate, flip or apply effects like blur, sharpen, emboss and more.\n    * Put text, balloons, shapes to convey the message: Put text with any font and color. Rotate the text or apply transparency to text. Add any rectangle, circle, freehand shape and filled colors ... opaque or translucent. Add stamp or callout shape to express effectively.\n    * Use high-lighter, arrow to pin-point: Use the highlighter tool button to highlight any area of your image. Place arrows, lines to pin-point the area of interest, or use eraser to remove any sensitive information.\n    * Amazing Edge Effects: You can add spectacular edge effects to your photo. Add torn edge, saw edge, shark edge, wave edge, beveled edge and more. These edge effects bring professional look to your graphics and a good idea to use them in presentations, web pages etc.\n    * Apply shadow for professional presentation: You can apply real-world shadow to your image. Also you can choose your shadow color, shadow size or background color. Simple to use yet so powerful!\n    * Screen Capture too: You can capture anything that shows up in your PC screen with Capture menu. You don't need to limit your capture with a rectangular area. Capture any polygonal region, circular area or any freehand region.\n\nSystem Requirements:\n-Windows Vista/XP/98/ME/2000/NT/2003\n-About 10MB of hard-disk space \n","torrent":{"xt":"urn:btih:955994d80a6396871a3712c534546b793ad58739","amp;dn":"Belltech+Photo+Editor+Max+2.0-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"955994d80a6396871a3712c534546b793ad58739","infoHashBuffer":{"type":"Buffer","data":[149,89,148,216,10,99,150,135,26,55,18,197,52,84,107,121,58,213,135,57]},"announce":[],"urlList":[]}}