{"title":"Coast to Coast AM - Sep 30 2009 - Underground Bases","uid":5108394,"size":55526201,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:95b4ddff5a667bce7b1c6d5bba31492974678fb3&amp;dn=Coast+to+Coast+AM+-+Sep+30+2009+-+Underground+Bases&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1254528770,"description":"Underground Bases\n\nDate: 09-30-09\nHost: George Noory\nGuests: Richard Sauder, Robert Hastings\n\nAuthor Richard Sauder presented some of his long-standing research into the many underground bases that are all over the world. While his focus of study is mainly in the United States, he said countries such as China, Russia, England, Australia, Saudi Arabia, and Israel also have such facilities. Examples of underground bases in North America include the Cheyenne Mountain facility associated with NORAD, Thunder Bay in Canada run by NATO, and a complex in suburban Maryland. The White House, itself, has some 17 levels underground, a witness reported to him.\n\nAccording to mining documents, it's feasible to sink a shaft as far down as two miles, and then drive a tunnel out from the shaft. Sauder suggested that the US Naval facility at China Lake may have used such technology in building a submarine base there. He believes Area 51 and other military complexes may house recovered alien craft in their subterranean chambers. Some underground facilities have huge cavernous spaces such as 600 ft. wide and 1100 ft. tall, but you'd never know they are there walking on the ground over them, he added.\n\nSauder contends there could be a secret space program, and he cited R &amp; D reports done at Los Alamos on how to use machines to make tunnels on the Moon-- described as &quot;cutting through rock like butter.&quot; There's also documentation on nuclear-powered tunneling machines. Anti-gravity research documents seem to dry up in the 1960s, but he suspects this technology just went classified, and it could be part of the clandestine space program. Sauder also noted there are many unsolved disappearances of citizens-- some of these people might have been taken to underground facilities and used as guinea pigs for secretive cloning and genetic experiments, he said.\nRoswell Revelations\n\nLast hour guest, UFO researcher Robert Hastings reported on his 1998 interview with U.S. Atomic Energy Commission Supervisor Chet Lytle who shared some revelations about the Roswell Incident. In 1953, Lytle encountered the former Roswell base commander, Col. William Blanchard, and Blanchard confessed to him that a crashed ET spaceship had been recovered at Roswell, along with 4 dead alien/humanoid bodies. More here.\n\nWebsite(s):\nkeyholepublishing.com/Sauder.html\nufohastings.com\n\nBook(s):\nUnderground Bases and Tunnels\nUnderwater &amp; Underground Bases\nKundalini Tales\nUFOs and Nukes\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224\t","torrent":{"xt":"urn:btih:95b4ddff5a667bce7b1c6d5bba31492974678fb3","amp;dn":"Coast+to+Coast+AM+-+Sep+30+2009+-+Underground+Bases","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95b4ddff5a667bce7b1c6d5bba31492974678fb3","infoHashBuffer":{"type":"Buffer","data":[149,180,221,255,90,102,123,206,123,28,109,91,186,49,73,41,116,103,143,179]},"announce":[],"urlList":[]}}