{"title":"VueScan 8.5.19.inc Serials","uid":4989949,"size":4843292,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:965c4f7a7fb860d5b1fb184b3c8b9781d4d01c25&amp;dn=VueScan+8.5.19.inc+Serials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Murlok","files":-1,"time":1246986460,"description":"VueScan, the world's most popular scanner software, is used extensively by photographers, home users, scanning services and corporations. VueScan is a scanning program that works with most high-quality flatbed and film scanners to produce scans that have excellent color fidelity and color balance. It is very easy to use, and also has advanced features for restoring faded colors, batch scanning and other features used by professional photographers. VueScan changes nothing on your system, installs nothing in your operating system and all other scanner software will continue to function. VueScan increases your productivity and saves you money. VueScan has advanced scanning options, powerful features, and greatly improves your scans with superior color accuracy and better color balance. VueScan supports more than 700 scanners and 209 digital camera raw files and takes about 5 minutes to download and install.\n\nFeatures:\n\n- Works with 1200 flatbed and film scanners\n- Runs on Mac OS X, Windows and Linux\n- Improves your productivity and quality of scans\n- Has been downloaded more than 5 million times\n- Create raw scan files\n- ICC profiles and color spaces\n- IT8 color calibration\n\nWhat's new in version 8.5.18\n\n* Fixed problem with occasional crashes when changing frames\n* Fixed problem with some networked Canon scanners\n* Fixed problem with long lamp warmup with some Avision and HP scanners\n* If 'Output | Printed size' set to 'Manual', also use for PDF paper size\n\nSomebody fix so BAYIMG working?","torrent":{"xt":"urn:btih:965c4f7a7fb860d5b1fb184b3c8b9781d4d01c25","amp;dn":"VueScan+8.5.19.inc+Serials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"965c4f7a7fb860d5b1fb184b3c8b9781d4d01c25","infoHashBuffer":{"type":"Buffer","data":[150,92,79,122,127,184,96,213,177,251,24,75,60,139,151,129,212,208,28,37]},"announce":[],"urlList":[]}}