{"title":"The Remains of the day NTSC DVD SL multiple Euro languages","uid":5177184,"size":4415679745,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:96c81edcbe58ffb2d643684dc90ffac0ef00850d&amp;dn=The+Remains+of+the+day+NTSC+DVD+SL+multiple+Euro+languages&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mrizzo2","files":-1,"time":1259037176,"description":"By the way, our utorrent station somehow does NOT connect to Azureus clients. (please note)\n\nThis is a re-launch of a torrent from last Christmas.Please download\nthis torrent file instead and seed the files you obtained last year if you\nhappened to have been one of our seeders back then, or wish to seed now. Thanks\n(the only change is an added jpg image of th DVD jacket).\n\nThis is a lovely DVD in NTSC format that has a better selection\nof languages than is offered as a store bought disc.\n\nIncluded are your choice of audio languages in English, French, German,\nSpanish or Italian. English subtitles are included for each if required.\n\nThe Remains of the day speaks to a problem in contemporary society that is\ntrue of England, the land where articulation standards seem the most perfect\nand are certainly supreme in my own view in fact, compared to any other so far\ndeveloped alternatives (if to see such options would have any desirability in\nany event, it escapes me for the present moment as to what that might be). The\nproblem in the picture nonetheless is a serious one, its that of human relating\nin an adequate manner so as to preserve valid emotions and in fact a wellness\nin the form of being that yield the real best quality of life.\n\nMy own political crusade in the area has been an outreach to see that the\nvalues prevalent in related societies in the region especially those of\nGermany, France, Italy and Spain, all in particular might yield a better\nformula for a better outcome in future endeavors to bring such people into\nsocieties where English is adopted for all its supreme benefits without losing\nsight of what remains fundamentally non-dispensable in making the transition\nmeaningful, worthwhile, desirable and in the end certainly fruitful.\n\nThere can never be an equivalent to the contribution that the British have made\nto the world in the area of decorum and the trappings of civilized discourse.\nWe are to never lose these benefits or anarchy is the certain result. that\nsaid, we must retain our full functioning as we come to learn what benefits\nthere are to be gained, in a manner as to stay within our own sense of what is\nagain, most meaningful personally, each to his own, that come from such related\ncultures (closely) as I make reference to here, and for whom the producers have\nprovided audio support on the PAL version of the DVD disc.\n\nEmma Thompson and Anthony Hopkins remain in my own mind &quot;the best of British&quot;\nin what they are as individuals and in this respect I am glad to see that it is\nthey that tell the story here.\n\nMichael Rizzo Chessman\nmoviesbyrizzo.info","torrent":{"xt":"urn:btih:96c81edcbe58ffb2d643684dc90ffac0ef00850d","amp;dn":"The+Remains+of+the+day+NTSC+DVD+SL+multiple+Euro+languages","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96c81edcbe58ffb2d643684dc90ffac0ef00850d","infoHashBuffer":{"type":"Buffer","data":[150,200,30,220,190,88,255,178,214,67,104,77,201,15,250,192,239,0,133,13]},"announce":[],"urlList":[]}}