{"title":"SimCity 2000 Theme Pack","uid":5195136,"size":1266620,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9719b764181f943d35607816889527ece822a77a&amp;dn=SimCity+2000+Theme+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"goriya2","files":2,"time":1259887080,"description":"For Microsoft Plus! Pack owners:\nThe SimCity 2000 Theme Pack Installation Wizard will automatically copy\nthe SimCity 2000 Theme files into the subdirectory that contains your \ncurrent Plus! Pack Theme files.  Once the SimCity 2000 Theme Pack has \nbeen installed, 3 new themes will become available in the Desktop \nThemes manager: SimCity 2000 Residential, SimCity 2000 Commercial, and\nSimCity 2000 Industrial. Each Theme has it's own wallpaper, font &amp; \ncolor scheme, font &amp; windows size settings, icons, and cursors.  The \nscreen saver and sounds are identical for all 3 themes.\n\nFor Microsoft Windows 95 without the Microsoft Plus! Pack:\nIf you do not have the Microsoft Plus! Pack installed, you can still \nuse the SimCity 2000 Theme Pack. The Installation Wizard will copy the\nfiles into the standard locations for cursors, bitmaps, sounds, and \nscreen savers and will add registry entries allowing you to easily call\nup the various Schemes.  For Sounds: Open the Sounds Control Panel. In\nthe Sounds Properties window, select the SimCity 2000 Sound Scheme. For\nCursors: Open the Mouse Control Panel. In the Mouse Properties, select \nthe Pointers tab. In the Pointers page, under Scheme, select SimCity \n2000 Cursor Scheme.  For the Desktop: Right-click on any open area of \nthe desktop and select Properties from the menu that pops up. First, \nselect the Background tab. The SimCity 2000 Theme Pack will have \ninstalled 3 new Wallpaper bitmaps, SimCity 2000 Commercial, SimCity \n2000 Residential, and SimCity 2000 Industrial. Select the bitmap you \nwish to use and select the Tile option immediately under the Wallpaper\nselect box.  Next, select the Screen Saver tab. A new screen saver will\nhave been added called The Mad Zoner. This is the SimCity 2000 screen \nsaver. With The Mad Zoner selected, clicking on the Settings button \nwill allow you to change the speed, tile size, and disaster frequency \nfor the screen saver as well as importing tile sets created by the \nUrban Renewal Kit.  Next, select the Appearance tab. In the Scheme \nselector, three new Schemes (SimCity 2000 Residential, SimCity 2000\nCommercial, and SimCity 2000 Industrial). Select the Scheme you wish\nto use and the font settings and colors will be changed to reflect that\nscheme.\n\nThis product is inspired by the award winning Maxis simulation, SimCity\n2000.\n","torrent":{"xt":"urn:btih:9719b764181f943d35607816889527ece822a77a","amp;dn":"SimCity+2000+Theme+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9719b764181f943d35607816889527ece822a77a","infoHashBuffer":{"type":"Buffer","data":[151,25,183,100,24,31,148,61,53,96,120,22,136,149,39,236,232,34,167,122]},"announce":[],"urlList":[]}}