{"title":"Close-Defeat of Spanish Armada(victory of Protestantism over pap","uid":4991774,"size":3531987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97fffc1105ece785169e4338d2d7f9b007c33601&amp;dn=Close-Defeat+of+Spanish+Armada%28victory+of+Protestantism+over+pap&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"red_gonzo","files":1,"time":1247084682,"description":"This is Albert Close's amazing booklet Defeat of the Spanish Armada (1987) which recounts the fateful events at the end of 16th century when the English navy would defeat the &quot;Armada Invencible&quot; or the Spanish Armada. The defeat of Spanish Armada is one of the major turning points in the history of Europe if not the world. Perhaps you may have wondered what would have happened if the Armada would have reached the shores of Britain and eventually invaded the mainland. Behind the Spaniards of the time was the tyrannical regime of papacy which would have surely suppressed any sign of Protestantism that not only had full support of British monarchy but has gained solid ground in the New world as well. It is this simple fact that this booklet turns to explore in order to achieve a remembrance of the events that would later enable the American Revolution to fully take place and further solidify the Protestant ideal in the whole world. The pope from Rome pope sent the Spanish armada to destroy Protestant England but destiny would have it otherwise. Was the hand of god involved in the defeat and destruction of the largest fleet to ever sail the oceans? Find out of the true importance of this defeat. 50 pages, some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:97fffc1105ece785169e4338d2d7f9b007c33601","amp;dn":"Close-Defeat+of+Spanish+Armada%28victory+of+Protestantism+over+pap","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97fffc1105ece785169e4338d2d7f9b007c33601","infoHashBuffer":{"type":"Buffer","data":[151,255,252,17,5,236,231,133,22,158,67,56,210,215,249,176,7,195,54,1]},"announce":[],"urlList":[]}}