{"title":"Efofex.FX.Stat.v2.002.8.Cracked.HAPPY.9TH.BIRTHDAY-EAT","uid":5195458,"size":8654870,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:980688c46746fb9f22f0f7ed9b81368f68e4c857&amp;dn=Efofex.FX.Stat.v2.002.8.Cracked.HAPPY.9TH.BIRTHDAY-EAT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TvTeam","files":5,"time":1259901738,"description":"SINCE 2000       \n                                                      \n                            E A T  P R E S E N T S      \n\n             Efofex.FX.Stat.v2.002.8.Cracked.HAPPY.9TH.BIRTHDAY-EAT        \n\n\n\n                                                \n                                                            \n                                                \n                RELEASE  INFO              \n                                                        \n                                                          \n                                                          \n                                                 \n                                                    \n                                                          \n                                                              \n                                                                    \n                                                                      \n                                                                      \n      SUPPLIER ....: TEAM EAT                                           \n      PROG TYPE ...: APPLICATION                                        \n       LANGUAGE ....: ENGLISH                                             \n        RELEASE DATE.: 2009-12-04                                           \n                                                                            \n        CRACKER ......: TEAM EAT                                            \n         PROTECTION ...: DEMO-LIMITS                                          \n         DIFFICULTY ...: GUESS!                                               \n                                                                              \n         PACKAGER ....: TEAM EAT                                              \n         FORMAT ......: ZIP/RAR                                               \n         ARCHIVE NAME.: eatfst2a.zip                                          \n         No OF DISKS .: [XX/02]                                               \n                                                                              \n         REQUIREMENTS .: Win9x/ME/2000/XP/Vista                               \n         PRICE ........: 65.00 AUD                                            \n         WEBSITE.......: http://www.efofex.com                                \n                                                                              \n                                                                            \n                                                                          \n                                                           \n                                                       \n                                              \n                                  \n          \n                       \n                                         \n                                                    \n                                              \n                                             \n                                                   \n                                                             \n\n\n                                                \n                                                            \n                                                \n                RELEASE  NOTES             \n                                                        \n                                                          \n                                                          \n                                                 \n                                                    \n                                                          \n                                                              \n                                                                    \n                                                                      \n                                                                      \n                                                                          \n                                                                        \n                                                                          \n                                                                            \n             Since 1989, Efofex has been producing tools that                 \n             save mathematics and science teachers time. If you               \n             need to draw high quality mathematical diagrams,                 \n             produce mathematical, chemical and physical                      \n             equations as quickly as possible or provide high                 \n             powered, but simple to use tools to mathematics                  \n             students - we have a tool for you.                               \n                                                                              \n             FX Chem makes typing chemical equations almost as                \n             easy as typing your name. Certainly, typing chemical             \n             equations isn't much fun. Superscripts, subscripts,              \n             italics and arrows are all tedious to produce and                \n             you could be doing something more enjoyable with                 \n             your time. FX Chem lets you do that. With FX Chem,               \n             you just type the information and FX Chem does the               \n             formatting for you. FX Chem understands enough about             \n             chemistry to recognise the various components of a               \n             chemical equation and puts them in the right place               \n             for you.                                                         \n                                                                              \n             FX ChemStruct makes drawing chemical structures an               \n             easy task. Chemical structures are extremely                     \n             difficult to draw using standard drawing tools and               \n             even specialised tools can be slow and cumbersome.               \n             What teachers need is a quick way of drawing                     \n             chemical structures - FX ChemStruct. All sorts of                \n             chemical structures and equations are possible. Just             \n             type the structure you want, select the display                  \n             option you require and a few clicks later you will               \n             have publication quality diagrams for your document.             \n             No &quot;drawing&quot; is required.                                        \n                                                                              \n             FX Equation is simply the fastest way to produce                 \n             mathematical and scientific equations. It provides               \n             an equation creation environment that really is                  \n             &quot;Astoundingly Quick&quot;. FX Equation 4 adds automatic               \n             vertical alignment of equals signs and a high speed              \n             toolbar entry system that can speed up entry of more             \n             complicated equations. FX Equation also adds short               \n             division signs, &quot;fill in the blank&quot; boxes,                       \n             combinations, permutations, arcs, highlighted lines              \n             and an on-screen keyboard for use with interactive               \n             whiteboards. To use FX Equation, you just type the               \n             equation. FX Equation looks at what you have typed               \n             and puts everything in the right place. You never                \n             have to touch the mouse.                                         \n                                                                              \n             FX Draw 3 can be used as a drawing tool for                      \n             teachers. It can be used as a demonstration tool                 \n             with a data projector. It can be used with                       \n             interactive whiteboards to provide a mathematically              \n             aware drawing surface. It can be used directly with              \n             students to provide a dynamic learning environment               \n             where they can easily and interactively investigate              \n             most aspects of mathematics. FX Draw 3 is the most               \n             useful piece of software a mathematics teacher or                \n             student can have on their computer.                              \n                                                                              \n             FX Graph makes powerful graphing dead simple. Most               \n             graphing packages offer powerful features but they               \n             are difficult to learn, difficult to teach and                   \n             difficult to use. Many schools spend more time                   \n             teaching students how to use the program rather than             \n             actually using it. FX Graph is different - it is                 \n             dead simple. So simple that secondary students will              \n             be using it to solve problems within minutes of                  \n             first seeing it.                                                 \n                                                                              \n             FX Stat 2 helps you interact with your data. FX Stat             \n             is a statistics program designed for secondary                   \n             school teachers and students. Just what you need,                \n             with nothing extra. It is easy to use, powerful and              \n             does things the way you want them done. FX Stat                  \n             creates a powerful, dynamic statistical environment              \n             for the exploration of data in all of its forms.                 \n             Students and teachers will love the ability to                   \n             produce high-quality statistically correct graphics              \n             for use in tests, examinations, worksheets and                   \n             assignments.                                                     \n                                                                            \n                                                                            \n                                                                          \n                                                           \n                                                       \n                                              \n                                  \n          \n                       \n                                         \n                              COMMENTS              \n                                              \n                                             \n                                                   \n                                                              \n                                                                  \n              Do NOT distribute this release outside of the scene   \n                       Keep the scene alive and secure!              \n                                                                      \n                       All good progs start as freeware,                      \n                         then things get worse ... ;-)                        \n\n                                                                   \n                                                             \n                                                   \n                                            \n                                          \n                                            \n                                           \n                                                \n                                                            \n\n\n\n\n                                                \n                                                            \n                                                \n              INSTALLATION NOTES           \n                                                        \n                                                          \n                                                          \n                                                  \n                                                    \n                                                          \n                                                              \n                               `TLB'                                \n                       Try it, Like it, Buy it!                       \n                                                                      \n                                                                          \n                                                                        \n                                                                          \n                                                                          \n             1. Unpack and install.                                           \n             2. Copy the included file to the installed folder.               \n                                                                              \n             That's all... Enjoy! ;-)                                         \n                                                                              \n      ___________________________________________________________________     \n                                                                              \n      Always remember to block applications (or go off line) from calling     \n      home 'during install'. Once installed, disable 'check for automatic     \n      updates' option if available, so that you don't get it blacklisted.     \n                                                                            \n                                                                          \n                                                           \n                                                       \n                                              \n                                  \n          \n                       \n                                         \n                                                    \n                                              \n                                             \n                                                   \n                                                               \n                                                                     \n                                                                       \n                                                                        \n                                                                      \n                                                                \n                         EAT  CONTACT                         \n                                                          \n                                                            \n                                                                    \n                                                                      \n                                                                      \n                                                                        \n                                                                      \n        EAT is a closed group. We would consider only:                \n                                                                      \n         Excellent reverse-engineers                                 \n         Experienced coders/scripters                                \n         Supplier of quality software who can do so on a             \n           frequent basis (retail date not older then 6 months)         \n                                                                          \n          We do *NOT* want...                                             \n            Distros, Shells, etc                                           \n           Carders &lt;You aren't what the scene is &amp; bring even more       \n              security risk&gt;                                                  \n            Couriers                                                       \n                                                                              \n                                                                            \n                                                                          \n                                                           \n                                                       \n                                              \n                                  \n          \n                       \n                                         \n                                                    \n                                              \n                                             \n                                                   \n\n                                                \n                                                            \n                                                \n                  EAT  NEWS                \n                                                        \n                                                          \n                                                          \n                                                  \n                                                    \n                                                          \n                                                              \n                                                                    \n                                                                      \n                                                                      \n                                                                          \n                                                                        \n                                                                          \n                                                                          \n                                                                              \n                                                                              \n                          HAPPY 9TH BIRTHDAY TEAM EAT!                        \n           It's great to be back together and active after our hiatus.        \n           We love the scene, ownage, the race, and the competition.          \n           Our goal is always the highest quality releases of software        \n           that we actually use. We are, and always will be, a small          \n           tight group of friends respectful of every member.                 \n                                                                              \n                                                                            \n                                                                          \n                                                           \n                                                       \n                                              \n                                  \n          \n                       \n                                           \n                                                            \n\n                                                \n                                                            \n                                                \n                  GREETINGS                \n                                                        \n                                                          \n                                                          \n                                                  \n                                                    \n                                                          \n                                                              \n                                                                    \n                                                                      \n                                                                      \n                                                                          \n                                                                        \n                                                                          \n                                                                          \n                                                                              \n           Greets to all friends, to those who have always have               \n           supported us, and to those that contribute to The Scene            \n           in a positive and secure way. Also to:                             \n                                                                              \n           ACME ALG0RITHM B2R CRD CRO diGERATi HS iPWNPDA LND LZ0             \n                  OUTLAWS PERPLEX RBS RECOiL SAG SOS VACE                     \n                                                                              \n           And as always our hearts and greets goes out to our past           \n           members that have retired from The Scene.                          \n                                                                              \n                                                                            \n                                                             \n                                                   \n                                               \n                                         \n                                       \n                                     \n                                   \n                                \n                            \n                            \n                           \n                             \n                             \n                       \n                           \n                          \n                   \n                  \n                     \n                   \n                       \n              \n            \n             \n                 \n              \n                      \n                         \n                         \n                       \n                               \n                          \n                    n0!\n                              \n                               \n                                 \n                                              \n                                                       \n                   NFO LAST UPDATE ON 2009","torrent":{"xt":"urn:btih:980688c46746fb9f22f0f7ed9b81368f68e4c857","amp;dn":"Efofex.FX.Stat.v2.002.8.Cracked.HAPPY.9TH.BIRTHDAY-EAT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"980688c46746fb9f22f0f7ed9b81368f68e4c857","infoHashBuffer":{"type":"Buffer","data":[152,6,136,196,103,70,251,159,34,240,247,237,155,129,54,143,104,228,200,87]},"announce":[],"urlList":[]}}