{"title":"Batch Picture Protector 1.4 Portable","uid":5157572,"size":4087343,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:99ac7aa762d8beabe67a62fbf62fff30b0ec60c7&amp;dn=Batch+Picture+Protector+1.4+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoExcuses","files":5,"time":1257947943,"description":"Batch Picture Protector 1.4 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Activation are included. This is just the GiveAwayOfTheDay.com program for today. Get it while it lasts. And after it use the Reg.reg file...\n\n\nBatch Picture Protector is a powerful and easy-to-use batch image watermarking tool. It protects your digital images and artwork by adding professional transparent watermarks that combine text, illustrations and graphics. When used in conjunction with your favorite image editing software, a watermark can even contain your copyright, website URL or logo image. Batch Picture Protector is the best way to achieve faster and simpler image protection.\n\nThis watermarking software is particularly useful to designers, artists and banner makers who send artwork proofs to customers for evaluation. Those who publish images on internet web galleries can also protect image copyright using this watermarking software. By using the software, digital photos can be effectively protected from unauthorized use. This photo watermark software places permanent watermarks that cannot be removed.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.giveawayoftheday.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.giveawayoftheday.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.softorbits.com/batch-picture-watermark/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.softorbits.com/batch-picture-watermark/index.html&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you like it and it's useful for you, show your support buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:99ac7aa762d8beabe67a62fbf62fff30b0ec60c7","amp;dn":"Batch+Picture+Protector+1.4+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99ac7aa762d8beabe67a62fbf62fff30b0ec60c7","infoHashBuffer":{"type":"Buffer","data":[153,172,122,167,98,216,190,171,230,122,98,251,246,47,255,48,176,236,96,199]},"announce":[],"urlList":[]}}