{"title":"Nederwiet de moevie","uid":6345344,"size":910642934,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9a3cae75c461361cc0b120e68d67bdf07fa0e852&amp;dn=Nederwiet+de+moevie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Reg-Edit","files":1,"time":1303817827,"description":"Voor wie hem gemist heeft...\n\nMaandag 25 april, 20.55 uur zendt de NCRV op Nederland 2 Nederwiet de moevie uit. Een film van Maaik Krijgsman en Hans Pool over het kat-en-muis-spel van kwekers, coffeeshophouders, politie en rechters rond de achterdeur van de coffeeshop. De Teledoc, een productie van IDTV Docs en de NCRV, kreeg financiÃƒÂ«le steun van het CoBO-Fonds en het Filmfonds. Dinsdag 26 april is in De Rode Hoed een debat over het coffeeshopbeleid.\n \nIn Nederland mag wat tot voor kort nergens op de wereld mocht. Blowen. In een coffeeshop. En dan het liefst een joint van Nederwiet.\n \nDe coffeeshop was dertig jaar lang het symbool van Nederlands unieke tolerantie en vrijheid. Maar sinds enkele jaren lijkt de wietbranche zijn onschuld te hebben verloren. Het gedoogbeleid dat de voordeur van de coffeeshop tot een gewone winkeldeur maakt, heeft namelijk niet voorzien in een goede regeling van productie en aanvoer van de handel: de achterdeur.\nEn daarmee staat de coffeeshop feitelijk op de grens van de boven- en de onderwereld.\n \nNederwiet de moevie stapt dÃƒÂ³ÃƒÂ³r de achterdeur van de coffeeshop de onderwereld in. Een wereld waar niets met zekerheid te zeggen valt. Maar waar idealisme en genot het langzaam lijken af te leggen tegen hebzucht en geweld. Het enige wat zeker is, is dat de prijs van Nederwiet blijft stijgen. En dat er dus steeds meer mee te verdienen is. Dat maakt de toestand zorgelijk. De politie zet steeds harder in op het bestrijden van de teelt en probeert de plant letterlijk met wortel en tak uit te roeien. Maar de vraag is of dat niet juist de prijzen opdrijft.\n\nNederwiet de movie is een film van Maaik Krijgsman (See You in Vegas) en Hans Pool (Van Dis in Afrika). De productie van IDTV Docs en NCRV toont het even hilarische als zorgwekkende kat-en-muis-spel dat door kwekers, coffeeshophouders, politie en rechters wordt gespeeld rond de achterdeur van de coffeeshop. Maar waar gaat het eigenlijk om? Een plantje. Veredeld onkruid. En iedereen weet wat het spreekwoord zegt over onkruid.","torrent":{"xt":"urn:btih:9a3cae75c461361cc0b120e68d67bdf07fa0e852","amp;dn":"Nederwiet+de+moevie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a3cae75c461361cc0b120e68d67bdf07fa0e852","infoHashBuffer":{"type":"Buffer","data":[154,60,174,117,196,97,54,28,192,177,32,230,141,103,189,240,127,160,232,82]},"announce":[],"urlList":[]}}