{"title":"Kathie Lee Gifford - Sentimental","uid":5144644,"size":64631801,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9be61ee052237267ee301b29b650d37749134b55&amp;dn=Kathie+Lee+Gifford+-+Sentimental&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bozo57","files":-1,"time":1257156799,"description":" 5.0 out of 5 stars  Kathie Lee's finest, January 25, 2003\nBy \tHoc Stercus &quot;beeper99&quot; (Hudson, NY USA) - See all my reviews\n  \nThis is one of the few albums I've heard where practically every track is a delight from start to finish. It's like a mint julep on a hot summer's day ---- pleasant, refreshing, and smooth. Every song on this CD has been recorded many times before, and by the pantheon of great American singers. You won't find any undiscovered musical nuggets here. What makes this album a standout, however, is that everything on it is just right: Mrs. Gifford's singing, the first-rate backup arrangements, and the quality of the recorded sound. If I had to single out one special aspect that particularly appeals to me, it would be Kathie Lee's understated delivery. Instead of an obvious &quot;belt-'em-out&quot; performance, she goes for a more relaxed presentation, as if she were gently singing to her kids before bedtime. While this approach may not work that well in a live performance, it invites the listener to repeated spins of this very special CD.\n","torrent":{"xt":"urn:btih:9be61ee052237267ee301b29b650d37749134b55","amp;dn":"Kathie+Lee+Gifford+-+Sentimental","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9be61ee052237267ee301b29b650d37749134b55","infoHashBuffer":{"type":"Buffer","data":[155,230,30,224,82,35,114,103,238,48,27,41,182,80,211,119,73,19,75,85]},"announce":[],"urlList":[]}}