{"title":"Windows 7 - All Versions + 7Loader Activation","uid":5178729,"size":4023860966,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9bf96f3b9b6dee074a1398d064126d7927dc0f41&amp;dn=Windows+7+-+All+Versions+%2B+7Loader+Activation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xCoDeRx","files":-1,"time":1259112764,"description":"This is the full retail of Windows 7. It includes all versions:\n\n*Windows 7 Starter 32bit\n\n*Windows 7 Home Basic 32bit &amp; 64 bit\n\n*Windows 7 Home Premium 32bit &amp; 64 bit\n\n*Windows 7 Professional 32bit &amp; 64 bit\n\n*Windows 7 Enterprise 32bit &amp; 64 bit\n\n*Windows 7 Ultimate 32bit &amp; 64 bit\n\n\n-Languages: English and Russian\n\n\nThis torrent also includes the activator needed to activate any version of Windows 7 for a lifetime. You will still be able to receive updates from Microsoft.\n\n\n\n------------------------------------------\nInstallation Instructions (UPGRADING ONLY)\n------------------------------------------\n\n**These Instructions are only for people who want to upgrade from their current OS to Windows 7. This process will NOT delete your entire hard drive, but back up your files and folders just in case.\n\n\n1. Download and unRAR all files included in the torrent.\n\n2. Burn the ISO file using Alcohol 120%, Power ISO, etc.\n\n3. After burn is completed, run the disk and use the upgrade option.\n\n4. From their, you will be able to choose the version of Windows 7 you would like to run.\n\n5. Begin the installation process and wait for it to finish.\n\n(During the installation you will be asked to activate windows. Choose the option &quot;Activate Later&quot;.)\n\n6. Once you have successfully installed Windows 7, reboot into the version you are using and open the 7Loader Release Activator.\n\n7. Choose the brand of machine that you are using so it is able to be installed properly on your computer.\n\n8. Reboot and the installation should be completed. You should have Windows 7 fully activated of whatever version you are running.\n\n**NOTE: To check yourself on the activation, go to Computer, System Properties, and scroll all the way down to the bottom where it will tell you if you have it activated or not.\n\n\n\n------------------------------------\nInstallation Instructions (ADVANCED)\n------------------------------------\n\n**These Instructions are for people who want to completely format their entire hard drive and install Windows 7 with a fresh new start on their files.\n\n\n1. Download and unRAR all files included in the torrent.\n\n2. Burn the ISO file using Alcohol 120%, Power ISO, etc.\n\n3. Once burn is completed, keep the disk in the CD drive and restart your machine.\n\n4. The first few seconds into rebooting, you should see a setup menu option with a hot key to get there (usually F2 or F7). Go into the setup menu by pushing the hot key.\n\n5. In the setup menu, go to the &quot;Boot&quot; Tab and set your 1st boot device to your CD/DVD Drive.\n\n6. Save and reboot and there should be text that comes up that says &quot;Press any key to boot from disk...&quot;\n\n7. Press any key and that installation window should come up within the next minute or so.\n\n8. From there, you are able to choose what version of Windows 7 you want to run.\n\n9. It will also ask you where you want to install Windows 7 (NOTE: If you already have an OS installed that you don't want deleted, I would not recommend this step.) You will be able to format you entire hard drive, thus creating space for the Windows 7 installation.\n\n10. Once you have done that, the installation process should begin. It may take 15 - 30 minutes, depending on which version you are installing.\n\n(During the installation you will be asked to activate windows. Choose the option &quot;Activate Later&quot;.)\n\n11. Once installed, boot into windows 7 and open the 7Loader Release 5 activator.\n\n12. In the activator, choose the brand of machine that you are running so it is able to install properly on your computer.\n\n13. Once you have successfully activated it, restart your machine, and you should have Windows 7 fully activated of whatever version you are running.\n\n\n**NOTE: To check yourself on the activation, go to Computer, System Properties, and scroll all the way down to the bottom where it will tell you if you have it activated or not.\n\n----------------------------------------------------------\nHope everybody enjoys! Please seed as much as possible! :)\n----------------------------------------------------------","torrent":{"xt":"urn:btih:9bf96f3b9b6dee074a1398d064126d7927dc0f41","amp;dn":"Windows+7+-+All+Versions+%2B+7Loader+Activation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bf96f3b9b6dee074a1398d064126d7927dc0f41","infoHashBuffer":{"type":"Buffer","data":[155,249,111,59,155,109,238,7,74,19,152,208,100,18,109,121,39,220,15,65]},"announce":[],"urlList":[]}}