{"title":"iPod touch For Dummies","uid":5148011,"size":14224995,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ce0187ef93e14b0fdae15e3d72566eb112865d2&amp;dn=iPod+touch+For+Dummies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VasiaZozulia","files":-1,"time":1257381697,"description":"The perfect full-color guide to the iPod touch for both Mac and Windows users\n\nYour iPod touch can do so many things. With this full-color guide, you can get hip to all your iPod touch has to offer and take full advantage of the iTunes store and the App Store, as well.\n\nYou'll start by learning how to manage the multi-touch interface and setting up iTunes. Then you'll discover how to connect to the Internet via Wi-Fi, receive and send e-mail, get directions and use maps, play games, download and watch movies, shop for cool new apps at the App Store, and much more.\n\n* Starts with the basics of setting up and using the iPod touch, richly illustrated in full color\n* Covers listening to music, synchronizing your data, working with the calendar, setting up iTunes, and getting online via Wi-Fi\n* Shows how to send and receive e-mail, shop for movies and music at the iTunes Store, browse the Web, share photos, download and watch movies and TV shows, and download apps from the App Store\n* Explains how to use your iPod touch as a portable game console and how to manage your contacts and to-do lists\n* Also covers protecting your information and troubleshooting\n\niPod touch For Dummies helps you make the most of this amazing device that combines a widescreen iPod with touch controls, a portable game console, and a breakthrough Internet device.","torrent":{"xt":"urn:btih:9ce0187ef93e14b0fdae15e3d72566eb112865d2","amp;dn":"iPod+touch+For+Dummies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ce0187ef93e14b0fdae15e3d72566eb112865d2","infoHashBuffer":{"type":"Buffer","data":[156,224,24,126,249,62,20,176,253,174,21,227,215,37,102,235,17,40,101,210]},"announce":[],"urlList":[]}}