{"title":"The.Kingdom.2007.BluRay.480p.H264","uid":6393984,"size":473192420,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9df3fd7ff66d0f682ad6ef0bd0b7c787dca874ce&amp;dn=The.Kingdom.2007.BluRay.480p.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"twentyforty","files":-1,"time":1305455280,"description":"Directed by Peter Berg. \n\nStarring Jamie Foxx, Chris Cooper, Jennifer Garner, Jason Bateman, Ashraf Barhom, \n         Richard Jenkins, Minka Kelly. \n\nAfter a terrorist attack to an American housing compound in Riyadh, Saudi Arabia, where families and the spy Francis Manner are murdered, FBI agent Ronald Fleury blackmails the South Arabian consul to get five days of investigation in the location. He travels with agent Grant Sykes, Janet Mayes and Adam Leavitt to revenge their friend and try to find the responsible for the bombing. The agents find all sorts of difficulties in their investigation, but they are supported by Colonel Faris Al Ghazi that advises the team how to act in a hostile environment.\n\n&quot;The movie deserves full marks for refusing to dumb down its story and make the Saudis appear as little more than window dressing to a big screen American shoot-'em-up. While Jamie Foxx, Jennifer Garner, Chris Cooper and Jason Bateman all get top billing, the real star of this story is Ashraf Barhom who plays Saudi police Col. Al-Ghazi, a man dedicated to his profession, with an acute sense of fair play, protocol and justice. Al-Ghazi, who was at the scene of the initial attack on the compound, initially plays the role of hamstrung go-between relegated to babysitting and restricting the movements of the FBI at the urging of higher-ups. However, thanks to a fortuitous face-to-face between the American &quot;guests&quot; and a Saudi Prince, Al-Ghazi is given free reign to lead the US investigators as they try to uncover the mastermind behind the attack.&quot;\n\nNOTE: Recommended. Actualized by recent events.","torrent":{"xt":"urn:btih:9df3fd7ff66d0f682ad6ef0bd0b7c787dca874ce","amp;dn":"The.Kingdom.2007.BluRay.480p.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9df3fd7ff66d0f682ad6ef0bd0b7c787dca874ce","infoHashBuffer":{"type":"Buffer","data":[157,243,253,127,246,109,15,104,42,214,239,11,208,183,199,135,220,168,116,206]},"announce":[],"urlList":[]}}