{"title":"FULL METAL PANIC FUMOFFU VOL 3","uid":4992231,"size":4383807486,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9e272735a1db558b8b38ad6c1d3e7e50a9949f25&amp;dn=FULL+METAL+PANIC+FUMOFFU+VOL+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mike80219","files":44,"time":1247101653,"description":"Full Metal Panic Fumoffu - Full Metal Fervor! (Vol. 3) (2005)\n\n\nFormat: Animated, Box set, Color, Dolby, DVD-Video, Subtitled, NTSC \nLanguage: English, Japanese \nSubtitles: English \nRun Time: 75 minutes \n\nKaname's friend Kyoko sums up the third set of episodes of the action comedy Full Metal Panic Fumoffu when she observes, &quot;This just keeps getting weirder.&quot; The principal of Jindai High threatens to disband the rugby club unless the players break their 49-year losing streak. Sousuke has to train them for their critical match--with the help of a book of rugby rules (which he doesn't quite grasp) and a volume of Marine-style cursing (which he grasps only too well). Jealousy rears its head during a visit from Captain Teletha &quot;Tessa&quot; Testarosa, Sousuke's Mithril commander in the previous season. Tessa brings military and fan service to Jindai High and the Okutama hot springs, but no one peeks at her or Kaname in the outdoor baths when Sousuke's on duty. Full Metal Fervor can't quite match the previous Full Metal Fracas for take-no-prisoners hilarity, but it's still very funny. (Rated TV PG V: comic violence, nudity, risquÃƒÂ© humor, including real and fake profanity) --Charles Solomon \n\nProduct Description\nWhereas the first Full Metal Panic anime series was a sci-fi drama with flashes of comedy, Fumoffu doesn't even pretend to be serious! Loads of new characters and scenes from the best-selling manga make Full Metal Panic? Fumoffu! A must-have for any anime fan! \n[img]http://ecx.images-amazon.com/images/I/51YR1KZNR6L._SS500_.jpg[/img]\n\n\n\n","torrent":{"xt":"urn:btih:9e272735a1db558b8b38ad6c1d3e7e50a9949f25","amp;dn":"FULL+METAL+PANIC+FUMOFFU+VOL+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e272735a1db558b8b38ad6c1d3e7e50a9949f25","infoHashBuffer":{"type":"Buffer","data":[158,39,39,53,161,219,85,139,139,56,173,108,29,62,126,80,169,148,159,37]},"announce":[],"urlList":[]}}