{"title":"Guerras Santas.(Docu).","uid":5168805,"size":884899344,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9e63bcee2590482bc726add59d3ac8f5b1e08014&amp;dn=Guerras+Santas.%28Docu%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cholo24","files":3,"time":1258569754,"description":"Guerras Santas\n\n1- En el nombre Ala:\nA partir de que Mahoma organizara en Medina en 622 una comunidad de fieles suficientemente fuerte como para unificar toda Arabia, el crecimiento del Islam es imparable. En pocos aÃƒÂ±os conquistan Palestina, Siria y Egipto y un siglo despuÃƒÂ©s llega al Magreb, la PenÃƒÂ­nsula IbÃƒÂ©rica, India, China, Mesopotamia ... A partir del siglo XIII Sumatra, Java e Indonesia abrazan esta religiÃƒÂ³n. Sus relaciones con otras culturas fueron notables en el plano mercantil y con su avance militar propagaron un desarrollo en medicina, arte, arquitectura y astronomÃƒÂ­a.\n\n2- En el nombre Cristo:\nLas Cruzadas surgen como una serie de campaÃƒÂ±as militares - realizadas a peticiÃƒÂ³n del Papado - durante los siglo XI y XIII contra los Turcos y Sarracenos para la conquista de Tierra Santa. Sin embargo, las Cruzadas no fueron una guerra entre la Cristiandad y el Islam, sino mÃƒÂ¡s bien un caÃƒÂ³tico enfrentamiento por el poder y la riqueza que llevaron a cabo gobernantes y reinos por su cuenta. Todo ello provocÃƒÂ³ una matanza de la poblaciÃƒÂ³n civil de JerusalÃƒÂ©n que todavÃƒÂ­a se recuerda hoy en dÃƒÂ­a\n\n3- Cristianos contra cristianos\nLa corrupciÃƒÂ³n, el vicio y un declive general de las normas morales de la Iglesia, fueron las razones que llevaron al monje alemÃƒÂ¡n MartÃƒÂ­n Lutero a inspirar la Reforma protestante. La reacciÃƒÂ³n de la Iglesia fue la Contrarreforma, con la que se produjo una divisiÃƒÂ³n entre catÃƒÂ³licos y reformistas. Este deseo por una forma mejor de cristianismo provocÃƒÂ³ la mayor catÃƒÂ¡strofe que ha asolado Europa: la Guerra de los Treinta AÃƒÂ±os. Durante este periodo, Europa perdiÃƒÂ³ a la mitad de su poblaciÃƒÂ³n. El ÃƒÂºltimo efecto de lo que se describiÃƒÂ³ como Guerras de religiÃƒÂ³n fue imprimir en cultura europea la existencia de una divisiÃƒÂ³n entre la Iglesia y el Estado\n","torrent":{"xt":"urn:btih:9e63bcee2590482bc726add59d3ac8f5b1e08014","amp;dn":"Guerras+Santas.%28Docu%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e63bcee2590482bc726add59d3ac8f5b1e08014","infoHashBuffer":{"type":"Buffer","data":[158,99,188,238,37,144,72,43,199,38,173,213,157,58,200,245,177,224,128,20]},"announce":[],"urlList":[]}}