{"title":"Sanctuary 1x01x02","uid":5105190,"size":730954764,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9e7b9d02dcdf778f8e631cd3ae9752083cf1928c&amp;dn=Sanctuary+1x01x02&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jurimu","files":1,"time":1254272026,"description":"Sanctuary\nTÃƒÂ­tulo Original: Sanctuary\nGÃƒÂ©nero: Ciencia FicciÃƒÂ³n\nPaÃƒÂ­s: USA\nFormato: Color\nDuraciÃƒÂ³n (episodio): 42 min. aprox.\nAÃƒÂ±o (estreno): 2008\nAÃƒÂ±os de emisiÃƒÂ³n: 2008-?\nPÃƒÂ¡gina Web: http://www.scifi.es/sanctuary/\nEstreno en EspaÃƒÂ±a: 23/09/2009\nEstreno en USA: 03/10/2008\nReparto:Amanda Tapping como Dra. Helen Magnus, Robin Dunne como Dr. Will Zimmerman\nEmilie Ullerup como Ashley Magnus, Ryan Robbins como Henry Foss, Agam Darshi como Kate Freelander\nChristopher Heyerdahl como Bigfoot, Mandy May como Sally, Panou como Sylvio Rudd\nKandyse McClure como Meg, Lynda Boyd como Dana Whitcomb, Alex Diakun como Doctor\nJonathon Young como Nikola Tesla, Kirsten Robek como Madre de Will, Kavan Smith como Det. Joe Kavanaugh\nChristine Chatelain como Clara Griffin, Darren Shahlavi como Ennis Camden, R. Nelson Brown como Squid\nPeter Wingfield como Dr. James Watson, Cainan Wiebe como Alexei, Paul McGillion como Wexford\n\nSinopsis: Sanctuary sigue las aventuras de la bella, enigmÃƒÂ¡tica y siempre sorprendente doctora Helen Magnus (Amanda Tapping), su nuevo colaborador, el psiquiatra forense Will Zimmerman (Robin Dunne), y su intrÃƒÂ©pida hija Ashley (Emilie Ullerup). Juntos se dedican a buscar, estudiar y proteger a las extraÃƒÂ±as y a menudo terrorÃƒÂ­ficas criaturas que viven en secreto entre nosotros.\nAunque por lo general estos seres son simplemente considerados como monstruosos productos de nuestra imaginaciÃƒÂ³n o de las pesadillas infantiles, Magnus tiene la prueba de que la naturaleza a veces comete errores y aciertos extraordinarios y de que estos son completamente reales.\nEl equipo formado por Magnus, Will, Ashley y el mago de la tecnologÃƒÂ­a Henry Foss se sirve en cada episodio de su fantÃƒÂ¡stica combinaciÃƒÂ³n de talento, audacia, conocimientos cientÃƒÂ­ficos y tecnologÃƒÂ­a de ÃƒÂºltima generaciÃƒÂ³n para encontrar a las criaturas que merodean por los rincones de nuestra civilizaciÃƒÂ³n y protegernos de aquellas que resultan demasiado peligrosas como para andar sueltas por ahÃƒÂ­...\n","torrent":{"xt":"urn:btih:9e7b9d02dcdf778f8e631cd3ae9752083cf1928c","amp;dn":"Sanctuary+1x01x02","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e7b9d02dcdf778f8e631cd3ae9752083cf1928c","infoHashBuffer":{"type":"Buffer","data":[158,123,157,2,220,223,119,143,142,99,28,211,174,151,82,8,60,241,146,140]},"announce":[],"urlList":[]}}