{"title":"Battle.Slots.Role.Playing.Game.RIP-Unleashed","uid":6357229,"size":303806874,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9eae0965b22266f4a06d2cc8543f58244a0ed9ac&amp;dn=Battle.Slots.Role.Playing.Game.RIP-Unleashed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":33,"time":1304184245,"description":"P R E P A R E  T O  B E  U N L E A S H E D\n\nBattle Slots: Role Playing Game RIP\n\nRelease Date  :  30/04/2011                Protection  :  Activation\nRelease Type  :  RIP 31x10.00MB            Company    :  Phantom EFX\n\nRelease Notes\n\nBattle Slots is a roleplaying game (RPG) with a twist.  Embark on a journ\ney of exploration into the foreign world of Tellus. Formerly a peaceful w\norld, Tellus has been wrought by an evil plaguing the land. Every land ne\neds a hero, and thats where you come in. A map-driven adventure, you wil\nl travel across over 100 unique locations, battling monsters and completi\nng nearly 200 daring quests.\n\nTaking the place of traditional RPG dice or number generators is a custom\nizable, magical slot machine  however there is no gambling.  Battle Slo\nts harnesses the excitement of popular Slot Machine mechanics, progressin\ng your adventure through fantastic gameplay. Spinning the slot machine yi\nelds Magic Points, Attack Points, Experience Points, Gold, and Summons.\n\nMagic Points and Attack Points are used to cast techniques that yield dev\nastation upon monsters throughout the world of Tellus. Experience Points\nallow you to gain levels and boast higher Health, Attack, and Magic Point\ntotals. The Gold earned can be used in the world to upgrade the Academy\nand the Zoo or purchase Runes, Techniques, or Slot Symbols.  When the slo\nt machine pays out a summons, the creature called for will appear and cas\nt its effect.  These summons may stun opponents, deliver gold, or place\nWilds throughout the reels of your slot machine.\n\nTechniques affect combat in a variety of ways.  Some will damage your opp\nonent, others will stun them. Some techniques will allow you to heal your\nself in battle, increase strengths, or become resistant to damage. Slot m\nachine related techniques will offer extra spins or Wilds as you collect\nnew Slot Symbols and Runes.\n\nWith money earned in battle, you can choose to upgrade the buildings in y\nour village hometown to increase the strength of your Allies and expand y\nour Zoo. The beasts kept in your Zoo drastically evolve your experience a\ns they come equipped with unique spells and skills. Who knows, these new\nskills and slot machine customization just might give you the upper-hand\nin the battle to restore peace to Tellus. This is your story.\n\nEveryone you meet, every creature you capture will influence your destiny\n. The question is, will you be able to stand up to the Reels of Fate?\n\nRIPPED: Nothing (intro logos removed, some movies were re-encoded)\n\nInstall Notes\n\n1. Unpack the release with WinRAR or equivalent\n2. Install by running unl-bslo.exe\n3. Start game with battleslots.exe\n4. Enjoy\n\nGame require:\n\nMicrosoft Visual C 2005 Redistributable Package\n &lt;a href=&quot;\nhttp://www.microsoft.com/downloads/en/details.aspx?familyid=32BC1BEE-A3F9&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.microsoft.com/downloads/en/details.aspx?familyid=32BC1BEE-A3F9&lt;/a&gt;\n-4C13-9C99-220B62A191EE&amp;displaylang=en\n\nRemember to support quality games\n\nUnleashed salutes all friends of the family, contacts and competition\n\n&quot; Prepare to be Unleashed &quot;\n","torrent":{"xt":"urn:btih:9eae0965b22266f4a06d2cc8543f58244a0ed9ac","amp;dn":"Battle.Slots.Role.Playing.Game.RIP-Unleashed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eae0965b22266f4a06d2cc8543f58244a0ed9ac","infoHashBuffer":{"type":"Buffer","data":[158,174,9,101,178,34,102,244,160,109,44,200,84,63,88,36,74,14,217,172]},"announce":[],"urlList":[]}}