{"title":"Black ops config editor","uid":6364457,"size":75639,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9fb18ea889acce74eb862defe3ef4741cd6e3ac3&amp;dn=Black+ops+config+editor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"freeware-uploads","files":-1,"time":1304456929,"description":"\n-----&gt; IF YOU EXPERIENCE LAG OR FPS DROPS THAN USE THIS PROGRAM TO TWEAK YOUR BLACK OPS TO RUN SMOOTHER &lt;-----\n\n\n----------------------------------------------\n\nAnyway, some settings that may be of importance are:\n\nr_multiGpu\n\nThis should only be enabled if you have multiple graphics cards or a graphics card with multiple GPUs. If you don't have multiple GPUs, don't know what this means, or are having issues with your MultiGPU solution, please set this to &quot;0&quot;.\n\nr_multithreaded_device\n\nThis setting should be enabled for EVERYBODY as the minimum requirements for Black Ops clearly states that you need a multithreaded (multicore) CPU to run the game. However, some people have noticed that by setting this to &quot;0&quot; some of the skipping lag is relieved. Test this out only as a last resort.\n\nr_vsync\n\nVSync prevents screen tearing. If you don't know what that is, just set it to &quot;0&quot; because you probably don't care anyway. Otherwise, VSync usually doesn't have any negative performance issues with today's graphics cards. However, there may be a few performance issues linked to VSync with the current release of Black Ops. Try setting this to &quot;0&quot; for compatibility.\n\nr_blur_allowed\n\nThis setting enables Blur shader effects. If you have a strong shader card, this setting may be negligible. Otherwise, just go ahead and set this to &quot;0&quot;.\n\nr_distortion\n\nThis setting enables Distortion shader effects. If you have a strong shader card, this setting may be negligible. Otherwise, just go ahead and set this to &quot;0&quot;.\n\nr_dof_enable\n\nThis setting enables Depth of Field shader effects. If you have a strong shader card, this setting may be negligible. Otherwise, just go ahead and set this to &quot;0&quot;.\n\nr_glow_allowed\n\nThis setting enables Glow (HDR?) shader effects. Normally, this should have a negligible performance impact. HOWEVER, this setting seems to be buggy! Performance improved DRAMATICALLY when I set this option to &quot;0&quot;.\n\nrate\n\nRate is the rate at which the client sends packets to the server. If you set this too low, below 10000 or so, you run the risk of sending insufficient data to the server and lagging out. Set this too high, above 50000 or so, and you run the risk of flooding your connection to the server. This setting should be adjusted according to your connection speed and may take some fine tuning.\n\ncl_maxpackets\n\nThis setting controls how many packets the client will hold to ensure packet transmission. If you set this setting to low, below 20 or so, then you run the risk of being disconnected prematurely. If you set this setting too high, above 150 or so, then you run the risk of continually resending redundant data and lowering your ping (or worse, getting choked). This setting is very hard to tune because it depends on so many factors beyond your own connection. Most people have found setting this to 100 is a good compromise for most servers.\n\n\n----------------------------------------------\n\n\nSome further technical notes:\n\nIt seems that the issues plaguing PC Multiplayer are two fold.\n\nFirst of all, poor CPU management is causing bottlenecks, especially with what seems to be thread context switching. This causes the system to hang intermentently as data is switched between the cores of your CPU.\n\nNext is poor management of the netcode. The netcode must be shared with the game engine in such a way that when the CPU hangs, no data is being transmitted to or received from the server, causing packets to timeout in both directions and LOADS of redundant data being transferred between all players.\n\nSo fixing the lag on your computer should help to alleviate the load for everybody else on the server and give all around better game play.\n\nAlso note that the above is just observation and speculation from an experienced programmer. I have, obviously, not seen the source to Black Ops, but because of how the application behaves, these are my most educated guesses.\n\nTry what I mentioned above and let me know if you find anything else that is of importance to the current state of multiplayer performance.\n\nGood Luck and Good Fragging!\n\n","torrent":{"xt":"urn:btih:9fb18ea889acce74eb862defe3ef4741cd6e3ac3","amp;dn":"Black+ops+config+editor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fb18ea889acce74eb862defe3ef4741cd6e3ac3","infoHashBuffer":{"type":"Buffer","data":[159,177,142,168,137,172,206,116,235,134,45,239,227,239,71,65,205,110,58,195]},"announce":[],"urlList":[]}}