{"title":"Aviosoft DVD X Player 5.4 Standard [ak]","uid":6397245,"size":20905262,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a017b55c91144433a0ec1a5294524e699bfac4cb&amp;dn=Aviosoft+DVD+X+Player+5.4+Standard+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1305552971,"description":"Aviosoft DVD X Player 5.4 Standard\n\n\nDVD X Player, your best DVD player on PC, playbacks any DVDs by unlocking all DVD region codes such as Region 1, Region 2, Region 3 etc.. DVD X Player supports recording DVD movie and converting recorded video files to MPEG, ASF, AVI format. Supported portable devices are Apple iPod, iPhone, Sony PSP, Zune, BlackBerry, Zen, Smart Phone, PMP etc.. DVD X Player provides superior video and audio quality, image capture, bookmark, etc..\n\nDVD Region Free\nDVD X Player plays all regions' DVD on all DVD drives (except the Matshita DVD-RAM series, Sony VAIO serials and Toshiba Satellite series) even if you have changed the region code 5 times.\n\nRecord DVD movies\nDVD X Player supports recording DVD and converting it to various popular movie files for expanding multimedia entertainment on most popular portable devices such as Apple iPod, iPhone, Sony PSP, Zune, BlackBerry, Zen, Smart Phone, PMP etc..\n\nIntegrate all functions\nDVD X Player provides superior video and audio (Dolby &amp; DTS) qualities, DVD record , image and DV playback , image capture and bookmark, etc.\n\nOther Features\n- Play DVD/VCD/CD/DivX/XviD/MPEG-4/QuickTime/Real/MacroMedia Flash.\n- DVD X Player supports High-Definition Video (HD-Video)\n- Support operation-free through which you can skip the FBI warning easily.\n- Smart Stretch lets you enjoy any movie with 16:9 aspect ratio on any screen mode, without distortion.\n- Support Dolby Digital 5.1(AC-3), Digital Theater System (DTS), Dolby Surround, multi-channel decoding up to 7.1 channels.\n- Visualization makes DVD X Player display multi-colored shapes and patterns that change in harmony with the audio track being played.\n- Desktop Video enables you to watch DVD and work simultaneously.\n- The built-in converter converts recorded video file to ASF, AVI, iPod-MP4, PSP-MP4, MPEG, etc..\n- Bookmarks helps you save the location of your favorite scenes.\n- DVD X Player can capture still image during movie playing.\n- Play video devices directly including PC Camera, Digital Camera (DC), Digital Vidicon (DV), Video Card and so on.\n- Free minor-version update available\n- 2 different versions Professional and Standard - Free for all customers.\n- Lifetime technical support.\n- 14-day free trial.\n\nHome Page - http://www.aviosoft.com/dvd-player.html\n","torrent":{"xt":"urn:btih:a017b55c91144433a0ec1a5294524e699bfac4cb","amp;dn":"Aviosoft+DVD+X+Player+5.4+Standard+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a017b55c91144433a0ec1a5294524e699bfac4cb","infoHashBuffer":{"type":"Buffer","data":[160,23,181,92,145,20,68,51,160,236,26,82,148,82,78,105,155,250,196,203]},"announce":[],"urlList":[]}}