{"title":"Hammerhead - Heart Made Of Steel ep (HOL - 1984) - 80s Geophagus","uid":5011755,"size":16801860,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a04bdf008e7f23cfa0c80460be9bd22c5059d6fb&amp;dn=Hammerhead+-+Heart+Made+Of+Steel+ep+%28HOL+-+1984%29+-+80s+Geophagus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"apisto","files":7,"time":1248029565,"description":"160\nHAMMERHEAD - Heart Made of Steel EP (Hol-1984)\nHarvest Records  1A K062-1469136\n\n[img]http://img461.imageshack.us/img461/1316/o419197az0.jpg[/img]\n\n01. Heart Made Of Steel\t\t\n02. Don't Cry Your Life Away\t\t\n03. Make It To the Top\t\t\n04. Kill The Night\n\nIn 1983 I was living in London, where i spotted an Advert in an English music magazine called &quot;Melody Maker&quot;. I sent a tape to Holland not expecting to hear a reaction, suddenly I had a call from fellow Englishman &amp; Hammerhead bassist Ian Bishop. Turns out guitarist &amp; Founder member Wilko van Beek, after listening to some 30 tapes or more, picked out my voice because as he put it &quot;i liked your Paul Rodgers bluesy style&quot; at the time. \nConsisting of 2 Dutchmen &amp; 2 Englishman with both our national flags hanging high above the stage, we toured Holland playing about 70 shows within 1 1/2 years, until Hammerhead became a very popular Dutch HR band with the support of journalists Mike van Rijswijk &amp; Michel v/d Moosdijk (who had just started their own HR Magazine called Aardshok) &amp; Hans v/d Heuvel (OOR) \nAfter a live appearance on Countdown Cafe (presented by Alfred Lagarde) EMI Holland (via A &amp; R contact Heinz Henn) offered us a contract and in '84 we recorded our 1st 12 inch EP &amp; single &quot;Don't cry your life away&quot;. (featuring founder member drummer Bert v/d Watering). It wasn't until we played a show at the Melkweg in Amsterdam later that year, that EMI Electrola (Germany) offered us a 5 year worldwide contract. \nDue to the initiative of bassist Ian Bishop, who actually one Saturday afternoon, saw David Rosenthal (Rainbow/Robert Palmer) Live on T.V. ,managed to get him on the telephone later that day. We had a meeting with David a few days later in Amsterdam at Bert's flat, and David agreed to work with us.\nAfter Bert's sudden departure, David put us in touch with a fantastic drummer New Yorker, Joe Franco ( Twisted Sister/ Widowmaker ). Finally the line-up for the album was completed.\nNot a lot of people know this, but Hammerhead played a one-off show with Joe Franco in Kaatsheuvel, Holland Nov' '84, just before we went into the Electrola studios. It was a HR festival with Highway Chile, Hammerhead &amp; new comers at the time Vengeance. (funny, who would have thought that i'd end-up singing with Vengeance 6 years later). \nWell after almost 2 years of hard work we finally recorded our debut album &quot;Heart Made Of Steel&quot;. On reflection we had an amazing time in the early days, going from a small town band, to signing a worldwide contract and working with great musicians David &amp; Joe. (We almost got to see the world as official Support band for German rockers &quot;Scorpions&quot; alas this was not to be ). During the 3 months we recorded at Electrola, I remember once being stopped from entering the main studio, because the singer from a band called Alphavilla had to record a new single...who's that I said jokingly!\nAlthough the recordings were plagued with problems, resulting in an extreme high recording budget, (which I believe was the main reason why EMI shelved the album), it has to be said that all the staff at EMI Electrola treated us as part of their family, especially Label manager &amp; friend Michael Litzenburger. \n- Ian Parry\n","torrent":{"xt":"urn:btih:a04bdf008e7f23cfa0c80460be9bd22c5059d6fb","amp;dn":"Hammerhead+-+Heart+Made+Of+Steel+ep+%28HOL+-+1984%29+-+80s+Geophagus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a04bdf008e7f23cfa0c80460be9bd22c5059d6fb","infoHashBuffer":{"type":"Buffer","data":[160,75,223,0,142,127,35,207,160,200,4,96,190,155,210,44,80,89,214,251]},"announce":[],"urlList":[]}}