{"title":"Comedy - Patton Oswalt - My Weakness is Strong! (2009 DVDR vob f","uid":5171392,"size":3254659642,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a1376a12724b277b18a8abdec21fc7d8f73fdf5a&amp;dn=Comedy+-+Patton+Oswalt+-+My+Weakness+is+Strong%21+%282009+DVDR+vob+f&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1258708597,"description":"Identical to my previous upload, except these are the .vob files needed to burn the disk. NTSC format. I figure Patton is popular enough that this torrent will stay seeded.\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1503646/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1503646/&lt;/a&gt;\n\nReview by David Jeffries\n\nForget that it opens with a sweet story about getting an &quot;I Love You&quot; text from the wife; it doesn't take long for My Weakness Is Strong to get to one of those great, gross, and strange Patton Oswalt lines, which in this case is &quot;bring forth my doom spawn from your stink crevice and prove the Gypsy wrong.&quot; That's his way of telling the audience his wife is expecting, and if there's a noticeable difference between this one and 2007's Werewolves and Lollipops, it's that Oswalt has matured accordingly. There are only three distinct geek references -- mobile tech, The Road Warrior, and the video game Galaga -- meaning all the folks who got to know the comedian through the Pixar film Ratatouille will be warm to the material, that is if they're of age, leftist leaning, and cool with making fun of religion (note the great Jack Chick-inspired cover art). Grown-up life means dealing with rodents (&quot;Rats&quot; isn't about the Pixar film but just about the funniest rat story you'll ever hear), house hunting (&quot;Orgy&quot; is an open house gone horribly wrong, as in &quot;fog bank of twat mist&quot; wrong), and shopping (&quot;Grocery Robots&quot; sums up the average checkout clerk's career path with &quot;meth, meth, meth, biker boyfriend, dead cop, technicality, rehab, Jesus, pharmacy assistant, meth, checkout clerk&quot;). Elsewhere he explains how Lucky Charms are pagan tools to sway impressionable youth away from Christianity and that &quot;Uncle Touchy's naked puzzle basement&quot; is a place where you won't wear shirts but you will cry. As returning customers will notice, none of the edge is gone; in fact, his attacks on George W. and religion are fiercer than ever. The jokes may be placed further apart than before, but the belly laughs still hurt real hard and the wordplay, observations, and delivery remain brilliant, often wicked. Unlike Werewolves, the CD and DVD combo here features basically the same show, but hardcore fans might enjoy picking out the minor changes.\n &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:dpfoxztaldke&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:dpfoxztaldke&lt;/a&gt;\n\nContents (as copied from the CD):\n1 Text\n2 Birth\n3 Fat\n4 Treadmill\n5 Whisky and Weed and L.S.D.\n6 The Sad Boy\n7 The Oswalt Family Crest\n8 Rats\n9 Orgy\n10 Lofty Thoughts\n11 First\n12 Obama...and Time Travel...and Coolness...and the Last Racist\n13 Demons\n14 Sky Cake\n15 Grocery Robots\n16 Airplane\n17 The Magician","torrent":{"xt":"urn:btih:a1376a12724b277b18a8abdec21fc7d8f73fdf5a","amp;dn":"Comedy+-+Patton+Oswalt+-+My+Weakness+is+Strong%21+%282009+DVDR+vob+f","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1376a12724b277b18a8abdec21fc7d8f73fdf5a","infoHashBuffer":{"type":"Buffer","data":[161,55,106,18,114,75,39,123,24,168,171,222,194,31,199,216,247,63,223,90]},"announce":[],"urlList":[]}}