{"title":"Everything's Eventual - Stephen King-viny","uid":6403397,"size":1388764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1aa15941738efde78e58a2d112b0c3af94bf7f5&amp;dn=Everything%5C%27s+Eventual+-+Stephen+King-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"daemonx0x","files":-1,"time":1305731401,"description":"Everything\\'s Eventual - Stephen King-viny\n\nThe first collection of stories Stephen King has published since Nightmares &amp; Dreamscapes nine years ago, Everything\\'s Eventual includes one O. Henry Prize winner, two other award winners, four stories published by The New Yorker, and \\&quot;Riding the Bullet,\\&quot; King\\'s original e-book, which attracted over half a million online readers and became the most famous short story of the decade. \\&quot;Riding the Bullet,\\&quot; published here on paper for the first time, is the story of Alan Parker, who\\'s hitchhiking to see his dying mother but takes the wrong ride, farther than he ever intended. In \\&quot;Lunch at the Gotham Cafe,\\&quot; a sparring couple\\'s contentious lunch turns very, very bloody when the maitre d\\' gets out of sorts. \\&quot;1408,\\&quot; the audio story in print for the first time, is about a successful writer whose specialty is \\&quot;Ten Nights in Ten Haunted Graveyards\\&quot; or \\&quot;Ten Nights in Ten Haunted Houses,\\&quot; and though Room 1408 at the Dolphin Hotel doesn\\'t kill him, he won\\'t be writing about ghosts anymore. And in \\&quot;That Feeling, You Can Only Say What It Is in French,\\&quot; terror is deja vu at 16,000 feet. Whether writing about encounters with the dead, the near dead, or about the mundane dreads of life, from quitting smoking to yard sales, Stephen King is at the top of his form in the fourteen dark tales assembled in Everything\\'s Eventual. Intense, eerie, and instantly compelling, they announce the stunningly fertile imagination of perhaps the greatest storyteller of our time","torrent":{"xt":"urn:btih:a1aa15941738efde78e58a2d112b0c3af94bf7f5","amp;dn":"Everything%5C%27s+Eventual+-+Stephen+King-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1aa15941738efde78e58a2d112b0c3af94bf7f5","infoHashBuffer":{"type":"Buffer","data":[161,170,21,148,23,56,239,222,120,229,138,45,17,43,12,58,249,75,247,245]},"announce":[],"urlList":[]}}