{"title":"Black Eyed Peas - Discography 2009","uid":5176231,"size":819212831,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a2c0df3b6d782119c617f7162cb66c672e55a832&amp;dn=Black+Eyed+Peas+-+Discography+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Daniel...","files":97,"time":1258992320,"description":"Because the other one i have found was not full! (And it was from me XD)\n\nPLEASE SEED\n\n\n\nWikipedia:\n\nhe E.N.D. (short for The Energy Never Dies) is the fifth studio album by American hip hop group Black Eyed Peas. It was initially released on June 3, 2009, in Japan and later worldwide from June 9, 2009. The production is led by will.i.am who takes the album away from the group's traditional hip-hop style into a new era of electro-hop. The album features more anthemic and inspirational songs in a bid to appeal to a new generation of music listeners, along with kick starting the sound of the 2010s.\n\nTo promote the album it was revealed that three promotional singles would be released a week apart through the iTunes Store in &quot;The E.N.D. Countdown&quot;. These were &quot;Imma Be&quot;, released on May 19, 2009, &quot;Alive&quot;, released on May 26, 2009 and &quot;Meet Me Halfway&quot;, released on June 2, 2009. will.i.am confirmed that these three songs should not be regarded as true singles from the album, although &quot;Meet Me Halfway&quot; eventually did become the album's third single.[2]\n\nThe album's lead single, &quot;Boom Boom Pow&quot;, topped the Billboard Hot 100 for 12 consecutive weeks, and is also the group's first chart-topper on any U.S. chart.[citation needed] The single also charted well elsewhere reaching number one in Australia, Canada, UK, Turkey and Belgium and several other countries. The album's second single, &quot;I Gotta Feeling&quot; has so far peaked at number one in the U.S., topping the Billboard Hot 100 for 14 consecutive weeks, Australia, Canada, Ireland, the U.K., the Netherlands and New Zealand. &quot;Meet Me Halfway&quot; was released as the third single from the album.\n\n\n\nIt's my first torrent so i don't know what trackers are :D","torrent":{"xt":"urn:btih:a2c0df3b6d782119c617f7162cb66c672e55a832","amp;dn":"Black+Eyed+Peas+-+Discography+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2c0df3b6d782119c617f7162cb66c672e55a832","infoHashBuffer":{"type":"Buffer","data":[162,192,223,59,109,120,33,25,198,23,247,22,44,182,108,103,46,85,168,50]},"announce":[],"urlList":[]}}