{"title":"Music  \tJose Carreras - An Evening With Jose Carreras - For Ever","uid":5000692,"size":236584107,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a4ebf67b8b2edb4eddf22756198dc9fa81c78b49&amp;dn=Music++%09Jose+Carreras+-+An+Evening+With+Jose+Carreras+-+For+Ever&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zootallure","files":21,"time":1247501813,"description":"Josep Maria Carreras i Coll (born 5 December 1946, Barcelona), better known as JosÃƒÂ© Carreras, is a Spanish Catalan tenor particularly known for his performances in the operas of Verdi and Puccini. He made his debut on the opera stage at the age of 11 as TrujamÃƒÂ¡n in Manuel de Falla's El retablo de Maese Pedro and went on to a career that encompassed over 60 roles on the stages of the world's leading opera houses and in the recording studio. He gained fame with a wider audience as one of The Three Tenors along with PlÃƒÂ¡cido Domingo and Luciano Pavarotti in a series of mass concerts that began in 1990 and continued until 2003. Carreras is also known for his humanitarian work as the president of the JosÃƒÂ© Carreras International Leukemia Foundation (La FundaciÃƒÂ³ Internacional Josep Carreras per a la Lluita contra la LeucÃƒÂ¨mia), which he established following his own recovery from the disease in 1988.\n\nIn this cd there are brilliant performances of Verdi an Puccini most know arias, such as Traviata and Rigoletto to La Boheme an Madama Butterfly.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print\nand put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:a4ebf67b8b2edb4eddf22756198dc9fa81c78b49","amp;dn":"Music++%09Jose+Carreras+-+An+Evening+With+Jose+Carreras+-+For+Ever","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4ebf67b8b2edb4eddf22756198dc9fa81c78b49","infoHashBuffer":{"type":"Buffer","data":[164,235,246,123,139,46,219,78,221,242,39,86,25,141,201,250,129,199,139,73]},"announce":[],"urlList":[]}}