{"title":"Democracy Now - 06 jun 2011","uid":6449871,"size":440507330,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a4f41d2b707822cf96a1913f3955bf826631dec9&amp;dn=Democracy+Now+-+06+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1307386253,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 06, 2011\n\n- Saleh Treated in Saudi Arabia After Rocket Attack\n- 96 Killed in Syrian Violence\n- Israeli Forces Kill Palestinian Demonstrations on Syria Border\n- Egypt Closes Gaza Border After Brief Opening\n- Thousands of Israelis Rally for Palestinian State\n- 19 Killed in Pakistan Attack\n- Gates: U.S. in &quot;No Rush&quot; to Leave Afghanistan\n- 5 U.S. Troops Killed in Iraq\n- NATO Deploys Choppers in Libya\n- Radiation at Japanese Nuclear Plant Hits Record Level\n- Hundreds Protest at Kansas Military Base for Manning Release\n- Over 2,000 Flee Arizona Wildfire\n- Leftist Claims Victory in Peru Vote\n- Mexico Anti-Drug War March Heads to Ciudad JuÃƒÂ¡rez\n- 80,000 Protest Austerity Measures in Greece\n- Indian Police Break Up Yoga Guru's Anti-Corruption Fast\n- March Against Mountaintop Removal Coal Mining Begins in West Virginia\n\n\nSpecial reports\n\n- Yemenis Celebrate as President Saleh Flees to Saudi Arabia, Transfers Power to Vice President\n\nThousands of people in Yemen are rejoicing at the departure of President Ali Abdullah Saleh. The embattled leader is reportedly in Saudi Arabia for medical treatment after being injured in a rocket attack on his presidential compound. Saleh temporarily ceded power to his vice president on Saturday night. His nephew remains in command of the Central Security paramilitary forces, and his son, Ahmad Ali Abdullah Saleh, still heads the elite Republican Guard. To discuss the implications of Saleh's departure, we're joined from Sana'a by Abdul-Ghani al-Iryani, a political analyst and co-founder of the Democratic Awakening Movement.\n\n\n- Former Black Panther Leader and Political Prisoner Geronimo JiJaga Pratt Dies in Tanzania\n\nWe look at the life of former political prisoner, Geronimo Jijaga Pratt, who died in Tanzania on Thursday. In 1972, Pratt was wrongfully convicted of the murder of Caroline Olsen for which he spent 27 years in prison, eight of those in solitary confinement. He was released in 1997 after a judge vacated his conviction. The trial to win his freedom revealed that the Los Angeles Black Panther leader was a target of the FBI's counter-intelligence program, or COINTELPRO. We play an excerpt of a Democracy Now! interview with Pratt and one of his attorneys, Johnnie Cochran Jr. in 2000. We also speak with his friend and former attorney, Stuart Hanlon, and with Ed Boyer, the Los Angeles Times reporter who helped expose his innocence. &quot;The FBI followed Geronimo every second almost of his life. They knew he was in Oakland at the time of the homicide,&quot; says Hanlon. &quot;When we started litigating this, rather than turning it over, for the first time anyone can remember, FBI wiretaps disappeared. Of course they knew where he was. It did not matter what the truth was, because he was the bad guy. The truth had to take second place, even in the courtroom.&quot; Pratt ultimately won a $4.5 million civil rights settlement against the FBI and the Los Angeles Police Department.\n\n\n- Dr. Gabor MatÃƒÂ©: Obama Admin Should Heed Global Panel's Call to End &quot;Failed&quot; U.S.-Led Drug War\n\nA high-level international panel has concluded the so-called &quot;war on drugs&quot; has failed and that governments should consider legalizing substances, including marijuana. The Global Commission on Drug Policy is comprised of 19 members, including several former heads of state. The Office of National Drug Control Policy at the White House has refuted the findings of the commission's report. We speak to Dr. Gabor MatÃƒÂ©, a Canadian physician and best-selling author of four books including, &quot;In the Realm of Hungry Ghosts: Close Encounters with Addiction.&quot; &quot;On any level you care to name, the war on drugs is a failure,&quot; Dr. MatÃƒÂ© says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a4f41d2b707822cf96a1913f3955bf826631dec9","amp;dn":"Democracy+Now+-+06+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4f41d2b707822cf96a1913f3955bf826631dec9","infoHashBuffer":{"type":"Buffer","data":[164,244,29,43,112,120,34,207,150,161,145,63,57,85,191,130,102,49,222,201]},"announce":[],"urlList":[]}}