{"title":"Curve - Open Day at the Hate Fest (2001) FLAC","uid":5187258,"size":331178672,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a4f671741bb13d011086d00b9a1c8e29a2a1a4bf&amp;dn=Curve+-+Open+Day+at+the+Hate+Fest+%282001%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ct1970","files":16,"time":1259522892,"description":"From AllMusic.com:\n\nArtist: Curve\nAlbum: Open Day at the Hate Fest\nRating: 3/5\nRelease Date: 2001\nLabel: Curve Music\nType: Compilation\n\nOpen Day at the Hate Fest isn't so much about yet another comeback from Curve as it is a reminder that they're still around, alive and kicking as ever. While locked in legal battles with the major label they began referring to as Estupendo (similar to the way a number of bands refer to another label as Neglektra, to further get the drift), it didn't stop Toni Halliday and Dean Garcia from providing B-sides and new recordings as MP3s on their website. Just as the duo had wriggled their way from their business partners -- which had been holding the follow-up LP to Come Clean hostage for over a year -- they released this web-only disc, which compiles a number of those MP3s and a couple extras to sweeten the deal. The limited availability and patchwork formation sound like the very definition of a completists-only package, but that's really not the case here. Back when Curve were releasing singles with regularity, it was apparent that Halliday and Garcia often weren't the best judges at what constituted B-material, since some of their finest moments could be found on the back side of their 12&quot;s. At its best, this disc reminds fans of that fact; at its worst, this disc reminds fans that they very rarely released any mediocre tracks. Hate Fest might not surpass their previous highs, but nearly everything holds up to them quite handily. It finds Curve doing what they do best, with only slight variations on their familiar attack. In fact, this could pass as a successor to 1993's Cuckoo, in that it's grittier and darker than 1998's slicker Come Clean. And it wouldn't be a stretch to say that several will find this to be better than that record for Estupendo. (www.curve.co.uk) \n\n01 Nowhere (4:06)\n02 The Birds They Do Fly (4:10)\n03 Che (5:04)\n04 Turnaround (4:24)\n05 You Don't Know (6:23)\n06 Backwards Glance (4:58)\n07 Speedcrash (4:53)\n08 Storm (4:28)\n09 Caught in the Alleyway (5:44)\n10 Open Day at the Hate Fest (7:02)\n\n-----\n\nFrom Cuckoo's Nest, The Curve Archive:\n\nCURVE. &quot;OPEN DAY AT THE HATE FEST&quot;\n\nToni Halliday. Voice and Words\nDean Garcia. Bass, Guitar, Drums and Programming\nAlan Moulder. Guitar and FX\n\nMade between 1996 and 2001\nProduced Engineered and Recorded at Todal by Curve\nMixed by Alan Moulder at Konk Studios North London\nexcept tracks 5.9.10 mixed by Dean Garcia and Toni Halliday at Todal\nAll songs written by Halliday / Garcia\nAll songs copyright control except tracks 1.2.3.6.7\nPublished by EMI / Virgin / Anxious Music Publishing\nexcept tracks 4.5.8.9 Copyright Control\nMastered by Alan Moulder at The Hit Factory, Willesden\nSleeve Design www.flatearth.co.uk\nNowhere recorded for the film Nowhere by Greg Araki\nYou Don't Know is featured in the film / soundtrack Gossip\n\n&quot;This CD is a web only release\nThanks to all our collaborators&quot;\n\nUK release (May 2001)\n","torrent":{"xt":"urn:btih:a4f671741bb13d011086d00b9a1c8e29a2a1a4bf","amp;dn":"Curve+-+Open+Day+at+the+Hate+Fest+%282001%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4f671741bb13d011086d00b9a1c8e29a2a1a4bf","infoHashBuffer":{"type":"Buffer","data":[164,246,113,116,27,177,61,1,16,134,208,11,154,28,142,41,162,161,164,191]},"announce":[],"urlList":[]}}