{"title":"Cradle Of Filth - Nymphetamine","uid":5161556,"size":184805380,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a504c8bb22be240ea9817830a24a6ef15e943c80&amp;dn=Cradle+Of+Filth+-+Nymphetamine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258178709,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nNymphetamine is the sixth album by English extreme metal band Cradle of Filth, released on September 28, 2004. Nymphetamine marks the first and only recorded appearance of guitarist James Mcilroy (as &quot;Germs Warfare&quot;) on a Cradle of Filth album.\n\nThe title is a portmanteau of &quot;nymphomania&quot; and &quot;amphetamine&quot;, and Dani Filth explained the track itself as referring to &quot;a drug-like addiction to the woman in question, with her insidious vampire qualities literally bringing her lover back from the brink of the spiritual grave, only to bury him further on the strength of a whim. The album is written in the style of Edgar Allan Poe's works, and leaves one thinking that, despite the character's inner agonies, he is really a welcome submissive who readily enjoys the terrible highs and lows of his relationship with this alluring and filthy, depreciative succubus.&quot;\n\nThe title track was nominated for a 2005 Grammy award in the Best Metal Performance category. It appears on the album twice; in a three-part, nine minute version -&quot;Nymphetamine (Overdose)&quot; - and again in a shortened five minute version - &quot;Nymphetamine Fix&quot; - as a bonus track. A video was released for the &quot;Fix&quot; version, and this track also appears on the soundtrack for the film Resident Evil: Apocalypse (without its suffix).\n\n&quot;Coffin Fodder&quot; is mentioned in episode four of the UK comedy The IT Crowd, as &quot;track 4&quot; on a gift-wrapped CD given by the goth character Richmond to a grieving widow at a funeral. &quot;Coffin Fodder&quot; is track 9 on the actual album, but since we don't see the cover of the CD it's possible that it's a compilation that Richmond has burned himself.\n\n&quot;Swansong for a Raven&quot; is a sequel to the Midian song &quot;Her Ghost in the Fog&quot;.\n\nThe album features guest appearances by ex Theatre of Tragedy and current Leaves' Eyes vocalist Liv Kristine, and Doug Bradley, who starred as the cenobite Pinhead in the Hellraiser series and also collaborated on Midian.\n\nIt was re-released as a special edition in 2005, with an extra disc featuring two new songs, an alternate version of the title track, three cover songs, a guest appearance by King Diamond and a CD-ROM of the &quot;Nymphetamine&quot; promo video.\n\nIn 2005, the song &quot;Mother of Abominations&quot; was used on the Alone in the Dark Original Soundtrack.\n\nNymphetamine debuted at #89 on the Billboard Top 200 chart selling 13,818 copies.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a504c8bb22be240ea9817830a24a6ef15e943c80","amp;dn":"Cradle+Of+Filth+-+Nymphetamine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a504c8bb22be240ea9817830a24a6ef15e943c80","infoHashBuffer":{"type":"Buffer","data":[165,4,200,187,34,190,36,14,169,129,120,48,162,74,110,241,94,148,60,128]},"announce":[],"urlList":[]}}