{"title":"Cassie feat. Diddy - Must Be Love","uid":5014793,"size":166416388,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a531b50958bf8558a56a9c3093db715a070b6cc9&amp;dn=Cassie+feat.+Diddy+-+Must+Be+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1248172608,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Must Be Love&quot; is lead single from Cassie's sophomore album, Electro Love. It was the second single released overall from the new album, the first was buzz single &quot;Official Girl&quot; released in August 2008.\n\n&quot;Must Be Love&quot; was scheduled to premiere on June 16, 2009 on MTV &amp; BET, according to Cassie's blog.  The video premiered four days earlier on June 12th on MTV's affliated channels under heavy rotation throughout the day: MTV Hits during every hour on the hour &amp; MTV Jams during every hour on the half-hour. The video features Diddy and is set in a living room where a wall blocks Ventura and Diddy from each other. They perform their parts in the song inside the living room, and also cutting to Ventura singing the song on the wall that blocks the two &quot;lovers&quot; from each other. During the video, it's clear that the temperature increases throughout the entire song until, around the end, the furniture begins to burn. The video ends with a pan out of both rooms with Ventura and Diddy in similar positions, face front against the wall, and all the furniture burning around them.\n\nElectro Love is the name of the second studio album by Bad Boy Record's American R&amp;B recording artist Cassie. The album has been in on and off production since Cassie's 2006 eponymous debut album.\n\nThe confirmation of the album's release in mid-late 2009 ends the speculation that Cassie would be joining the former members of label-mates Danity Kane to form a new R&amp;B recording group. Cassie has so far worked with Ryan Leslie, Diddy, Akon, Souldiggaz, Mario Winans and Pharell Williams for the new album amongst others.\n\n&quot;Official Girl&quot; was the first single from the album back in August 2008 which proved commercially unsuccessful. After re-entering the studio &quot;Must Be Love&quot; was released as the new lead single in April 2009 and was also unsuccessful. The next single from the album was confirmed to be &quot;Lets Get Crazy&quot; (featuring Akon) due for release in July 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a531b50958bf8558a56a9c3093db715a070b6cc9","amp;dn":"Cassie+feat.+Diddy+-+Must+Be+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a531b50958bf8558a56a9c3093db715a070b6cc9","infoHashBuffer":{"type":"Buffer","data":[165,49,181,9,88,191,133,88,165,106,156,48,147,219,113,90,7,11,108,201]},"announce":[],"urlList":[]}}