{"title":"cheech &amp; chong viel rauch um nichts","uid":5106634,"size":734003200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a56b4eaaa1ecd146e04b51a58f475c7f1013497f&amp;dn=cheech+%26+chong+viel+rauch+um+nichts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BenHardn","files":-1,"time":1254417430,"description":"Traum meiner Jugend ;-))\n\n\n\n\n&quot;Viel Rauch um nichts&quot; bildet den Auftakt um die Filmreihe der beiden stÃƒÂ¤ndig zugedrÃƒÂ¶hnten, grenzdebilen Kiffer Pedro De Pacas und Anthony 'Man' Stoner, besser bekannt als &quot;Cheech &amp; Chong&quot;. Da ihr erstes &quot;Werk&quot; in einschlÃƒÂ¤gigen Kreise ein Riesenerfolg war und auch die Fortsetzungen in die gleiche Kerbe schlugen, rankt sich mittlerweile ein zwei Generationen umfassender Fankult um die beiden. Warum diese hirnlose Zelluloidverschwendung so erfolgreich war und ist bleibt mir aber verschlossen.\n\nDer simple Plot ist mÃƒÂ¶glichst einfach gestrickt, um den Zuschauer nicht zu ÃƒÂ¼berfordern. Die beiden Hauptcharaktere treffen sich zufÃƒÂ¤llig auf einem Highway, wo Pedro den gestrandeten Anthony aufgabelt. Da sie beiden eine gemeinsame Leidenschaft haben, das Kiffen, sind sie folgerichtig damit beschÃƒÂ¤ftigt sich stÃƒÂ¤ndig auf Partys, Freunden, Dealern und Hanffabriken Gras zu besorgen und selbiges zu rauchen.\n\nZu lachen gibt es dabei wenig, sofern man nicht selbst unter Drogeneinfluss steht. Das nervende, mÃƒÂ¶glichst coole Gelaber der beiden, zerrt spÃƒÂ¤testens nach 10 Minuten an des Zuschauers Nerven und nur ganz wenige Gags (Hund schnÃƒÂ¼ffelt sich an einem Marihuanawagen zu Tode) treffen ins Schwarze. Der parallel verlaufende Subplot, um Polizisten, die die beiden zu Drogenkurieren gewordenen Kiffer verhaften wollen zieht den recht kurzen Film genau so unnÃƒÂ¶tig in die LÃƒÂ¤nge, wie die peinliche, finale Gesangseinlage der beiden im BallerinakostÃƒÂ¼m.\n\nFazit:\nFÃƒÂ¼r die kiffenden Hardliner mag dieses substanzlose Werk vielleicht Kultcharakter besitzen, da viele &quot;rauchende&quot; Klischees, teilweise ÃƒÂ¼berzogen, verarbeitet worden sind. FÃƒÂ¼r den Durchschnittszuschauer bleibt aber nur eine langweilige KomÃƒÂ¶die mit trefferfreien Gags. Nur ein paar Evergreens verhindern die HÃƒÂ¶chststrafe. Warum sich ein Schauspieler wie Stacy Keach fÃƒÂ¼r sowas hergab wird mir ein RÃƒÂ¤tsel bleiben....\n","torrent":{"xt":"urn:btih:a56b4eaaa1ecd146e04b51a58f475c7f1013497f","amp;dn":"cheech+%26+chong+viel+rauch+um+nichts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a56b4eaaa1ecd146e04b51a58f475c7f1013497f","infoHashBuffer":{"type":"Buffer","data":[165,107,78,170,161,236,209,70,224,75,81,165,143,71,92,127,16,19,73,127]},"announce":[],"urlList":[]}}