{"title":"Hook(1991)DVDRip.AC3(ENG)-DROCK","uid":6403289,"size":732260352,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a6209bfdb7c23309d569f280c0b1b49c3bf2a6f8&amp;dn=Hook%281991%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"drock232","files":-1,"time":1305728571,"description":"Steven Spielberg filters J. M. Barrie's Peter Pan through a distinctly 1990s sensibility in Hook. Peter Pan has become Peter Banning (Robin Williams), a 40-year-old mergers and acquisitions lawyer with a permanent scowl on his face and a cellular phone in his belt. Banning has lost any memory of being Peter Pan, and he is also in danger of losing his wife Moira (Caroline Goodall) and two children, Jack (Charlie Korsmo) and Maggie (Amber Scott). Peter and his family travel to London to visit Granny Wendy (Maggie Smith) who recalls Peter's lost youth and asks him, &quot;Peter, dear, don't you know who you are?&quot; With Peter's children asleep in the same bedroom where the original Peter Pan story began, there is a blinding flash. Peter comes into the room to discover a note from Captain Hook (Dustin Hoffman), informing Peter that he has kidnapped his children. Granny Wendy now tells him who he really is and encourages him to re-discover his happy thoughts, transform himself into the Peter Pan of the past, and go rescue his children. With the encouragement of Tinkerbell (Julia Roberts), Peter recalls the birth of his son and once again takes wing. Then it's off to Never Land to rescue his kids.\n\nRipped with Autogk.\n\nLength: 2 Hours 22 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:a6209bfdb7c23309d569f280c0b1b49c3bf2a6f8","amp;dn":"Hook%281991%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6209bfdb7c23309d569f280c0b1b49c3bf2a6f8","infoHashBuffer":{"type":"Buffer","data":[166,32,155,253,183,194,51,9,213,105,242,128,192,177,180,156,59,242,166,248]},"announce":[],"urlList":[]}}