{"title":"SoundSlimmer 1.04.001","uid":6439721,"size":737087,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a62ece00bc051fb4439edfae9f3e324519486047&amp;dn=SoundSlimmer+1.04.001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Archall","files":1,"time":1306943861,"description":" SOUND SLIMMER - \nWORLD CHAMPION IN MP3 LOSSLESS COMPRESSION \n\nMp3 lossless compression. Is it possible!?\n\nIf your Digital Music collection is getting bigger everyday, even bigger than the storage you have?\n\nAre you looking for a way to accelerate delivery of audio data reducing music download time?\n\nTHIS IS THE SOLUTION FOR YOU...\n\nA vast array of We-based data acceleration technologies has propagated the market, yet they fail to effectively accelerate or compress media data, especially when it comes to Internet Audio.\n\nSoundSlimmer, which is based on proprietary technology developed by Sound Genetics, breaks an axiom of the conventional compression theory that stated that previously compressed files cannot be compressed further; \\&quot;zip can\\'t be zipped\\&quot; is no longer true where sound is concerned.\n\nDon\\'t worry - no tricks here. Our theory is stable and alive.  A simple explanation of the paradox is: SoundSlimmer works with audio data only utilizing certain specifics of the digital sound signal to losslessly slim the audio content.\n\nSoundSlimmer can compress and after that decompress so that resultant file will be bit to bit identical to the original file similar to the way  WinZip or WinRar compresses standard data, but with 10 times more compression power as it relates to the music files!\n\nThe goal of SoundSlimmer is to save storage capacity and reduce the transfer time through the Internet for the owners of mp3 music collections.\n\nUsing our SoundSlimmer encoder you can save about 15% - 20% of the disk space and the transfer time without losing even one bit of information of the original file.\n\nOur current version of SoundSlimmer losslessly compresses Mp3 and Mp3Pro files averaging 15% - 20% less file size, whereas general purpose archivers reduce audio file size by 1-2%. To achieve such revolutionary lossless compression we have combined many proprietary technologies which working together deliver cutting edge, yet simple applications.\n\nThe software does not require super computers. It uses efficient system resources like those used in your favourite Zip, Rar or other archivers. Download SoundSlimmer now and enjoy this quality product from Sound Genetics.\n\n\nThis is what SoundSlimmer can do for you:\nAn example of an average result of more than a terabyte of processed data.\n &lt;a href=&quot;\nhttp://www.soundgenetics.com/gr/diagramm_small.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.soundgenetics.com/gr/diagramm_small.png&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a62ece00bc051fb4439edfae9f3e324519486047","amp;dn":"SoundSlimmer+1.04.001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a62ece00bc051fb4439edfae9f3e324519486047","infoHashBuffer":{"type":"Buffer","data":[166,46,206,0,188,5,31,180,67,158,223,174,159,62,50,69,25,72,96,71]},"announce":[],"urlList":[]}}