{"title":"Esmee Denters - Outta Here","uid":5010667,"size":111931396,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a701ec51b995e48268e9a996ccc6f22c121fa487&amp;dn=Esmee+Denters+-+Outta+Here&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1247974966,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Outta Here&quot; is a song by Dutch pop singer EsmÃƒÂ©e Denters and the debut single released from her debut studio album Outta Here. The track was co-written and produced by Esther Dean, Jason Perry, Timberlake, Jones.\n\nThe music video premiered on May 13 2009 on Dutch music channel TMF.It was directed by Diane Martel\n\nThe video is about Denters breaking up with her boyfriend after finding out his true nature. In the video we see her go through a range of emotions from being very upset in the beginning of the video to feeling relieved at the end. Denters wore multiple outfits for the music video.\n\nThe song is about trying to escape a relationship after being unsatisfied with her discovery of her boyfriend's true colors. &quot;Outta Here&quot; is an uptempo electropop-dance song with an urban pop sound. The song is set in Common time with a moderately fast tempo of 120 beats per minute. The song begins with electro synths playing followed by breathy vocal, then progresses into slow tempo electro-dance beat played by guitars, sythesizer keyboards, and synthesized drums. HotMusicBeat says that &quot;'Outta Here' sends a message of female empowerment through a hybrid of urban beats, pop lyrics and rock attitude.&quot; WeArePopSlags calls the single &quot;extremely catchy.&quot;\n\nEsmÃƒÂ©e Denters (born September 28, 1988 in Oosterbeek, The Netherlands) is a Dutch singer. She was a regular cover-artist on video-sharing websitewhere she covered songs from Brandy, Mariah Carey, One Republic, Natasha Bedingfield and Justin Timberlake, amongst others. In 2008 it would be Timberlake who discovered her talent and Denters would sign up as the first artist with Timberlake's new label imprint Tennman in association with Interscope.\n\nOutta Here is the debut studio album by Dutch R&amp;B/Pop artist EsmÃƒÂ©e Denters. It was released on May 22, 2009. Denters is the first artist signed to Justin Timberlake's record label Tennman Records.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a701ec51b995e48268e9a996ccc6f22c121fa487","amp;dn":"Esmee+Denters+-+Outta+Here","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a701ec51b995e48268e9a996ccc6f22c121fa487","infoHashBuffer":{"type":"Buffer","data":[167,1,236,81,185,149,228,130,104,233,169,150,204,198,242,44,18,31,164,135]},"announce":[],"urlList":[]}}