{"title":"Jordin Sparks feat. Chris Brown - No Air","uid":4987042,"size":168542212,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a74ef92fa738b4f614cdc2e3858f3aa020dcdf86&amp;dn=Jordin+Sparks+feat.+Chris+Brown+-+No+Air&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1246790959,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;No Air&quot; is the second single (third overall, including &quot;This Is My Now&quot;) taken from Jordin Sparks self-titled debut album, with R&amp;B singer Chris Brown. It was released in the United States on February 11, 2008 and peaked at number three on the Billboard Hot 100 chart. It is Sparks' best selling and highest peaking single in the US. It was also highly successful worldwide, peaking at number one in Australia and New Zealand and it was hugely successful in the UK, peaking at number three and certified silver for selling over 200,000 units. It is the most sold single from an American Idol contestant. &quot;No Air&quot; peaked at number three in the European Hot 100, the second highest peak for an American Idol contestant, second only to Kelly Clarkson's &quot;Because of You&quot; which peaked at number one in 2006. The single is also Chris Brown's best-selling single worldwide.\n\nThe song was ranked number 4 on New York's Hit Music Station, Z100's Top 100 Songs of 2008.\n\nIt was the most successful song of 2008 in New Zealand.\n\nNo Air is also the song with the most paid downloads by an Idol contestant, selling 3,516,189 digital copies worldwide.\n\nThe music video for &quot;No Air&quot; (directed by Chris Robinson) was filmed Wednesday January 23, 2008 in New York City, with photos from the shoot leaking to the internet the next day. A leak of the video was uploaded toon February 20, 2008, nearly a week before the video was officially released to Yahoo! Music on February 25, 2008.\n\nThe video begins with Sparks playing the piano in her home. Suddenly, she stops playing and makes a call on her cell phone, which directs her to an answering machine. The camera cuts to the phone she is presumably calling, which has been left on a counter in a steamy room. Sparks leaves a message, asking someone (Chris Brown) to call her when he can. Her silhouetted profile is then seen on the left in a different scene, against a blank gray background, as the song begins. Sparks is then shown going to her window and looking out, drawing a heart in the fog on the cold glass as she sings the song. Brown is next shown, wiping off a foggy mirror in his bathroom as he begins singing his first verse. Brown's profile is also seen entering on the right in the the gray background scene, and the two's silhouetted profiles face each other. The video cuts to Brown, who is shown putting on his jacket and leaving his home as he walks through New York City.\n\nSparks is next seen at nighttime by the water with the Brooklyn Bridge in the background. She gets into her car and begins driving through the city. Meanwhile, we see Brown still in the daytime, arriving at Sparks' home. In a climactic sequence Brown confronts Sparks by her piano and the two passionately sing the final chorus to each other. Brown then leaves, and the video ends with their two silhouettes against the gray background, pulling away from each other. Whether or not they were ever really in the same place at the same time, or were simply imagining the other's presence, is left to the discretion of the viewer.\n\nThere are individual face shots of Brown and Sparks intercut throughout the video as well. Brown is also seen singing alone in a studio room with drums, guitars, and a piano, which he plays at the end, mirroring Sparks' first appearance on screen. One notable motif throughout the video is the wind that often blows against Brown and Sparks when they are shown outside or in the silhouetted scenes, driving home the message of the chorus: despite the presence of &quot;air&quot; all around, neither finds it possible to &quot;breathe&quot; without the other.\n\nThe music video was nominated: for two BET Awards for Viewers Choice and Chris Robinson was nominated for Best Video Director for his work on the &quot;No Air&quot; music video; for MTV Video Music Awards for Best Female Video and Best New Artist.\n\nThe video recently passed the 54,000,000 view mark onmaking it Jordin's highest viewed video on the website to date. This also made it the 19th most viewed video onof all time, after which it was removed from the channel due to an alleged copyright claim. The re-uploaded video on the same channel had more than a million views in less than a week.\n\nThe video also won a Music Choice &quot;Most Demanded '08&quot; award for Best Collaboration. There is a 26-second intro to the video\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a74ef92fa738b4f614cdc2e3858f3aa020dcdf86","amp;dn":"Jordin+Sparks+feat.+Chris+Brown+-+No+Air","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a74ef92fa738b4f614cdc2e3858f3aa020dcdf86","infoHashBuffer":{"type":"Buffer","data":[167,78,249,47,167,56,180,246,20,205,194,227,133,143,58,160,32,220,223,134]},"announce":[],"urlList":[]}}