{"title":"As Legend   EP","uid":5159584,"size":58828452,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a7669aa71c16ada752f4756230e3494b47a6a9fa&amp;dn=As+Legend+++EP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"seancwatson","files":13,"time":1258059435,"description":"This is from their MySpace:\n\n\n&quot;BIO: Pinpointing the exact moment when life began for As Legend Has It is difficult because the music and mindset of this band traces its origins back to other band membership under a different name. Suffice it to say then that this band was established in Autumn 2007 with the name As Legend Has It, under its current line-up of Klint Monroe (vocals), Nathan Palmer (guitar), Jared Bivens (guitar), Brad Reed (bass), and Andy Cosby (drums). Their delivery is always a calculated fury of melodic prowess and punishing percussion, featuring the theatrical grandeur of European metal through their use of orchestral arrangements and frantic dual-harmonized guitar leadwork. But occasionally As Legend Has It must remind its listeners of their proud east Tennessee heritage and therefore they can't help but throw in occasional hoedowns and cat-calls. It is through this unique hybridization of genres that the band proudly wears its classification of &quot;ep-neck metal&quot; (short for epic redneck metal). In defiance of the obsessions that peer metalcore bands have with trying to write the heaviest breakdowns and most superlatively &quot;necro&quot; lyrics, As Legend Has It brings a more engaging and heroic form of melodic metal, and breaks the inherent pretense of the art form by simply having fun with it - and even making fun of it. Armed with the sponsorship of Scott Lee of Feedback Symphony Music and the production direction of MiAH of The Sound Lair, As Legend Has It has completed their debut self-titled 7-song EP for release in early 2008. The band will be playing shows extensively in support of the new release throughout the region and writing new material. There is no one doing anything like them in the area and as they solidify their identity and sound as a band, they will surely be the ones to keep an eye on.. &quot;","torrent":{"xt":"urn:btih:a7669aa71c16ada752f4756230e3494b47a6a9fa","amp;dn":"As+Legend+++EP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7669aa71c16ada752f4756230e3494b47a6a9fa","infoHashBuffer":{"type":"Buffer","data":[167,102,154,167,28,22,173,167,82,244,117,98,48,227,73,75,71,166,169,250]},"announce":[],"urlList":[]}}