{"title":"Duplex.2003.SWESUB.DvdRip.Bananslipsen","uid":5185059,"size":734863360,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a767c13cfaa2687e77bc4df3bac02d4b4c68cda0&amp;dn=Duplex.2003.SWESUB.DvdRip.Bananslipsen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bananslipsen","files":1,"time":1259429169,"description":"Alex Rose and Nancy Kendricks are a young couple who believe they have found their perfect home to start a family in. There is just one problem. An elderly tenant is staying upstairs and won't move out. Alex and Nancy desperately try everything to convince her to leave, but she refuses to move. Soon, their dream home becomes their home of nightmares. Written by FilmFanUK\n\nAlex Rose and Nancy Kendricks are a young, professional, New York couple in search of their dream home. When they finally find the perfect Brooklyn brownstone they are giddy with anticipation. The duplex is a dream come true, complete with multiple fireplaces, except for one thing: Mrs. Connelly, the cranky old lady who lives on the rent-controlled top floor. Assuming she is elderly and ill, they take the apartment but their hopes are quickly dashed when they realize that Mrs. Connelly is an energetic senior who enjoys watching her television at top volume day in and day out and rehearsing in a brass band. A writer, Alex is attempting to finish his novel against a looming deadline. However, each day as he begins to write, he is interrupted by Mrs. Connelly's numerous demands and requests and what begins as a nuisance quickly escalates into an all-out war. When Nancy loses her job and the pair are trapped at home together with Mrs. Connelly, their rage turns to homicidal fantasy as they plot ways to get rid of their no-good neighbor...\n\nRiktig kul film..\n\nJag kommer seeda i ungefÃƒÂ¤r en mÃƒÂ¥nad.\n\nSeeda sÃƒÂ¥ andra kan se denna otroligt roliga filmen!","torrent":{"xt":"urn:btih:a767c13cfaa2687e77bc4df3bac02d4b4c68cda0","amp;dn":"Duplex.2003.SWESUB.DvdRip.Bananslipsen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a767c13cfaa2687e77bc4df3bac02d4b4c68cda0","infoHashBuffer":{"type":"Buffer","data":[167,103,193,60,250,162,104,126,119,188,77,243,186,192,45,75,76,104,205,160]},"announce":[],"urlList":[]}}