{"title":"Hollywood MK Deception [Mind Control]","uid":6458003,"size":950464632,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:a796cf08281132c91ae73a2e854ba823af1f5f9b&amp;dn=Hollywood+MK+Deception+%5BMind+Control%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"naba888","files":32,"time":1307650045,"description":"Hollywood MK Deception [Mind Control]\n\nA presentation of MK Ultra mind control techniques present in today's entertainment culture.\n\nText from Esoteric Kitten's youtube channel: \n\n*WARNING - EVERYTHING ON THIS CHANNEL IS TRIGGERING*\n\nPlease begin watching series beginning with Series Intro and start from MK Hollywood Deception #1. The video quality increases after Hollywood MK Deception #4 and typos disappear - sorry about that. As the series progresses, it gets more intense. I advise to watch the ENTIRE SERIES before asking questions as you will find that your answers most likely reside in another video as they each focus on another aspect of Hollywood Mind Control. If you do choose to send a message, please understand that it does take time to look at material and respond and sometimes the shit just gets lost so try and bear with me.\n\nGood Luck - and DO SOMETHING. An Expose on Hollywood Occult Practice and their Monarch symbols.\n\nThis channel is for those who have one eyebrow raised at the television and wondering what the hell is going on. This channel is for those who are looking for answers and information relating to the mania happening inside the magazines. This channel is dedicated to the people who are being manipulated by others who are manipulated into seducing the masses. This channel is dedicated to those who want answers to put this puzzle together. This channel is dedicated to the DECONSTRUCTION OF THE PROGRAM.\n","torrent":{"xt":"urn:btih:a796cf08281132c91ae73a2e854ba823af1f5f9b","amp;dn":"Hollywood+MK+Deception+%5BMind+Control%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a796cf08281132c91ae73a2e854ba823af1f5f9b","infoHashBuffer":{"type":"Buffer","data":[167,150,207,8,40,17,50,201,26,231,58,46,133,75,168,35,175,31,95,155]},"announce":[],"urlList":[]}}