{"title":"Killer Dwarfs - We Stand Alone","uid":5155651,"size":179746820,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a7f4e398796d54d136a2f55c2b39966e6a7c8236&amp;dn=Killer+Dwarfs+-+We+Stand+Alone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1257834281,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nKiller Dwarfs were a heavy metal band who formed in late 1981 in Oshawa, Ontario. Though they were known for their off beat sense of humor (all band members adopted the surname &quot;Dwarf&quot;), they were nominated for two Juno Awards.\n\nThe original members of Killer Dwarfs are Russ Graham (Russ Dwarf) lead vocals, Bryce Trewin (Bryce Dwarf) on guitar, Ange Fodero (Ange Dwarf) on bass, and Darrell Millar (Darrell Dwarf) on drums. Millar has gone on to start his own record label Unkledunk Records and is a frontman for rock band Automan. Trewin and Fodero left the band a year after its self titled debut album was released in 1983 because they thought the band was stuck in neutral; they were replaced by Mike Hall (Mike Dwarf) on guitar and Ronald Mayer (Ronald &quot;Bad Ronbo&quot; Dwarf) on bass, respectively. They released 1986's Stand Tall (on indie label Maze/A&amp;M in Canada and Grudge Records in the USA) with this lineup, and the album received good reviews and achieved modest success, selling 80,000 units (with no small help from the videos for &quot;Keep the Spirit Alive&quot;, which was the most requested video on MTV by spring 1987, and the title track, &quot;Stand Tall&quot;). With the addition of touring the U.S. coast to coast, the exposure got the band noticed, which eventually led them to signing a record deal with major label Epic Records. In 1988 the band released its first album on the Epic label titled Big Deal, which featured their major U.S. metal radio hit We Stand Alone. They were the opening act for Iron Maiden on their tour of England in 1988. In 1990 they released Dirty Weapons. These two albums are their only releases to make the Billboard charts. Mike Hall left prior to 1992's Method to the Madness, and was replaced by Gerry Finn (Gerry Dwarf). With their most successful days behind them, they were dropped by Epic. That, added to Graham's family crisis, was enough to put the Killer Dwarfs on ice in 1995. The Stand Tall lineup reunited in 2001 for a tour, and a live album -- Reunion of Scribes: Live 2001 -- was released in 2002. Mike Hall also played in the band Balls Deep, with former Harem Scarem drummer Darren Smith, as well as playing guitar on Smith's recent solo release. As of 2008, the band is inactive, with Russ Graham joining Canadian rock institution Moxy.\n\nMike Hall has also been a member of London, Ontario's Helix, playing alongside his Balls Deep bandmate Darren Smith. Gerry Finn has also played alongside Hall in Helix.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a7f4e398796d54d136a2f55c2b39966e6a7c8236","amp;dn":"Killer+Dwarfs+-+We+Stand+Alone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7f4e398796d54d136a2f55c2b39966e6a7c8236","infoHashBuffer":{"type":"Buffer","data":[167,244,227,152,121,109,84,209,54,162,245,92,43,57,150,110,106,124,130,54]},"announce":[],"urlList":[]}}