{"title":"Trick Pony - It's A Heartache","uid":4986980,"size":125442052,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a83164ac6cbf1c6bdfc0048ff650517c0c81fac8&amp;dn=Trick+Pony+-+It%5C%27s+A+Heartache&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1246783308,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;It's a Heartache&quot; is a pop-country song that was recorded by Juice Newton, Bonnie Tyler and Ronnie Spector (of the Ronettes) in 1978. Tyler's version of the song which was produced by David Mackay proved to be the biggest hit (see her version's chart positions below), peaking at #3 in the U.S. and #4 in the UK. However, Newton's version went Gold in Mexico and was the original charting version in the United States, peaking at #86 on Billboard's Hot 100 before Tyler's quickly released cover version eclipsed Newton's single's chart success. Tyler's rendition was also a Top Ten country music hit.\n\nTyler's version was recorded right after she had surgery for nodule removal. In the middle of healing, she accidentally yelled out in frustration, causing the distinctive rasp in her voice that she is best known for.[citation needed] Badfinger drummer Mike Gibbins played drums on the Tyler single.\n\nSince the 1978 releases, the song has been covered numerous times. Country pop group Dave &amp; Sugar released a cover in 1982, reaching #32 on the country charts with it. Trick Pony covered it on the album R.I.D.E., and released its version in 2005, peaking at #22 on the same chart.\n\nR.I.D.E. is the third and final studio album by American country music group Trick Pony. It is also the group's first and only recording for the Asylum-Curb label. The album's name is an abbreviation for &quot;Rebellious Individuals Delivering Entertainment&quot;.\n\nThis album includes the singles &quot;The Bride&quot;, &quot;It's a Heartache&quot;, and &quot;Ain't Wastin' Good Whiskey on You&quot;. Two of the tracks on this album are cover songs: &quot;It's a Heartache&quot; is a cover of a pop standard which has been recorded by Juice Newton and Bonnie Tyler, while &quot;SeÃƒÂ±orita&quot; was previously recorded by Los Lonely Boys on their 2004 self-titled album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a83164ac6cbf1c6bdfc0048ff650517c0c81fac8","amp;dn":"Trick+Pony+-+It%5C%27s+A+Heartache","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a83164ac6cbf1c6bdfc0048ff650517c0c81fac8","infoHashBuffer":{"type":"Buffer","data":[168,49,100,172,108,191,28,107,223,192,4,143,246,80,81,124,12,129,250,200]},"announce":[],"urlList":[]}}