{"title":"Splash Dvdrip H264 Bookerdog.mp4","uid":4993665,"size":840817208,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a8fdb304ef4409f83d31f9157f831f5560abd125&amp;dn=Splash+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookerdog","files":-1,"time":1247168930,"description":"Category\tComedies, Romance, Recommended, Essential Cinema, Fantasy, Love, New York City, Love Story, Self-Discovery, Romantic Comedy, Love Affairs, 1980s\nStarring\tTom Hanks, Eugene Levy, Daryl Hannah, John Candy\nDirector\tRon Howard\nAdditional Music/Songs\tRita Coolidge\nComposer\tLee Holdridge\nExecutive Producer\tJohn Thomas Lenox\nScreenwriter\tLowell Ganz, Babaloo Mandel, Bruce Jay Friedman\nStory\tBruce Jay Friedman\nTom Hanks stars as a workaholic who's convinced he can't fall in love..until he's mysteriously rescued from a boating accident by a mermaid! Also stars Daryl Hannah, Eugene Levy and John Candy.\nA literal fish-out-of-water tale about a lovely mermaid who comes to Manhattan, looking for the man she saved from drowning. When the two meet, a romance begins -- even as the ill-at-ease mermaid wreaks havoc and attracts attention everywhere. But the unlikely duo's love is tested when the mermaid must return to the sea, forcing her earthly boyfriend to make an unusual decision.\n\nA charming, sexy and funny mermaid tale with Tom Hanks as a successful, young businessman who has everything but love, that is until he meets up with the girl of his dreams, played by Daryl Hannah; however, unbeknownst to him, she is a mermaid targeted for capture by an obsessed oceanographer. Perfect performances and clever laughs make this a must see for fans of romantic comedy.","torrent":{"xt":"urn:btih:a8fdb304ef4409f83d31f9157f831f5560abd125","amp;dn":"Splash+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8fdb304ef4409f83d31f9157f831f5560abd125","infoHashBuffer":{"type":"Buffer","data":[168,253,179,4,239,68,9,248,61,49,249,21,127,131,31,85,96,171,209,37]},"announce":[],"urlList":[]}}