{"title":"Alison Weir - Eleanor Of Aquitaine - 2002 [52k VBR]","uid":5108365,"size":402811410,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a9f97d31874da5e4b9c956a7f9522f2ffd7c85bd&amp;dn=Alison+Weir+-+Eleanor+Of+Aquitaine+-+2002+%5B52k+VBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1254570386,"description":"New upload of earlier private torrent which had expired on another service. This content was not prepared by me. It might be identical to another torrent of the same content uploaded in 2008. Keeping things alive, I guess!\n\n---\n\nAs delicately textured as a 12th-century tapestry, royal biographer Weir's (The Life of Elizabeth I, etc.) newest book is exhilarating in its color, ambition and human warmth. \n\nThe author exhibits a breathtaking grasp of the physical and cultural context of Queen Eleanor's life, presenting a fuller, more holistic appreciation of a dazzling world whose charms can easily be anesthetized by dull narrative. And from the start, her auburn-haired subject, a live wire in a restrictive society, muse of poets and crusaders, seduces the reader. \n\nWeir conveys a deep empathy for the relaxed south of France where Eleanor was raised, a natural home for the gospel of courtly love. She paints a Brueghelesque picture of England, where wolves roamed the forests and people made skates in winter out of animal bones. \n\nIn approaching as complex a subject as feudalism, Weir wears her learning lightly and has a pleasant habit of anticipating all the questions of a curious reader. Her account parades a sequence of extraordinary characters: the saintly abbot Bernard of Clairvaux, who as an adolescent leapt into a freezing pond until his erection subsided; Eleanor's first husband, Louis VII of France, haunted by the screams of burning victims after his assault on a village in Champagne; her lover, Raymond of Poitiers, who could bend an iron bar with his bare hands; and her second husband, Henry II of England, her princely mirror in energy, intelligence and sexuality. Above all, there is the heroine, viewed clear-sightedly in all her intoxicating and imperious irresistibility.","torrent":{"xt":"urn:btih:a9f97d31874da5e4b9c956a7f9522f2ffd7c85bd","amp;dn":"Alison+Weir+-+Eleanor+Of+Aquitaine+-+2002+%5B52k+VBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9f97d31874da5e4b9c956a7f9522f2ffd7c85bd","infoHashBuffer":{"type":"Buffer","data":[169,249,125,49,135,77,165,228,185,201,86,167,249,82,47,47,253,124,133,189]},"announce":[],"urlList":[]}}