{"title":"DanDans (Easy) Audio Editor v9.0","uid":5002099,"size":15474854,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aafb050278374efe87e2f623a35ff1880e36ced7&amp;dn=DanDans+%28Easy%29+Audio+Editor+v9.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":2,"time":1247572701,"description":" &lt;a href=&quot;http://www.dandans.com/EasyAudioEditor.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.dandans.com/EasyAudioEditor.htm&lt;/a&gt;\n\n\nEasy Audio Editor is the best easy-to-use audio editor for home users. This multifunctional visual music-editing software allows you to perform various operations with audio file such as visual editing, creating, recording, and playing audio files, applying various audio effects, filtering, format conversion, adjusting stereo channels or making duetto, extracting audio from video files, converting audio from text, audio file information editing and more. It supports all major audio and video formats. \n\nWith Easy Audio Editor you can:\n Open, create, play and save audio files\n Extract audio from video files\n Convert audio from text (Text To Speech)\n Adjust stereo channels or make duetto\n Record new audio file from a microphone, sound card or other input devices (you can record audio from DVD / VCD / CD Player, MP3 Player, RealPlayer, Windows Media Player, Web Page, Internet Conversation, Internet News, Internet Radio Station and more)\n Visually edit an audio file (Delete, Cut, Copy, DeleteSilence, Paste, PasteFromFile, Mix, MixFromFile)\n Apply different effects (Amplify, Delay, Equalizer, Fade, Flanger, Invert, Normalize, Reverse, MultiTapDelay, Silence, Stretch, Vibrato, Echo, Chorus)\n Apply different filters to the selected part of an audio file (BandPass Filter, FFT Filter, HighPass Filter, HighShelf Filter,LowPass Filter, LowShelf Filter, Notch Filter)\n Insert noise or silence in an audio file\n Convert an audio file from one format to another\n Convert the sample type of audio files\n Insert and change information about audio markers (Count, Country, Dialect, Label, Language, Length, Note, Num, Position, Text)\n Insert and change information about an audio file (Album, Artist, Channels, Comments, Copyright, Genre, Title, Year)\n Use marker to locate the selected part or special part of the audio data\n\nSUPPORTED AUDIO FORMATS\n uncompressed WAV (PCM); \n compressed WAV (ADPCM, A-LAW, U-LAW, DSP, GSM and others); \n MP3, MP2\n Ogg \n WMA\n CDA (Audio CD Tracks)\n AVI\n AIFF\n AU\n G.721, G.723, G.726\n VOX (Dialogic ADPCM)\n RAW\n MPC (MusicPack)\n\nSUPPORTED VIDEO FORMATS (Extract Audio from)\n AVI (DivX, XviD, MS MPEG4, Uncompressed, Cinepak and other)\n MPEG (MPEG-1 and MPEG-2 Video)\n WMV \n Quick Time\n\n\nscans clean and working for me.   working patch included.\n\nTested 5 mins ago.\n\n","torrent":{"xt":"urn:btih:aafb050278374efe87e2f623a35ff1880e36ced7","amp;dn":"DanDans+%28Easy%29+Audio+Editor+v9.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aafb050278374efe87e2f623a35ff1880e36ced7","infoHashBuffer":{"type":"Buffer","data":[170,251,5,2,120,55,78,254,135,226,246,35,163,95,241,136,14,54,206,215]},"announce":[],"urlList":[]}}