{"title":"Democracy Now - 02 jun 2011","uid":6443103,"size":445867626,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ab42e0f2011e94cecb034d3932817775310c6afd&amp;dn=Democracy+Now+-+02+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1307036256,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 02, 2011\n\n- Yemen Fighting Continues, 15 Dead in Overnight Clashes\n- Gaddafi's Oil Minister Defects Over &quot;Unbearable&quot; Conflict\n- Fearing Passage, House GOP Postpones Vote to Halt Libya Bombing\n- Obama Admin Rebuffs Karzai Plea to Halt Deadly Raids\n- Dozens Killed in Cross-Border Militant Attack in Pakistan\n- Bahraini Gov't Forces Attack Protesters After Lifting Martial Law\n- Mubarak to Stand Trial in August\n- U.S. to Boycott U.N. Racism Conference\n- New York Demands New Environmental Impact Study on Fracking\n- New York Suspends Role in &quot;Secure Communities&quot; Program\n- Arizonans Seeks Recall of State Senator Behind Anti-Immigrant Law\n- Florida Law Forces Drug Testing on Welfare Recipients\n- Palestinians Mark 1-Year Anniversary of Israeli Flotilla Attack\n- IAEA: Japan Downplayed Tsunami, Nuclear Damage\n- Honduras Re-Admitted to OAS\n- 4 Killed in Massachusetts Tornadoes\n\n\nSpecial reports\n\n- Clashes Spread Across Yemen, Raising Fears of Civil War\n\nClashes are continuing across Yemen in the growing conflict over President Ali Abdullah Saleh's refusal to step down. At least 15 people were reportedly killed in overnight clashes in the capital city of Sana'a. Dozens have been killed since Monday, when artillery explosions and machine-gun fire shattered a tenuous cease-fire that lasted less than 48 hours. We get a report from Iona Craig of The Times of London, who is in Sana'a.\n\n\n- &quot;A Country of Dark Corners&quot;: Freed Journalist Dorothy Parvaz on Her Syrian Detention and the Assad Regime Crackdown\n\nAl Jazeera correspondent Dorothy Parvaz disappeared for 19 days when she flew to Damascus to cover the uprising there at the end of April. Parvaz was jailed in a Syrian prison, where she underwent interrogation and witnessed the abuse of pro-democracy protesters. She was ultimately deported to Iran, where she was detained again and then finally released. We speak with Parvaz about her ordeal and the unfolding human rights crisis in Syria.\n\n\n- &quot;Reckless Endangerment: How Outsized Ambition, Greed, And Corruption Led to Economic Armageddon&quot;\n\nA prominent Wall Street analyst predicted this week that not a single top executive at Goldman Sachs will face criminal prosecution for the company's role in causing the financial meltdown of 2008. &quot;I think there is a genuine sense out there that there are two sets of rules: One for big and powerful institutions that are deemed to be too powerful to fail, and the rest of us, Main Street,&quot; says our guest Gretchen Morgenson, the Pulitzer Prize-winning business reporter who has written extensively on how the U.S. government has failed to prosecute any of the top figures who played a role in the economic crash. Morgenson and Joshua Rosner are co-authors of the new book, &quot;Reckless Endangerment: How Outsized Ambition, Greed, And Corruption Led to Economic Armageddon.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ab42e0f2011e94cecb034d3932817775310c6afd","amp;dn":"Democracy+Now+-+02+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab42e0f2011e94cecb034d3932817775310c6afd","infoHashBuffer":{"type":"Buffer","data":[171,66,224,242,1,30,148,206,203,3,77,57,50,129,119,117,49,12,106,253]},"announce":[],"urlList":[]}}