{"title":"TORO SEDUTO E IL GRANDE POPOLO SIOUX[TNTVILLAGE]","uid":5104025,"size":323753984,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ac701d2078ee8cd952f3d96161a54079179e29cc&amp;dn=TORO+SEDUTO+E+IL+GRANDE+POPOLO+SIOUX%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":1,"time":1254230540,"description":"[b][color=blue] I GRANDI CAPI INDIANI[/color][/b]\n\n[b][color=red] TORO SEDUTO E IL GRANDE POPOLO SIOUX[/color][/b]\n\n[b][color=RED]:::-&gt;LOCANDINA&lt;-:::[/color][/b]\n\n[IMG]http://img2.imageshack.us/img2/5397/torosedutoloc.jpg[/IMG]\n\n[b][color=red]:::-&gt;SCREENSHOT&lt;-:::[/color][/b]\n\n[IMG]http://img87.imageshack.us/img87/7633/toroz.jpg[/IMG]\n\n[b][color=red]:::-&gt;TRAMA&lt;-:::[/color][/b]\n\n[color=teal]Nelle regioni sconfinate delle Grandi Pianure americane visse una delle piÃƒÂ¹ famose e celebrate tribÃƒÂ¹ in-diane: i Sioux. Fieri ed aggressivi, abilissimi nell'uso di archi e frecce, piÃƒÂ¹ di ogni altra tribÃƒÂ¹ impersonarono il fascino dell'incontaminato Far West. La prima parte del programma, con immagini spettacolari delle Montagne Rocciose, repertorio fotografico d'epoca e ricostruzioni storiche, ripercorre la vita e la drammatica storia di questo orgoglioso ed indomito popolo. Attraverso le parole di Toro Seduto e di altri famosi capi indiani, rivive lo spirito della grande tribÃƒÂ¹ Sioux.\n[/color]\n\n[b][color=red]:::-&gt;TORO SEDUTO&lt;-:::[/color][/b]\n[color=teal]\n[IMG]http://img30.imageshack.us/img30/2889/chiefsittingbull.jpg[/IMG]\n\nGrandissimo capo militare, guida spirituale dei siuox, Toro Seduto ÃƒÂ¨ un personaggio complesso e affascinante.\nInscindibile dalla vita di grande condottiero ÃƒÂ¨ la storia del suo popolo, i lakota, e della sua della tribÃƒÂ¹, i Sioux Hunkpapa.\n&quot;Era sempre dolce e gentile con la moglie e i figli, e cortese e premuroso con gli altri. Durante la mia permanenza con loro il cibo era a volte scarso e, Toro Seduto e sua moglie, spesso patirono la fame per non farne mancare a me.\nOccupano entrambe un posto molto speciale nel mio cuore.&quot;\nFanny Kelly fu fatta prigioniera nel Luglio del 1864 da una banda di Hunkpapa Sioux in Wyoming. Durante i cinque mesi della sua prigionia, fu' alloggiata nei quartieri di Toro Seduto come &quot;ospite&quot; della famiglia.\nUn'insegnante e missionaria tra il popolo di Toro Seduto, Catherine Weldon, lo descrisse cosi':\n&quot;Come amico...sincero e onesto; come patriota, dedicato e incorruttibile. Come marito e padre, amoroso e premuroso. Come ospite, infinitamente cortese e ospitale .&quot;\nCapo degli Hunkpapa Lakota e indiscussa Autorita' Spirituale nelle lotte per la sopravvivenza delle tribu' Lakota delle grandi praterie del Nordest, Toro Seduto nacque intorno al 1831 sul Grande Fiume, nell' odierno Sud Dakota e fu chiamato Tatanka-Iyotanka, nome che descrive un Bisonte intrattabile accovacciato sulle zampe posteriori.\nAncora giovane, Toro Seduto divenne il leader della Societa' dei Guerrieri Coraggiosi e, piu' tardi, membro autorevole dei Silent Eaters--Mangiatori Silenziosi--un gruppo responsabile del benessere tribale.\nA 14 anni il battesimo del fuoco, in un'azione contro i Crow, e nel Giugno del 1863 il suo primo confronto con i soldati americani, impegnati in azioni di rappresaglia per la rivolta dei Santee in Minnesota, e alla quale il popolo di Toro Seduto non aveva partecipato.\nL' anno seguente ingaggio' di nuovo i soldati nella battaglia di Killdeer Mountain, e nel 1865 guido' l'assedio a Fort Rice, da poco insediato nell'odierno Nord Dakota.\nLargamente rispettato per coraggio e visione, intorno al 1868 divenne Grande Capo della Nazione Lakota.\nIl terreno per un aperto confronto tra Toro Seduto e l' esercito della Confederazione fu pronto nel 1874, quando una spedizione guidata dal generale George Armstrong Custer confermo' la presenza di oro nelle Black Hills del territorio Dakota, su un'area sacra a molte tribu' e preclusa a insediamenti colonici dal Trattato di Fort Laramie del 1868. In barba a quel divieto, i cercatori d'oro invasero le Black Hills provocando la reazione dei Lakota. Quando il successivo tentativo del Governo degli Stati Uniti di acquistare le Black Hills falli', il Trattato di Fort Laramie fu messo da parte e il Commissario per gli Affari Indiani decreto' che tutti i Lakota al di fuori delle Riserve dopo il 31 Gennaio, 1876, sarebbero stati considerarsi ostili.\nToro Seduto e la sua gente tennero duro.\nIn Marzo, mentre tre colonne di soldati guidati dai Generali George Crook e Alfred Terry e dal Colonnello John Gibbon muovevano sul luogo, Toro Seduto riuni' Lakota, Cheyenne e Arapaho nel suo campo di Rosebud Creek nel Territorio del Montana. La', li guido' nella Danza del Sole, offrendo preghiere a Wakan Tanka, il Grande Spirito, e tagliando le sue braccia cento volte in segno di sacrificio. Durante la cerimonia ebbe la visione di soldati che cadevano nel campo dei Lakota, come cavallette che cadono dal cielo.\nIspirato dalla visione, il Capo Guerriero degli Oglala Lakota, Cavallo Pazzo, ando' in battaglia con una banda di 500 guerrieri, e il 17 Giugno colse di sorpresa le truppe di Crook costringendole alla ritirata nella battaglia di Rosebud. Per celebrare la vittoria, i lakota spostarono il campo nella valle del fiume Little Bighorn, dove furono raggiunti da altri 3,000 Indiani che avevano lasciato le riserve per unirsi a Toro Seduto. Qui, il 25 di Giugno, furono attaccati dal Settimo Cavalleggeri del Generale George Custer, che in grave inferiorita' numerica prima assalto' il campo, come a rappresentare la visione di Toro Seduto, e poi si attesto' su un vicino ponte dove fu' annientato.\nL' indignazione per la catastrofe militare porto' migliaia di soldati nell' area, e un anno di incessante pressione militare costrinse i Capi dei Lakota, che nel frattempo si erano di nuovo divisi, alla resa.\nMa Toro Seduto non fu tra questi e, nel Maggio del 1877, riparo' con le sue bande in Canada, e quando il Generale Terry gli offri' il perdono se avesse accettato di stabilirsi in una Riserva, lo caccio' sdegnosamente.\nQuattro anni piu' tardi, tuttavia, sempre piu' in difficolta' nello sfamare la sua gente in un mondo in cui il Bisonte era ormai quasi estinto, decise di arrendersi. Il 19 Luglio del 1881, accompagnato da un giovane figlio consegno' il suo fucile al Comanfdante di Fort Buford in Montana. Chiese il diritto di attraversare il confine canadese a suo piacimento ed una Riserva sul Little Missouri River presso le Black Hills. In un primo tempo fu invece inviato alla Riserva di Standing Rock, e successivamente, temendo nuove rivolte, a Fort Randall dove trascorse due anni come prigioniero di guerra.\nFinalmente, il 10 Maggio del 1883, Toro Seduto pote' ricongiungersi alla sua gente a Standing Rock.\nNel 1885 gli fu concesso di lasciare la Riserva per lavorare nel Buffalo Bill's Wild West, dove era pagato 50 $ a settimana per un giro a cavallo dell' arena, oltre ai proventi di autografi e fotografie. Quattro mesi dopo lascio' il Circo, incapace di tollerare la societa' dell' uomo bianco anche se, in quel periodo, ebbe occasione di stringere la mano al Presidente Grover Cleveland, e considero' l' evento come un segno della sua perdurante autorita' di Grande Capo.\nTornato a Standing Rock, si stabili' sul Grande Fiume, dove era nato, rifiutando di rinunziare alle sue tradizioni come i regolamenti della Riserva imponevano. Continuo' a vivere con due mogli e a rifiutare la cristianita', ma non manco' di inviare i suoi figli ad una vicina scuola cristiana, conscio dell' importanza di leggere e scrivere per la successiva generazione Lakota.\nNell' Autunno del 1890, un Lakota Miniconjou di nome Orso Scalciante, gli porto' notizia di una Danza degli Spiriti che avrebbe scacciato i bianchi dalle loro terre e ristabilito il loro modo di vivere. I Lakota delle Riserve di Pine Ridge e Rosebud avevano gia' adotato il rito, e i preoccupati agenti locali avevano mobilitato le truppe per controllare la situazione. Le autorita' di Standing Rock, temendo che Toro Seduto, tuttora rispettato Capo Spirituale potesse partecipare al rito, inviarono 43 poliziotti Lakota a prelevarlo. Il 15 Decembre 1890, prima dell' alba, i poliziotti irruppero nella cabina di Toro Seduto e lo trascinarono all' esterno, dove i suoi seguaci stavano confluendo per proteggerlo. Nel conflitto a fuoco che segui', un poliziotto Lakota lo colpi' al capo ferendolo a morte.\nToro Seduto fu sepolto a Fort Yates in Nord Dakota, e nel 1953 i suoi resti furono trasferiti a Mobridge, Sud Dakota, dove riposano sotto un cippo di granito che segna la sua tomba.\nIl suo popolo ha sempre ricordato in Toro Seduto non soltanto la grande Guida Spirituale e l' intemerato Guerriero, ma anche il Padre Amoroso, il Cantante Dotato, L' Affabile amico la cui profonda religiosita' aveva conferito visione profetica e speciali poteri alle sue Preghiere.\n\n [/color]\n\n[b][color=red]:::-&gt;RAPPORTO AVINAPTIC&lt;-:::[/color][/b]\n[b][color=TEAL]\n\n\n\n[ Info sul file ]\n\nNome: Toro Seduto e il Grande Popolo Sioux.avi\nData: 16/09/2009 14:46:22\nDimensione: 323,753,984 bytes (308.756 MB)\n\n[ Info generiche ]\n\nDurata: 00:21:14 (1274.44 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 2\nTipo stream n. 0: video\nTipo stream n. 1: audio\nAudio streams: 1\nISFT: VirtualDubMod 1.5.10.2 (build 2540/release)\nJUNK: VirtualDubMod build 2540/release\n\n[ Dati rilevanti ]\n\nRisoluzione: MOLTO ALTA (640 x 480)\nLarghezza: multipla di 32 (BENE)\nAltezza: multipla di 32 (BENE)\nQualitÃƒÂ  DRF medio: MEDIA (3.576692)\nQualitÃƒÂ  deviazione standard: ALTA (0.743359)\nMedia pesata dev. std.: ALTA (0.521965)\n\n[ Traccia video ]\n\nFourCC: xvid/XVID\nRisoluzione: 640 x 480\nFrame aspect ratio: 4:3 = 1.333333\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 4:3 = 1.333333\nFramerate: 25 fps\nFrames totali: 31861\nStream size: 291,610,275 bytes\nBitrate: 1830.515520 kbps\nQf: 0.238348\nKey frames: 133 (0; 300; 600; 900; 1200; ... 31808)\nNull frames: 0\nMin key int: 1\nMax key int: 300\nKey int medio: 239.556390\nRitardo: 0 ms\n\n[ Traccia audio ]\n\nAudio tag: 0x2000 (AC3)\nBitrate (contenitore): 192 kbps CBR\nCanali (contenitore): 2\nFrequenza (contenitore): 48000 Hz\nChunks: 31850\nStream size: 30,586,560 bytes\nPreload: 480 ms\nMax A/V diff: 496 ms\nAC-3 frames: 39826\nDurata: 00:21:14 (1274.432 s)\nChunk-aligned: No\nMode: stereo\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: XviD0050\nPacked bitstream: No\nQPel: No\nGMC: No\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: H.263\nFrames totali: 31861\nDrop/delay frames: 0\nFrames corrotti: 0\n\n[ Analisi DRF ]\n\nDRF medio: 3.576692\nDeviazione standard: 0.743359\nDRF max: 6\n\nRapporto generato da AVInaptic (18-11-2007) in data 16 set 2009, h 16:00:19\n\n\n\n\n\n[/color][/b]\n[b][color=red]:::-&gt;NOTE FINALI&lt;-:::[/color][/b][color=TEAL]\n[b]Durata: 25'[/b]\n[b]Lingue: ITALIANO  [/b]\n[b]Sottotitoli: NON PRESENTI[/b]\n[/color]\n\n[b][color=red]TNTVILLAGE.SCAMBIOETICO.ORG[/b][/color]","torrent":{"xt":"urn:btih:ac701d2078ee8cd952f3d96161a54079179e29cc","amp;dn":"TORO+SEDUTO+E+IL+GRANDE+POPOLO+SIOUX%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac701d2078ee8cd952f3d96161a54079179e29cc","infoHashBuffer":{"type":"Buffer","data":[172,112,29,32,120,238,140,217,82,243,217,97,97,165,64,121,23,158,41,204]},"announce":[],"urlList":[]}}