{"title":"Wisbar Advance Desktop Version 2.5.0.7 For The Pocket PC","uid":5162207,"size":11031289,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:acbb0b76d665f2476ec5af72d9a55f5d802adbe1&amp;dn=Wisbar+Advance+Desktop+Version+2.5.0.7+For+The+Pocket+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxThugxx","files":-1,"time":1258212119,"description":"                        *******   *    *  *     *   *****\n                           *      *    *  *     *   *\n                           *      ******  *     *   *\n                           *      *    *  *     *   * ****\n                           *      *    *  *     *   *    *\n                           *      *    *  *******   ******\n\n\n\n\n                        Wisbar Advance Desktop Version   2.5.0.7\n\n\n                                                             \nWisBar Advance Desktop replaces your existing Today screen. You can create shortcuts, system meters, floating windows and virtual pages to extend the functionality of your PocketPC.\n\nWisBar Advance Desktop also supports most existing Today plugins. You can arrange them on multiple pages in order to maximize their usefulness.\n\n\n\n             Here are some key features of &quot;WisBar Advance Desktop&quot;:\n\n\n* Customize your home screen any way you wish\n* Add multiple pages to increase the information available at your fingertips\n* Run in &quot;low-memory&quot; mode in order to reduce the amount of memory used\n* Use animations when switching pages or showing/hiding docks\n* Add widgets to your screen: Monthly calendar, Digital or analog clock, Images, Text to monitor the registry, Weather conditions, Grids for contacts, shortcuts or embedded objects, Display up to the next seven days of appointments, Status icons, Notifiers, and more!\n* Use 77 variables to customize the information displayed on the screen\n* Can download up to ten days of weather information\n* Easily import themes created by other users and easily share your own creations!\n\n\n                   Whats new in WisBar Advance Desktop v.2.5.0.7:\n\n\n\n                                   Interface Changes \n\n\n\n* Reorganised the main menu.\n* Made many of the dialogs finger friendly.\n* Added horizontal and vertical spacing to the calendar widget.\n* Added the ability to align the date in the Agenda widget to either the left, right or center.\n* Added &quot;OnHide&quot; and &quot;OnShow&quot; scripts to the notifiers.\n* Added an &quot;OnHold&quot; script to several widgets. This script only works when in user mode.\n* Added an &quot;OnUpdate&quot; script event for &quot;Registry Text&quot; objects.\n* You will now be visually notified when you are running the program in author mode.\n* Added the ability to add more than two cities for the weather information.\n* Weather icons are now theme-specific.\n* Added a &quot;Medium&quot; size for weather icons.\n* Added text variables to retrieve the current wind direction.\n* Added an &quot;Slide Incomplete&quot; script event for the slider widget.\n* Added an option to the widget grids to respect the horizontal alignment of text widgets.\n* When adding a shortcut to a shortcut grid, the user can now choose a custom icon.\n* Added an option to keep grids from scrolling.\n* Added a feature to the weather settings page to download the latest version of the city data (so I don't have to keep updating the program when a city has been added).\n* Added an option to the button widget to allow tapping on the text to execute scripts.\n* Added an option to the image widget to pass taps to the object underneath the image. This option will only work in user mode. In author mode, the image widget will respond normally to taps and holds (otherwise it would be impossible to access the item).\n* Added a tap animation to the shortcut and bookmark grids.\n* Added a &quot;Startup&quot; script for the theme (it's called when the theme is loaded).\n* Added an option to the Agenda widget to tile the middle scrollbar section.\n* Added a tap and hold option to the shortcut grids to customize the shortcut's icon.\n* Added a &quot;Bookmark Grid&quot; option to the grids.\n* Moved &quot;Change Theme&quot; from the settings dialog to the user-mode menu.\n* Added a custom text variable to display the next appointment in a TouchFlo style (more reminiscent of TouchFlo 2.5) which also allows the user to specify the &quot;No Appointments&quot; text.\n* Added a custom text variable to display just the time of the next alarm (without the date).\n* Added the ability to select a folder of images as a slideshow wallpaper.\n* Added an option to contact and shortcut grids to display the name of the object.\n* Added &quot;Quit&quot; to the user menu.\n* Added an option to the agenda widget to create a task or appointment when tapping and holding on the date.\n* Added an option to not display the appointments in the agenda widget. \n\n\n\n                                  Bug Fixes\n\n\n* Fixed another grid rendering bug where self-updating items did not refresh themselves properly.\n* Fixed a bug where the finger-friendly volume dialog would not be used.\n* The &quot;System - Volume Control&quot; script command now works with HTC's volume control.\n* Made some optimizations for the grid's rendering.\n* Added some critical section locking in order to prevent some random crashes.\n* Fixed a bug where the program would stall downloading information.\n* Fixed a bug with the tab bar where the bar disappeared when changing pages.\n* Fixed an issue with the tabs where tapping on a tab frequently selected the wrong one.\n* Fixed a bug where the move coordinates would appear under the tabs at the bottom of the screen.\n* Fixed a crash that occurred when rendering the desktop.\n* Fixed a bug where docks that were hidden prior to switching pages would sometimes reappear when switching back to the original page.\n* When a grid's image is stretched, there is no longer a pink outline on the image.\n* Fixed a crash that occurred when adjusting the columns and rows in a grid.\n* Fixed the &quot;System - Display Start Menu&quot; script command on newer builds of Windows Mobile.\n* Fixed a bug in the &quot;Wakeup&quot; settings where the &quot;Wake on Startup&quot; did not indicate that the program was already set that way.\n* Fixed a bug where items in grids would not always be updated when pressed or if the status changed.\n* Fixed a bug where pinning a dock which contained a grid would cause the grid to lose its objects.\n* Fixed a bug in the grids where the selection image was never drawn.\n* Rewrote the wallpaper dialog.\n* Added some code to keep some updating threads from bumping into each other, causing random lockups.\n* Redesigned the image browser in order to fix the disappearing thumbnails on some devices.\n* Fixed a bug in the grid rendering where objects captured the background while sliding.\n* Added the ability to select the agenda object in the agenda script commands.\n* Fixed a bug in the agenda widget where task checkboxes didn't scroll.\n*  Fixed the &quot;Quit&quot; script command so that it works.\n* Fixed the &quot;Quit&quot; start menu command.\n* Fixed a bug in the shortcut widget that didn't allow for commandline parameters to be passed to the program to be launched.\n* Fixed a bug that caused the phone dialer to be brought up inadvertantly.\n* Fixed a bug where the theme manager was still running after changing the theme.\n* Made a change to keep widget dock items from disappearing.\n* Made a change to make docks opaque when the opacity level is set to 100%.\n* Rewrote the notifiers to make them more reliable.\n* Rewrote the grids in order to prevent crashing.\n* Made a change to make the clock more reliable.\n* Made a change to the HTC clock layout to accommodate time separators other than the ':' character.\n* Fixed a bug that allowed grids to appear underneath an edge-aligned dock when the program is restarted.\n* The default theme now properly supports WVGA and WQVGA resolutions.\n* Fixed a memory leak that occurred when updating the weather status.\n* Fixed a crash that could occur when switching between pages.\n* Fixed a bug where docks aligned to the same edge as a tab bar would be behind the tab bar.\n\n","torrent":{"xt":"urn:btih:acbb0b76d665f2476ec5af72d9a55f5d802adbe1","amp;dn":"Wisbar+Advance+Desktop+Version+2.5.0.7+For+The+Pocket+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acbb0b76d665f2476ec5af72d9a55f5d802adbe1","infoHashBuffer":{"type":"Buffer","data":[172,187,11,118,214,101,242,71,110,197,175,114,217,165,95,93,128,42,219,225]},"announce":[],"urlList":[]}}