{"title":"Dragon.Age.2.Update.v1.03.Cracked-FLTDOX","uid":6446019,"size":28743472,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ad0507e6c3920c5294e0e996c4fdfa4aa0b396c1&amp;dn=Dragon.Age.2.Update.v1.03.Cracked-FLTDOX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rlf-rls","files":-1,"time":1307284429,"description":"Dragon Age 2 v1.03 *Cracked*                        \n(c) Electronic Arts                             \n\nCracked by:  FAiRLiGHT              Release Date: 03/06/11            \nPackaged by: FAiRLiGHT              # of Options: N/A                 \nType: [ ] Manual/Reference Card             Type: Crack               \n      [ ] CD/Box Covers           \n      [ ] Walkthrough             \n      [ ] Strategy Guide         \n      [ ] Cheat/Trainer           \n      [x] Patch                   \nNumber of archives: x             \n\n\nChanges coming with this patch:\n\n\nGAMEPLAY\n\n- The Epic achievement was not unlocking properly for some users. This no \n  longer occurs.\n\n- The Supplier achievement now always unlocks after finding at least 66 \n  resource varieties, including resources purchased from the Black Emporium.\n\n- A codex entry that helps unlock the Archaeologist achievement is now \n  easier to acquire in the Viscount's Keep during the first year in Kirkwall.\n\n- In many fights, enemies now move less quickly at the start of combat. \n  This slower initial pace makes tactical positioning more useful and important.\n\n- If the force of an enemy attack interrupts a party member's current \n  action, the party member now resumes the action once he or she has recovered. \n  This means, for example, that party members who have been instructed to \n  consume a health potion will now do so as soon as they are able, and do not \n  need to be told to consume a health potion again if they are interrupted.\n\n- Enemies are now much less likely to explode into body parts upon death.\n\n- Attacks that hit a stealthed assassin are now more likely to disrupt stealth.\n\n- Abilities that apply a silence effect now also cancel the target's current \n  action in addition to preventing the target from using further abilities.\n\n- When an enemy wakes from a sleep effect due to suffering damage, other status \n  effects that were applied by the same ability that caused the sleep effect \n  are no longer removed at the same time.\n\n- Items that bear the property &quot;100% of basic attack damage vs. enemies that \n  attack in melee&quot; no longer harm the user when equipped in conjunction with \n  abilities like Blood Magic or Sacrificial Frenzy that reduce the user's health.\n\n- The items known as Final Thought, Sataareth, Sundering, and Trepanner's \n  Gift now have damage types that match their elemental damage bonuses.\n\n- The items known as Allure's Crook, Corrupted Acolyte's Staff, Defender of \n  the Wall, Void's Hammer, and Volcanic Shield can now only be equipped by \n  the appropriate classes.\n\n- The high dragon's fireballs no longer track moving targets.\n\n- Pride demons can no longer be affected by their own Crushing Prison spells.\n\n- The size of the area affected by an ability is now explicitly described as \n  diameter or radius (usually diameter).\n\n- When a party member's armor changes after consummating a romance, runes \n  inscribed on his or her old armor now carry over to the new armor.\n\n- Using the Maker's Sigh potion on an archer no longer alters inventory capacity.\n\n- It is no longer possible to create more than one Elixir of Heroism.\n\n- It is no longer possible to simultaneously enable sustained modes that \n  are supposed to be mutually exclusive.\n\n- In some cases, enemies would freeze while entering combat. This no longer \n  occurs.\n\n- In some cases, saw traps or spike traps would throw party members back even \n  when the trap was not visible. This no longer occurs.\n\n- The Special Deliveries chest can no longer get into a state where it contains \n  items but cannot be opened.\n\n- The storage chest is now present in the Hawke estate after completing the \n  main campaign.\n\n- If the Black Emporium premium content is installed, the mabari hound now \n  follows his master more reliably.\n\n- Various character-corruption issues now correct themselves automatically when \n  you load your game.\n\n- Various minor gameplay issues no longer occur.\n\n\nQUESTS (SPOILER WARNING)\n\n- &quot;Who Needs Rescuing&quot; can now be completed.\n\n- &quot;Friendly Concern&quot; is now available after consummating a romance.\n\n- In &quot;Act of Mercy,&quot; Thrask can no longer die, which could block completion.\n\n- In &quot;A Murder of Crows,&quot; it is now always possible to fight the varterral.\n\n- In &quot;A New Path,&quot; Merrill no longer remains locked in the party after the quest.\n\n- In &quot;Bait and Switch,&quot; the chest in the abandoned house can now always be opened.\n\n- In &quot;Demands of the Qun,&quot; Aveline's guards no longer turn hostile if the player \n  declines to enter the Qunari compound during the day and then returns at night.\n\n- In &quot;Dissent,&quot; it is no longer possible to loot Ser Alrik's body before the \n  appropriate time. This ensures that the quest can always be completed.\n\n- In &quot;No Rest for the Wicked,&quot; Isabela now always begins the opening conversation \n  at the appropriate time.\n\n- In &quot;The Captain's Condolences,&quot; it is now possible to ask Aveline about her \n  father even if she is not currently in the party.\n\n- In &quot;The Last Straw,&quot; Anders now responds much differently if he is a rival.\n\n- In &quot;The Last Straw,&quot; Aveline no longer attacks Meredith when the party is \n  supposed to be stunned. This prevents a subsequent issue where the game could \n  freeze after loading the post-campaign save.\n\n- In &quot;Wayward Son,&quot; it is no longer possible to speak to Thrask after speaking \n  to Samson. This ensures that the quest progresses correctly.\n\n- If Merrill's clan members die, she no longer speaks as if they were alive.\n\n- If Anders is a rival, giving him the Tevinter Chantry Amulet now results In \n  rivalry points instead of friendship points.\n\n- If the Black Emporium premium content is installed, a new conversation between \n  Fenris and Hawke's dog is available during the fourth year in Kirkwall.\n\n- Alternate Merrill/Aveline banter is now available if Merrill's clan is killed.\n\n- Various references to the events of Dragon Age: Origins are now more accurate.\n\n- Various minor story-scripting issues no longer occur.\n\nFUNCTIONALITY\n\n- Users with a large number of promotional items were timing out when attempting \n  to log in. This no longer occurs.\n\n- Combat audio has been rebalanced so that it is no longer louder than exploration \n  and dialogue audio.\n\n- The Epic achievement or trophy can now always be unlocked.\n\n- The Supplier achievement or trophy now always unlocks after finding at least \n  66 resource varieties, including resources purchased from the Black Emporium.\n\n- A codex entry that helps unlock the Archaeologist achievement or trophy is now \n  easier to acquire in the Viscount's Keep during the first year in Kirkwall.\n\n- In the tactics menu, actions that use Items no longer become blank.\n\n- Various minor art issues no longer occur.\n\n- Various technical changes should improve performance and limit crashes.\n\n\nPC/MAC-SPECIFIC FUNCTIONALITY\n\n- The game now runs correctly for Windows administrator accounts that were \n  receiving errors about insufficient privileges.\n\n- An error about AWC.dll that prevents the game from launching no longer occurs.\n\n- A rare issue that caused the configuration utility to crash no longer occurs.\n\n- In the gameplay options menu, It is now possible to enable persistent \n  highlighting on usable objects, similar to holding down the tab key. To \n  reduce clutter, however, this setting does not highlight characters.\n\n- In the gameplay options menu, it is now possible to disable enhanced targeting. \n  Disabling this setting improves framerate but makes it more difficult to \n  highlight characters or objects in some situations.\n\n- The DirectX 11 renderer is now disabled if your video-card drivers are older \n  than version 11.4 (for AMD cards) or 267.14 (for NVIDIA cards).\n\n- The game no longer erroneously uses the DirectX 11 renderer if the DirectX 9 \n  renderer was selected in conjunction with a full-screen gamma value other \n  than the default. This change should improve performance for players who were \n  using those settings. As well, the full-screen gamma value is now saved correctly.\n\n- If the game is set to use a language other than English, it no longer reverts \n  to English upon installing a patch.\n\n- Various issues specific to DirectX 11 no longer occur.\n\n- Various issues preventing the game from launching no longer occur.\n\nBALANCE\n\nNOTE: Patch 1.03 introduces significant changes to the overall balance of the \n      game, improving the strategic elements and making combat and class \n      progression more engaging and enjoyable for players. Here is a detailed \n      summary of the balance-related improvements:\n\n- Enemies' basic attacks now apply much less force, which means that party \n  members' actions are not interrupted as frequently.\n\n- The secondary attribute requirement for equipping armor or shields \n  (constitution for warriors, willpower for mages, and cunning for rogues) is \n  now significantly smaller.\n\n- The rate at which rogues regenerate stamina while performing basic attacks \n  has been significantly increased. Rogues now regain 1% of their stamina per \n  hit with dual weapons or 2% per hit with a bow.\n\n- Traps no longer inflict injuries.\n\n- Enemies now gain more health as the game progresses.\n\n- Enemy assassins now have less health.\n\n- Lieutenant-rank and boss-rank enemies now have less health.\n\n- Lieutenant-rank enemies can no longer lose more than 40% of their health from \n  a single hit, and boss-rank enemies cannot lose more than 20%.\n\n- Enemy commanders now occasionally throw stun grenades while encouraging their \n  troops to concentrate attacks against a single party member. Previously, this \n  behavior was limited to nightmare difficulty.\n\n- Values for armor and elemental resistances now cannot exceed 95%. The game \n  displays values of up to 100%, but characters now suffer 5% damage from an \n  attack even if they show 100% resistance.\n\n- The DISORIENT effect now applies a 50% penalty to enemy defense, as described \n  in the codex, instead of only 25%.\n\n- The Rune of Valiance now provides a +2 bonus to all attributes instead of a \n  variable bonus that could rise as high as +7. As well, equipping and unequipping \n  multiple pieces of armor that each bear a Rune of Valiance no longer results in \n  incorrect attribute scores.\n\n- Items that improve the Blood Magic cost ratio now provide 0.25 mana per point \n  of health instead of 1 mana.\n\n- On hard and nightmare difficulties, status effects now persist on enemies for a \n  slightly longer duration.\n\n- On nightmare difficulty, enemies now inflict more damage than before.\n\n- On nightmare difficulty, party members no longer suffer friendly-fire damage \n  from warriors' basic attacks.\n\n- On nightmare difficulty, party members can no longer suffer more than 75% of \n  their health in damage from a single friendly-fire attack.\n\n- The warrior's Aftershock upgrade to the Tremor talent now has a 30% chance to \n  STAGGER normal enemies instead of 40%.\n\n- The warrior's Claymore upgrade to the Cleave talent now has a 10% chance to \n  STAGGER normal enemies instead of 40%.\n\n- The warrior's Cleave talent now increases damage by 75% instead of 100%, while \n  while the cost has been increased from 20 stamina to 30 and cooldown from 20s \n  to 25s.\n\n- The warrior's Shield Bash talent no longer automatically STAGGERS enemies \n  within range of the attack who were not targeted directly. The primary \n  target is still automatically STAGGERED, but other normal enemies within range \n  have a 40% chance to STAGGER.\n\n- The warrior's Shield Defense talent now increases threat generation by 100%.\n\n- The warrior's Sunder talent now has a 20% chance to STAGGER enemies on a \n  critical hit instead of 50%. As well, the talent now only STAGGERS enemies \n  if the warrior is wielding a two-handed weapon, as originally intended.\n\n- The berserker's Berserk talent now calculates the damage bonus differently, \n  substantially increasing the ability's effectiveness.\n\n- The reaver's Blood Frenzy talent and Fenris's Veneer of Calm talent now provide  \n  a maximum bonus of +50% damage instead of +100%.\n\n- The rogue's Ambush talent now functions as described.\n\n- The rogue's Burst Shot talent now inflicts approximately 50% more damage \n  (and 3x physical force instead of 2x).\n\n- The rogue's Brand talent now provides a 25% bonus to warriors' and mages' \n  critical chance instead of 10%.\n\n- The rogue's Disorienting Shot upgrade to the Pinning Shot talent now always \n  DISORIENTS the victim, regardless of whether the victim was pinned in place.\n\n- The rogue's Inconspicuous talent now extends the reduced threat generation to \n  other rogues and mages within a 10m diameter.\n\n- The rogue's Lacerate talent now provides a 10% chance to re-apply the damage \n  from any ability over 5s, instead of a chance to apply a fixed amount of damage.\n\n- The rogue's Merciless Strike upgrade to the Explosive Strike talent now applies \n  300% damage vs. STAGGERED targets instead of 400%.\n\n- The rogue's Pinning Shot talent now pins the victim for the correct duration.\n\n- The rogue's Pinpoint Strikes talent now includes a 100% bonus to attack for \n  the duration of the ability.\n\n- The assassin's Assassinate talent now has a 50s cooldown instead of 40s. The \n  Annihilate upgrade now applies 200% damage vs. BRITTLE targets instead of 400%.\n\n- The shadow's Decoy talent and Sebastian's Guardian Angel talent now have a \n  45s cooldown instead of 30s.\n\n- The shadow's Disorienting Criticals talent now functions as described, and \n  provides a 50% bonus to critical damage when obscured instead of 25%.\n\n- The shadow's Pinpoint Precision talent now provides a 50% bonus to critical \n  damage instead of 25%.\n\n- The mage's Walking Bomb spell now inflicts damage equal to 50% of the victim's \n  maximum health upon explosion, within a 4m radius, instead of 100%.\n\n- The mage's Arcane Wall upgrade to the Arcane Shield spell now continues to \n  provide a 20% defense bonus to the mage, as described. Previously, the upgrade \n  reduced the bonus to 15%. Other party members receive a 5% bonus.\n\n- The mage's Chain Reaction upgrade to the Chain Lightning spell now applies \n  300% damage vs. DISORIENTED targets instead of 600%.\n\n- The mage's Death Syphon spell now drains multiple corpses more quickly.\n\n- The mage's Entropic Cloud spell now applies for 30s instead of 15s (against \n  normal enemies), but the cost has been increased from 35 mana to 50 and the \n  cooldown from 40s to 50s. The Death Cloud upgrade now applies damage every 2s \n  instead of every 4s.\n\n- The mage's Fireball and Firestorm spells now both inflict approximately 40% \n  more damage and apply 3x elemental force instead of 2x.\n\n- The mage's Misdirection Hex spell now applies for 15s instead of 10s (against \n  normal enemies).\n\n- The mage's Petrify spell now applies for 12s instead of 15s (against normal \n  enemies).\n\n- The mage's Sleep spell now applies for 15s instead of 10s \n  (against normal enemies).\n\n- The mage's Spirit Mastery spell now includes a 10% bonus to critical chance \n  instead of 5%.\n\n- The mage's Spirit Strike upgrade to the Spirit Bolt spell now applies 300% \n  damage vs. DISORIENTED targets instead of 200%.\n\n- The mage's Winter's Blast upgrade to the Winter's Grasp spell now notes that \n  it affects nearby enemies.\n\n- The blood mage's Blood Magic spell and the spirit healer's Healing Aura spell \n  are now mutually exclusive.\n\n- The blood mage's Blood Magic spell now reserves 70% of the mage's mana instead \n  of 50%.\n\n- The blood mage's Blood Slave spell now enslaves the victim for a longer   duration. \n  As well, if the spell is ineffective, the victim's current action is now \n  canceled. The Blood Spatter upgrade now inflicts damage equal to 75% of the \n  victim's maximum health upon explosion instead of 100%, within a 4m radius. \n  As well, the spell description now displays this information.\n\n- The blood mage's Grave Robber spell now affects a 12m diameter instead of 6m \n  in order to make the ability more useful. The One Foot In upgrade now \n  inflicts 100% of the mage's maximum health in damage instead of 10%.\n\n- The blood mage's Paralyzing Hemorrhage upgrade to the Hemorrhage spell now \n  applies 500% damage vs. STAGGERED targets instead of 900%.\n\n- The force mage's Fist of the Maker spell now inflicts approximately 50% more \n  damage. The Maker's Hammer upgrade now applies 600% damage vs. STAGGERED \n  targets instead of 900%.\n\n- The force mage's Unshakable spell now provides a +50 bonus to fortitude \n  instead of +100.\n\n- The spirit healer's Group Heal spell and Anders's Aid Allies spell now \n  restore 25% of party members' health instead of 30%. When upgraded, Group Heal \n  restores 40% of health instead of 50%.\n\n- The spirit healer's Healing Aura spell and Anders's Panacea spell now provide \n  a +100 bonus to health regeneration instead of +50, and a +200 bonus when \n  upgraded instead of +100. As well, the diameter of the spell has been increased \n  from 6m to 10m, and from 8m to 15m when upgraded. In addition, a rare case in \n  which the spell previously provided an abnormally high rate of health \n  regeneration no longer occurs.\n\n- Anders's Swift Justice spell now reduces cooldowns to 90% of their normal \n  duration instead of 80%.\n\n- Aveline's Bodyguard talent no longer allows her to absorb the damage from \n  Anders's Martyr spell.\n\n- Aveline's Immovable talent now provides a stacking 8% bonus to damage resistance \n  per hit instead of 2%.\n\n- If Bethany or Carver rejoin the party near the end of the game, they now learn \n  the Force Mage and Templar specializations, respectively. Existing save games \n  from after the Deep Roads Expedition will not receive the benefit of this fix.\n\n\n\nInstructions:\n\n- Install the update\n- Copy the crack to the installed dir, overwrite when prompted\n\n\n                                               /TEAM FAIRLIGHT\n\n\n+-+  Kindest regards - FairLight DOX 2011 +-+","torrent":{"xt":"urn:btih:ad0507e6c3920c5294e0e996c4fdfa4aa0b396c1","amp;dn":"Dragon.Age.2.Update.v1.03.Cracked-FLTDOX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad0507e6c3920c5294e0e996c4fdfa4aa0b396c1","infoHashBuffer":{"type":"Buffer","data":[173,5,7,230,195,146,12,82,148,224,233,150,196,253,250,74,160,179,150,193]},"announce":[],"urlList":[]}}