{"title":"Regina Spektor - Laughing With","uid":4988154,"size":111915012,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ad1cb26ee207f46405743093b16cd952dad65b0d&amp;dn=Regina+Spektor+-+Laughing+With&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1246841195,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Laughing With&quot; is the opening single from Regina Spektor's fifth studio album, far. It was released on her MySpace on May 8, 2009, and was officially released as a digital download on May 18 in various parts of Europe and in the United States and Canada on May 19.\n\nSpektor arranged strings for this song, &quot;but instead of a traditional quartet we had two cellos. I'm drawn to that, the lower sounds - bass, cello, tuba, that warm bottomy sound.&quot; \n\nA physical EP was released in the U.S. on June 9, 2009. Apart from Laughing With, it contains the songs Folding Chair, from Spektor's upcoming album; The Call, which was featured in the soundtrack of the film The Chronicles of Narnia: Prince Caspian; and a live performance of The Noise from the Live at Bull Moose EP.\n\nA music video directed by Adria Petty was released on May 26, 2009.\n\nLaughing With has reached #44 on the iTunes Alternative Songs Chart. The song has also reached #14 on the Billboard Hot Singles Sales. The music video has thus far peaked at #18 on the US iTunes Music Video chart.\n\nFar is the fifth studio album by singer-songwriter Regina Spektor. It was released in Europe by Sire Records on June 22, 2009 and North America on June 23, 2009 as was announced in a press release on April 13. The first single &quot;Laughing With&quot; was released to Spektor's MySpace page on May 8 and was released as a digital download on May 18 in the United States and parts of Europe, along with &quot;Blue Lips&quot;. Two viral videos for &quot;Dance Anthem of the 80s&quot; and &quot;Eet&quot; were released on Spektor's myspace account. The official video for &quot;Laughing With&quot; was released on iTunes on May 26, 2009. A special edition of the album was released with 2 bonus tracks and a DVD with four music videos.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ad1cb26ee207f46405743093b16cd952dad65b0d","amp;dn":"Regina+Spektor+-+Laughing+With","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad1cb26ee207f46405743093b16cd952dad65b0d","infoHashBuffer":{"type":"Buffer","data":[173,28,178,110,226,7,244,100,5,116,48,147,177,108,217,82,218,214,91,13]},"announce":[],"urlList":[]}}