{"title":"This Sceptred Isle  (111-120)  (BBC Radio)","uid":5102214,"size":140297207,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ad5ff5aa2ae4305e85a6f65ab0e4d901a4d735d6&amp;dn=This+Sceptred+Isle++%28111-120%29++%28BBC+Radio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eddie1969","files":16,"time":1254075965,"description":"THIS SCEPTRED ISLE  101-110 (BBC7 History) - radioarchive.cc\n\nMP3, 44Khz, 128Kbps, CBR, Stereo \n\n6. The First British Empire: 1702-1760 \n\n111.   1-111  Jan 22 96   Robert Walpole, the First Prime Minister\n112.   1-112  Jan 23 96   The New Hanoverians: Death, Gin and Daniel Defoe\n113.   1-113  Jan 24 96   Monarchy, Cabinet and Dirty Taxes at the Crossroads\n114.   1-114  Jan 25 96   George II and Turnip Townshend\n115.   1-115  Jan 28 96   Queen Caroline and the Emergence of William Pitt\n116.   1-116  Jan 29 96   A Bottled Ear, Grog and Rule Britannia\n117.   1-117  Jan 30 96   Patronage and the Fall of Robert Walpole\n118.   1-118  Jan 31 96   War, Pragmatism and the Final Charge of an English \n\nMonarch\n119.   1-119  Feb  1 96   Bonnie Prince Charlie, Culloden and God Save the King\n120.   1-120  Feb  2 96   Hogarth, the Price of Gin and Pitt the Elder\n\n\n\nFrom Wikipedia, the free encyclopedia\n-----------------------------------------\n\nThis Sceptred Isle was created as a series of short 12-14 minute radio \n\nprogrammes by the BBC for transmission daily on Radio 4 from 1995 about the \n\nhistory of the lands and peoples of the British Isles. The producer was Pete \n\nAtkin.\n\nStarting in 55 BC with the arrival of Julius Caesar and initially concluding in \n\n1901 with the death of Queen Victoria, the series was read by Anna Massey and \n\nincluded extracts from the book A History of the English-speaking Peoples \n\nwritten by Sir Winston Churchill, interwoven into Christopher Lee's main account \n\nof the history. The extracts were read by Paul Eddington, who died during the \n\nproduction and his role was taken by Peter Jeffrey. In total the series \n\ncontained 216 episodes, ran 29 hours, and was first broadcast in daily episodes \n\nbetween June 1995 and June 1996.\n\nThe series was very successful, being broadcast twice each day in the morning \n\nand late at night, and in 1999 the BBC extended the programme to cover the \n\ntwentieth century; picking up from where the first series had finished to the \n\nend of the millennium. This new series was a total of 15.25 hours long and \n\nalthough it used the same narrator, the quotations were read by Robert Powell. \n\nThe first episode of this new series was broadcast on August 30 1999 and the \n\nfinal episode on December 31 1999.\n\nIn 2001 another shorter series entitled This Sceptred Isle: Dynasties was \n\nproduced. This told the stories of the powerful and influential families of \n\nBritain's history, including the Godwines, the Despensers and the Churchills. \n\nThe series consisted of 10 episodes and was again narrated by Anna Massey.\n\nOver the course of several months in 2005 and 2006 This Sceptred Isle: Empire a \n\n90-part history of the British Empire was broadcast on Radio 4. Each part was\n\napproximately 15 minutes long. The narrator was Juliet Stevenson and the cast of \n\nreaders of various historical documents--including poems, songs, personal \n\nletters, and first-hand accounts--included Jack Davenport, Joss Ackland, \n\nChristopher Eccleston, and Anna Massey among others.\n\nThe programme's title is a quotation from act 2 scene 1 of Shakespeare's King \n\nRichard II, attributed to John of Gaunt: &quot;This royal throne of kings, this \n\nscepter'd isle, This earth of majesty, this seat of Mars ... This blessed plot, \n\nthis earth, this realm, this England&quot;.\n\n\nBBC7\nCategories:\nGenre: Factual History\nFormat: Documentaries\n","torrent":{"xt":"urn:btih:ad5ff5aa2ae4305e85a6f65ab0e4d901a4d735d6","amp;dn":"This+Sceptred+Isle++%28111-120%29++%28BBC+Radio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad5ff5aa2ae4305e85a6f65ab0e4d901a4d735d6","infoHashBuffer":{"type":"Buffer","data":[173,95,245,170,42,228,48,94,133,166,246,90,176,228,217,1,164,215,53,214]},"announce":[],"urlList":[]}}