{"title":"LA Noire [MULTI5][DVD2][Region Free][XBOX360][sneak_shot]","uid":6400337,"size":7198429048,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:adda78c5f1cef649f35916f957c962efd0cbe82f&amp;dn=LA+Noire+%5BMULTI5%5D%5BDVD2%5D%5BRegion+Free%5D%5BXBOX360%5D%5Bsneak_shot%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sneak_shot","files":75,"time":1305643535,"description":"preasenting s n e a k _ s h o t \n\n\n\nrelease date:17-05-2011\n\n\ndescription:\n\n\n\nL.A. Noire is a video game developed by Team Bondi in conjunction with Rockstar Games[10] and published by Rockstar Games. Initially announced as a PlayStation 3 exclusive, the game was later reported to also be scheduled for release on the Xbox 360.[4][11] L.A. Noire is set in \\\\\\&quot;a perfectly re-created Los Angeles\\\\\\&quot; of 1947,[12] with players being given an open-ended challenge to solve a series of murder mysteries.[11]\n\n\n\n\nAs the title suggests, the game draws heavily from both plot and aesthetic elements of film noir - stylistic films from the 1940s and 1950s that shared similar visual styles and themes including crime, sex and moral ambiguity and were often shot in black and white with harsh, low-key lighting. The game uses a distinctive colouring-style in homage to the visual style of film noir. The post-war setting is the backdrop for plot elements that reference the detective films of the \\\\\\'40s (as well as James Ellroy\\\\\\'s novel L.A. Confidential and the Academy Award winning Curtis Hanson film based on it), such as corruption and drugs, with a jazz soundtrack.\n\n\n\n\n\nThe game takes place in 1947 Los Angeles, a city of glamour, fame and wealth, but also where crime, vice corruption is rife. The player assumes the role of Cole Phelps, an LAPD officer who rises through the ranks of the department. He has joined the police force to \\\\\\&quot;right the wrongs\\\\\\&quot; he committed during the Second World War. He starts off as a patrol-man, then a traffic detective, homicide, vice, and finally arson investigator. Each rank gives the player a partner who will help Phelps in his investigations, fights, and arrests. The game blends investigative elements such as mystery, and crime solving, with fast paced action sequences from chases on foot to car, as well as gun-play. As well as the storyline missions, the player can choose to work on optional side-investigations following a call from dispatch. The player can also travel on foot, as well as in different vehicles.\n\n\nseed c mment n enjoy!!!...","torrent":{"xt":"urn:btih:adda78c5f1cef649f35916f957c962efd0cbe82f","amp;dn":"LA+Noire+%5BMULTI5%5D%5BDVD2%5D%5BRegion+Free%5D%5BXBOX360%5D%5Bsneak_shot%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adda78c5f1cef649f35916f957c962efd0cbe82f","infoHashBuffer":{"type":"Buffer","data":[173,218,120,197,241,206,246,73,243,89,22,249,87,201,98,239,208,203,232,47]},"announce":[],"urlList":[]}}