{"title":"Democracy Now - 27 may 2011","uid":6427112,"size":458448505,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ae3df3f2a2fae949e03c1d214ba11a9898469156&amp;dn=Democracy+Now+-+27+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1306514268,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 27, 2011\n\n- Yemeni Air Force Bombs Tribal Fighters\n- Thousands of Egyptians Protest in Tahrir Square\n- Obama Signs Extension of PATRIOT Act\n- House Passes Bill Authorizing an Endless &quot;Worldwide War&quot;\n- Eight U.S. Troops Die in Afghanistan\n- Banks To Pay $22 Million For Foreclosing on Military Service Members\n- Vermont Governor Signs Single-Payer Healthcare Law\n- Mladic To Be Extradited To Face War Crimes Charges\n- Saudi Arabia Rallies Other Nations to Form Sunni Alliance\n\n\nSpecial reports\n\n- The Battle For Wisconsin: Court Strikes Down Gov. Scott Walker's Anti-Union Bill\n\nA Wisconsin judge has struck down Gov. Scott Walker's union-busting law because Republican legislators failed to provide sufficient public notice before passing the measure in March. The law sharply curbs nearly all collective bargaining rights of state employees. We speak to John Nichols of The Nation magazine on the future of the bill, Wisconsin's repressive new Voter ID bill, and Rep. Paul Ryan's (R-WI) budget proposals to overhaul Medicare and Medicaid\n\n\n- Eli Pariser on &quot;The Filter Bubble: What the Internet Is Hiding from You&quot;\n\nThe Internet is increasingly becoming an echo-chamber in which websites tailor information according to the preferences they detect in each viewer. When some users search the word &quot;Egypt&quot; they may get the latest news about the revolution, others might only see search results about Egyptian vacations. The top 50 websites collect an average of 64 bits of personal information each time we visit-and then custom-designs their sites to conform to our perceived preferences. What impact will this online filters have on the future of democracy? We speak to Eli Pariser, author of &quot;The Filter Bubble: What the Internet Is Hiding from You.&quot; &quot;Take news about the war in Afghanistan. When you talk to people who run news websites, they will tell you, stories about the war in Afghanistan don't perform very well, they don't get a lot of clicks-people don't flock to them. And yet, this is arguably one of the most important issues facing the country,&quot; says Pariser. &quot;But it will never make it through these filters. Especially on Facebook, this is a problem because the way that information is transmitted on Facebook is with the 'Like' button. And the 'Like' button has a very particular balance. It is easy to click 'Like' on 'I just ran a marathon' or 'I baked a really awesome cake.' It is very hard to click 'Like' on 'War in Afghanistan enters its 10th year.'&quot;\n\n\n- Sandra Steingraber on the Health Crisis Surrounding Natural Gas Extraction\n\nAbout 30 states allow hydraulic fracturing, or &quot;fracking,&quot; the natural gas drilling process that injects millions of gallons of water, sand and chemicals deep into the earth in order to break up shale rock and release natural gas. New York has imposed a partial moratorium on the drilling process pending the outcome of an environmental impact study this July. Yesterday, New York state lawmakers held a hearing on the health impacts of fracking, an issue that until now has received little media attention. We talk with Sandra Steingraber, a biologist who testified at the hearing. She is author of &quot;Raising Elijah: Protecting Children in an Age of Environmental Crisis.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ae3df3f2a2fae949e03c1d214ba11a9898469156","amp;dn":"Democracy+Now+-+27+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae3df3f2a2fae949e03c1d214ba11a9898469156","infoHashBuffer":{"type":"Buffer","data":[174,61,243,242,162,250,233,73,224,60,29,33,75,161,26,152,152,70,145,86]},"announce":[],"urlList":[]}}