{"title":"The Pussycat Dolls - Stickwitu   (2nafish)","uid":5169958,"size":128292868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ae7787520600fb52caadee0c1f3356d7190085c7&amp;dn=The+Pussycat+Dolls+-+Stickwitu+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258589649,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Stickwitu&quot; is the second single from the Pussycat Dolls' debut album, PCD. The title is a colloquialism for &quot;stick with you&quot;. The song is about expressing loyalty in a relationship.\n\nThis song gave the Dolls a Grammy nomination at the 49th Annual Grammy Awards but lost to Black Eyed Peas &quot;My Humps&quot;. It peaked at #1 in the United Kingdom and New Zealand.\n\nThe song appears on the game Karaoke Revolution Presents: American Idol.\n\nThe video, directed by Nigel Dick, begins with the group at a hotel being awoken by someone knocking on the door. The Pussycat Dolls begin to pack their belongings, then walk to their tour bus, stopping to sign autographs for fans on the way. The video continues to show footage of the girls on the bus, in dance rehearsals and practicing the song &quot;Stickwitu&quot;. The video ends with group coming out of a back entrance of a building posing for some pictures. Throughout the video, the members of PCD are seen talking on Nokia mobile phones, presumably to their partners.\n\nPCD is the debut album by American girl group the Pussycat Dolls, released by A&amp;M Records on September 13, 2005 in the United States. The majority of the album was produced by Ron Fair and Tal Herzberg with other producers including Timbaland, Cee-Lo Green, will.i.am, and Rich Harrison, amongst others, and incorporates a mixture of contemporary pop/dance/R&amp;B originals, jazz-influenced tracks, and cover versions. The album was a commercial success, and has gone on to sell over seven million units worldwide, spawning seven singles. The group toured with Gwen Stefani and have cited, among their influences, Stefani, Janet Jackson, Paula Abdul and M.I.A..\n\nThe album ended 2006 as the twenty-eighth best-selling album in the United Kingdom, with sales of 536,340 copies, in 2006 and 574,000 in 2005, for combined sales of over 1.1 million in the UK and as the sixteenth best selling album in the Netherlands.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ae7787520600fb52caadee0c1f3356d7190085c7","amp;dn":"The+Pussycat+Dolls+-+Stickwitu+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae7787520600fb52caadee0c1f3356d7190085c7","infoHashBuffer":{"type":"Buffer","data":[174,119,135,82,6,0,251,82,202,173,238,12,31,51,86,215,25,0,133,199]},"announce":[],"urlList":[]}}