{"title":"The Managers - Take It or Leave It (vbr 210kbs)","uid":4995898,"size":97199594,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:af4e0314bcc4b790f4aa4991e9905f6ab13c49cb&amp;dn=The+Managers+-+Take+It+or+Leave+It+%28vbr+210kbs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nz_flyboy","files":15,"time":1247276113,"description":"The Managers - Take It or Leave It  (2007)\n\nNew Zealand's hardest working, longest playing, furthest touring, pogo inducing, good times ska band have released their second album, Take It or Leave It, and if their recording history stays true to form, it'll be a good few years before the next one comes out. Well known as a knees up, floor filling, old school ska act, The Managers have transferred their upbeat spirit into this album, and they've also shown they're not all about the old school. They've cast the ska net quite wide and captured a good variety of traditional and non-traditional ska influences.\n\nDub and reggae manage to surface, there are elements of first wave Jamaican style ska, nods to second wave English acts like The Specials and Madness as well as some contemporary styling that show these guys have stayed parallel to their international peers in the third wave of ska. Punk and Ska have close roots, they were popularised in the UK at much the same time, and since the seventies, punk-ska hybrids have been popping up. The Managers have blended the two well in 'Gangska', but for the life of me '2 Sides' is the first heavy metal ska tune I can remember. The mood varies across the album with party tracks, thoughtful lyrics, and a classic dubby instrumental in 'Ska Ha Ha'.\n\nAll of the sounds you'd expect in a classic ska album are available for the taking on the album. The &quot;sk-sk-sk&quot; of guitar skank, the melodic lead and support of the horn section and the warm drive of thick basslines and slick rim shots on the drums. But at the same time as containing all of the elements you'd expect, 'Take it or leave it' is surprising and a rewarding listen. These guys deserve their reputation as a brilliant live act, and this album firmly reinforces their authority as a recording act.\n\n100% New Zealand Music","torrent":{"xt":"urn:btih:af4e0314bcc4b790f4aa4991e9905f6ab13c49cb","amp;dn":"The+Managers+-+Take+It+or+Leave+It+%28vbr+210kbs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af4e0314bcc4b790f4aa4991e9905f6ab13c49cb","infoHashBuffer":{"type":"Buffer","data":[175,78,3,20,188,196,183,144,244,170,73,145,233,144,95,106,177,60,73,203]},"announce":[],"urlList":[]}}