{"title":"Inglourious Basterds(2009)DVDRip.AC3(ENG)-DROCK","uid":6410204,"size":732860054,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:afb4b3961735735dbd51d26ddd9cba1b9325f3ac&amp;dn=Inglourious+Basterds%282009%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":1,"time":1305946867,"description":"A group of hardened Nazi killers stalk their prey in Nazi-occupied France as a Jewish cinema owner plots to take down top-ranking SS officers during the official premiere of a high-profile German propaganda film. As far as Lt. Aldo Raine (aka Aldo the Apache,&quot; Brad Pitt) -- is concerned, the only good Nazi is a dead Nazi. Raine's mission is to strike fear into the heart of Adolf Hitler by brutally murdering as many goose-steppers as possible, or die trying. In order to accomplish that goal, Lt. Raine recruits a ruthless team of cold-blooded killers known as &quot;The Basterds&quot; which includes baseball-bat-wielding Bostonian Sgt. Donnie Donowitz (aka &quot;The Bear Jew,&quot; Eli Roth) and steely psychopath Sgt. Hugo Stiglitz (Til Schweiger), among others. When the Basterds' secret rendezvous with turncoat German actress Bridget von Hammersmark (Diane Kruger) goes awry, they learn that the Nazis will be staging the French premiere of &quot;The Nation's Pride,&quot; a rousing propaganda film based on the exploits of German hero Fredrick Zoller (Daniel BrÃƒÂ¼hl), at a modest theater owned by Jewish cinephile Shoshanna Dreyfus (MÃƒÂ©lanie Laurent), posing as a Gentile after the brutal murder of her family by the ruthless Col. Hans Landa (Christoph Waltz). As the Basterds hatch an explosive plan to take out as many Nazis as possible at the premiere, they remain completely oblivious to the fact that Shoshanna, too, longs to bring the Third Reich to its knees, and that she's willing to sacrifice her beloved theater in the process. .\n\nRipped with Handbrake.\n\nLength: 2 Hours 33 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:afb4b3961735735dbd51d26ddd9cba1b9325f3ac","amp;dn":"Inglourious+Basterds%282009%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afb4b3961735735dbd51d26ddd9cba1b9325f3ac","infoHashBuffer":{"type":"Buffer","data":[175,180,179,150,23,53,115,93,189,81,210,109,221,156,186,27,147,37,243,172]},"announce":[],"urlList":[]}}