{"title":"Corbin Fisher - - - Connor's First Time ((MictrmbL))","uid":5019760,"size":210612957,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:afb51893edda9b85cd6a9aa9686d6a2bc8e9a8bd&amp;dn=Corbin+Fisher+-+-+-+Connor%5C%27s+First+Time+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mictrmbl","files":37,"time":1248396615,"description":"From the vaults of Corbin Fisher:\n\nGotta say it... I'm so damn thrilled I have this video to share with you today!\n\nWhen I first met Connor, I was blown away. He is everything you could hope for in a CF stud - tall, buff, incredible-looking, and with an awesome personality. I knew I had to get him to give some guy/guy action a shot, but it was certainly slow-going in making that happen. He finally decided to give a BJ a shot, but that was as far as he felt like going for quite awhile.\n\nSince then, I've gotten countless e-mails from members asking when we were finally going to get to see Connor go further, and for the longest time I had no idea what the answer to that question was, much less whether we'd ever get to see him go further at all. As you can see now, though, that day has finally come! What's more, it is well worth the wait!\n\nI have to confess, as well, that seeing Jeff bottom is my latest guilty pleasure. He looks so damn hot while getting fucked, with a priceless look on his face that seems to say, &quot;I can't believe this is happening... it's so crazy... but feels damn good!&quot; So when the time came to finally get to see straight stud Connor fuck a guy for the first time ever, Jeff seemed perfect for the job, but not just because of how hot he is! He also has this great personality and I knew he'd not only put Connor at ease, but also make the entire experience fun for Connor (and all of us watching!).\n\nWe get plenty of great facial expressions from both Jeff and Connor here, in fact. Once Jeff has lowered himself on to Connor's dick and starts bouncing up and down, you can see that Connor's thinking the same thing as Jeff - &quot;I can't believe this feels so damn good!&quot;\n\nEach of these studs undoubtedly has a sea of girls clamoring for their attention at any given time and turns heads wherever they go. They're both the kind of guy you'd lay eyes on and not be able to help but stare at for awhile. Rather than just being able to stare at and think, &quot;Wow, I wish I could see more of him&quot;, though, we actually get to see Jeff get that hot ass of his drilled and see Connor fuck another man for the very first time ever!","torrent":{"xt":"urn:btih:afb51893edda9b85cd6a9aa9686d6a2bc8e9a8bd","amp;dn":"Corbin+Fisher+-+-+-+Connor%5C%27s+First+Time+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afb51893edda9b85cd6a9aa9686d6a2bc8e9a8bd","infoHashBuffer":{"type":"Buffer","data":[175,181,24,147,237,218,155,133,205,106,154,169,104,109,106,43,200,233,168,189]},"announce":[],"urlList":[]}}