{"title":"Cold Feet Season 5","uid":5159068,"size":2870792144,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b0c60f030bd6ef2d91c5b2fcc6d17a43e0bf0b3f&amp;dn=Cold+Feet+Season+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KP12388","files":6,"time":1258037496,"description":"Three months after the birth of their baby, Adam is given a redundancy notice at work. After he gets a new job he and Rachel are told they will be evicted from their house after their landlord died. As they search for a new place to live, Adam's estranged father, Bill (Ian McElhinney), arrives. Bill and Adam patch up their relationship and he offers Adam and Rachel the money to buy their own house. On the way to the auction, Rachel is killed in a car crash, leaving Adam devastated. Her ashes are scattered in the final episode. Karen and David are going through an amicable divorce but when she starts seeing Mark again and David starts seeing his new lawyer Robyn (Lucy Robinson), it escalates, as they begin using each others' adultery and her alcoholism as a basis for custody of the children. Karen stops seeing Mark and the divorce cools down. Both re-evaluate their lives after Rachel's death; David develops his relationship with Robyn and Karen plans a trip with Ramona. Pete and Jo's marriage deteriorates when she sleeps with a co-worker (Richard Armitage) on a work weekend away. Jenny returns from New York in Episode 4 and moves back in with Pete after he asks Jo for a divorce.","torrent":{"xt":"urn:btih:b0c60f030bd6ef2d91c5b2fcc6d17a43e0bf0b3f","amp;dn":"Cold+Feet+Season+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0c60f030bd6ef2d91c5b2fcc6d17a43e0bf0b3f","infoHashBuffer":{"type":"Buffer","data":[176,198,15,3,11,214,239,45,145,197,178,252,198,209,122,67,224,191,11,63]},"announce":[],"urlList":[]}}