{"title":"Eahoosoft HD Video Converter 2.1.2 [ak]","uid":6407778,"size":5009942,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b114f14cf2fb9593f2a4b3fb75ab3958143fea46&amp;dn=Eahoosoft+HD+Video+Converter+2.1.2+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1305872381,"description":"Eahoosoft HD Video Converter 2.1.2\n\nEahoosoft HD Video Converter enriches your life to enjoy HD videos anywhere. It is a high definition video converter (HD converter) designed to convert HD video to many popular formats, like AVI to HD, MP4 to HD, FLV to HD, etc. Advanced in supporting HD video with 720p, 1080p resolution and above, this powerful HD video converter can ensure a smooth HD video conversion with excellent synchronization of audio and video, no image distortion or grains upon output.\n\nFor professionals and HD video fanatics, the program also facilitates diverse needs to trim HD video length, crop HD video to fit for 4:3 or 16:9 aspect ratio display, adjust video effects in a very handy way. You can also change conversion settings like video bit rate, frame rate, audio channel, etc. to get better outputs.\n\nKey Features\n\nConvert HD video of all types\nThis high definition video converter (HD converter) flawlessly supports all kinds of HD video, including MOD/TOD and AVCHD videos from camcorder devices, MTS/M2TS videos.\n\nMake HD video available in various formats\nEahoosoft HD Video Converter can convert HD video to almost all available formats, e.g. AVI, MP4, WMV, MKV, RMVB, FLV, MPG, MOV, VOB, 3GP.\n\nStable and high speed HD video conversion\nYou can convert batch of HD videos at a time and run the program on multicore CPU system for a fast HD video conversion.\n\nPut HD video to enjoy on personal devices\nThis HD tool provides abundant output profiles to convert HD video for playback on iPod, iPhone, PSP, Zune, Apple TV, Xbox, mobile phones and more without hassles.\n\nProfessional conversion settings for flexible output\nThere are advanced settings for conversion like video bit rate, frame rate, audio bit rate, channel, etc. to broaden output of the HD video conversion.\n\nBuilt-in HD video player with screenshot output\nThe program comes with an embedded video player for you to preview the HD videos and capture the video frames and then save them to JPG, BMP or PNG files.\n\nAdjust video effect to your satisfaction\nYou can tweak the brightness, contrast and saturation of the image so as to get the video to project better on your device screen.\n\nCut your favorite part out of the entire video\nThis HD video converter lets you pick a precise length of the HD video for conversion to get rid of unwanted parts easily.\n\nCrop the video image for better display\nTo make the HD video display better on different screens, e.g. TV screen, projector canvas, mobile phone screen, Eahoosoft HD Video Converter offers 4:3, 16:9, pan scan crop presets as well as the opportunity to customize.\n\n\nHome Page - http://www.eahoosoft.com/\n\n","torrent":{"xt":"urn:btih:b114f14cf2fb9593f2a4b3fb75ab3958143fea46","amp;dn":"Eahoosoft+HD+Video+Converter+2.1.2+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b114f14cf2fb9593f2a4b3fb75ab3958143fea46","infoHashBuffer":{"type":"Buffer","data":[177,20,241,76,242,251,149,147,242,164,179,251,117,171,57,88,20,63,234,70]},"announce":[],"urlList":[]}}