{"title":"'Man Born To Be King, The' by Dorothy L Sayers  (1976 Version)","uid":5102433,"size":242647796,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b15064d6b7469ecf1732ddbf2e1c7e9cbd7a81c4&amp;dn=%5C%27Man+Born+To+Be+King%2C+The%5C%27+by+Dorothy+L+Sayers++%281976+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dimorphod","files":13,"time":1254090932,"description":"THE MAN BORN TO BE KING\nBy Dorothy L Sayers\nAdapted and Produced by Raymond Raikes\nMP3 64kbps\n\nPlay I: Kings in Judea\n========================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio- Herod. A name abhorred in history. But was he really a tyrant? Or a man on the edge, trying to keep the peace?/ \n\nPlay II: The King's Herald\n===========================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio-  John the Baptist. A man with no conscience about speaking his mind. But how will his friends be affected?\n\nPlay III: A Certain Nobleman\n==============================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio- A nobleman approaches Jesus to save his son\n\nPlay IV: The Heirs to the Kingdom\n===================================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio- Judas becomes a target for manipulation.\n\nPlay V: The Bread of Heaven\n==============================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio- Jesus renames Simon, and stirs anger.\n\nPlay VI: The Feast of Tabernacles\n==================================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio- Jesus draws some unwelcome attention.\n\nPlay VII: The Light and the Life\n==================================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio- Lazarus lives. Has Jesus gone too far?\n\nPlay VIII: Royal Progress\n==========================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio- Baruch the Zealot has plans for Jesus.\n\nPlay IX: The King's Supper\n============================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio- Jesus issues a new law to live by.\n\nPlay X: The Princes of This World\n===================================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio- Jesus is a prisoner.\n\nPlay XI: King of Sorrows\n============================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio- Will Jesus' death satisfy the Sanhedrin?\n\nPlay XII: The King Comes to His Own\n======================================\nDorothy L Sayers' take on the story of Jesus, dramatised for radio- Jesus's tomb is found empty.\n\n'The Man Born to be King' is a radio drama based on the life of Jesus, produced and broadcast by the BBC during the Second World War. It is a play cycle consisting of twelve plays depicting specific periods in Jesus' life, from the events surrounding his birth to his death and resurrection. It was first broadcast by the BBC Home Service on Sunday evenings, beginning on December 21, 1941, with new episodes broadcast at 4-week intervals, ending on October 18, 1942. The series was written by novelist and dramatist Dorothy L. Sayers, and produced by Val Gielgud.\n\nThe project aroused a storm of controversy, even before it was broadcast. Objections arose to the very idea - atheists complained of Christian propaganda, while devout Christians declared that the BBC would be committing blasphemy by allowing the Christ to be impersonated by a human actor - and also to Sayers' approach to the material. Sayers, who felt that the inherent drama of the Gospel story had become muffled by familiarity and a general failure to think of its characters as real people, was determined to give the plays dramatic immediacy, featuring realistic, identifiable characters with human emotions and motivations. (And speech-patterns. The decision to have the characters speak in modern colloquial English was, by itself, the cause of much disquiet among those more used to hearing Jesus and his followers speaking in the polished and formal words of the King James Bible.)\n\nIn the event, although it continued to be criticised by conservative Christians - one group going so far as to proclaim the fall of Singapore in February 1942 to be a sign of God's displeasure with the series - The Man Born to be King was generally considered a great success, both as drama and as biblical representation.\n\nThe scripts of the series were first published in 1943, accompanied by a commentary by the author illuminating her attitude to the work and the reasoning behind particular aspects of her dramatisation. There have been many subsequent issues and editions.\n\nThis 1975 version was the first in stereo and starred Gabriel Woolf, Denys Blakelock, Denise Bryer, Trevor Martin, Norman Shelley and Robert Eddison. This version was repeated from 6-21 December 2007 on BBC 7.\n\nNo copies of the original version are held by the BBC, although recordings do exist elsewhere.\n\n","torrent":{"xt":"urn:btih:b15064d6b7469ecf1732ddbf2e1c7e9cbd7a81c4","amp;dn":"%5C%27Man+Born+To+Be+King%2C+The%5C%27+by+Dorothy+L+Sayers++%281976+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b15064d6b7469ecf1732ddbf2e1c7e9cbd7a81c4","infoHashBuffer":{"type":"Buffer","data":[177,80,100,214,183,70,158,207,23,50,221,191,46,28,126,156,189,122,129,196]},"announce":[],"urlList":[]}}