{"title":"Justin Sullivan - Navigating by the Stars (2003) VBR -V 0","uid":5168800,"size":98826965,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b1ba945b7313475f5266cb53e360c8df6a76f1f9&amp;dn=Justin+Sullivan+-+Navigating+by+the+Stars+%282003%29+VBR+-V+0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"egosavar","files":12,"time":1258569690,"description":"Another excellent album which unbelievably can't be found on torrent sites. This solo work by New Model Army frontman is totally different than what he does in his underground legendary band, every New Model Army fan should own this album nevertheless. \n\nReview by Jack &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;257744474c41654449494850564c460b464a48&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nJustin Sullivan's first studio solo record is a total departure, a watershed work with a completely different feeling and tone than anything he's ever attempted before. And it's breathtaking, like the sky at night out at sea, the wind in your face, the deep black waters lit by the stars as far as you can see. The metaphor is inspired by the LP itself, 12 songs that are meditations on such a sea voyage. This is the warmest, richest, most deeply involving music imaginable, all spooky hush and solitary contemplation. Forgoing drums almost entirely and ingeniously employing standup acoustic bass to add a nimble, near-jazzy quality to the lightly brushed acoustic guitars, beguiling piano, meditative organ, and bits of strings, Sullivan creates a web of sound that is impossible to categorize. It's the mood that's the star here, beyond the wonderful songs, the involving lyrics, the instrumentation, or even the vocals that arrest the listener like a siren's song. This vivid disposition holds from the opening seconds through the whole 57 minutes, a remarkable feat. The listener is confronted with every emotion evoked by the power and splendor of nature, but most of all, Navigating By the Stars depicts the restive stillness of the human mind as it experiences life in the physical world. It starts out with whitecaps frothing on the first three songs, then it hits a hushed patch of four songs that bring its velocity back down to a slow crawl, like a sailboat floating aimlessly in the dusk. This middle suite is just a calm before the last storm that emerges on track nine, &quot;Green.&quot; The haunting echo feeds straight into the acoustic waltz of &quot;Home,&quot; the second wave crest. It all ends on a tranquil note, having passed through all that life, storms, and relationships can throw. Sullivan implies we're all out to sea together, and it's a novel you can't put down -- only this novel stands up to repeated listenings, over and over and over.","torrent":{"xt":"urn:btih:b1ba945b7313475f5266cb53e360c8df6a76f1f9","amp;dn":"Justin+Sullivan+-+Navigating+by+the+Stars+%282003%29+VBR+-V+0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1ba945b7313475f5266cb53e360c8df6a76f1f9","infoHashBuffer":{"type":"Buffer","data":[177,186,148,91,115,19,71,95,82,102,203,83,227,96,200,223,106,118,241,249]},"announce":[],"urlList":[]}}