{"title":"Harry Potter 1-5 PAL DVD9","uid":5019478,"size":41947363696,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b1d6befc968bc5e6a722a9397e33918702a64322&amp;dn=Harry+Potter+1-5+PAL+DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ubehage","files":17,"time":1248385100,"description":"Harry Potter 1-5\n----------------\n\nHarry Potter and the Sorcerer's Stone (2001)\n--------------------------------------------\n&quot;Let The Magic Begin.&quot;\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0241527/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0241527/&lt;/a&gt;\n\nAudio: English (DD5.1 EX), Danish (DD5.1 EX), Norwegian (DD5.1 EX)\n\nSubs: Danish, Norwegian, English\n\nExtra Materials:\n- none.\n\n\nPlot outline:\nHarry Potter and the Sorcerer's Stone is the first film in the Harry Potter series based on the novels by J.K. Rowling. It is the tale of Harry Potter, an ordinary 11-year-old boy serving as a sort of slave for his aunt and uncle who learns that he is actually a wizard and has been invited to attend the Hogwarts School for Witchcraft and Wizardry. Harry is snatched away from his mundane existence by Hagrid, the grounds keeper for Hogwarts, and quickly thrown into a world completely foreign to both him and the viewer. Famous for an incident that happened at his birth, Harry makes friends easily at his new school. He soon finds, however, that the wizarding world is far more dangerous for him than he would have imagined, and he quickly learns that not all wizards are ones to be trusted.\n\n\n\nHarry Potter and the Chamber of Secrets (2002)\n----------------------------------------------\n&quot;Something Evil Has Returned To Hogwarts!&quot;\n\nIMDB:  &lt;a href=&quot;\nhttp://imdb.com/title/tt0295297/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0295297/&lt;/a&gt;\n\nAudio: English, Danish (5.1 on both)\n\nSubs: Danish, English\n\nExtra Materials:\n- First Year at Hogwarts.\n- Biographies.\n- Cinematic Trailer.\n\n\nPlot outline:\nForced to spend his summer holidays with his muggle relations, Harry Potter gets a real shock when he gets a surprise visitor: Dobby the house-elf, who warns Harry Potter against returning to Hogwarts, for terrible things are going to happen. Harry decides to ignore Dobby's warning and continues with his pre-arranged schedule. But at Hogwarts, strange and terrible things are indeed happening: Harry is suddenly hearing mysterious voices from inside the walls, muggle-born students are being attacked, and a message scrawled on the wall in blood puts everyone on his/her guard - &quot;The Chamber Of Secrets Has Been Opened. Enemies Of The Heir, Beware&quot;.\n\n\n\nHarry Potter and the Prisoner of Azkaban (2004)\n-----------------------------------------------\n&quot;Mysteries will unfold. Secrets will be revealed. Character will be tested. Darkness will descend. Everything will change!&quot;\n\nIMDB:  &lt;a href=&quot;\nhttp://imdb.com/title/tt0304141/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0304141/&lt;/a&gt;\n\nAudio: English, Danish, Norwegian (All DD5.1)\n\nSubs: Danish, Norwegian, English\n\nExtra Materials:\n- none.\n\n\nPlot outline:\nHarry Potter is having a tough time with his relatives (yet again). He runs away after using magic to blow Uncle Vernon's sister Marge who was being offensive towards Harry's parents. Initially scared for using magic outside the school, he is pleasantly surprised that he won't be penalized after all. However, he soon learns that a dangerous criminal and Voldemort's trusted aide Sirius Black has escaped from the Azkaban prison and wants to kill Harry to avenge the Dark Lord. To worsen the conditions for Harry, vile shape-shifters called Dementors are appointed to guard the school gates and inexplicably happen to have the most horrible effect on him. Little does Harry know that by the end of this year, many holes in his past (whatever he knows of it) will be filled up and he will have a clearer vision of what the future has in store...\n\n\n\nHarry Potter and the Goblet of Fire (2005)\n------------------------------------------\n&quot;Dark And Difficult Times Lie Ahead.&quot;\n\nIMDB:  &lt;a href=&quot;\nhttp://imdb.com/title/tt0330373/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0330373/&lt;/a&gt;\n\nAudio: English, Danish (DD5.1)\n\nSubs: Danish, Norwegian, English\n\nExtra Materials:\n- none.\n\n\nPlot outline:\nHarry's fourth year at Hogwarts is about to start and he is enjoying the summer vacation with his friends. They get the tickets to The Quidditch World Cup Final but after the match is over, people dressed like Lord Voldemort's 'Death Eaters' set a fire to all the visitors' tents, coupled with the appearance of Voldemort's symbol, the 'Dark Mark' in the sky, which causes a frenzy across the magical community. That same year, Hogwarts is hosting 'The Triwizard Tournament', a magical tournament between three well-known schools of magic : Hogwarts, Beauxbatons and Durmstrang. The contestants have to be above the age of 17, and are chosen by a magical object called Goblet of Fire. On the night of selection, however, the Goblet spews out four names instead of the usual three, with Harry unwittingly being selected as the Fourth Champion. Since the magic cannot be reversed, Harry is forced to go with it and brave three exceedingly difficult tasks.\n\n\n\nHarry Potter and the Order of the Phoenix (2007)\n------------------------------------------------\n&quot;The Rebellion Begins&quot;\n\nIMDB:  &lt;a href=&quot;\nhttp://imdb.com/title/tt0373889/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0373889/&lt;/a&gt;\n\nAudio: English, Danish, Swedish\n\nSubs: Danish, Swedish, Norwegian, Finnish, English\n\nExtra Materials:\n- Additional Scenes.\n- The Secrets of Harry Potter - Explore All the Movies in the Series for Clues to the Mystery of Harry's True Identity.\n- Trailing Tonks: Natalia Tena (aka Nymphadora Tonks) Leads a Very Personal Film Set Tour.\n- Harry Potter: The Magic of Editing - Director David Yates and Editor Mark Day Show What a Difference a Good Edit Makes\n\n\nPlot outline:\nAs another year begins for Harry, at Hogwarts school of Witchcraft and Wizardry so does the never-ending articles stating that he and Dumbledore are insane. As the ministry starts to invent new and malicious lies about Harry's account on Voldemort's return, Hogwarts begins to change for the worse as the ministry sends in their cure for all the insanity, Professor Dolores Jane Umbridge. As she begins to inflict her rules and regulations on the students at Hogwarts they begin to find that with her as their teacher, they'll never be ready for the outside world. So Harry along with his friends decides to take things into their own hands and begin to learn magic the real way. As Harry starts having visions of terrible events happening with the Ministries very walls he decides to take action, leading himself and his friends into battle, ultimately teaching them what friendship, loyalty and sacrifice really means.","torrent":{"xt":"urn:btih:b1d6befc968bc5e6a722a9397e33918702a64322","amp;dn":"Harry+Potter+1-5+PAL+DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1d6befc968bc5e6a722a9397e33918702a64322","infoHashBuffer":{"type":"Buffer","data":[177,214,190,252,150,139,197,230,167,34,169,57,126,51,145,135,2,166,67,34]},"announce":[],"urlList":[]}}