{"title":"OneRepublic - All The Right Moves","uid":5160221,"size":155559940,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b354bc49eee51f45a7a5fb23720056eaa89268ab&amp;dn=OneRepublic+-+All+The+Right+Moves&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258099560,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;All The Right Moves&quot; is the lead single by OneRepublic from their sophomore album Waking Up, released to mainstream radio on September 29, 2009 and released for digital download on October 6, 2009. It is the band's first single of the album for all countries except Austria and Germany, where &quot;Secrets&quot; serves as the first single from the new album.\n\nA low quality version of the song was published by the band on http://onerepublicmusic.tk on the 6th September 2009 while higher quality versions of the song can be found on their official Myspace page and official band website.\n\nOn October 8, 2009 the official music video premiered on Vh1.com &amp; mtv.com. The video was directed by Wayne Isham. The music video features the band playing on a small stage for the performers of a masquerade ball. They play &quot;All The Right Moves&quot; and the dancers perform to this song. Meanwhile, a small boy collects money from the dancers as they move around the floor.\n\n&quot;All The Right Moves&quot; debuted on the Billboard Hot 100 at number 58 on the week ending October 24, 2009. Currently, the song is at number 83.\n\nWaking Up is the forthcoming second studio album by OneRepublic and it is due for a release on November 17, 2009 in North America, while being release November 13, 2009 in Germany and January 18, 2010 in the U.K. The band has already performed some of the songs that are expected to appear on the album. Lead singer Ryan Tedder announced on July 21, 2009, that the band's sophomore album would be completed five weeks from that date which was August 25, 2009. The album was completed on that date. The lead single from the album, &quot;All the Right Moves&quot;, was released on September 29, 2009 for airplay and officially released on October 6, 2009. The lead single in Germany, &quot;Secrets&quot; was released on October 30, 2009, and it will be released as the second single in the US in 2010.\n\nOneRepublic is an American pop rock band formed in Colorado. After a few years of moderate success, they have drawn mainstream attention with the release of their singles &quot;Apologize&quot;, and &quot;Stop and Stare&quot;. A remix of &quot;Apologize&quot; was featured on Timbaland's Shock Value and the band's debut album, Dreaming Out Loud.\n\nThe band's second album, Waking Up, is scheduled to be released on November 17, 2009. The album's first single, titled &quot;All the Right Moves&quot;, has been released to mainstream radio on September 29, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b354bc49eee51f45a7a5fb23720056eaa89268ab","amp;dn":"OneRepublic+-+All+The+Right+Moves","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b354bc49eee51f45a7a5fb23720056eaa89268ab","infoHashBuffer":{"type":"Buffer","data":[179,84,188,73,238,229,31,69,167,165,251,35,114,0,86,234,168,146,104,171]},"announce":[],"urlList":[]}}