{"title":"Herman's Hermits-Our Danish Colle","uid":5020596,"size":90691193,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b39d0e3c0f06d05270bf437e669714df120cfa3c&amp;dn=Herman%5C%27s+Hermits-Our+Danish+Colle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SecondOpinion","files":-1,"time":1248443757,"description":" &lt;a href=&quot;http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.btzip.com&lt;/a&gt; Your doorway to the Scene\n\n\nThe Team with [RAR-Free] Releases.\n\n\n(((((((((((((= Enjoy RAR Free releases =))))))))))))))))))))\n\n...................................NFO:....................................\n\n\n\n\n\nHerman's Hermits were an English pop band, formed in Manchester in 1963 as 'Herman &amp; The Hermits'. The group's management and producer Mickie Most (who controlled the band's output) emphasized a simple, non-threatening and clean-cut image, although the band originally played R&amp;B numbers (according to Keith Hopwood on VH1's My Generation episode on the band). This helped Herman's Hermits become hugely successful in the mid-1960s but hampered the band's creativity, relegating Noone, Hopwood, Leckenby and Green's original songs to quickly recorded B-Sides and album cuts.\nTheir first hit was &quot;I'm Into Something Good&quot; (written by US songwriters Gerry Goffin and Carole King), which reached No. 1 in the UK and No. 13 in the US in 1964. They never topped the British charts again, but had two US No. 1's with &quot;Mrs. Brown, You've Got a Lovely Daughter&quot; (originally sung by Tom Courtenay in a 1963 British TV play) and &quot;I'm Henry the Eighth, I Am&quot; (a British Music Hall song by Harry Champion dating from 1911). These songs were aimed at a US fan-base, with Peter Noone exaggerating his Manchester accent; the band was not fond of either song and they were never released as singles in Britain.\nThe Hermits appeared in several movies, including When The Boys Meet The Girls (1965) - and Hold On! (1966). They also starred in the film Mrs. Brown You've Got A Lovely Daughter (1968) and were one of the performers in Pop Gear (1965). They were on the MGM label, a company which often featured the musical performers they had signed to record deals in films.\nHerman's Hermits had three Top 3 hits in the U.S. in 1965, with the aforementioned #1 hits, as well as &quot;Can't You Hear My Heartbeat&quot; (U.S. #2). They had the hits &quot;A Must to Avoid&quot; (U.S. #8), &quot;Listen People&quot; (U.S. #3), &quot;Leaning on a Lamp Post&quot; (U.S. #7), and &quot;Dandy&quot; (U.S. #3) in 1966; &quot;There's a Kind of Hush&quot; was a Top 10 hit for them the following year. They appeared on the The Ed Sullivan Show, The Dean Martin Show and The Jackie Gleason Show. Commercial success would prove elusive after the late '60's and Peter Noone and Keith Hopwood left the band in 1971. The band reunited in 1973 to headline a hugely successful British invasion tour culminating with a standing-room-only performance at Madison Square Garden and an appearance on The Midnight Special( without Hopwood). Later a version of the band featuring Leckenby and Whitwam opened for The Monkees on a couple of reunion tours. Noone declined an offer from tour organizers to appear but later appeared with Davy Jones on a successful teen idols tour.\n\n","torrent":{"xt":"urn:btih:b39d0e3c0f06d05270bf437e669714df120cfa3c","amp;dn":"Herman%5C%27s+Hermits-Our+Danish+Colle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b39d0e3c0f06d05270bf437e669714df120cfa3c","infoHashBuffer":{"type":"Buffer","data":[179,157,14,60,15,6,208,82,112,191,67,126,102,151,20,223,18,12,250,60]},"announce":[],"urlList":[]}}