{"title":"Wise Password Recover 2009 with Serial by MoralesCrk","uid":4999128,"size":1071326,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b44958b36270f66ebd3a090dfa18d1c10656cff0&amp;dn=Wise+Password+Recover+2009+with+Serial+by+MoralesCrk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MoralesCrk","files":2,"time":1247431175,"description":"The Most Powerful Password Recovery Toolkit\nWise Password Recover is a simple but powerful password recovery tool. Easily recover login and password information to various instant messengers; quickly retrieve email accounts created in Outlook, Windows Live Mail and Mozilla Thunderbird; reveal any passwords hidden under asterisk characters, and much more... \n\nAll passwords are recovered instantly, regardless of the length of passwords. Using Wise Password Recover to find lost or forgotten passwords will save you a lot of time and frustration.\n\nFeatures and Benefits\nInstant Messenger - Recover passwords for MSN Messenger, Windows Live Messenger, MSN Explorer, AIM, Google Talk, Digsby, Camfrog Video Chat, and other popular instant messengers.\nMS Office Outlook - Retrieve passwords to email accounts created in Outlook 98/2000/XP/2003/2007, as well as passwords to protected Personal Storage Files (*.pst).\nOutlook Express - Recover server name, login and password for all mail and news accounts in Microsoft Outlook Express, and also passwords for LDAP services.\nMS Internet Explorer - Recover passwords to Web sites, FTP accounts, and AutoComplete strings. \nMozilla Firefox - Display logins and passwords for protected sites stored by Firefox and Mozilla browsers. \nFTP Client - Recover lost or forgotten passwords saved on your computer by any FTP client software, such as CuteFTP, SmartFTP, FileZilla, FlashFXP, WS_FTP, CoreFTP, FTP Control, FTP Navigator, FTP Voyager, WebDrive, SecureFX, AutoFTP, etc.\nHidden Passwords - Reveal passwords from any Windows applications that masks/covers passwords with asterisks (******), such as MySpaceIM, VNC, FTP Commander, CoffeeCup FTP, FTP Explorer, etc.\nWindows Mail, Windows Live Mail, Phoenix Mail, Mozilla Thunderbird, Eudora, Incredimail - Recover mail passwords and logins from these email clients as well.\nAnd much more...\nWise Password Recover runs on Windows 98/ME/2000/XP/2003/Vista. You can download the free evaluation version for a free system scan, find all your lost or forgotten passwords instantly.\n\n\nSEED AND ENJOY. Ã‚Â¡Ã‚Â¡Ã‚Â¡UP CRACKSLATINOS!!!","torrent":{"xt":"urn:btih:b44958b36270f66ebd3a090dfa18d1c10656cff0","amp;dn":"Wise+Password+Recover+2009+with+Serial+by+MoralesCrk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b44958b36270f66ebd3a090dfa18d1c10656cff0","infoHashBuffer":{"type":"Buffer","data":[180,73,88,179,98,112,246,110,189,58,9,13,250,24,209,193,6,86,207,240]},"announce":[],"urlList":[]}}