{"title":"NASCAR  2011 the game [wii] [ntsc-u] [scrubbed]","uid":6438988,"size":2025116609,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:b455ac107adb0ff237de61a2749452d8853e0839&amp;dn=NASCAR++2011+the+game+%5Bwii%5D+%5Bntsc-u%5D+%5Bscrubbed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flat480","files":-1,"time":1306901371,"description":"NASCAR The Game 2011 has been built from the ground up to make a thoroughly new experience. The development team started by speaking with the people who know NASCAR best - the fans - and took that insight to the teams, drivers and officials to completely embrace what makes NASCAR America's #1 motorsport. Players can choose to play as themselves or as one of the sport's real-world drivers as they battle it out for the NASCAR Sprint Cup Series Championship. Each pro driver has the AI characteristics of his or her real world counterpart, setting the stage for intense rivalries played out on the track. Damage is meticulously detailed and multi-car wrecks are the most extreme ever experienced in an officially licensed racing game. From the 22 real world tracks to full pit stop strategy action, NASCAR The Game 2011 captures the real atmosphere, sense of speed and spectacle that embodies NASCAR. Players can even feel the thrill of a win with the interactive celebration mode. The game also includes in-depth multiplayer modes which allow up to 16 players to battle it out for the win online. In both online and offline races, players earn NASCAR experience points which help unlock rewards such as decal packs or special car designs, as well as career sponsorships and special races throughout career mode. Everything you do on the track counts! With a fresh infusion of real world detail and blistering racing action, NASCAR The Game 2011 completely redefines what fans can expect from a NASCAR racing game. \n\n\n\n               enjoy  please seed!!!!\n\n**************** this game is confirmed working *****************                 \n\nworks on ntsc 4.1u \nusb loader gx 2.1 ios 249 R(17) \ndisk channel (darkcorp v1.1)\n","torrent":{"xt":"urn:btih:b455ac107adb0ff237de61a2749452d8853e0839","amp;dn":"NASCAR++2011+the+game+%5Bwii%5D+%5Bntsc-u%5D+%5Bscrubbed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b455ac107adb0ff237de61a2749452d8853e0839","infoHashBuffer":{"type":"Buffer","data":[180,85,172,16,122,219,15,242,55,222,97,162,116,148,82,216,133,62,8,57]},"announce":[],"urlList":[]}}