{"title":"Corbin Fisher - - - Jacob Fucks Colin ((MictrmbL))","uid":5006369,"size":215934120,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:b4b8d644b228137b0118612ad78b7a1c5d3219a2&amp;dn=Corbin+Fisher+-+-+-+Jacob+Fucks+Colin+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mictrmbl","files":2,"time":1247705629,"description":"From the vaults of Corbin Fisher:\n\n\nSince I introduced Jacob in his interview video, the requests have been flooding my inbox to see him in some sort of action scene; either with his GF or one of the other CF studs. And believe me, these requests didn't go unnoticed because even I couldn't wait to get his toned, college boy body back in my studio...\n\nAs he mentioned during our first conversation back on the beach he was definitely interested in banging a chick on camera, but unfortunately for him, his girlfriend didn't share the same opinion. As he regretfully broke the news to me over the phone I couldn't help but think about jumping to the next step and naturally put my negotiation (checkbook) skills to quick use! :)\n\nAfter about a week of consideration on Jacob's end, I was pleased to see his response saying he was on board and yet another hot stud would be continuing his &quot;education&quot; here at CF!\n\nI wanted to take a different approach with this video and instead of pairing him with one of the other seasoned CF straight studs, I decided to pair him with another novice, Colin. You will recall Colin previously did his solo vid and topped Julian... so the timing was perfect to take him to the next step with Jacob.\n\nI didn't give these two a lot of direction because I wanted to see what would happen when two beginners went with the flow and saw what it was all about!","torrent":{"xt":"urn:btih:b4b8d644b228137b0118612ad78b7a1c5d3219a2","amp;dn":"Corbin+Fisher+-+-+-+Jacob+Fucks+Colin+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4b8d644b228137b0118612ad78b7a1c5d3219a2","infoHashBuffer":{"type":"Buffer","data":[180,184,214,68,178,40,19,123,1,24,97,42,215,139,122,28,93,50,25,162]},"announce":[],"urlList":[]}}