{"title":"Trillian.5.Pro.for.Windows.v5.0.0.33-TE","uid":6440713,"size":14591948,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b56da6322c5e865b5d7d38f700d763da322ecc77&amp;dn=Trillian.5.Pro.for.Windows.v5.0.0.33-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":7,"time":1306973950,"description":"TE 2011 PRESENTS\n\nANOTHER FINE RELEASE\n\nRelease: Trillian 5 Pro for Windows v5.0.0.33 (c) 2011 Cerulean Studios\n\nDate: 05/31/2011\n\nCracked By: Twisted EndZ\n\nRelease Type\nRegistration/Serial Crack\nActivation Crack\nTrial Crack\nX Server Check Crack\nSerial\nHidden/Added Features Enabler\nOther\n\nLoader Patcher        Patch      X Precracked        RegFile\nKeygen\n\nRELEASE NOTES\n\nNOTE TO THE NUKER OF BUILD 32\n\nFirst you can't nuke because of a developer issue (if you read\nthe updates on their site, you'd see the some ads popping up were\nactually a bug).  Also if you took time to read that Astra saves\nall your settings and must be connected to do so.  Then removing\na forced update sure can be done but Astra server will deny you a\nconnection to its server and also through some very annoying\nreconnections in the background.  Sure older versions could be\npatched to make them relay a different version, but to do this\nwith the latest build is impossible, who knows what future build\nwill have a forced update when the time comes.  Also having Astra\nserver seeing a newer build that doesn't exist yet isn't very\nsmart.  We have Trillian set to tell the main server your running\ntrial edition so your account that isn't pro, will not show that\nyour client is set to Pro atm.  So next time think about it\nbefore you nuke and provide proof as well, a screenshot.  If you\nwant to blame someone blame the Minor Update rule (any updates to\nan application must wait 2 weeks before it can be pred) or else\nwe would pre an updated crack right away.  If the ads bug you so\nmuch, use the old talk.dll until TE pres the next version\n\nClean. Simple. Powerful\n\nStreamlined social news feeds\n\nTrillian 5's Facebook, Twitter and LinkedIn support is fast,\nuniform and integrated\nComprehensive: More types of feeds, like Facebook events and\nTwitter searches\nFlexible: Store feeds in your contact list and/or system tray\nQuick: Instant updates to all services are just one click away\nInteractive: View likes and read/write comments directly within\nTrillian\nDetailed: Links and pictures are expanded automatically to\navoid opening the web browser\n\nDesigned for Windows 7\nTrillian 5 feels right at home in all versions of Windows. Our\nclean and pleasant user interface has been carefully designed\nto smoothly integrate with the operating system\n\nSynchronized chat history\nNever miss a message again with Trillian 5's fully\nsynchronized chat history. The power of the Trillian network\nensures your contact list, accounts, and chat history are\nautomatically shared between your desktops and phones\n\nFoursquare with GPS support\nOur newly-supported Foursquare plugin lets you meet up with\nnew friends and discover new places Powered by the GPS support\nin Windows 7, you can even check-in right from Trillian\n\nA truly compact interface\nStuck on a netbook with a tiny screen? No problem. Switching\nbetween our full and compact user interfaces is only a click\naway in Trillian 5. No need to change skins, no need to wait,\nand no need to worry about Trillian hogging your desktop\nCompact, slim and fast\n\nWhat is Trillian\n\nConnect to your IM, mail, and social networks in one place\nTrillian can connect to AIM, Windows Live, Yahoo, Google,\nFacebook Chat, Jabber, Skype and a lot more. Trillian 5\nintroduces improved Facebook Chat via XMPP and support for\nFoursquare, LinkedIn, and studiVZ / meinVZ / schuelerVZ chat\n\nFully customizable and extensible\nWith a multitude of options and a comprehensive library of\nplugins, skins and skin packs, you can extend and customize\nTrillian in any way imaginable. Show RSS feeds or even play\nmusic while chugging along with a contact list right out of\nTerminator 5\n\nOptimized for Windows\nTrillian is built directly in C using native Windows APIs\nNot relying on third-party runtimes or toolkits means lower\nmemory consumption and direct access to native Windows\nfeatures as soon as they're made available to developers\nTrillian 5 for Windows is the smoothest and fastest version\nof Trillian ever\n\nWhats New In v5.0.0.33\n\n======\nFIXED\n======\n\n12990Kevin Kurtz FIXEDAlerts Pop-Up\nAdvertisement Notifications steal focus and cause instability\nwith many full-screen 3D applications. Recommend disabling when\ntrillian lacks focus\n13005Kevin KurtzFIXEDMessage Window Don't\n'bulk up' systray ads\n13004Kevin KurtzFIXEDMessage Window If a\nwindow is not in focus, the ad click should not happen\n12982Kevin KurtzFIXEDMessage Window Pro\nlicense - still getting ads\n\nFor More Info on Trillian 5 Pro for Windows Visit &lt;a href=&quot;\nhttp://www.trillian.im/learn/tour-trillian5.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.trillian.im/learn/tour-trillian5.html&lt;/a&gt;\n\nTE Release Filename: tt50033x.zip\n\nINSTALLATION NOTES\n\nStep #1\n\nRun trillian-v5.0.0.33.exe and read below before doing install\n\nIt is prefered that you do not click Launch on the final\ninstallation Window, instead click the X at the top right.  If\nyou clicked launch (don't worry nothing wrong can happen), close\nTrillian 5 down first.  Next copy contents of the Crack folder to\nthe installed folder of Trillian 5 Pro, making sure to overwrite\nthe existing files.  If you have already setup your account with\na previous version then your done, if not follow on to Step #2\nbelow\n\nStep #2\n\nLaunch Trillian 5 Pro and Register a new Trillian Account.  Fill\nout required information (real email is needed for confirmation\nand make sure to UNCHECK I have previously purchased Trillian\nPro.  Check your email and get confirmation code.  Apply code and\nnow continue to setup your IM accounts.  You now how a fully\nregistered version of Trillian 5 Pro  Also remember the Trillian\nAccount IS REQUIRED for your settings to be saved\n\nThats it  Enjoy\n\nT E  2 0 1 1\n\nascii\nby mx\n\nDon't Hate The Hacker,  Hate The Code\n","torrent":{"xt":"urn:btih:b56da6322c5e865b5d7d38f700d763da322ecc77","amp;dn":"Trillian.5.Pro.for.Windows.v5.0.0.33-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b56da6322c5e865b5d7d38f700d763da322ecc77","infoHashBuffer":{"type":"Buffer","data":[181,109,166,50,44,94,134,91,93,125,56,247,0,215,99,218,50,46,204,119]},"announce":[],"urlList":[]}}