{"title":"Tim Knol - Days (2011)(Indie Folk Roots-Rock Acoustic)(Retail)(F","uid":6440420,"size":259336187,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b5c9a7b52b5801a7fe4c31853d9b93fa41f72427&amp;dn=Tim+Knol+-+Days+%282011%29%28Indie+Folk+Roots-Rock+Acoustic%29%28Retail%29%28F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SoundbaronPirateBay","files":23,"time":1306962389,"description":"Music : Indie : Lossless\n\n\n\n\n\n\nTim Knol - Days (2011)(Retail)(FLAC)(HQ Artwork Scans Included)\n\n\n\n\n\n\n\n\n\n\nDutch:\n\nTim Knol groeide op in Hoorn, waar hij ook, vanaf zijn tiende jaar, muziek begon te maken. Lokaal maakte hij indruk met de band Be Right Back waarin hij zong en gitaar speelde. Terwijl hij in die band speelde, werkte hij aan allerlei zij-projecten en nam hij ook solo nummers op. In mei 2008 speelde hij op De avond van het kippenvel van DJ St. Paul in de Utrechtse Ekko, onder andere samen met Anne Soldaat. Samen met onder andere Anne Soldaat nam hij enkele demo's op voor Excelsior Recordings. In mei 2009 besloot hij zijn band vaarwel te zeggen en echt solo door te gaan.\n\nIn juni 2009 verscheen het eerste resultaat van zijn solocarriÃƒÂ¨re, het nummer Cry van Godley &amp; Creme, op het online verzamelalbum Guilty pleasures van de Coverclub. Andere artiesten die te vinden zijn op deze verzamelaar zijn Silence is Sexy, The Gasoline Brothers en Solo.\n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Tim_Knol&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Tim_Knol&lt;/a&gt;\n\n\n\nEnglish:\n\nTim Knol was born and raised in Hoorn, where he started making Music at the age of 10. Locally he made an impression with the band Be Right Back in which he sang and played guitar. While playing in that band, he also worked on various side projects and recorded a couple of solo tracks. In May 2008 he played at De avond van het kippenvel in Utrecht, where he got in contact with Anne Soldaat, formerly of Daryll-Ann. Together they recorded some demos for Excelsior Recordings. In May 2009 he decided to quit his band, and start a solo career. In June 2009 the first result from his solo career, a cover version of Godley &amp; Creme's Cry, appeared on the online compilation album Guilty pleasures. Other artists that appeared on that album ware Silence Is Sexy and Solo.\n\nDuring the Lowlands Festival in August 2009 Knol signed a record deal with Excelsior Recordings. His debut record got positive reviews in the Dutch media. On the album Knol is accopanied by Jacob de Greeuw, Jeroen Kleijn and Matthijs van Duijvenbode from Johan and Anne Soldaat and Reyer Zwart from Do-The-Undo. Knol first presented his songs as a support act for Johan, during their farewell tour in the second half of 2009. After a few try-out concerts, the first big performance of Knol with his new band was at the Noorderslag Festival in Groningen January 2010.\n\nHis debutalbum was released in Great-Britain May 24, 2010 by Excelsior Recordings.\n\nThe songs of Tim Knol are often compared to the roots rock of Gram Parsons, Wilco and Ryan Adams.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Tim_Knol&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Tim_Knol&lt;/a&gt;\n\n\n\n\n\n\n\n\n\nKort na het succes van zijn debuutplaat, begonnen Tim Knol en Matthijs van Duijvenbode, keyboardspeler uit zijn liveband, met het schrijven van nieuwe nummers. Het merendeel van de plaat werd in april en mei 2011 geschreven in een vakantiehuisje in Friesland, waar het tweetal verstoken was van televisie, radio en internet. In juni namen Knol en Van Duijvenbode met de rest van de band demo's op op Vlieland, waar met name Anne Soldaat hielp met het uitwerken van bepaalde arrangementen. Hierna het materiaal werd uitgeprobeerd tijdens de clubtour, die Knol hield, in september en oktober. In november ging Knol naar de Studio Sound Enterprise van Frans Hagenaars om de nummers op te nemen. Groot verschil hierbij was dat dit keer niet werd gekozen voor sessiemuzikanten, maar dat de voltallige liveband van Knol zelf de nummers inspeelde. Eind 2010 waren de opnames van in totaal 15 nummers afgerond. Begin januari speelde Knol diverse nummers van het nieuwe album op Noorderslag en hierna vertrok hij voor een korte tour naar IndonesiÃƒÂ«. In februari 2011 werd het album afgemixt. Na het mixen werd besloten drie nummers te laten afvallen om zo de plaat terug te brengen tot 12 nummers. Een titel voor de plaat bleef lang op zich wachten, maar uiteindelijk werd gekozen voor Days. Op 16 april 2011 verscheen de eerste single van het album Gonna get there als vinylsingle ter ere van Record Store Day, waarvan Knol tevens ambassadeur is. Op de b-kant van de single stond het nummer What the hell, een van de afvallers van de oorspronkelijke opnames. Op 27 april verscheen er ook een videoclip bij het nummer geregiseerd door Teemong, die ook clips regisseerde van Fresku, Winne, The Opposites, Lucky Fonz III en Go Back To The Zoo. In de clip zijn de hoofdrollen weggelegd voor Knol en Van Duijvenbode. Voorafgaand aan de release van het album, plaatste Knol op de website van het radioprogramma MetMichiel van 3FM, een liveopname van een nummer van het album.\n\nOp 20 mei 2011 verschijnt het album zowel op cd als op vinylalbum. Ter promotie van het album worden er drie releaseparty's gehouden op 27 mei in Paradiso in Amsterdam, 28 mei in Manifesto in zijn thuisstad Hoorn en 29 mei in Rotown in Rotterdam.\n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Days_%28album%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Days_%28album%29&lt;/a&gt;\n\n\n\n\n\n\n\n\n\n\nTracklist:\n\n01. Gonna Get There\n02. Days\n03. Shallow Water\n04. A First\n05. Fire Of Love\n06. 1966\n07. Years\n08. Don't Expect Me Too Soon\n09. Do You Leave The Light On?\n10. Lies\n11. Golden Days, Golden Years\n12. A Simple Man\n\n\nMuzikanten:\n\n* Tim Knol - Zang, Akoestische Gitaar\n* Anne Soldaat - Elektrische Gitaar, Zang\n* Matthijs van Duijvenbode - Wurlitzer, Keyboards, Zang\n* Jeroen Overman - Basgitaar\n* Kees Schaper - Drums\n\nAlle nummers zijn geschreven door Tim Knol en Matthijs van Duijvenbode.\n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Days_%28album%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Days_%28album%29&lt;/a&gt;\n\n\n\n\n\n\n\n\n\nENJOY &amp; AS ALWAYS: REMEMBER TO KEEP SEEDING FOR OTHERS!!!\nTHANKS!!\n\n","torrent":{"xt":"urn:btih:b5c9a7b52b5801a7fe4c31853d9b93fa41f72427","amp;dn":"Tim+Knol+-+Days+%282011%29%28Indie+Folk+Roots-Rock+Acoustic%29%28Retail%29%28F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5c9a7b52b5801a7fe4c31853d9b93fa41f72427","infoHashBuffer":{"type":"Buffer","data":[181,201,167,181,43,88,1,167,254,76,49,133,61,155,147,250,65,247,36,39]},"announce":[],"urlList":[]}}