{"title":"Merlin S02D02 (E 05,06,07,08)(ENG)(NL SUBS)2Lions-Team","uid":5167272,"size":4503184473,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b5e50cc6da27adaa73d67568ee477dc7ec22e1a6&amp;dn=Merlin+S02D02+%28E+05%2C06%2C07%2C08%29%28ENG%29%28NL+SUBS%292Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pioen","files":-1,"time":1258480181,"description":"Merlin S02D02       \n\n seizoen 2 episode 5, 6, 7, en 8 op een dvd\n\nDe mythische stad Camelot, in een tijd voor de geschiedenis begon. Een fantastisch rijk van legendarische schepsels en mysterieuze volkeren. Een gevaarlijke wereld waaruit de genadeloze tiran Uther Pendragon elke vorm van magie heeft verboden.\n\nWanneer Merlin, een jongeman met magische krachten, in het koninkrijk aankomt, maakt hij meteen heel wat vijanden. Dankzij zijn mentor Gaius, de wijze lijfarts van Uther, ontdekt Merlijn zijn talenten om de mystieke geheimen van Camelot te ontsluieren en daarmee te overleven. Zo ontdekt hij dat zijn lotsbestemming en die van Arthur, de volgende vorst van het koninkrijk, onlosmakelijk met elkaar verbonden zijn.\n\n\nEnglish\n \n  Merlin is a drama series based around the legends of the mythical wizard and his relationship with Prince Arthur. Set in the early days of their relationship, it shows the development of each in his respective field, finding his way on the path to future greatness. Humour, danger and excitement abound, accompanied by mythical creatures, magic and of course much medieval swashbuckling.\n\n5. Beauty and the Beast (1)\nLady Catrina and her strange servant Jonas arrive in Camelot, where they are welcome to stay by a most delighted king Uther, who becomes captivated by his latest guest. Arthur, on the contrary, far from sharing his father's enthusiasm and in the sight of the flirting going on, is pretty appalled with the situation. Merlin and Gaius have the feeling that she is not what she seems and their suspicions are proven true when Merlin discovers that Lady Catrina is a troll and that unfortunately, her intentions are far beyond the prize of a king's heart. Horrified, he reveals the truth to Arthur, who doesn't believe him. Merlin embarks in the task of proving the real nature of the woman while at the same time saving Uther from ruin and Camelot from fall. Will the young warlock be able to overcome the powerful magic of the troll before it's too late?\n\n6. Beauty and the Beast (2)\nLady Catrina has now been crowned and is now known as Queen Catrina. She accuses Merlin of stealing and he is driven into hiding, and must now find a way to expose her true form.\n\n7. The Witchfinder\nUther is determined to once and for get rid of all the magic being performed inside Camelot. Aredian, a witch finder is called to Camelot to help deal with the problem. Gaius tries to make Merlin see how much danger he is in. Morgana is certain that Aredian will discover her secret and Merlin attempts to protect bother her and Gaius.\n\n8. The Sins of the Father\nArthur is challenged to a dual by a mysterious warrior. Arthur and Merlin then find themselves on a quest on Morgause's behalf. A dark secret is discovered by Arthur that could change Camelot forever.\n\n\n\n\n\nMenu: Ja, simpel\nBron: PDTV XVID\nAudio: Engels 2.0DD\nSubs: Nederlands door Regeer &amp; Falcon\n\nVeel kijkplezier.\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : TV\nThanks : Darkling \n\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Actie\nAvontuur\nFamiliefilm\nTV Shows/Series\n \nWeblink : http://www.bbc.co.uk/merlin/ \n\n***************************************** \n\nBrought to you by \nPioen \n2Lions Team \n\nmeer zien?? \nKom dan eens kijken op ons forum \n   &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n","torrent":{"xt":"urn:btih:b5e50cc6da27adaa73d67568ee477dc7ec22e1a6","amp;dn":"Merlin+S02D02+%28E+05%2C06%2C07%2C08%29%28ENG%29%28NL+SUBS%292Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5e50cc6da27adaa73d67568ee477dc7ec22e1a6","infoHashBuffer":{"type":"Buffer","data":[181,229,12,198,218,39,173,170,115,214,117,104,238,71,125,199,236,34,225,166]},"announce":[],"urlList":[]}}