{"title":"Dokken - Burning Like A Flame","uid":5141614,"size":174798852,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b632d7e7b32c89b9bc64a01412575353c77c4c72&amp;dn=Dokken+-+Burning+Like+A+Flame&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1256981547,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nDokken is an American heavy metal and hard rock band that was formed in 1978. The group accumulated numerous charting singles and has sold more than 10 million albums worldwide.\n\nDokken was composed of founder Don Dokken on vocals, George Lynch on lead guitars, Juan Croucier on bass, and Mick Brown on drums. In 1983 Croucier left Dokken in order to join Ratt and was replaced by Jeff Pilson. Currently, Dokken and Brown remain from the original lineup. After several personnel changes on guitar, Dokken's attorney Jon Levin stepped in to fill the role in 2004. In 2001, Barry Sparks replaced Jeff Pilson on the bass guitar.\n\nIn 2008, Dokken returned to the mainstream music scene with their first studio album in four years titled Lightning Strikes Again. The album was critically acclaimed and it gave the band a return to the charts when it debuted at #133 on the Billboard Top 200 and became their highest charting album since 1995. The album's success has been attributed to its sound which is very similar to the band's material in the 1980s.\n\nBack for the Attack is the fourth studio album by heavy metal band Dokken, released in 1987.\n\nThe album includes a remixed re-release of the song &quot;Dream Warriors&quot;. The song was first released earlier in 1987 as the theme song for the movie A Nightmare On Elm Street 3: Dream Warriors. The two other singles on the album were &quot;Heaven Sent&quot; and &quot;Burning Like a Flame&quot;, the latter reaching #79 on the Billboard Hot 100. There's also a George Lynch instrumental, &quot;Mr Scary. &quot;\n\nFor this album, they toured Japan in April 1988. That tour was recorded for the Beast from the East album, released in 1988. They also performed Van Halen's Monsters of Rock Tour 1988 from May 23-July 30, 1988. After that tour the band broke-up.\n\nThis would be their last studio album until 1995 due to the band's breakup.\n\nBack For The Attack charted at #13 on the billboard U.S. charts, selling over two million copies in the U.S. and over 4 million copies worldwide.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b632d7e7b32c89b9bc64a01412575353c77c4c72","amp;dn":"Dokken+-+Burning+Like+A+Flame","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b632d7e7b32c89b9bc64a01412575353c77c4c72","infoHashBuffer":{"type":"Buffer","data":[182,50,215,231,179,44,137,185,188,100,160,20,18,87,83,83,199,124,76,114]},"announce":[],"urlList":[]}}