{"title":"Forever Night (1998) - anal + DP, dark &amp; gothic classic","uid":5003150,"size":913755916,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:b6e5cbbc178e34691bcaf2e56400d563a4360847&amp;dn=Forever+Night+%281998%29+-+anal+%2B+DP%2C+dark+%26+gothic+classic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"pure_screens","files":12,"time":1247606665,"description":"Forever Night\n\n\n\n\nscreens: &lt;a href=&quot;\nhttp://www.jam-hot.com/pictures/2146/forever-night.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jam-hot.com/pictures/2146/forever-night.html&lt;/a&gt;\n\n\nDVD-covers: &lt;a href=&quot;\nhttp://www.jam-hot.com/pictures/2147/forever-night-covers.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jam-hot.com/pictures/2147/forever-night-covers.html&lt;/a&gt;\n\n\n\n\n\nThis movie is well done: sort of like a mixture of Dark Shadows (the Gothic TV soap opera) and Dallas (the other TV Soap opera). \nThe director (Michael Ninn) has a sort of Tim Burton/Passolini sensibility, and has the ability to get his stars involved in his vision. In this dark and sexy epic, the last angry man turns his back on the heavens for taking his wife and child. The sex and angst slips back and forth between Victorian mansions, deserted grave yards and sullen Bauhaus architecture. What was that I heard? Tell us about the sex! Ok, dear reader. There's more than enough fucking, sucking, raping, petting, kissing, licking and flying cum to please the most avid raincoater!\n\n\n\nActresses\n\n    * Ashley Renee               [LezOnly]\n    * Brittany Andrews\n    * Brooke Lane                [Facial]\n    * Jeanna Fine                [Facial]\n    * Jill Kelly                 [Anal Facial]\n    * Liza Harper                [Anal Facial]\n    * Raylene                    [LezOnly]\n    * Stacy Valentine            [Anal Facial DP]\n\n\n   \nScene Breakdowns\n\n    * Scene 1. guys, Stacy Valentine\n    * Scene 2. guy, Jeanna Fine\n    * Scene 3. Liza Harper, Peter Romero\n    * Scene 4. Ashley Renee, Raylene, Stacy Valentine\n    * Scene 5. Eric Price, Jill Kelly\n    * Scene 6. Brooke Lane, Earl Slate\n    * Scene 7. John Decker, Stacy Valentine\n\n\n\nStudio:          VCA\nReleased:        1998\nFormat:          mpeg\nLanguage:        English\n\n\n\nREVIEW:\n\nForever Night is a dark gothic type film. Jaime Gillis curses God for taking his wife and child. He vows to spend his life in darkness. The eerie, sinister costumes used are great. Many of the male performers are unrecognizable because of the masks used. The film is in both color, and black and white. The cast is made up of some very beautiful females. The sex is hot and nasty. There''s some anal sex and quite a few facial cumshots. I highly recommend it.\n\n\nScene 1: Stacy Valentine and two guys\nFilmed in both color and black and white, Stacy masturbates as Jaime watches her. She fucks herself with a vibrator. Two men, in black sinister looking costumes with masks half white and half black, stand in front and behind her. In slow motion, Stacy sucks dick. She eyes the camera as she sucks on both their cocks, one at a time and with no hands. Stacy gets fucked doggie style (condom used). The guys d. p. her (condom''s used). Both cum on her tongue and face, one at a time. Stacy eyes the camera as the second guy cums on her face. She briefly gives each a suck after they''ve cum. We then see Stacy masturbating some more.\n\nScene 2: Jeanna Fine and a guy\nJeanna sits on a couch with a wig and a leather dress on, and her pussy exposed. Jaime stands and watches. There are two guys in costumes seated in separate chairs. Jeanna strokes one guys cock in her mouth as she eyes the camera. As the camera shows a close-up of Jeanna, you can see she has a lot of make up on her face that makes her look feline. She sucks on the guys tongue. The frames change quickly. Jeanna briefly looks like she''s getting fucked and she sucks on some more dick (not at the same time). She does fuck doggie style and talk dirty. They stand and she bends over as he continues fucking Jeanna from behind. He cums on her face and tongue.\n\nScene 3: Liza Harper and Peter Romero\nLiza sucks on his cock as she eyes the camera. She has a blonde, Victorian wig on. Peter eats her french pussy. They screw reverse cowgirl. In slow motion, Liza slides down on his cock in her ass and then raises herself so the cock is out of her ass. This happens a few times. Peter then sodomizes her from behind. She eyes him as his cum drips off her tongue. Liza then eyes the camera as she takes his dick in her mouth.\n\nScene 4: Stacy Valentine, Ashley Renee and Raylene\nStacy masturbates a little. Jeanna brings Stacy over to Ashley and Raylene as Jeanna, and Jaime watch. The two eat out Stacy and fuck her with a vibrator. The girls d. p. Stacy with vibrators. There''s some dirty talking from the ladies. Stacy holds onto a dildo that is fucking both Raylene and Ashley at the same time. Stacy also tastes Raylene''s pussy. Stacy next holds onto a dildo that''s in their asses (Raylene and Ashley) at the same time.\n\nScene 5: Jill Kelly and Eric Price\nEric is made to look like a devil. Jill undresses in front of the devil. She too has on a blonde Victorian wig. They tongue each other. He fucks her pussy with something that looks like a screwdriver. Jill strokes his cock in her mouth as she eyes the him. Saliva drips from her mouth. The devil licks one of her tits and we see her ride a dildo. They fuck doggie style (condom used). Jill hangs in the air with a strap under her belly holding her up as she gets fucked from behind. They fuck in a couple of positions before this devil gets to fuck Jill''s ass. Jill talks dirty to him. Jill jerks him off as he shoots his cum into her open mouth and on her face. Cum drips out of her mouth and off her face. Cum hangs from Jill''s lower lip. Jill sucks and strokes his dick.\n\nScene 6: Brooke Lane and Earl Slate\nJeanna and Jaime sit at opposite ends of a table and keep repeating dirty words to each other, i. e. fuck stick, hot cunt, honey sweet she juice, dirty pig whore, hot sucking mouth and dirty scum sucking mouth, among others. They then give direction in dirty words as Earl fucks Brooke''s mouth while Brooke eyes the camera. Earl rubs his dick on Brooke''s face at Jaime''s direction. He licks her pussy. Jaime won''t let Earl fuck Brooke until she says please. He inserts his dick, but Jaime has him pull out and Brooke get on her knees. Brooke masturbates and spreads her pussy. Earl begins fucking Brooke. Earl screws Brooke on her back as she masturbates. Earl cums on her stomach. She wipes some of the cum all over her belly. They fuck reverse cowgirl as she masturbates. He cums a little on her face. She licks his cock and eyes the camera.\n\nScene 7: Stacy Valentine and John Decker\nThis is a brightly lit scene. Jaime and Jeanna sit around in white clothes. Stacy touches herself in a white one piece bathing suit. There''s a mist over the pool. John comes up from under the water and joins Stacy. Stacy eyes and blows him (also eyes the camera). John tastes her pussy before fucking it. Jeanna and Jaime watch. John screws Stacy in a couple of positions. He also sodomizes Stacy. He cums by her mouth, but I only saw cum on her chest. Stacy eyes John.\n\n\n\n\n2,700+ torrents: \n(ALWAYS with honest screens &amp; detailed info)\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n\n\n\n\n","torrent":{"xt":"urn:btih:b6e5cbbc178e34691bcaf2e56400d563a4360847","amp;dn":"Forever+Night+%281998%29+-+anal+%2B+DP%2C+dark+%26+gothic+classic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6e5cbbc178e34691bcaf2e56400d563a4360847","infoHashBuffer":{"type":"Buffer","data":[182,229,203,188,23,142,52,105,27,202,242,229,100,0,213,99,164,54,8,71]},"announce":[],"urlList":[]}}