{"title":"Effects Of Alcohol.avi.Xvid.","uid":6348717,"size":126613642,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ba2cdf1e1704b76758fe9e8051091b7167c0312b&amp;dn=Effects+Of+Alcohol.avi.Xvid.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ama007","files":1,"time":1303922135,"description":"Alcohols can be used as a beverage (ethanol only), as fuel and for many scientific, medical, and industrial utilities. Ethanol in the form of alcoholic beverages has been consumed by humans since pre-historic times. A 50% v/v solution of ethylene glycol in water is commonly used as an antifreeze.\n\nSome alcohols, mainly ethanol and methanol, can be used as an alcohol fuel. Fuel performance can be increased in forced induction internal combustion engines by injecting alcohol into the air intake after the turbocharger or supercharger has pressurized the air. This cools the pressurized air, providing a denser air charge, which allows for more fuel, and therefore more power.\n\nAlcohols have applications in industry and science as reagents or solvents. Because of its low toxicity and ability to dissolve non-polar substances, ethanol can be used as a solvent in medical drugs, perfumes, and vegetable essences such as vanilla. In organic synthesis, alcohols serve as versatile intermediates.\n\nEthanol can be used as an antiseptic to disinfect the skin before injections are given, often along with iodine. Ethanol-based soaps are becoming common in restaurants and are convenient because they do not require drying due to the volatility of the compound. Alcohol is also used as a preservative for specimens.\n\nAlcohol gels have become common as hand sanitizers.\n\nTorrent by Ama007 Sri Lanka","torrent":{"xt":"urn:btih:ba2cdf1e1704b76758fe9e8051091b7167c0312b","amp;dn":"Effects+Of+Alcohol.avi.Xvid.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba2cdf1e1704b76758fe9e8051091b7167c0312b","infoHashBuffer":{"type":"Buffer","data":[186,44,223,30,23,4,183,103,88,254,158,128,81,9,27,113,103,192,49,43]},"announce":[],"urlList":[]}}