{"title":"300","uid":5156595,"size":10876553872,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:ba81f5a71551f7e0152d93d33557afce4b7592fb&amp;dn=300&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vacationerUK","files":1,"time":1257885164,"description":"Full HD\n\n300 is a 2007 American action film adaptation of the graphic novel of the same name by Frank Miller, and is a fictionalized retelling of the Battle of Thermopylae. The film was directed by Zack Snyder, while Miller served as executive producer and consultant. The film was shot mostly with a super-imposition chroma key technique, to help replicate the imagery of the original comic book.\nSpartan King Leonidas (Gerard Butler) and 300 Spartans fight to the last man against Persian &quot;God-King&quot; Xerxes (Rodrigo Santoro) and his army of more than one million soldiers. As the battle rages, Spartan Queen Gorgo (Lena Headey) attempts to rally support in Sparta for her husband. The story is framed by a voice-over narrative by the Spartan soldier Dilios (David Wenham). Through this narrative technique, various fantastical creatures are introduced, placing 300 within the genre of historical fantasy.\n300 was released in both conventional and IMAX theaters in the United States on March 9, 2007, and on DVD, Blu-ray, and HD DVD on July 31, 2007. The film's opening was the 24th largest in box office history, although critics were divided over its look and style. Some acclaimed it as an original achievement, while others criticized it for favoring visuals over characterization and its controversial depiction of the ancient Persians.","torrent":{"xt":"urn:btih:ba81f5a71551f7e0152d93d33557afce4b7592fb","amp;dn":"300","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba81f5a71551f7e0152d93d33557afce4b7592fb","infoHashBuffer":{"type":"Buffer","data":[186,129,245,167,21,81,247,224,21,45,147,211,53,87,175,206,75,117,146,251]},"announce":[],"urlList":[]}}