{"title":"Coraline.2009.DVDrip[vice]","uid":5152545,"size":599479149,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ba982303a04b56dab182141153e346b44d2ff98e&amp;dn=Coraline.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1257641166,"description":"ENGLISH ANIMATION\n\nCORALINE 2009 DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 01:40:31\nvideo bitrate 768\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCAST\n\nDakota Fanning\nTeri Hatcher\nKeith David\nRobert Bailey Jr.\nJohn Hodgman\nJennifer Saunders\nDawn French\nIan McShane\n\nPlot\n\nCoraline Jones (Dakota Fanning) and her parents, Mel and Charlie Jones (Teri Hatcher and John Hodgman) leave their relatively comfortable lives in Pontiac, Michigan and move into the Pink Palace Apartments in Ashland, Oregon, which is a converted mansion that they share with retired actresses Miss Spink and Miss Forcible (Jennifer Saunders and Dawn French) and retired Russian circus performer Mr. Bobinsky (Ian McShane). Coraline's parents are busy working on a gardening catalog, which leaves them with little time for Coraline. She meets Wybourne &quot;Wybie&quot; Lovat (Robert Bailey Jr.), a talkative neighborhood boy and his nameless black cat (Keith David) while exploring her new home. Wybie has been told to avoid the house by his grandmother (who is the landlady of the Pink Palace), as her twin sister had disappeared there years ago as a child. The next day, Wybie gives Coraline a button-eyed doll that has an uncanny resemblance to her. She also finds a small locked door that had been wallpapered over, and when she insists her mother unlock it, she is surprised to find nothing but a brick wall.\n\nThat night, Coraline is awoken by the sound of mice, and follows their trail to the small door. Opening it, she finds a passageway instead of the brick wall, and crawls through it. On the opposite side, she finds herself in the &quot;Other World&quot;, which is inhabited by button eyed doppelgangers of her parents, the Other Mother and the Other Father. The &quot;Other Parents&quot; seem to be much warmer and attentive than Coraline's real parents, particularly her Other Mother, who does everything she can to impress Coraline. Coraline continues to return to the Other World and is entertained by &quot;other&quot; versions of Wybie and the neighbors. But when she falls asleep, she finds herself back in her normal world. Coraline's attempts to compare her normal world with that of the Other World raises tension between her and her mother, who slowly tries to be more affectionate to Coraline (and fails).\n\nOn her third visit to the Other World, Coraline sees the black cat she saw earlier on. He warns her of the dangers of the Other Mother, but Coraline doesn't listen. Later, after a show performed for her by the Other Miss Spink and Forcible, Coraline's Other parents offer to let her stay there forever, but only if she agrees to allow them to sew buttons in her eyes. Scared, Coraline rejects the offer and tries to go to sleep, but finds she's unable to return to her normal world. When Coraline refuses to call the Other Mother her real mother, she becomes angry and transforms into a wretched witch, trapping Coraline in a mirror until she's &quot;ready to be a loving daughter&quot;. In the mirror, Coraline meets the ghosts of three button eyed children, including that of Wybie's grandmother's sister, who explain the Other Mother or &quot;Beldam&quot; kidnaps children from the real world, sewing buttons over their eyes with the promise of a happier life, and slowly consumes their souls. They also explain that the rag dolls are actually the Beldam's spies. Just as she promises to find the childrens' eyes to free their souls, she is rescued from the mirror by Other Wybie, who helps her back into her world.\n\nBack home, Coraline finds her parents have disappeared. Coraline visits the real Miss Spink and Forcible, who give her a seeing stone made from old candy for protection. After seeing an image of her parents shivering in the mirror, she realizes they have been kidnapped by the Other Mother. After preparing herself for the mission ahead, Coraline returns to the Other World, and demands that the Beldam return her parents. Coraline then challenges the Beldam to a game to find her parents and the eyes of the three children. If she loses, she will stay in the Other Mother's world and let her sew buttons on her eyes. If she wins, then everyone will be freed.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0327597/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0327597/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:ba982303a04b56dab182141153e346b44d2ff98e","amp;dn":"Coraline.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba982303a04b56dab182141153e346b44d2ff98e","infoHashBuffer":{"type":"Buffer","data":[186,152,35,3,160,75,86,218,177,130,20,17,83,227,70,180,77,47,249,142]},"announce":[],"urlList":[]}}