{"title":"Amerika's Historic Moment(biblical prophecy&amp;marxist Obama tak","uid":5102345,"size":589589420,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bb890fdcc5a44f52be87c32452ec9bdbb74ec8c1&amp;dn=Amerika%5C%27s+Historic+Moment%28biblical+prophecy%26marxist+Obama+tak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1254083100,"description":"This is Bob Trefz's amazing video lecture Amerika's Historic Moment which explains how biblical prophecy foretold the marxist takeover of the forces behind the current US president Barrack Obama. Immediately after election Obama begins a gigantic program of redistribution of wealth, as done previously by all marxist leaders. Also he established a multi-billion program to reeducate America's youth as Hitler did with his Hitlerjugend in Germany. Find out how Obama actually has muslim roots and that he was extensively indoctrinated into extremist forms of jihad islam before he &quot;converted&quot; to marxism. What is the role of the Catholic church and particularly the Jesuit order in formation of islam and their liberation theology which has severe marxist overtones? Was Obama mentored by a member of America's leftist terrorist organization Weather underground which planned mass murder of the capitalist class? Trefz combines passages from the bible to provide a spiritual as well as historic insight into the events transpiring before our eyes. See for yourself how does America's &quot;historic moment&quot; fit in to the broader picture of the three angel's messages as recorded in the biblical prophecy. 1h 10 min. long. A must see for everyone.\n\nVideo specs:\nVideo codec: xvid, 720x480, 1000 kbps\nAudio codec: MP3, 48kHz, Stereo\n","torrent":{"xt":"urn:btih:bb890fdcc5a44f52be87c32452ec9bdbb74ec8c1","amp;dn":"Amerika%5C%27s+Historic+Moment%28biblical+prophecy%26marxist+Obama+tak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb890fdcc5a44f52be87c32452ec9bdbb74ec8c1","infoHashBuffer":{"type":"Buffer","data":[187,137,15,220,197,164,79,82,190,135,195,36,82,236,155,219,183,78,200,193]},"announce":[],"urlList":[]}}