{"title":"Atreyu - Storm To Pass (2nafish)","uid":5182315,"size":136345604,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bc92d8c5b8fb58ea64a8397b2c3e6a301bd030c8&amp;dn=Atreyu+-+Storm+To+Pass+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259305629,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nAtreyu are an American metalcore band from Orange County, California, formed in 1998. The band consists of vocalist/lyricist Alex Varkatzas, guitarists Dan Jacobs and Travis Miguel, bassist Marc McKnight and drummer/vocalist Brandon Saller. The band was originally named &quot;Retribution&quot; but later changed their name to &quot;Atreyu&quot; after the character of the same name from the fantasy book (movie) The Neverending Story when they found out that another band from Hemet, California had been using their original name. Since their formation the band have since released four studio albums, Suicide Notes and Butterfly Kisses, The Curse, A Death-Grip on Yesterday and Lead Sails Paper Anchor, each of which has sold more than 200,000 copies. Their fifth studio album, Congregation of the Damned, was released on 27 October, 2009. In 2008, they were on the Projekt Revolution tour with Linkin Park and headlined the smaller Revolution Stage along with 10 Years, Hawthorne Heights, and Armor for Sleep. \n\nCongregation of the Damned is the fifth studio album from the American metalcore band Atreyu, released through Hollywood Records on October 27, 2009.\n\nThe band started a co-headlining tour with Hollywood Undead and Escape The Fate in October 2009, and as promotion of album have debuted songs like &quot;Bleeding Is a Luxury&quot; at K-Rockathon 14 in New York State Fairgrounds, Syracuse, NY., and &quot;Gallows&quot;. Atreyu has also promoted their new album in many other ways. For example, 5 webisodes, between September 1 to October 20 every two weeks, have been released advertising the album. They describe the album to &quot;make more sense than the other ones because they finally realize what they are.&quot;\n\nThey have also released two songs on their Myspace page, &quot;Stop! Before It's Too Late And We've Destroyed It All&quot; and &quot;Storm to Pass&quot;, on September 13 and September 15, 2009 respectively; &quot;Storm to Pass&quot; was also their first US Radio single from Congregation Of The Damned. &quot;Gallows&quot; was later released on October 20 in a promotional game entitled &quot;Metal Head Zombies,&quot; designed by video game creator Jason Oda (&quot;Dropkick the Faint&quot;) which is a first-person shooter, where fans can play here, the game based loosely on Call of Duty.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:bc92d8c5b8fb58ea64a8397b2c3e6a301bd030c8","amp;dn":"Atreyu+-+Storm+To+Pass+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc92d8c5b8fb58ea64a8397b2c3e6a301bd030c8","infoHashBuffer":{"type":"Buffer","data":[188,146,216,197,184,251,88,234,100,168,57,123,44,62,106,48,27,208,48,200]},"announce":[],"urlList":[]}}