{"title":"Star Wreck (Complete)","uid":6431450,"size":1096112842,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:be99c8f5b6e93a63e267c23496931a045e8f5cc1&amp;dn=Star+Wreck+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"legal-tracker","files":7,"time":1306666262,"description":"A series of funny movies. English Subtitles. You will need two CD's for all films.\n\nFirst movies: &lt;a href=&quot;\nhttp://www.starwreck.com/legacy/movies.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.starwreck.com/legacy/movies.php&lt;/a&gt;\n\nThe first Star Wreck animation was inspired by the classic computer game Star Control 2. Star Wreck I was drawn frame by frame using Deluxe Paint Animation, so the visuals are just as crude as the dialogue. Then again, this was one of Samuli's animations to have dialogue.\n\nSamuli returns to the crime scene in Star Wreck II: The Old Shit, this time with Rudi Airisto, who joins as a writer and the voice for the Vulgar, Mr. Spook.\nThe second film is a huge improvement over the first in every way. This time the space battles and the bridge were rendered in 3D and more sounds and music were added. The acting was much improves and the crew come across as actual personalities. The film is full of slapstick humor and it actually works very well at times.\n\nPirk's fumbling voyages continue in Star Wreck III - Wrath of the Romuclans. There were improvements in the graphics, a more complicated storyline, and lots of new, tasteless humour. Many consider this to be the funniest of the old episodes, although Pirk's excessive swearing did raise a few eyebrows back int he day... Star Wreck III saw the first of the now traditional red-shirted security guard jokes.\n\nIn Star Wreck IV: The Kilpailu (&quot;kilpailu&quot; is Finnish for &quot;competition&quot;, several new characters were introduced, now drawn by Rudi Airisto. He would like to take this opportunity to apologise for the silly-looking Ferret graphics - the palette simply ran out of colours.\n\nDespite it's numbering Star Wreck 4Ã‚Â½ - Weak Performance was actually made after Star Wreck V, even though most of it is re-used footage from Andy Bones II, made years earlier... Confused? So is the plot, where Captain Pirk plays Andy Bones on the Halludeck while Romuclans attack The Kickstart.\n\nSee how Pirk got stranded in the past! Star Wreck V: Lost Contact was the first film to use live actors instead of cartoons. Real sets would have cost too much, so we decided to try bluescreen, just for fun. Our expectations weren't high, but it worked. So the movie was shot against a cheap blue bed-sheet and the blue background was replaced with spaceship bridges.\n\nLicense: http://creativecommons.org/licenses/by-nc-nd/3.0/\n\nStar Wreck: In The pirkinning: &lt;a href=&quot;\nhttp://www.starwreck.com/introduction.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.starwreck.com/introduction.php&lt;/a&gt;\n\nStar Wreck: In the Pirkinning is a feature-length sci-fi parody, seven years in the making. It is the product of a core group of five Finns, and over 300 extras, assistants and supporters. The film combines world-class visual effects, a rough-and-ready sense of humour, and a passion that provide the basis for the first-ever Finnish science fiction adventure.\n\nLicense: http://creativecommons.org/licenses/by-nd-nc/1.0/fi/\n\nFilms made by: Energia Productions Ltd.; Tampere, FINLAND","torrent":{"xt":"urn:btih:be99c8f5b6e93a63e267c23496931a045e8f5cc1","amp;dn":"Star+Wreck+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be99c8f5b6e93a63e267c23496931a045e8f5cc1","infoHashBuffer":{"type":"Buffer","data":[190,153,200,245,182,233,58,99,226,103,194,52,150,147,26,4,94,143,92,193]},"announce":[],"urlList":[]}}