{"title":"Wilby Wonderful.DVDRIP.(spanish).","uid":5018981,"size":733892608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bea076a3ba6660f7014178c92ff6767e830b74aa&amp;dn=Wilby+Wonderful.DVDRIP.%28spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zurera","files":1,"time":1248366331,"description":"Datos tÃƒÂ©cnicos\n\n- GÃƒÂ©nero ComÃƒÂ©dia dramÃƒÂ¡tica\n- Idioma(s) Castellano\n- AÃƒÂ±o de producciÃƒÂ³n 2004\n- Director Daniel MacIvor.\n- Actores protagonistasJames Allodi ,Maury Chaykin , Paul Gross , Rebecca Jenkins , Sandra Oh , Ellen Page , Callum Keith Rennie , Daniel MacIvor , Kathryn MacLellan , Mary Ellen MacLean .\n- CÃƒÂ³dec de audio mp3\n- CÃƒÂ³dec de vÃƒÂ­deo divx\n\n\nSipnosis\n\nWilby wonderful&quot; es una comedia agridulce sobre lo mucho que pueden cambiar las cosas en un solo dÃƒÂ­a. En el transcurso de veinticuatro horas, los habitantes de Wilby, un pequeÃƒÂ±o pueblo de una isla, intentan seguir como si na-da, como si lo que ocurre no fuese para tanto, ante una serie de acontecimientos que sÃƒÂ­ son para mucho. Mientras un escÃƒÂ¡ndalo amenaza con sacudir los fundamentos de la isla de Wilby, Duck MacDonald (Callum Keith Rennie), el dislÃƒÂ©xico pintor de pancartas del pueblo, trata incesantemente de disuadir al deprimido dueÃƒÂ±o del videoclub del pueblo, Dan Jarvis (James Allodi), que intenta, aunque sea sin mucha convicciÃƒÂ³n, llevar a cabo lo que a todas luces pare-ce ser un intento de suicidio. Entretanto, Dan ha contratado los servicios de la superambiciosa agente inmobiliaria, Carol French (Sandra Oh), para que ÃƒÂ©sta le venda la casa. Con esa venta espera atar unos cabos sueltos. Carol, sin embargo, estÃƒÂ¡ mÃƒÂ¡s por la labor de vender la casa de su reciÃƒÂ©n fallecida suegra al alcalde Brent Fi-sher (Maury Chaykin), para poder asÃƒÂ­ entrar en el cÃƒÂ­rculo mÃƒÂ¡s ex-clusivo de la ÃƒÂ©lite de la isla. Para dar ese importante paso social hacia arriba, a Carol le vendrÃƒÂ­a bien la ayuda de su marido policÃƒÂ­a Buddy (Paul Gross). Pero Buddy tiene mÃƒÂ¡s que suficiente con la perennemente sexy, y eternamente perdida, Sandra Anderson (Re-becca Jenkins), que no sabe si va o si viene. A la hija de Sandra, Emily (Ellen Page), no le gusta nada ver a su madre volver a caer, por enÃƒÂ©sima vez, en los brazos de hombres casados, nada reco-mendables. Pero la misma Emily estÃƒÂ¡ a punto de descubrir, por pri-mera vez, y a golpes, algo de lo que tanto hablan: eso de que le rompan a una el corazÃƒÂ³n. Pero todo eso son menudencias al lado de lo que todos van a tener que afrontar a partir de esta noche cuando alguien descubre un cadÃƒÂ¡ver en un armario. Bienvenidos a Wilby.","torrent":{"xt":"urn:btih:bea076a3ba6660f7014178c92ff6767e830b74aa","amp;dn":"Wilby+Wonderful.DVDRIP.%28spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bea076a3ba6660f7014178c92ff6767e830b74aa","infoHashBuffer":{"type":"Buffer","data":[190,160,118,163,186,102,96,247,1,65,120,201,47,246,118,126,131,11,116,170]},"announce":[],"urlList":[]}}