{"title":"Renaldo &amp; The Loaf - Arabic Yodelling (1983)","uid":5144872,"size":51021219,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:beacbb0027a5ef2da1a862dee955035b79da7793&amp;dn=Renaldo+%26+The+Loaf+-+Arabic+Yodelling+%281983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"Sportsaction666","files":16,"time":1257163075,"description":"Renaldo and the Loaf was an English musical duo active in the late seventies and most of the eighties, consisting of a pathologist (David Janssen or &quot;Ted The Loaf&quot;) and an architect (Brian Poole or &quot;Renaldo Malpractice&quot;, most often simply &quot;Renaldo M&quot;).\n\nBy their own assertion, they achieved their unique sound in part by striving to get unnatural synthesizer-like sounds using only what instruments they had available (acoustic ones). To that end they routinely used muffled and de-tuned instruments, and often to striking effect, tape loops / manipulation. The two released four full length albums, one collection, various songs on compilation albums, and several self-produced demos. They were &quot;discovered&quot; by The Residents when Brian dropped off a tape at Ralph Records headquarters in San Francisco, during a visit to the U.S. After being signed to Ralph, they collaborated with The Residents on Title in Limbo.\n\nBy 1989, the collaboration had lost its steam, and the duo disbanded after recording a sea shanty, &quot;Haul on the Bowline,&quot; which appeared only on a Ralph various artists release. Brian/Renaldo contributed to sporadic recordings in the 1990s. In 2006 upon the launch of the new Renaldo &amp; the Loaf web site, the duo were reunited for the first time in the better part of two decades.\n\nDirector Graham Whifler produced a short film in 1980, Songs for Swinging Larvae, from the album of the same name. The film concerns a kidnapped child and raises questions of home and human relationship. The film has since been banned from television and film festivals due to its controversial nature. &quot;Larvae&quot; was premiered at an art museum. It was included first in the Residents' 5 Minute Movies video collection, and later on the comprehensive Icky Flix DVD.\n","torrent":{"xt":"urn:btih:beacbb0027a5ef2da1a862dee955035b79da7793","amp;dn":"Renaldo+%26+The+Loaf+-+Arabic+Yodelling+%281983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beacbb0027a5ef2da1a862dee955035b79da7793","infoHashBuffer":{"type":"Buffer","data":[190,172,187,0,39,165,239,45,161,168,98,222,233,85,3,91,121,218,119,147]},"announce":[],"urlList":[]}}