{"title":"Vanessa Williams - Breathless","uid":5141539,"size":170536964,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c07d9ba84986ef63a9b626f951428d26b403c9a6&amp;dn=Vanessa+Williams+-+Breathless&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1256973952,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nVanessa Lynn Williams (born March 18, 1963) is an American singer, songwriter and actress. Williams made history on September 17, 1983 when she became the first woman of African American descent to be crowned Miss America. Williams' reign as Miss America came to an abrupt end when scandal led to her subsequent resignation of the title. Williams rebounded by launching a career as an entertainer, earning Grammy, Emmy, and Tony Award nominations.\n\nThe Real Thing is the eighth studio album (ninth overall) by Vanessa Williams, released in the United States on June 2, 2009 by Concord Records. The album, produced by Babyface, Keith Thomas, Rob Mathes, and Rex Rideout, features songs written by Stevie Wonder, Bill Withers, Babel Gilberto, Phil Galdston and Babyface. Williams' herself has described the album as &quot;a hybrid of samba, bossa nova, some salsa and also some pop and R&amp;B&quot;. The album's Stevie Wonder-penned title-track was released in the UK as a single (complete with a Soul Seekerz dance remix) on September 28, 2009.\n\nNotable chart performances from subsequent albums, motion picture and television soundtracks have included the songs &quot;Love Is&quot;, &quot;Colors of the Wind&quot;, &quot;Where Do We Go From Here&quot;, and &quot;Oh How the Years Go By&quot;. In total, Williams has sold more than six million records and has received 15 Grammy Award nominations.\n\nIn May 2009, she performed two highly successful concerts at the Tropicana Hotel and Casino in Atlantic City to sold out crowds.\n\nOn June 2, 2009, she released her 8th studio album on Concord Records, titled The Real Thing. It features songs written and/or produced by Babyface, Stevie Wonder, Bill Withers, Bebel Gilberto, and Rex Rideout. The album is &quot; a hybrid of samba, bossa nova, some salsa and also some pop and R&amp;B&quot; says Williams.\n\nWilliams confirmed on September 26, 2009 that she will start to record her ninth studio album in January of 2010 and she also stated that it is due for a Late Summer/Early Fall, 2010 release. It is going to be a pop and R&amp;B album similar to the sound of her 2005 album, Everlasting Love.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c07d9ba84986ef63a9b626f951428d26b403c9a6","amp;dn":"Vanessa+Williams+-+Breathless","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c07d9ba84986ef63a9b626f951428d26b403c9a6","infoHashBuffer":{"type":"Buffer","data":[192,125,155,168,73,134,239,99,169,182,38,249,81,66,141,38,180,3,201,166]},"announce":[],"urlList":[]}}