{"title":"Swing Out Sister - Butterfly","uid":5012946,"size":117147652,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c0a19ed081e321ecd6e289e9122de35667dc5e03&amp;dn=Swing+Out+Sister+-+Butterfly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1248090046,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nSwing Out Sister is a British &quot;sophisti-pop&quot; group best known worldwide for their 1986 song &quot;Breakout&quot;. Other hits include &quot;Twilight World&quot;, &quot;Waiting Game&quot; and a remake of &quot;Am I the Same Girl?&quot; Though their album sales in the U.S. and Europe have leveled off since the 1980s, they continue to attract a loyal fanbase. The group is also very popular in Japan.\n\nLate 2005 saw Swing Out Sister return to their studio in London to commence recording of their new album. The band planned on making a second tour of America in 2006 however due to recording commitments this had to be canceled. In 2006 they composed incidental music for the ITV1 drama The Outsiders, which featured Nigel Harman. August 2007 saw a new single &quot;Secret Love&quot;, co-written by Morgan Fisher.\n\nThe new album from the band was entitled Beautiful Mess and was released by the Japanese record company Avex on February 27, 2008. The title is taken from one of the tracks on the album. Prior to its release in late December 2007, two other tracks were made available for download: &quot;Butterflies&quot; and &quot;Something Everyday&quot;. The album was released in the U.K. in August 2008 and in the U.S. in May 2009.\n\nBeautiful Mess is the title of the ninth studio album by the British pop-smooth jazz group Swing Out Sister. It was produced by group member Andy Connell, who has been with Swing Out Sister since its inception.\n\nBeautiful Mess has received generally favorable reviews from music critics and journalists. Allmusic gave the album four stars out of a possible five. Daryl Easlea of the BBC reviewed the album soon after its British release in September 2008 and described the music as &quot;(s)weet, time-warped; unmistakeable; with their brand of London Embankment sunrises and cocktail party sunsets, it's so very Swing Out Sister&quot;. The reviewer continued that &quot;Swing Out Sister could still give Adele, Duffy and all the latest crop a spin in their soft top for their money.&quot; Elysa Gardner of the USA Today chose &quot;Time Tracks You Down&quot; as one of her ten most intriguing tracks for the week on 18 May 2009, stating that &quot;(r)etro-soul doesn't get much smoother or sweeter than this...&quot; Music critic Mario Tarradell of the Dallas Morning News gave the album an &quot;A&quot; rating, describing it as &quot;exquisite&quot; and stating that the group &quot;continue to make gorgeously lush and rhythmically jazzy albums whether stateside audiences care or not.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c0a19ed081e321ecd6e289e9122de35667dc5e03","amp;dn":"Swing+Out+Sister+-+Butterfly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0a19ed081e321ecd6e289e9122de35667dc5e03","infoHashBuffer":{"type":"Buffer","data":[192,161,158,208,129,227,33,236,214,226,137,233,18,45,227,86,103,220,94,3]},"announce":[],"urlList":[]}}