{"title":"Democracy Now - 25 apr 2011","uid":6343396,"size":443781629,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c1137558b8851db12393afafb0dbc05aabd31872&amp;dn=Democracy+Now+-+25+apr+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1303750464,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Apr 25, 2011\n\n- WikiLeaks Documents Reveal Over 150 Innocent Men Knowingly Held At GuantÃƒÂ¡namo\n- Yemen President Accepts Plan To Step Down, Security Forces Continue Crackdown\n- Syria Deploys Troops And Tanks In Continuing Crackdown, 20 Killed, Border Sealed\n- NATO Bombs Gaddafi Compound Injuring Dozens, U.S. Senators Call For Escalation Of Mission\n- Iraq: Thousands Protest Extended U.S. Occupation\n- U.S. Federal Court Reinstates Case Against Blackwater Guards In Iraq Massacre\n- 500 Prisoners Escape Prison In Afghanistan\n- Japan: Damaged Nuclear Plant Released More Radioactive Material Than Previously Estimated; Thousands Call for Nuclear Moratorium\n- Pakistan: NATO Supply Route Blocked By Drone Strike Protesters\n- Rep. Markey Calls For Probe Into iPhone Location Tracking Technology\n- Obama: Wikileaks Suspect Broke Law, Dismisses Similarity To Daniel Ellsberg\n\n\nSpecial reports\n\n- Syrian Crackdown Intensifies: Over 150 Killed Since Friday as Assad Regime Attempts to Crush Protest Movement\n\nSyria has intensified its massive crackdown on demonstrators, despite the lifting of emergency rule last week that banned demonstrations. Al Jazeera reports thousands of troops backed with tanks have swept into the southern city of Daraa, where a curfew is in place, setting up snipers on rooftops and killing at least 20 people. Government security forces have also stormed the large Damascus suburb of Douma. These latest developments follow protests on Friday that ended with more than 100 people killed in the deadliest day since the uprising began. We go to Syria to speak to Rula Amin of Al Jazeera and Razan Zaitouneh, human rights lawyer and activist.\n\n\n- First Tunisa, Then Egypt, Now Yemen? Yemini President Saleh Agrees To Resign Within 30 Days; Protests Continue\n\nYemen's longtime President Ali Abdullah Saleh has reportedly accepted a plan designed by neighboring Arab nations to hand over power within weeks, following three months of street protests. If he actually resigns, Saleh would become the third leader in the region to resign in the last three months. But demonstrations are continuing in Yemen because many people do not believe Saleh will keep his promise. Earlier today, at least 10 people were injured in the Yemeni city of Taiz after security forces opened fire. We speak to independent journalist Laura Kasinof who has just left Yemen where she was reporting for the New York Times.\n\n\n- WikiLeaks Documents Reveal U.S. Knowingly Imprisoned 150 Innocent Men At GuantÃƒÂ¡namo\n\nThe whistleblowing website WikiLeaks has begun releasing thousands of secret documents from the U.S. military prison at GuantÃƒÂ¡namo Bay that reveal the Bush and Obama administrations knowingly imprisoned more than 150 innocent men for years without charge. In dozens of cases, senior U.S. commanders were said to have concluded that there was no reason for the men to have been transferred to GuantÃƒÂ¡namo. Among the innocent prisoners were an 89-year-old Afghan villager and a 14-year-old boy who had been kidnapped. Some men were imprisoned at GuantÃƒÂ¡namo simply because they wore a popular model of Casio watches, which had been used as timers by Al Qaeda. The documents also reveal that the journalist Sami al-Hajj was held at GuantÃƒÂ¡namo for six years partly in order to be interrogated about his employer, the Al Jazeera network. Al-Hajj's file said he was sent to GuantÃƒÂ¡namo in order to &quot;provide information on ... the al-Jazeera news network's training programme, telecommunications equipment, and newsgathering operations in Chechnya, Kosovo and Afghanistan.&quot; For more we speak with journalist Andy Worthington, author of, &quot;The GuantÃƒÂ¡namo Files: The Stories of the 774 Detainees in America's Illegal Prison.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c1137558b8851db12393afafb0dbc05aabd31872","amp;dn":"Democracy+Now+-+25+apr+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1137558b8851db12393afafb0dbc05aabd31872","infoHashBuffer":{"type":"Buffer","data":[193,19,117,88,184,133,29,177,35,147,175,175,176,219,192,90,171,211,24,114]},"announce":[],"urlList":[]}}