{"title":"W.A.S.P. - Forever Free","uid":5161910,"size":154413060,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c12e751ac861a6371a1560ee48a9b90a2c1138b1&amp;dn=W.A.S.P.+-+Forever+Free&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258198860,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Forever Free&quot; is a power ballad by W.A.S.P. from their 1989 album The Headless Children. It was the third single released from that album.\n\nThe lyrics take place &quot;deep in the night&quot; and tell the story of a lonely man who is on the road to &quot;nowhere&quot;. He hears shadows whispering to him to go to &quot;forbidden forests by the shore&quot; where before him an angel falls from the light of heaven. As he embraces her, the angel tells him that she must leave him and tells him not to cry for her because she will forever be free in the form of &quot;wind&quot;. She then turns into a breeze whispering the angel's name and blows away from the man's arms. The man is heartbroken at losing her and knows that he'll love the angel forever. He is left lonely once more, but now has his love to live for.\n\nThe Headless Children was the fourth studio album by American heavy metal band W.A.S.P., released by Capitol Records in 1989.\n\nThe cover shows a string of historical figures, prominently featuring a picture of Jack Ruby shooting Lee Harvey Oswald.\n\nThe album was the last studio album to feature guitarist Chris Holmes in nearly a decade until he rejoined W.A.S.P. in late 1997 to record Kill F*** Die.\n\nW.A.S.P. is an American heavy metal band formed in 1982. They emerged from the same Los Angeles scene that spawned MÃƒÂ¶tley CrÃƒÂ¼e, Ratt, Quiet Riot and others. The band's popularity peaked in the 1980s, yet they continue to record and tour, making them one of the most enduring of the West Coast heavy metal bands. W.A.S.P. gained notoriety for their shock rock themed image, lyrics and live performances. They have sold over 12 million albums.\n\nThe band were a prominent target in the mid-1980s of the Parents Music Resource Center (PMRC) led by Tipper Gore, wife of then-Senator Al Gore (D-TN), an organization that pushed for warning labels on recorded music. The band immortalized its fight with the PMRC on the song &quot;Harder, Faster&quot; from their 1987 live album, Live...In the Raw.\n\nBlackie Lawless remains the only member from the original line-up. They released their most recent album in October 2009, entitled Babylon.\n\nIn October 2007, W.A.S.P. embarked on The Crimson Idol Tour, to celebrate that album's 15th anniversary. It is the first time that the album, often regarded to be among the band's finest work, was to be played in full from start to finish. The tour kicked off in Greece, in Thessaloniki at the Principal Club Theater on October 26, 2007. It was also announced that this tour would be W.A.S.P.'s last tour for some time. However, the band already confirmed some European festival appearances for summer 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c12e751ac861a6371a1560ee48a9b90a2c1138b1","amp;dn":"W.A.S.P.+-+Forever+Free","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c12e751ac861a6371a1560ee48a9b90a2c1138b1","infoHashBuffer":{"type":"Buffer","data":[193,46,117,26,200,97,166,55,26,21,96,238,72,169,185,10,44,17,56,177]},"announce":[],"urlList":[]}}