{"title":"SDGO2010","uid":6425335,"size":33143806058,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c193140ece2168f902f1db08d0d121be76ec8750&amp;dn=SDGO2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ceeaffa","files":14,"time":1306442935,"description":"1080p full HD 25 frames per second MP4 first round average bitrate 20.5 MBPS the rest 23.5 MBPS. This is the highest quality disc golf video in terms of technical quality that has been released to our knowledge.\n\nYou need a media player software such as the free VLC available from www.sourceforge.net or Media Player Classic. If you are unlucky you may need to install new codecs to playback the video correctly. We have successfully used K-Lite Codec Pack. Prior to installing it please remove old codecs. Use Google to see how it is done for your operating system. We can't offer that kind of help.\n\nThis video covers the leading players of The Stockholm Disc Golf Open 2010 -a Euro Tour 2010 event.\n\nDisc golf is an exciting lifetime sport that can be played by almost anyone and it is cheap. You can play with just one disc and most courses are free to play in and don't have tee times. The object of the sport is the same as in golf and many of the rules are the same. The discs are different from beach frisbees and fly much farther. Flat land distance record is 250 meters -820 feet.\n\nFor more information about the exciting sport of disc golf please visit www.pdga.com You can find where your closest course is also at www.discgolfcoursereview.com. For detailed analysis and help on training how to become better in playing the game please visit www.discgolfreview.com and especially the articles on the main page and the forums where i JR and many others are there to help you.\n\nFor help in including disc golf to physical education curriculum in a school near you please contact the EDGE at: http://www.edgediscgolf.org/\n\nThis video is free for everyone so please share, tell about and show it to everyone. Most of all please copy it to everyone willing and ask them to share it and keep on uploading the videos so that everybody else can enjoy this video too. The idea is to grow the sport.\n\nThe music is not free to use so if you want to use it please contact the band.\n\nYou can switch to the no commentary audio track that is the default. The with commentary audio track is track number two.\n\nFor lots more disc golf videos please visit Youtube channels lcgm8 and mfranssila. And just write disc golf as a search word on Youtube.\n\nEnjoy,\n\nCameraman and host Janne RÃƒÂ¤sÃƒÂ¤nen and editor Juha AlkkiomÃƒÂ¤ki.","torrent":{"xt":"urn:btih:c193140ece2168f902f1db08d0d121be76ec8750","amp;dn":"SDGO2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c193140ece2168f902f1db08d0d121be76ec8750","infoHashBuffer":{"type":"Buffer","data":[193,147,20,14,206,33,104,249,2,241,219,8,208,209,33,190,118,236,135,80]},"announce":[],"urlList":[]}}