{"title":"Rock Star: SUPERNOVA","uid":5179827,"size":10308794368,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c1b1dadd46540332d04e9466cefbe04d35de3037&amp;dn=Rock+Star%3A+SUPERNOVA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ralaz2","files":33,"time":1259179444,"description":"Rock Star: Supernova was the second season of the reality television show Rock Star. The show, hosted by Dave Navarro and Brooke Burke, featured 15 contestants competing to become the lead vocalist for a newly formed supergroup featuring MÃƒÂ¶tley CrÃƒÂ¼e drummer Tommy Lee, former Metallica bassist Jason Newsted, and former Guns N' Roses guitarist Gilby Clarke. As the show's name implies, the new group was to be called Supernova; however, another band named Supernova was granted an injunction against the television supergroup stating that they cannot use the name &quot;Supernova&quot; for any promotion or perform under that name. With this judicial ruling, the band announced their official name would be &quot;Rock Star Supernova&quot;.\n\nThe show began online on the Rock Star web site on MSN on Monday, July 3 with an Internet exclusive weekly episode and premiered on 5 July 2006 on CBS in the United States and Global in Canada. Votes could be cast on the Rock Star website or by text message on Verizon Wireless. it was one of two prominent programs in the &quot;Rock Reality Show&quot; mini movement of the summer of 2006, the other being VH1's SuperGroup.\n\nUnlike in the first season, the behind-the-scenes episodes were not televised in the U.S.; instead, they were available online at the official MSN sponsored website, to subscribers of Verizon, and through the Rock Star tab on Windows Live Messenger. However, these &quot;In the Mansion&quot; reality episodes did air on television in Canada on Global, in Australia on Foxtel channel FOX8, and in Asia on STAR World.\n\nThere are 33 episodes in this pack, all are TV rips from STAR World.","torrent":{"xt":"urn:btih:c1b1dadd46540332d04e9466cefbe04d35de3037","amp;dn":"Rock+Star%3A+SUPERNOVA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1b1dadd46540332d04e9466cefbe04d35de3037","infoHashBuffer":{"type":"Buffer","data":[193,177,218,221,70,84,3,50,208,78,148,102,206,251,224,77,53,222,48,55]},"announce":[],"urlList":[]}}