{"title":"Coast to coast AM 2011-05-16 Paranormal Communications","uid":6409154,"size":56682477,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c1d1dae2e98c99014ec9a18ec191214d5f15d6ad&amp;dn=Coast+to+coast+AM+2011-05-16+Paranormal+Communications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":6,"time":1305915505,"description":"\nMiscellaneous\nDate: 05-16-11 \nHost: George Noory \nGuests: Paul F. Eno, Benjamin Eno, Jonathan Emord \nFather &amp; son paranormal investigators Paul &amp; Ben Eno discussed their new adventures exploring the multiverse which include communications with humanoids from parallel dimensions who have knowledge of major changes between 2012 and 2016. Paul outlined his theory that ghosts actually exist in a parallel world, going about their lives where it's still 1790 or whatever time frame they're in. For example, in a case they investigated in a Connecticut home in 2005, legs were seen dangling from the ceiling as though walking on a surface that wasn't in our world, he recounted. \n\nIn the Conn. case, they learned that the house was one point in a geographical triangle, with another nexus being an area known for military/UFO activity. Paul and Ben (who'd mentored with a Aztec shaman) investigated, and found a locked building, which Ben sensed contained a portal that the government knew about. Such portals might connect people to the other dimensions in the multiverse, and Ben is learning to move portals, Paul announced. He also compared the multiverse to a large apartment building, in which not all the dwellers were even aware there were other apartments. \n\nPaul described parasites as beings of about 9 different species from parallel worlds, who feed off negative human energy. Regarding the period of 2012-2016, they learned from entities such as the &quot;Clerics&quot; (tall, gentle humanoids) that an &quot;interdimensional war&quot; will take place after the parasites' feeding discontinues. Paul also sees a &quot;self inflicted disaster&quot; on the planet before 2016, which he thinks is related to a nuclear attack. Another realm, he called the &quot;good world,&quot; may serve as an escape option for us, he added. \n\nNote: Paul Eno is teaching a class, &quot;Science, Religion, &amp; the Paranormal&quot; at the Intl. Metaphysical Univ. \n\nRaw Milk Crackdown\nFirst hour guest, constitutional attorney Jonathan Emord talked about an Amish farmer being arrested for selling unpasteurized milk. The farmer was set up in a sting operation by the FDA, even though his raw milk has been tested as safe. Emord suggested that the FDA has become captive to big business, who seek to eliminate the option of unpasteurized milk for consumers. \n\nNews segment guests: Bruce Goldberg, Dr. Leonard Coldwell , Richard C. Hoagland \n\nWebsite(s): \nnewenglandghosts.com\nbehindtheparanormal.com\nemord.com\nBook(s): \nTurning Home: God, Ghosts and Human Destiny\nGlobal Censorship of Health Information\nThe Rise of Tyranny\n\n","torrent":{"xt":"urn:btih:c1d1dae2e98c99014ec9a18ec191214d5f15d6ad","amp;dn":"Coast+to+coast+AM+2011-05-16+Paranormal+Communications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1d1dae2e98c99014ec9a18ec191214d5f15d6ad","infoHashBuffer":{"type":"Buffer","data":[193,209,218,226,233,140,153,1,78,201,161,142,193,145,33,77,95,21,214,173]},"announce":[],"urlList":[]}}