{"title":"12 Rounds.mp4","uid":5174131,"size":887090636,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:c37f45bb8d4162c888f8639f1d14394ffc798950&amp;dn=12+Rounds.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1258860759,"description":"dvd rip of 12 Rounds in .mp4 Iphone format english\n\n\n12 Rounds(2009)\n\nDetective Danny Fisher (John Cena) is about to have the worst day of his life. A nearly untraceable internationally-known terrorist named Miles Jackson (Aidan Gillen) has kidnapped his girlfriend Molly Porter (Ashley Scott) and forced him into &quot;12 Rounds&quot; of dangerous games carefully plotted throughout the streets of New Orleans. Danny struggles to keep focus while the obvious ticking clocks and crude consequences that accompany each one of these &quot;rounds&quot; do their best to derail him from rescuing the love of his life before it's too late. The movie is 108 minutes long. [D-Man2010]\n\nA New Orleans police detective's girlfriend is kidnapped. WWE champion John Cena is New Orleans Police Detective Danny Fisher. When Baxter stops a brilliant thief from getting away with a multi-million-dollar heist, the thiefs girlfriend is accidentally killed. After escaping from prison, the criminal mastermind enacts his revenge, taunting the cop with a series of near-impossible puzzles and tasks 12 roundsthat Baxter must somehow complete to save the life of his fiancÃƒÂ©e.","torrent":{"xt":"urn:btih:c37f45bb8d4162c888f8639f1d14394ffc798950","amp;dn":"12+Rounds.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c37f45bb8d4162c888f8639f1d14394ffc798950","infoHashBuffer":{"type":"Buffer","data":[195,127,69,187,141,65,98,200,136,248,99,159,29,20,57,79,252,121,137,80]},"announce":[],"urlList":[]}}