{"title":"Metallica - Mama Said","uid":5014584,"size":170866692,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c3dc69cca688f7c7563875b4787a2c052988be0e&amp;dn=Metallica+-+Mama+Said&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1248165165,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Mama Said&quot; is a Metallica song on the band's sixth album, Load. The lyrics, written by James Hetfield, represent a man or boy who is learning to find his own way in life away from his mother. The song is almost directly written about Hetfields' difficult relationship with his mother, who died of cancer.\n\nThe song stands out among Metallica's predominantly metal catalog; its genre-blending style incorporates country and hard rock. &quot;Mama Said&quot; begins with acoustic guitar and, during the chorus, becomes flush with a country-flavored vocal harmony and steel guitar. Toward the end the song features power chords on electric guitar.\n\n&quot;Mama Said&quot; has never been featured as a part of Metallica's live setlist. Hetfield has performed this song live, however, using a single steel-stringed acoustic guitar with no drum or bass accompaniment. He also performed it along with country singer Jessi Colter on CMT's Outlaw Concert, along with Hetfield's cover of Waylon Jennings's &quot;Don't You Think This Outlaw Bit Done Got Out of Hand.&quot;\n\nLesser known among Metallica's music video catalog, the &quot;Mama Said&quot; video focuses on James Hetfield sitting in the backseat of a car while playing the song on an acoustic guitar. The vehicle appears to be driving along a Southwestern highway, and at one point the other members of Metallica are seen outside looking into the window. As the song comes to an end, the view pulls back to reveal that Hetfield has been sitting in a stationary backseat inside a studio. He then walks over to a horse, takes its bridle, and walks off screen.\n\nLoad is the sixth studio album by American heavy metal band Metallica, released June 4, 1996. To date, the album has sold over 5 million copies in America, and is certified Gold in the UK, having sold over 100,000 copies. It spent four consecutive weeks at #1 on Billboard 200.\n\nAccording to drummer Lars Ulrich: &quot;This album and what we're doing with it - that, to me, is what Metallica are all about: exploring different things. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c3dc69cca688f7c7563875b4787a2c052988be0e","amp;dn":"Metallica+-+Mama+Said","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3dc69cca688f7c7563875b4787a2c052988be0e","infoHashBuffer":{"type":"Buffer","data":[195,220,105,204,166,136,247,199,86,56,117,180,120,122,44,5,41,136,190,14]},"announce":[],"urlList":[]}}