{"title":"The Adventures of Robert Savage - Volume 1 (1971) [mp3@320]","uid":6414836,"size":86397788,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c44b2fa80b2a18c2f20a2dc78263bfc6b0d11c30&amp;dn=The+Adventures+of+Robert+Savage+-+Volume+1+%281971%29+%5Bmp3%40320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"zibbik","files":12,"time":1306135802,"description":"Artist: The Adventures of Robert Savage\nTitle: Volume 1\nGenre: Heavy Psych,Blues\nOrigin: US\n\nTracklist:\n\n01. Beaver Baby (3.10)\n02. Milk Run (3.13)\n03. Don\\'t Run And Hide (4.06)\n04. A Hard One (3.22)\n05. 7 Days Drunk (4.32)\n06. Save Us From The Cyclops (5.51)\n07. Amy (3.53)\n08. Lonely World (3.12)\n09. Road Apples (4.29)\n\nBand:\n- Don Parish - Vocals, Bass\n- Robert Savage - Vocals, Guitar\n- Tommy Richards - Drums\n\nVolume 1 is the First and only Album by the American Hard-Rock Psychedelic Band The Adventures Of Robert Savage.\nLittle is known about this Band, apart from having recorded this Album in California, United States, so it is thought that they are Americans. I really don\\'t know what i can say about them, because there is really no information, and the fact that they are Americans is already a supposition. The Cover-Art may be misleading, i thought this was a Medieval Rock Album, while it is a 70\\'s Hard-Rock Album. It is very good nonetheless, a fantastic drawing of an hero slaying a Dragon on the top of a cliff.\nThe opening song, \\&quot;Beaver Baby\\&quot; starts with a strong Guitar Riff, very groovy, and some extraordinary Vocal work, especially the Female. The song is very powerful, and it is undoubtedly one of the best songs in the Album. \\&quot;Milk Run\\&quot; there are parts of the song thar are extremely enjoyable, the Vocals for instance, have some great moments (some weren\\'t so great) and the Guitar Solo is also something which should not be discarded. \\&quot;DonÃ‚Â´t Run And Hide\\&quot; best part is the Refrain, which unfortunately is repeated only a few times, for a music this long. The Drums take the lead role in \\&quot;A Hard One\\&quot;, which is a very Soul-full song, with Jimi Hendrix like Vocals. This one, \\&quot;7 Days Drunk\\&quot;, would be better of without the Guitars, because it as some very catchy moments, but they don\\'t correspond to the Guitar lines. The largest song in the Album is probably also the weakest \\&quot;Save Us From The Cyclops\\&quot;, is extremely tedious, and has the smell of something that has been rotten for ages. \\&quot;Amy\\&quot; starts bad, but it starts getting better and better, until the moment where a Guitar full of effects, starts a Kick-Ass Solo. \\&quot;Road Apples\\&quot; is truly a great finale. A 4 and an half minutes instrumental Jam, with a fantastic Guitar work and an amazing Beat. It is truly the best end this Record could have.\nVolume 1 indicates that they intended to record more Albums, but it never happened. \n\n","torrent":{"xt":"urn:btih:c44b2fa80b2a18c2f20a2dc78263bfc6b0d11c30","amp;dn":"The+Adventures+of+Robert+Savage+-+Volume+1+%281971%29+%5Bmp3%40320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c44b2fa80b2a18c2f20a2dc78263bfc6b0d11c30","infoHashBuffer":{"type":"Buffer","data":[196,75,47,168,11,42,24,194,242,10,45,199,130,99,191,198,176,209,28,48]},"announce":[],"urlList":[]}}