{"title":"Ronnie Scott Quintet - Never Pat A Burning Dog (FLAC)","uid":6411430,"size":440229604,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c5616e547c60f129368cecb025122ac062119b16&amp;dn=Ronnie+Scott+Quintet+-+Never+Pat+A+Burning+Dog+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiddler22","files":11,"time":1305987433,"description":"\n\nReview - Dave Gelly:\nConsidering the fact that he owned a club equipped with state-of-the-art recording facilities and played there nightly for weeks on end, it is amazing how few Ronnie Scott records actually exist. This was the last one he made, recorded in late 1990, and it features the quintet he had been leading for most of the previous decade, with Dick Pearce on trumpet and John Critchinson on piano, along with bassist Ron Matthewson and drummer Martin Drew. Scott's reputation as a wisecracking man of the world concealed an exceptionally sensitive personality and this duality revealed itself in his music. The overwhelming majority of pieces in a Ronnie Scott set were energetic, up-tempo affairs and only rarely would he call a slow ballad. Yet when he did, the weight of feeling he brought to it was deeply affecting. Fortunately, this album contains two such ballads and they are among the best things he ever recorded. They bear out the old adage that the hardest thing in jazz is to play a simple melody with the minimum of decoration. The up-tempo numbers are fine, too, but that goes without saying. The title, incidentally, is the punch-line of a Ronnie Scott joke so ancient and obscure that nobody can now remember what led up to it.\n\n1. Contemplation  \n2. I'm Glad There Is You  \n3. White Caps  \n4. All The Things You Are  \n5. This Love Of Mine  \n6. When Love Is New  \n7. Little Sunflower  \n\nNB: Mornington Lockett (Tenor) replaces Dick Pearce on track 7.\n\n\n\n\n","torrent":{"xt":"urn:btih:c5616e547c60f129368cecb025122ac062119b16","amp;dn":"Ronnie+Scott+Quintet+-+Never+Pat+A+Burning+Dog+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5616e547c60f129368cecb025122ac062119b16","infoHashBuffer":{"type":"Buffer","data":[197,97,110,84,124,96,241,41,54,140,236,176,37,18,42,192,98,17,155,22]},"announce":[],"urlList":[]}}