{"title":"Norah Jones - Chasing Pirates   (2nafish)","uid":5174591,"size":95510532,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c5a058d7e12544c8c444eb1d2a736da63aa0b454&amp;dn=Norah+Jones+-+Chasing+Pirates+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1258849412,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Chasing Pirates&quot; is the first single by American singer Norah Jones from her fourth album, The Fall. It was released exclusively to iTunes on Tuesday, October 13, 2009. The song also had its North American radio station premiere on 97.3 EZ Rock from Toronto, Ontario, Canada on October 9, 2009. Jones said the song marked a new direction for her.\n\nThose who subscribe to Norah Jones's online newsletter get a sneak peak at the upcoming &quot;Chasing Pirates&quot; music video. The sneak peak shows Norah receiving a message in a bottle and attempting to find something using the map she obtained with the bottle. October 27, 2009 VH1 aired the full version of Norah Jones's &quot;Chasing Pirates&quot; music video directed by Rich Lee.\n\nNorah Jones explained how &quot;Chasing Pirates&quot; came to be, &quot;About a year ago, I did some demos in my home studio. I had some friends come in and we figured out a cool arrangement for 'Chasing Pirates,' with a cool drum part. It went somewhere I didn't expect it to go, and that became a direction to look in.&quot;\n\nThe song entered the Triple A charts on October 21, 2009 at #13. It became the highest entry on by a female artist on that chart since Alanis Morissette's Everything in 2004. The last single by a female artist to chart at a higher position was another single by Jones, Sunrise. The song entered on the Irish Singles Chart for the first time on #39.\n\nNorah Jones (born March 30, 1979) is an American singer-songwriter, pianist, keyboardist, guitarist, and actress. She is the daughter of sitarist Ravi Shankar and the half-sister of Anoushka Shankar. Her career began with her 2002 debut album Come Away with Me, an adult contemporary vocal jazz album with a soul/folk/country tinge, that received five Grammy Awards, including &quot;Record of the Year&quot; and &quot;Best New Artist&quot;. This was followed by her second album, Feels like Home, released in 2004. In 2007, she released her third album, Not Too Late. Jones released her fourth album, The Fall, on November 17, 2009. She has sold more than 16 million albums in the US and over 36 million records worldwide; altogether, she has sold more albums than any other female jazz artist during the 2000s.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c5a058d7e12544c8c444eb1d2a736da63aa0b454","amp;dn":"Norah+Jones+-+Chasing+Pirates+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5a058d7e12544c8c444eb1d2a736da63aa0b454","infoHashBuffer":{"type":"Buffer","data":[197,160,88,215,225,37,68,200,196,68,235,29,42,115,109,166,58,160,180,84]},"announce":[],"urlList":[]}}