{"title":"Seminarix 20091111 Linux i386 KDE LiveDVD - based on sidux 2009-","uid":5184605,"size":1599711232,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:c5b6a337561d533c500ded4ea4f07ab6aa2bc638&amp;dn=Seminarix+20091111+Linux+i386+KDE+LiveDVD+-+based+on+sidux+2009-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AshRulez","files":1,"time":1259367872,"description":"Seminarix - based on sidux is a Linux LiveDVD to support and improve the computer-based teaching of pupils and teachers. &lt;a href=&quot;\nhttp://www.seminarix.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seminarix.org/&lt;/a&gt;\n\n\nGerman:\n\nSeminarix - based on sidux ist ein Bildungs-Projekt, das durch die ZusammenfÃƒÂ¼hrung von Seminarix und sidux entstanden ist. Seminarix zielt darauf, mit Hilfe von freien offenen Linuxprogrammen die Ausbildung von Lehrerinnen und Lehrern mit ComputerunterstÃƒÂ¼tzung preiswerter, effektiver und anschaulicher zu gestalten.\n\nDie DVD wurde mit umfangreicher Lernsoftware aus den Bereichen Bildung und Wissenschaften und einem Programmstarter ausgestattet. Der Programmstarter macht es dem Linuxneuling, ob Auszubildender, Lehrer oder SchÃƒÂ¼ler, einfach, die verschiedenen Bildungsprogramme und andere allgemein nutzbare Programme zu starten. DarÃƒÂ¼berhinaus kann man mit dem speziell fÃƒÂ¼r Seminarix - based on sidux entwickeltem Programmstarter &quot;Eduversum&quot; sehr schnell und leicht verschiedene weitere Bildungsprogramme nachinstallieren. Wichtige Informationen ÃƒÂ¼ber die Programme und Weblinks erleichtern dem Nutzer die Auswahl der Programme.\n\nBei Gefallen kann man sich Seminarix - based on sidux auch parallel zu einer bestehenden Windowsinstallation auf einer Festplatte, alleine auf Festplatte oder einem anderen Speicher wie etwa einem USB Stick installieren. Mit sidux kann die gesamte Software leicht und kontinuierlich mit Hilfe spezieller sidux-Programme aktualisiert werden. Besondere sidux-Werkzeuge erleichtern die Konfiguration.\n\nFÃƒÂ¼r weitere Hinweise und bei Problemen bitte das sidux-Handbuch und das Seminarix-Handbuch lesen. Beide BÃƒÂ¼cher sind auf der DVD im Programmstarter enthalten.\nIm sidux-IRC-Kanal (das Icon dazu erscheint auf dem sidux-Desktop) und im sidux Forum erhÃƒÂ¤lt jede(r) auch Hilfe, wenn man mit dem sidux-Handbuch nicht weiter kommen sollte.","torrent":{"xt":"urn:btih:c5b6a337561d533c500ded4ea4f07ab6aa2bc638","amp;dn":"Seminarix+20091111+Linux+i386+KDE+LiveDVD+-+based+on+sidux+2009-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5b6a337561d533c500ded4ea4f07ab6aa2bc638","infoHashBuffer":{"type":"Buffer","data":[197,182,163,55,86,29,83,60,80,13,237,78,164,240,122,182,170,43,198,56]},"announce":[],"urlList":[]}}