{"title":"THE CARE BEARS- 4 DISC SET@KIDZCORNER COLLECTION DVDRIP[ENG]","uid":4998229,"size":3249322341,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c62fc2e37cef3555e2ebb695d9c0044f2fcf9075&amp;dn=THE+CARE+BEARS-+4+DISC+SET%40KIDZCORNER+COLLECTION+DVDRIP%5BENG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"alanwatson","files":9,"time":1247391247,"description":"1. CARE BEARS THE MOVIE\nThe Care Bears live in their sky dwelling of Care-A-Lot, spreading joy and light throughout the world. And they give special attention to those who particularly need affection, like orphans Kim and Jason. But Evil Spirit does not approve of all this sweetness and kindness, so with the help of a lost, lonely little boy named Nicholas, he launches a nefarious plot to rob the world of love. Down go the numbers on the Care-o-meter. And down to the Forest of Feelings go the Bears, ready to battle Evil Spirit and make the world safe for happiness and good feelings once again.\n--------------------------------------------------------------------------------\n2.Care Bears: The Movie 2 - A New Generation\n\nCome help the care bears save the kingdom of caring!\n\nIn a peaceful summer camp, evil Dark Heart makes a bargain with an unhappy little girl to trap the Care Bears and destroy goodness. But when she learns the cost of her decision, she realizes that she must race to save them before it is too late!\n\nFeaturing beautiful animation and songs by Stephen Bishop and Debbie Allen, this is a heart-warming adventure for the whole family!\n---------------------------------------------------------------------------------\n\n3.Care Bears: Journey To Joke-A-Lot\n\nA brand new CGI animated Care Bears movie!\n\nWhen one of his jokes goes wrong, Funshine Bear leaves Care-a-lot to find a place where his sense of humour will be appreciated. His travel takes him to Joke-a-lot, a whimsical land where humour rules and Funshine is made King! He is even given the royal scepter guarding the magic jewels which hold the secret to Joke-a-lot's power to tickle the funny bone. Worried about their lost friend, Tenderheart, Cheer Bear and the other Care Bears track down Funshine and plead with him to return home. Will Funshine choose royal laughs or heart warming companionship? Will he stay in a land where serious is a forbidden word or go back to rainbow-filled Care-a-lot? Find out in this musically charged tale full of giggles, love and lots of caring!\n=====================================\n\n4.CARE BEARS-TELL TALE TUMMIES [2009]\n\nThe infinitely cuddly Care Bears are back with this collection of eight episodes. Confronted with such obstacles as locating a missing friend and learning ... Full Descriptionhow to ride a bicycle, Grumpy, Sunshine, and even Grizzle learn a thing or two about teamwork and telling the truth.","torrent":{"xt":"urn:btih:c62fc2e37cef3555e2ebb695d9c0044f2fcf9075","amp;dn":"THE+CARE+BEARS-+4+DISC+SET%40KIDZCORNER+COLLECTION+DVDRIP%5BENG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c62fc2e37cef3555e2ebb695d9c0044f2fcf9075","infoHashBuffer":{"type":"Buffer","data":[198,47,194,227,124,239,53,85,226,235,182,149,217,192,4,79,47,207,144,117]},"announce":[],"urlList":[]}}