{"title":"trailer-park-boys_countdown-to-liqour-day_2009","uid":5107913,"size":504298304,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c64d578e10ae73d96790409e2c02ac25fc8e43bc&amp;dn=trailer-park-boys_countdown-to-liqour-day_2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"owen420","files":2,"time":1254519001,"description":"TRAILER PARK BOYS - COUNTDOWN TO LIQOUR DAY\nDIVX - CAMERA BOOTLEG\nFIRST COPY ON THE NET!!!! FROM YOUR FRIENDS IN CANADA KEEPING A EYE ON THE REST OF THE WORLD!!!! WE BRING YOU THIS FANTASTIC MOVIE FOR YOUR VIEWING PLEASURE... AND WHEN YOU GET A CHANCE TO BUY IT PLEASE DO AS WE KNOW YOU WILL!!!\n\nCOPY IS COMPRESSED FOR BEST QUALITY-SIZE RATIO = FAST DOWNLOAD\n\nIAM SEEDING THIS ON A POOR CONNECTION SO PLEASE SHARE WHAT YOU HAVE DOWNLOADED!!\n\n\nBOOTLEG RATING: VIDEO - 6.5/10\n                AUDIO - 6/10\n\nI WILL RELEASE A HIGHER QUALITY COPY AS IT BECOMES AVAILABLE\n\nIN THE MEANTIME ENJOY THIS ENTIRELY WATCHABLE BOOTLEG (ITS PRETTY DAMN GOOD QUALITY)\n\nRicky, Julian and Bubbles are about to get out of jail, and this time, Julian vows to go straight, even open a legit business. Soon the Boys will all be rich. At least thats what theyve told the parole board. But when they arrive back at the park, they find it's not the same old Sunnyvale - and it's not the same old Jim Lahey, Trailer Park Supervisor. Lahey's a new man, hasn't had a drink for two years. And he has plans - BIG PLANS - for Sunnyvale. But unfortunately for Lahey, Julian stands in his way. With his big plans for Sunnyvale going down the toilet, his relationship with Randy broken down, and having the Boys back in the park is all way too much pressure for him to bear. For Jim Lahey, the countdown to liquor day is on. Meanwhile, Julian's having problems of his own and the Boys are forced to resort to doing what they know best - breaking the law. Lahey's descent into the liquor coupled with the Boys descent into crime puts them all on a collision course to mayhem and destruction. - In Theaters September 25th, 2009\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1337032/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1337032/&lt;/a&gt;","torrent":{"xt":"urn:btih:c64d578e10ae73d96790409e2c02ac25fc8e43bc","amp;dn":"trailer-park-boys_countdown-to-liqour-day_2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c64d578e10ae73d96790409e2c02ac25fc8e43bc","infoHashBuffer":{"type":"Buffer","data":[198,77,87,142,16,174,115,217,103,144,64,158,44,2,172,37,252,142,67,188]},"announce":[],"urlList":[]}}