{"title":"[PDF] [1996] Phosgene (Topics in Inorganic and General Chemistry","uid":6446658,"size":47000488,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c65f23800a0aaef3b5d2427ee49a983303359b93&amp;dn=%5BPDF%5D+%5B1996%5D+Phosgene+%28Topics+in+Inorganic+and+General+Chemistry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lyndavilla","files":2,"time":1307292575,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n  &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nPhosgene, COCl2 is a C1 chemical of major industrial importance. The annual production, worldwide, is more than 1 million tons; 90% of which is used in the manufacture of isocyanates and of polyurethane and polycarbonate resins. Phosgene is also extensively used as a synthetic reagent in organic chemistry, in particular in the preparation of acyl chlorides, chloroformate esters, organic carbonates and carbamoyl chlorides.\n\nAlthough more than 7000 papers have appeared on phosgene and some 1000 papers on its analogues, this is the first book on these interesting chemicals. It presents a critical treatise of phosgene, ranging from its discovery and subsequent use as a war gas to some potential applications of the material into the 21st century. It includes chapters on biological effects and industrial hygiene; on synthesis, formation and manufacture; analysis, uses, environmental effects, and physical and thermodynamic properties. Reactions with organic and inorganic materials are described. Four of the seventeen chapters are devoted to a description of the carbonyl halides (especially carbonyl difluoride) related to phosgene, and a special section deals collectively with the electronic structures of carbonyl halide molecules.\n\nFeaturing the first-ever comprehensive discussion of the medical effects of phosgene poisoning and the most modern methods of treating exposure victims, the book will be of interest to historians and militarists and those working in the chemical industries (heavy chemicals, agricultural and pharmaceutical), university libraries, hospitals, medical research centres, museums, environmental research centres, poison units and health and safety institutions world-wide.","torrent":{"xt":"urn:btih:c65f23800a0aaef3b5d2427ee49a983303359b93","amp;dn":"%5BPDF%5D+%5B1996%5D+Phosgene+%28Topics+in+Inorganic+and+General+Chemistry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c65f23800a0aaef3b5d2427ee49a983303359b93","infoHashBuffer":{"type":"Buffer","data":[198,95,35,128,10,10,174,243,181,210,66,126,228,154,152,51,3,53,155,147]},"announce":[],"urlList":[]}}