{"title":"Lusitania Murder on the Atlantic - 2lions team nl subs dutch ned","uid":5179595,"size":4327822004,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c6c4bb0b61741898db311932141fca9b0380097a&amp;dn=Lusitania+Murder+on+the+Atlantic+-+2lions+team+nl+subs+dutch+ned&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pandastoker","files":-1,"time":1259168782,"description":"\n\nLusitania: Murder on the Atlantic (2007)\n\nVerenigd Koninkrijk / Duitsland\nDrama / Documentaire\n90 minuten\n\ngeregisseerd door Christopher Spencer\nmet John Hannah, Kenneth Cranham en Florian Panzner\n\nIn 1915 is RMS de Lusitania het snelste, grootste en meest glamoureuze cruiseschip van dat moment. \nHet is het vlaggenschip van de Cunard-rederij en pendelt tussen New York en Liverpool. \nDan, op de ochtend van de 17e mei van dat jaar, op slecht enkele kilometers van de haven van Liverpool, \nwordt het schip plotseling door een Duitse torpedo getroffen. 18 minuten later is het voorbij, de Lusitania is gezonken. \n1200 van de 1900 mensen aan boord vinden een gruwelijke dood in de koude wateren van de Ierse Zee.\n\n\nBron: RETAIL (PAL)\nFormaat: DVD5\nAudio: Engels DD 2.0\nGeluid: DD 2.0\nsubs: Nederlands (instelbaar)\nMenu: Ja\nExtra's: Nee\nBeeld verhouding: 16:9\nCover: Ja (nederlands)\nLabel: Ja\nInlay: Nee\nGenre : Documentaire\nvideo:\n\nEnglish:\n\n\n90 minutes\n\nLusitania : Murder On The Atlantic is a 90 minute docu-drama telling the real-life story of the Lusitania, a British luxury ocean liner which was torpedoed by a German U-boat one year into the First World War.\nThis massive ship sank incredibly quickly (18 minutes) just a few miles off Ireland, with the loss of around 1,200 of the 2,000 passengers aboard.  \nHannah plays one of the survivors and his strong Scottish accent is used to great effect as narrator.\nIt has been said that this catastrophe changed the world's view about how Germany was conducting itself during the War and ultimately forced the United States to join the Allied Forces some two years later.\nJohn Hannah is really the only well known face in the cast. However, the remaining actors do their jobs well and display a great deal of courage in many of the action sequences.\nThe film has some impressive production values with crowd scenes effectively edited into computer generated shots of the luxury liner and the seascape.  These computer generated images of the Lusitania look real and build on the developments made for that other seafaring disaster, Titanic.  \nIn fact, Lusitania has a very Titanic look and feel about it!  \nThis being said though, the use of more modern film techniques, such as quick editing and jerky camera work, during the sinking sequences makes Lusitania impressive in its own right.\nThese final moments of the sinking of the ocean line are very realistic and keep your attention.\nMany believe that the sinking of the Lusitania is the second most famous civilian passenger liner disaster after the sinking of Titanic, and so viewers of the earlier Titanic film are sure to enjoy this one.\nOne of the real controversial elements of this film's version of the story is the British Admiralty's stubborn attitude not to defend the Lusitania as a civilian ship despite the alleged use of the passenger liner to carry ammunition for the War.\nAnother statement made in the film is the fact that the consequent cover-up, including an inquiry designed by the British Admiralty to lay blame on the liner's captain, was apparently condoned by Winston Churchill!\nInterestingly, this approach might have come about as a result of the film being an English-German production, evidenced by the inside submarine scenes being filmed in Munich.\nAnother point of interest is the fact that the outside filming was done in South Africa for some reason!\nAlthough produced in 2007, the film was only recently aired in Australia on ABC1 who have cleverly arranged this simultaneous DVD release.\n\nBron: RETAIL (PAL)\nFormat: DVD5\nAudio: English DD 2.0\nsound: DD 2.0\nsubs: Dutch (instelbaar)\nMenu: Yes\nExtra's: No\naspect ratio: 16:9\nCover: Ja (nederlands)\nLabel: Ja\nInlay: Nee\nGenre : Documentaire\n\n\nMoviemeter http://www.moviemeter.nl/film/56578\nIMDb http://www.imdb.com/title/tt1043496/\n\n*****************************************\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n  &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n******************************************\n","torrent":{"xt":"urn:btih:c6c4bb0b61741898db311932141fca9b0380097a","amp;dn":"Lusitania+Murder+on+the+Atlantic+-+2lions+team+nl+subs+dutch+ned","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6c4bb0b61741898db311932141fca9b0380097a","infoHashBuffer":{"type":"Buffer","data":[198,196,187,11,97,116,24,152,219,49,25,50,20,31,202,155,3,128,9,122]},"announce":[],"urlList":[]}}