{"title":"Hard Disk Sentinel Pro v3.00 Build 3736 + Activator [RH]","uid":5150656,"size":8405516,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c6f4b950559e0847b517107940ba0d40bede5ae0&amp;dn=Hard+Disk+Sentinel+Pro+v3.00+Build+3736+%2B+Activator+%5BRH%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RobbingHood","files":1,"time":1257536672,"description":"\n\n\n   .-._______                                                         _______.-.\n--( )_)______)  Hard Disk Sentinel Pro v3.00 Build 3736 + Activator  (______(_( )--\n (    ()___)                                                           (___()    )\n      ()__)                                                             (__()\n-(___()_)                                                                 (_()___)-\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n SPONSORED LINK                    SPONSORED LINK                   SPONSORED LINK\n ^^^^^^^^^^^^^^                    ^^^^^^^^^^^^^^                   ^^^^^^^^^^^^^^\n&lt;---------------------------------------------------------------------------------&gt;\n\nHDSentinel Support Website for all HDSentinel Products &amp; all HDSentinel Cracks:   &lt;a href=&quot;\nhttp://www.hdsentinel.com/support.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hdsentinel.com/support.php&lt;/a&gt;\n\nNOTE: Please do not forget to leave behind as much information as possible  \nabout where the product is from and about your personal identification data. \nYou'll then be contacted as soon as possible by the HDSentinel Support Team! \n\n\nThank you for choosing HDSentinel,\n\nThe HDSentinel Support Team\n\n&lt;---------------------------------------------------------------------------------&gt;\n&lt;---------------------------------------------------------------------------------&gt;\n\n\n\n                Hard Disk Sentinel Pro v3.00 Build 3736 + Activator\n\n\n\nHard Disk Sentinel (HDSentinel) is a multi-OS HDD/SDD monitoring and analysis \napplication. Its goal is to find, test, diagnose and repair disk drive problems, \nreport and display SDD and HDD health, performance degradations and failures. \nHard Disk Sentinel gives complete textual description, tips and displays/reports \nthe most comprehensive information about the hard disks and solid state disks \ninside the computer or in an external enclosure (USB / e-SATA). Many different \nalerts and report options are available to ensure maximum safety of your valuable \ndata.\n\nAs hard disk sizes are constantly increasing, data stored on them are more and \nmore valuable for the user of the computer (and this is especially true for a \ncompany or office). Serious problems can occur upon a hard disk failure.\n\nHard Disk Sentinel can monitor hard disk status, including temperature and \nS.M.A.R.T. (Self-Monitoring, Analysis and Reporting Technology, built in most \nhard disks today) values for each hard disks. Also it measures the hard disk \ntransfer speed in real time which can be used as a benchmark or to detect \npossible hard disk failures, performance degradations.\n\nHard Disk Sentinel can be used to prevent serious damage or data loss. It warns \nthe user before a problem may occur and this gives opportunity to backup important\nand valuable data.\n\nHDSentinel is the perfect data protection solution: it can be effectively used to \nprevent HDD failure and SDD / HDD data loss because it has the most sensitive disk\nhealth rating system which is extremely sensitive to disk problems. This way even \na small HDD problem can't be missed. The Professional version has scheduled and \nautomatic (on-problem) disk backup options to prevent data loss caused by not only \nfailure but by malware or accidental delete also.\n\n\n\nFeatures of Hard Disk Sentinel Professional:\n\nEasy to use interface:\nAll information are displayed in the main window of the application. \nQuick controls allow easy navigation to access all hard disks, partitions and \ndifferent information. Intuitive user interface elements display information by \nusing green/yellow/red color to indicate the level of problem. Detailed text \ndescription and context sensitive help guides the user thru the features and \noptions.\n\n1. Install &gt; 2. Configure &gt; 3. Stay protected:\nJust install, configure alerts and backup functions and your system is now safe. \nYou'll be notified about the problems - but if everything is correct, Hard Disk \nSentinel just sits on tray and displays current status. The data is protected \n24 hours daily, 7 days a week.\n\nBackup:\nWide range of automatic backup methods are available: to backup data to local \ncomputer, to a LAN server or to a remote server by transferring files via FTP \n(or even by e-mail). It is possible to use 3rd party tools to create archives \nor burn CD/DVD media. Hard Disk Sentinel Professional can manage power status \nof remote computers in the network, so it is possible to automatically power \non and shut down remote computers, for example a backup server.\n\nAPI Interface For Developers:\nWith the API it is possible to query detected hard disk information from the \nsoftware. This way 3rd party software can log, display or otherwise process \ndetected disk information including temperature, health and so.\n\nRemote Monitoring:\nHard Disk Sentinel Professional offers extensive remote monitoring capabilities. \nHard disk status can be checked remotely by a web browser, even by a mobile phone \nor a PDA.\n\nInstant S.M.A.R.T. analysing:\nHard Disk Sentinel can communicate with IDE, Serial ATA, SCSI and most USB HDD \nand SSD to detect their status and temperature. Disk status are displayed \nimmediately as you launch the application, there is no need to analyse disks \nfor a long period. It displays the current and maximum temperature for the \nhard disk. It reads all general and vendor-specific attributes and monitor \ntheir values. For advanced users, all raw data are displayed also including \npower-on time and number of read/write errors. Hard Disk Sentinel interprets \nthe performance and fitness related S.M.A.R.T. values and displays the \ncalculated Performance and Health percentage, total power on time and \nestimated lifetime remaining.\n\nHard Disk Hadware Tests:\nBy using Hard Disk Sentinel, it is possible to start hardware hard disk self tests.\nThese tests can be used to effectively find all hard disk problems because \nbuilt-in hardware methods are used to verify hard disk components (for example \nheads, servo, internal buffer in the Short self test). The Extended self test \nalso verifies the complete disk surface, finds and repairs all weak areas and \nre-allocates the possible bad sectors. This is not possible with the \nsoftware-based disk surface scan methods (for example, by using scandisk).\n\nSeek Noise Test:\nSeek Test - to verify hard disk noise, seek time performance and temperature. \nLonger tests can be used as very deep and intensive stress-tests for the disk \nsystem and useful to verify if additional cooling is required.\n\nEnhanced Disk Tests:\nSurface Test - to verify hard disk surface with intensive disk testing methods \nto reveal and fix disk problems. Surface reinitialisation resets all sectors to\nfactory default states. Different destructive and non-destructive tests are \navailable to re-fresh the condition of any hard disks, solid state disks or \neven your pendrives or memory cards.\n\nLogging:\nHard Disk Sentinel logs all degradations in all SMART parameters and issues \nalerts in such cases to maximise data protection. For example, if a new bad \nsector is found on your hard disk, you will be notified.\n\nAlerts:\nHard Disk Sentinel has wide range of alerts upon different problems. It can \nsend e-mail (with e-mail-&gt;SMS gateway it can be SMS warning to your mobile), \nnetwork message, can play sound alerts and so.It can execute various tasks \n(automatic panic backup or any configured external applications) in case of \na problem.There is an option to send daily emails about current status.\n\nShutdown:\nOffers option to shut down the computer on hard disk failure, HDD overheat or \nhealth degradation. This option can be used in combination of the alerts to \nprevent further data loss.\n\nHard Disk Details:\nDetects and displays every information about the hard disk, from the revision \nnumber and buffer size to all features it has. The maximum available and current \ntransfer modes are also displayed.\n\nHDD status in Windows Explorer:\nView the current health status and used space in Windows Explorer or in any other \napplication, so you'll always know the amount of used space for each partitions \nand the disk condition.\n\nInformation on demand:\nCurrent hard disk temperatures and health are displyed on the system tray and can \nbe displayed in a small status window, the desktop itself or in a sidebar gadget \n(under Windows Vista or newer operating system). Average and maximum temperatures \nare logged for all hard disks and these informations are displayed in graphs for \nstatistical purposes.\n\nHard Disk Performance:\nLogs how much data were read from or written to the hard disk. Displays current \ntransfer rates for both reading and writing and estimates the maximum available \n(theoretical) transfer rate for a particular hard disk.\n\nHard Disk Partitions:\nDisplays partitions for each physical hard disks and type and usage informations \nabout them so you cannot run out of space. Hard Disk Sentinel sends this info \nautomatically in alert/status messages.\n\nAcoustic Management:\nOffers option to control the acoustic level of IDE/S-ATA hard disk. \nIt is possible to increase performance or make the disks more silent. Unique \nfeature: control the acoustic level of your external USB hard disk (if your USB \nenclosure is equipped with proper USB-ATA bridge chip which supports this feature).\n\nClock Synchronization:\nIt offers option to synchronize the PC clock with an atomic clock via NTP (Network\nTime Protocol).\n\nImprovements:\nHard Disk Sentinel is constantly improving. More features will be available soon.\nIf you have any idea which can be useful, just let us know.\n\n\n\nWhat's new in Hard Disk Sentinel Pro v3.00 Build 3738:\n\n- Disk surface test functions (*) (accessible from File menu or by quick button) to \n  test hard disk and solid state disk surface with different read and write  test \n  methods. Destructive and non-destructive tests are possible and many settings\n  are available including complete simple read tests, disk re-initialisation (**),   \n  data area refresh (**), industry standard data-destruction (**) and so to help \n  disk diagnostics and repair. Temperature and data transfer speed is measured and \n  displayed during the test to analyse disk operation and slowly accessible regions. \n- Disk Contents Inspector allows to check stored information on the disk (*). \n- Detection of both SATA and SAS disks configured to RAID arrays on HighPoint \n  1xxx and 2xxx series RAID controllers (SAS only if applicable, for example by \n  the 2640x4 controller).\n- Detection of new USB drives, SATA multipliers, external enclosures, SAS drives. \n- More SSD specific information and attributes displayed for various SSD devices \n  (for example OCZ, Corsair, Super Talent, Intel, Samsung, Crucial and so). \n- Added detection of new SSD devices. \n- Verify results online: compare details of a drive with reports received online, \n  to check if the drive is better or worse than average (&quot;globe&quot; with HDD icon) (*). \n- Right click over list of logical drives to hide drives or select button sizes (*). \n- Displaying highest temperature ever found in the entire lifespan of the disk, \n  option to reset measured highest/lowest temperatures. \n- Configurable tray icon font (Configuration -&gt; Thresholds/tray icon). \n- Option to prevent disks from spin down (Configuration -&gt; Disk control). \n- Hard Disk Sentinel API: 3rd party software can get disk information from the \n  software for further processing (*). \n- Many user interface fixes and improvements. \n- 150+ new hard disks in database. \n- Various minor bug fixes and improvements. \n- Fixed: random seek time test resulted errors on some disks over 1 TB. \n- Improved support for ARECA RAID controllers with STORPORT drivers. \n- Added Bulgarian language support - thanks for Georgi Nenov for the translation. \n- Added Greek language support - thanks for dancer_69 for the translation. \n- Added Swedish language support - thanks for Ulf for the translation. \n- Added Russian language support - thanks for Andrey Nikolaev for the translation. \n\n(*): available only in registered Hard Disk Sentinel and Hard Disk Sentinel \nProfessional (**): available only in registered Hard Disk Sentinel Professional. \n\n\n\nSystem Requirements:\n\n- Windows operating system (Windows 95, 98, 98SE, ME, NT4, 2000, XP, 2003, 2008, \n                            Vista, Windows 7, Windows Home Server)\n- Pentium or compatible CPU \n- 32 megabytes of system memory\n- 15 megabytes of hard disk space\n- System administrator account (in service mode, it is possible to use without \n  administrator rights and without even user logged in)\n- One or more hard disk or solid state disk with ATA (IDE or Serial ATA/SATA II), \n  SCSI, SAS, USB interface. USB hard disk support depends on the USB-ATA bridge \n  chips. Other type of external disks (USB or IEEE 1394) are NOT supported because \n  the hard disk controller chip in the external enclosure does not support the \n  detection of S.M.A.R.T. information.\n\n\nNote: RAID arrays usually do not provide S.M.A.R.T. informations. However, \n      standalone hard disks connected to standard RAID controllers (for example \n      motherboard integrated RAID controllers, like NVidia, Intel RAID) provide \n      this information most of the time. If you have good or bad experiences or \n      compatibility problems, please let us know. \n\nNote: The software can read and display all such information about hard disks \n      inside the arrays if the RAID array is controlled by a compatible RAID \n      controller card. It is also possible to manage these drives like standalone \n      drives.\n\nNote: hard disk controller drivers can also cause incompatibility problems and \n      this case not all hard disk information may be displayed. \n      For more information, please check the compatibility page and for some \n      solutions, please read the information in the F.A.Q.\n\n\n\nMore info: &lt;a href=&quot;\nhttp://www.hdsentinel.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hdsentinel.com/&lt;/a&gt;\n\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n&lt;---------------------------------------------------------------------------------&gt;\n\n\n\n&gt;&gt;&gt;When using TPB please read these important notes: \n****************************************************\n\n01- AV software may warn about keygens, patches, cracks etc because of their \n    capabilities and signatures (generating codes, etc). Sometimes also they're \n    added to the virus/spyware database and will be detected as malware. If not \n    trusting keygens, patches, cracks etc don't use them.\n\n02- To avoid AV software removing/blocking clean cracks etc: exclude the crack \n    or folder from being auto-protected &amp; auto-scanned by the AV software.\n\n03- If AV software removed a clean crack usually it can be restored \n    (if it's not in Quarantaine then look at History or something similar).\n\n04- To avoid risks when using cracks also Sandboxie can be used to test them:\n   &lt;a href=&quot; http://www.sandboxie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sandboxie.com/&lt;/a&gt;\n   &lt;a href=&quot; http://thepiratebay.se/torrent/4918844/Sandboxie_v3.38___Keys_[RH]&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/4918844/Sandboxie_v3.38___Keys_[RH]&lt;/a&gt;\n\n05- Before running .exe-files, keygens, patches, cracks etc always check first \n    if they can be unpacked. Often some thirth party added a virus to the \n    original file, repacked it, and uploaded it again.\n\n06- Letting AV software software sending scan results to their companies \n    can cause keygens, patches, cracks etc being added to their virus-database.\n\n07- Firewalls which are set to automatically decide for connections will allow \n    connections for lots of apps &amp; MALWARE!. To avoid so firewalls should be set \n    to decide yourself which connection to allow or not.\n\n08- Clicking on unknown links can coz malware being silently installed on a pc!\n\n09- Usually (new) torrents with extreme many downloads &amp; seeders in a short time \n    are very suspicious! Torrents with a SKULL-logo are trusted.\n\n10- Some (frustrated) people use multiple accounts and post lots of FAKE comments \n    and/or files trying to spread confusion. Usually they NEVER seriously reply \n    on comments and don't have any torrent, or to look reliable just a few.\n\n11- In general often there are more fake &amp; negative comments than reliable &amp; \n    positive comments.\n\n12- In some countries uploading/downloading copyright-protected material is \n    forbidden, but showing some appreciation to reliable uploaders is not.\n\n13- Posting FAKE comments &amp; uploads on TPB can result in getting banned from TPB!\n\n\nFor reporting bad or suspicious torrents:  &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nFor visiting &quot;TPB's Most Ridiculous Comments&quot;:  &lt;a href=&quot;\nhttp://forum.suprbay.org/showthread.php?tid=24699&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/showthread.php?tid=24699&lt;/a&gt;\n\nFor visiting my account*:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/RobbingHood/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RobbingHood/&lt;/a&gt;\n\n*All torrents scanned with:\n1- Norton Internet Security  \n2- Avast! Antivirus AV Pro  \n3- AVG Antivirus Pro   \n4- Kaspersky AV Pro  \n5- NOD32 AV  \n\nAlso scanned with reputed antispyware software. Reported malware \ndetected by other anti-malware software probably are false positives!\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n\n\nTo the &quot;United Reliable The Pirate Bay Users&quot;,\n\nNowadays a lot of TPB members abuse their TPB membership by intenionally posting \nfake comments &amp; files. Their meaning is just to spread confusion and try to \nfrustrate TPB and it's users. And less downloaders = less seeders = less \ndownloadspeed etc etc. \n\nIt's in the benefit of TPB and all reliable users to warn each other about people \nwho intenionally keep posting fake comments &amp; files. It's an easy answer against \nthose who intenionally keep posting fake comments &amp; files, which is a never \nending issue. \n\nWhen reporting errors or false positives just keep in mind that what goes up for \none does not always goes up for another. That's for both the working of an app \nand about false positives! Remember: whatever is said, say it constructive! \nLet's just try to help each other and TPB by thinking about what's said &amp; posted. \nThings are all up to you, the &quot;United Reliable The Pirate Bay Users&quot;!\n\n\nEnjoy The Pirate Bay\n                                         \n* Status torrent at November, 06 2009 - 19.15 CET: clean, tested &amp; working.","torrent":{"xt":"urn:btih:c6f4b950559e0847b517107940ba0d40bede5ae0","amp;dn":"Hard+Disk+Sentinel+Pro+v3.00+Build+3736+%2B+Activator+%5BRH%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6f4b950559e0847b517107940ba0d40bede5ae0","infoHashBuffer":{"type":"Buffer","data":[198,244,185,80,85,158,8,71,181,23,16,121,64,186,13,64,190,222,90,224]},"announce":[],"urlList":[]}}