{"title":"Netforce Unidad de Red - Miniserie Completa DVDRip Spanish","uid":5020839,"size":1459338406,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c7c7cbcbab7f00358ea8fcc395a6555fccefec2f&amp;dn=Netforce+Unidad+de+Red+-+Miniserie+Completa+DVDRip+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":3,"time":1248455408,"description":"La serie, que consta de dos partes, tiene un comienzo dramÃƒÂ¡tico: los miembros de Netforce, una nueva divisiÃƒÂ³n del FBI creada en el aÃƒÂ±o 2005 para combatir especÃƒÂ­ficamente la espiral de nuevos delitos surgidos en relaciÃƒÂ³n al uso de Internet, reciben un duro golpe cuando su comandante es asesinado. El subcomandante Alex Michaels (Scott Bakula) serÃƒÂ¡ puesto en el cargo y deberÃƒÂ¡ averiguar quiÃƒÂ©n asesinÃƒÂ³ a su jefe y a la vez mejor amigo. Ayudado por la subdcomandante Toni Fiorelli (Joanna Going), una mujer que juega un papel importante tanto en su vida personal como profesional, Michaels y su equipo recurrirÃƒÂ¡n tanto a su armamento fÃƒÂ­sico como electrÃƒÂ³nico para encontrar al culpable.\n\nEl ambiente y escenario de la serie recrea un mundo de altas tecnologÃƒÂ­as y realidad virtual, con mÃƒÂ³viles de ÃƒÂºltima generaciÃƒÂ³n con cÃƒÂ¡maras de video donde las pistas se recogen tanto de la vida real como de los sitios chat de Internet. SegÃƒÂºn avanza la investigaciÃƒÂ³n se hace mÃƒÂ¡s evidente para Michaels que un hÃƒÂ¡bil informÃƒÂ¡tico estÃƒÂ¡ intentando infiltrarse en la red de ordenadores de Netforce, un hecho que podrÃƒÂ­a acarrear repercusiones devastadoras de alcance global, ya que los sistemas informÃƒÂ¡ticos e Internet controlan prÃƒÂ¡cticamente todos los aspectos del gobierno y sus actividades.","torrent":{"xt":"urn:btih:c7c7cbcbab7f00358ea8fcc395a6555fccefec2f","amp;dn":"Netforce+Unidad+de+Red+-+Miniserie+Completa+DVDRip+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7c7cbcbab7f00358ea8fcc395a6555fccefec2f","infoHashBuffer":{"type":"Buffer","data":[199,199,203,203,171,127,0,53,142,168,252,195,149,166,85,95,204,239,236,47]},"announce":[],"urlList":[]}}