{"title":"Stone FLV Converter 1.6.256","uid":6454049,"size":9392834,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c80d3604ba6c8aa8078141498ffda4c39847b09d&amp;dn=Stone+FLV+Converter+1.6.256&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1307527843,"description":"Stone FLV Converter 1.6.256\n\nStone FLV Converter is a simple, stable and fast multimedia converter to convert popular video formats to Flash video. You can convert your video files to FLV or SWF files. It supports conversion from almost all well known video formats to Flash video, including WMV, ASF, AVI, DivX, XviD, MPEG-1 (VCD), MPEG-2 (DVD), MPEG-4 (MP4), QuickTime MOV, Flash Video (FLV), RM, RMVB, Matroska (MKV), 3GP and 3G2 etc.\n\n-It supports batch conversion.\n-It supports extracting images from video file.\n-It has an embedded player for you video/audio files playback.\n\nFeedback from our customer:\n\nThe Stone FLV Converter is a standalone, batch converter to convert your video files to FLV or SWF files. Application support conversion for all popular video format such as WMV, ASF, AVI, DivX, XviD, MPEG-1 (VCD), MPEG-2 (DVD), MPEG-4 (MP4), QuickTime MOV, RM, RMVB, Matroska (MKV), 3GP and 3G2 etc. Application also allows you to extract images from video file.\n\nFeatures: Everyday new video format get evolved and hence you would to get ride away from different video format. To do this you need to convert your video file from any format to Flash or SWF format file.\n\nAdd all video files which you would like to convert to the conversion list. For each fie you can define output format and output file name. Define video output settings such as bit rate and frame size. For Audio output settings set bit rate and sample rate. Define start position and end position for conversion of your choice. You can see the details off added files as input file, input duration, output file, output format, conversion status and convert process. Application has built-in video player, you can play your movie on this player. Application allows you to take snap for your favorite shot, just you need to click on camera icon and the shot present on screen will be saved in JPG format.\n\nOverall: This is a good program to convert your video file to flash file easily and quickly as per your choice.\n\nHome Page - http://www.stonenext.com/\n\n\n","torrent":{"xt":"urn:btih:c80d3604ba6c8aa8078141498ffda4c39847b09d","amp;dn":"Stone+FLV+Converter+1.6.256","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c80d3604ba6c8aa8078141498ffda4c39847b09d","infoHashBuffer":{"type":"Buffer","data":[200,13,54,4,186,108,138,168,7,129,65,73,143,253,164,195,152,71,176,157]},"announce":[],"urlList":[]}}