{"title":"Weird Al Yankovic - Craigslist","uid":4994209,"size":166418436,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c82413cda455fb8515ab5f7b43cb6719f8d15c30&amp;dn=Weird+Al+Yankovic+-+Craigslist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247197506,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Craigslist&quot; is the name of a song and single by &quot;Weird Al&quot; Yankovic. It is a style parody of The Doors, and contains lyrics inspired by postings at the online classified advertising service, Craigslist. Yankovic described the idea of the song coming about thinking how it would be &quot;anachronistically weird&quot; for Jim Morrison to scream about Craigslist. Yankovic opted to use Craigslist as an example of something big in both the popular culture and his own life, and spent time exploring its listings to compose the lyrics. The song was released shortly after the closure of the Michael John Anderson, aka the Craigslist Killer, case, a factor Yankovic considered &quot;unfortunate timing&quot;.\n\nFormer Doors keyboardist Ray Manzarek was brought on board to recreate the music style for the song. The song, while not borrowing directly from any single Doors song, is said to have discrete sections similar to &quot;When The Music's Over&quot;, &quot;The End&quot; and &quot;Light My Fire&quot;.\n\nThe single is the first of four new singles that are being released as part of the Internet Leaks EP; Yankovic's previous single, &quot;Whatever You Like&quot; was retroactively considered to be the first song for the EP. The song was released digitally on iTunes and other digital music services on June 16, 2009.\n\nThe song has an associated video produced by Liam Lynch and was released on the same day as the single, though AOL previewed the video a day before. The budget for the video was much lower than Yankovic's &quot;White &amp; Nerdy&quot; and was shot in Lynch's garage. Yankovic stated that the low budget video &quot;dovetails well&quot; with the concept of the song. The video incorporates similar imagery seen in The Doors' videos, including stock footage and art house effects. Yankovic dressed as Morrison, having to lose some weight to look like the singer at age 24, and performed in front of a green screen to allow effects to be added afterward.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c82413cda455fb8515ab5f7b43cb6719f8d15c30","amp;dn":"Weird+Al+Yankovic+-+Craigslist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c82413cda455fb8515ab5f7b43cb6719f8d15c30","infoHashBuffer":{"type":"Buffer","data":[200,36,19,205,164,85,251,133,21,171,95,123,67,203,103,25,248,209,92,48]},"announce":[],"urlList":[]}}