{"title":"Avril Lavigne - Hot   (2nafish)","uid":5180539,"size":123127812,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c88c3a812de86f4262313a7438c908e1f6c7aa04&amp;dn=Avril+Lavigne+-+Hot+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259220300,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Hot&quot; is a song by Avril Lavigne produced by Lukasz &quot;Dr. Luke&quot; Gottwald, and is the third single from Lavigne's third album, The Best Damn Thing. During an interview at the 2007 MuchMusic Video Awards, Lavigne implied that she planned to shoot a video for the song, which premiered on Yahoo on October 5. She performed the song on the 2007 MTV Europe Music Awards and on the July 6 episode of The Friday Night Project. It was played on the fourth episode of season three of MTV's The Hills. A Japanese version of the song was released as a ringtone in Japan, with the Japanese lyrics replacing the chorus. In China, a Mandarin version of the song was released which replaced the chorus and the introduction with Mandarin lyrics. Onit has generated over 30 million views.\n\nThe video mirrors the lyrical meaning of the song in many ways. Lavigne, semi-disguised in a wig, makes a grand entrance into a club in a stylish dress. She's shown discussing how she secretly wants to be with a boy while dressed in a seductive, dark, secretive outfit. Only during the chorus when she lets her emotions out is she shown in a shiny green corset preparing for what appears to be a burlesque show. As such, she releases her emotions only when she's dressed the most revealingly and strongly. When she dresses in dark colors or disguises herself &amp; her purpose at the venue, she's hiding her emotions behind intricate outfits. Contrastingly, during the song's bridge (in which Lavigne candidly reveals her raw feelings - not about sex and him making her &quot;hot&quot;, but about his love &amp; kiss-) Lavigne is dressed in a normal, plain outfit. This represents her openness and her desire for him to see past her &quot;star&quot; status and her loud declaration of attraction, and for him to instead see the real, raw Lavigne, who wants only to love him forever and for him to never let her go.\n\nIn a recent article it was revealed that Lavigne had shot a music video at the Beacon in Remote land, a representative for the development announced. The 23-year-old singer was at the complex -- the former Jersey City Medical Center -- on Saturday night. The video was directed by Matthew Rolston and is shot in Murdoch Hall. The video premiered on Yahoo! Music, VIVA and MTV. &quot;Hot&quot; music video debuted at #1 in Spain in its first week on the video download chart and reached #1 in the Australian iTunes music video chart too.\n\nMany fans agree that this is probably Lavigne's most risquÃƒÂ© music video to date.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c88c3a812de86f4262313a7438c908e1f6c7aa04","amp;dn":"Avril+Lavigne+-+Hot+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c88c3a812de86f4262313a7438c908e1f6c7aa04","infoHashBuffer":{"type":"Buffer","data":[200,140,58,129,45,232,111,66,98,49,58,116,56,201,8,225,246,199,170,4]},"announce":[],"urlList":[]}}