{"title":"INLAND EMPIRE - David Lynch  DVDRip 4.35gig","uid":6414306,"size":4680837120,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c8c7f6a810ecd9255d250b5620dd6a5df918a7a7&amp;dn=INLAND+EMPIRE+-+David+Lynch++DVDRip+4.35gig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jjba68","files":13,"time":1306115638,"description":"An actress's perception of reality becomes increasingly distorted as she finds herself falling for her co-star in a remake of an unfinished Polish production that was supposedly cursed.  CLASSIC LYNCH WIERD  \n\nInland Empire is a 2006 nonlinear psychological thriller film [2] with elements of horror written and directed by David Lynch. It was his first feature-length film since 2001's Mulholland Drive, and shares many similarities with that film. It premiered in Italy at the Venice Film Festival on September 6, 2006.[3] The feature took two and a half years to complete, and was Lynch's first film to have been shot entirely in standard definition digital video.[3]\n\nThe cast includes such Lynch regulars as Laura Dern, Justin Theroux, Harry Dean Stanton, and Grace Zabriskie, as well as Jeremy Irons and Diane Ladd. There are also very brief appearances by Nastassja Kinski, William H. Macy, Laura Harring, Terry Crews, Mary Steenburgen, and Ben Harper. The voices of Harring, Naomi Watts, and Scott Coffey are included in excerpts from Lynch's Rabbits website project.\n\nIt was named the second-best film of 2007 (tied with two others) by Cahiers du cinÃƒÂ©ma,[4] and listed among Sight &amp; Sound's &quot;thirty best films of the 2000s&quot;, as well as The Guardian's &quot;10 most underrated movies of the decade&quot;.","torrent":{"xt":"urn:btih:c8c7f6a810ecd9255d250b5620dd6a5df918a7a7","amp;dn":"INLAND+EMPIRE+-+David+Lynch++DVDRip+4.35gig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8c7f6a810ecd9255d250b5620dd6a5df918a7a7","infoHashBuffer":{"type":"Buffer","data":[200,199,246,168,16,236,217,37,93,37,11,86,32,221,106,93,249,24,167,167]},"announce":[],"urlList":[]}}