{"title":"The Fray - Never Say Never","uid":4990830,"size":143550468,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c9ebfdf88bdb2fa48a2284abdc1b7745aec441c2&amp;dn=The+Fray+-+Never+Say+Never&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247029454,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Never Say Never&quot; or &quot;&quot;Never Say Never (Don't Let Me Go)&quot; is a song by the piano-rock band, The Fray that was included on their second studio album, The Fray. It is the second single from the album and it is a direct love song between two people who are &quot;pulling apart and coming together again and again.&quot;  The song has charted at 57 on the US Hot 100 and 87th on UK Charts. It has also reached the 24th spot on &quot;Top Songs&quot; and the 12th spot on &quot;Top Rock Songs&quot; on iTunes. The song is present on the soundtrack of the film Transformers: Revenge of the Fallen - The Album.\n\nThere are currently two versions of the song: the full Album Version and the Radio Edit (known as Half Guitar Solo Edit), which is shorter and cuts out a portion of the song's guitars.\n\nOn the March 14th episode of the VH1 Top 20 Video Countdown, the Fray stated in an interview that a video was in the works, and it has since been completed. The music video for Never Say Never surfaced on the internet on April 17th, but the video officially premiered on the internet only on April 24, through the band's Myspace. It premiered everywhere else on television May 5, 2009.\n\nThe video was takes place in one only sequence, featuring singer and pianist Isaac Slade walking through a destroyed suburban street after some sort of accident or attack. While Isaac walks through the street, panicked civilians run for safety and police officers and soldiers try to save others in the ruins. The video ends with Isaac finding his girlfriend (played by Jaime King) and everyone else in the neighborhood looking to the distant Los Angeles cityscape before it completely explodes. The set used in the aftermath of the plane crash scene from Steven Spielberg's War Of The Worlds was also used to film this clip, located at Universal's Hollywood Studios.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c9ebfdf88bdb2fa48a2284abdc1b7745aec441c2","amp;dn":"The+Fray+-+Never+Say+Never","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9ebfdf88bdb2fa48a2284abdc1b7745aec441c2","infoHashBuffer":{"type":"Buffer","data":[201,235,253,248,139,219,47,164,138,34,132,171,220,27,119,69,174,196,65,194]},"announce":[],"urlList":[]}}