{"title":"A Clockwork Orange.mp4","uid":5174166,"size":922961521,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:ca7ac49bb811f86a623f390d2a27e5608eb467e3&amp;dn=A+Clockwork+Orange.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1258862283,"description":"dvd ripped .mp4 of &quot;A Clockwork Orange&quot; in iPhone format in english no subs\n\n\nA Clockwork Orange(1971)\n\nAlex, a teenage hooligan in a near-future Britain, gets jailed by the police. There he volunteers as guinea pig for a new aversion therapy proposed by the government to make room in prisons for political prisoners. &quot;Cured&quot; of his hooliganism and released, he is rejected by his friends and relatives. Eventually nearly dying, he becomes a major embarrassment for the government, who arrange to cure him of his cure. A pivotal moment is when he and his gang break into an author's home: the book he is writing (called &quot;A Clockwork Orange&quot;) is a plea against the use of aversion therapy, on the grounds that it turns people into Clockwork Oranges (Orang is Malay for &quot;Man&quot;): they are not being good from choice (sentiments later echoed by the prison chaplain). The film reflects this: many bad scenes in a Clockwork Orange are accompanied by jolly music; if we are to experience them as we should, we have to do it consciously, by realising they are bad, and not because the director tells us so through the use of music and images.","torrent":{"xt":"urn:btih:ca7ac49bb811f86a623f390d2a27e5608eb467e3","amp;dn":"A+Clockwork+Orange.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca7ac49bb811f86a623f390d2a27e5608eb467e3","infoHashBuffer":{"type":"Buffer","data":[202,122,196,155,184,17,248,106,98,63,57,13,42,39,229,96,142,180,103,227]},"announce":[],"urlList":[]}}