{"title":"Stargate Universe-1x01-1x02.Air.Parts.1&amp;2.(eng.subITA) by BabyBo","uid":5109077,"size":733992960,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cb35b846d7d87da5bc825d8f23bd6f877055b496&amp;dn=Stargate+Universe-1x01-1x02.Air.Parts.1%262.%28eng.subITA%29+by+BabyBo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cirip2006","files":1,"time":1254616072,"description":"Devo chiedere scusa a gli fan di Smallville per non aver postato l'episodio 9x02 ma non ho resistito alla tentazione di postare prima possibile l'inizio della piÃƒÂ¹ attesa serie di quest'anno, cioÃƒÂ¨ STARGATE UNIVERSE.\nPer tutti i fan di Smallville, tranquilli, domani sera avrete il vostro episodio (9x02). Per i fan delle altre 2 serie di STARGATE (SG1 &amp; ATLANTIS) vi ho portato i primi due episodi della nuova aventura stellare, STARGATE UNIVERSE. Per quelli che non sanno ancora cos'ÃƒÂ¨ STARGATE, ho pensato di postare anche una piccola descrizione :\n\n&quot;Stargate Universe (abbreviato in SGU) ÃƒÂ¨ una serie televisiva di genere fantascientifico, la terza appartenente al franchise di Stargate, prodotta dalla Metro-Goldwyn-Mayer e ideata da Brad Wright e Robert C. Cooper.  La serie, come le due precedenti, ÃƒÂ¨ stata girata a Vancouver, in Canada, nei Bridge Studios.\n\nUn team di esploratori si troverÃƒÂ , grazie alla scoperta dell'uso del nono Chevron dello Stargate, su una nave disabitata chiamata Destiny, lanciata dagli Antichi all'apice della loro civitÃƒÂ  in una galassia inesplorata. Frutto di un esperimento iniziato ma mai completato, la Destiny ha il compito di esplorare la galassia in cui ÃƒÂ¨ stata spedita accompagnata da un'altra nave che distribuisce stargate sui pianeti esplorati. Il gruppo di civili e scienziati restano bloccati a bordo dell'astronave senza la possibilitÃƒÂ  di tornare indietro e cercherÃƒÂ  di ritrovare la via di casa mentre esplorerÃƒÂ  questa nuova galassia, ma soprattutto dovranno cercare di sopravvivere.&quot; - Wikipedia.\n\nP.S. Questa era la sorpresa di cui vi parlavo nel mio  precedente torrent. Spero vi sia piaciuta.\nBUONA VISIONE e...SEED ! Non scordate una cosa importante : VOGLIO assolutamente vedere una marea di commenti...","torrent":{"xt":"urn:btih:cb35b846d7d87da5bc825d8f23bd6f877055b496","amp;dn":"Stargate+Universe-1x01-1x02.Air.Parts.1%262.%28eng.subITA%29+by+BabyBo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb35b846d7d87da5bc825d8f23bd6f877055b496","infoHashBuffer":{"type":"Buffer","data":[203,53,184,70,215,216,125,165,188,130,93,143,35,189,111,135,112,85,180,150]},"announce":[],"urlList":[]}}