{"title":"Iron Maiden - Fear In The Dark (Live)","uid":5168036,"size":274825220,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cbdcd9345a0c4bcb751b781786499c6d0a20afb1&amp;dn=Iron+Maiden+-+Fear+In+The+Dark+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258527487,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nA live performance by Iron Maiden - Fear In The Dark from the Somewhere In Time Tour.\n\n\n&quot;Fear of the Dark&quot; is a song written by Steve Harris, bass player and main songwriter for Iron Maiden, as the title track to Iron Maiden's 1992 album Fear of the Dark. This is the only song from the Fear of the Dark album to still be played in concerts today, although &quot;Afraid to Shoot Strangers&quot; was often played live until 1998.\n\nThe single &quot;Fear of the Dark (live)&quot; is the 26th single released by the band. This live version of the song (as well as the live version of &quot;Bring Your Daughter...To the Slaughter&quot;) is taken from the live album A Real Live One. The single reached number 5 in the UK charts. The live version of &quot;Hooks in You&quot; was recorded at the Wembley Arena, London, UK on the 17th of December 1990. When Iron Maiden plays this song live the crowd sings along and is sometimes even louder than the band itself. A good example is the performance at Rock In Rio when a crowd of 250,000 people sang during the intro, before and after the guitar solo. Another exceptional occasion occurred in Helsinki, Finland in the band's 1992 concert, which was held indoors with an enthustiastic crowd (although much less in quantity than in the beforementioned Rio concert) chanting along the songÃ‚Â´s melody especially during the beginning of the song, creating what was described later as almost religious atmosphere. The special feeling was also noticed by the band and consequently Fear of the Dark from the Helsinki concert was included in their Real Live One album. During the song, the enthustiastic response by the audience is met with apparent satisfaction by lead singer Bruce Dickinson, who constantly lets the audience sing parts of the songs alone.\n\nThe song has been covered by German a cappella metal band van Canto on their album Hero, as well as the Italian metal band Graveworm on their 2001 album Scourge of Malice, by the also Italian death metal band Infernal Poetry on their 2005 album Beholding the Unpure and by the Finnish band Sturm und Drang as the bonus track on their 2008 album Rock 'n Roll Children.\n\nFear of the Dark is well-known at live concerts, because often Iron Maiden fans will sing along during the chorus, for a powerful effect.\n\nThe song was also covered by Fightstar for kerrang's Maiden Heaven.\n\nThe Flight 666 version of the song was released as downloadable content for the Rock Band video game series on June 9th, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:cbdcd9345a0c4bcb751b781786499c6d0a20afb1","amp;dn":"Iron+Maiden+-+Fear+In+The+Dark+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbdcd9345a0c4bcb751b781786499c6d0a20afb1","infoHashBuffer":{"type":"Buffer","data":[203,220,217,52,90,12,75,203,117,27,120,23,134,73,156,109,10,32,175,177]},"announce":[],"urlList":[]}}