{"title":"HISTORY OF POP AND ROCK MUSIC - part 298","uid":6395680,"size":469644500,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cc50e08ad59d67e09190c7569afbb8b8a0c35388&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+298&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1305514369,"description":"                   PART  298\n\n\n           JAZMINE SULLIVAN  -  Bust Your Windows (2008)\n           JAZMINE SULLIVAN - Dream Big  (2009)\n\n\n\n    &quot;Bust Your Windows&quot; is the second single by R&amp;B singer-songwriter Jazmine Sullivan from her debut Grammy-nominated album &quot;Fearless&quot;. The single, fueled by strong radio airplay, managed to peak at #4 on Billboard's Hot R&amp;B/Hip-Hop Singles Chart, becoming her second consecutive Top 5 single on that chart. &quot;Bust Your Windows&quot; debuted at #81 on the Billboard Hot 100 issued for week 43 of 2008. The single also became her second consecutive Top 40 hit on the Billboard Hot 100 when it spent a total of 5 weeks within the top 40. It peaked at #31 and holds the record for Jazmine's highest-peaking single on the chart, so far. The success of the song on this chart continued for weeks on end and it eventually dropped out in early 2009, spending a total of 15 weeks charting.\n    \n    &quot;Dream Big&quot; is the fourth overall single and first official UK single released from Jazmine Sullivan's debut album, &quot;Fearless&quot;. Jazmine performed &quot;Dream Big&quot; on popular French television show &quot;Le Grand Journal&quot; as part of her international 2009 promotion of her first album, &quot;Fearless&quot;. She also performed it along with several of her album tracks for UK BBC Radio 1's Trevor Nelson in April, 2009. On April 18, 2009 the single peaked at #164 on the UK Singles Chart after a surge of steady download sales during that week. &quot;Dream Big&quot; peaked at #6 on the Turkish Singles Chart issued March 30, 2009, making it Jazmine's first hit single outside the U.S. The track then went on to make waves on European airplay charts in countries such as Greece and Russia.","torrent":{"xt":"urn:btih:cc50e08ad59d67e09190c7569afbb8b8a0c35388","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+298","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc50e08ad59d67e09190c7569afbb8b8a0c35388","infoHashBuffer":{"type":"Buffer","data":[204,80,224,138,213,157,103,224,145,144,199,86,154,251,184,184,160,195,83,136]},"announce":[],"urlList":[]}}