{"title":"Glary Utilities Pro 2.17.0.776-serial incl","uid":5154940,"size":6056110,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ccce36eedc9cf3392c26865d77a620f9dbc9aa03&amp;dn=Glary+Utilities+Pro+2.17.0.776-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jmb2012","files":2,"time":1257791244,"description":"Reviewed by: CNET Staff \n\nThis powerful application offers extensive utilities to improve your system's performance and protect your privacy. Glary Utilities' well-organized interface allows users to easily choose from several tools. It cleans unwanted junk files and removes invalid and broken shortcuts, freeing up valuable disk space.\n\nIts Registry cleaner allows you to scan, remove, and back up faulty Registry entries. You also can wipe out online and Windows traces, although Internet Explorer is the only browser in which this function is supported. To improve the speed of your computer, Glary Utilities offers tools to manage start-up programs and memory optimization. Privacy-conscious users will certainly appreciate its inclusion of a government-standard file shredder to securely delete data.\n\nOverall, users who are looking for an effective and easy-to-use application to keep their system in tip-top shape should try this one out.\n\nOne Click A Day For PC Maintenance, Keeps Any PC Problems Away. With millions of worldwide users, the first-rank &amp; free Glary Utilities is an indispensable friend for your PC, with its 100% safe, thorough &amp; quick cleaning and worry-free restoration. Glary Utilities is a freeware with registry and disk cleaning, privacy protection, performance accelerator and amazing multifunctional tools. It can fix dogged registry errors, wipe off clutters, optimize internet speed, safeguard confidential files and maintain maximum performance. It is designed for both novice and professionals. User-friendly interface shows clear &amp; detailed directions. For novice, all work can be done with just 1 or 2 clicks, while for professionals, abundant options are available.\n\n\nWhat's new in this version:\nVersion 2.17.0.776 may include unspecified updates, enhancements, or bug fixes.\n\nOperating system: Windows Vista, Windows 2000, Windows XP, Windows 7\n","torrent":{"xt":"urn:btih:ccce36eedc9cf3392c26865d77a620f9dbc9aa03","amp;dn":"Glary+Utilities+Pro+2.17.0.776-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccce36eedc9cf3392c26865d77a620f9dbc9aa03","infoHashBuffer":{"type":"Buffer","data":[204,206,54,238,220,156,243,57,44,38,134,93,119,166,32,249,219,201,170,3]},"announce":[],"urlList":[]}}