{"title":"Lady GaGa - Paparazzi  (Live - 2009 VMA's)","uid":5106335,"size":161345540,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cd7639ac0029cf379d606664a37e3de3934f9eae&amp;dn=Lady+GaGa+-+Paparazzi++%28Live+-+2009+VMA%5C%27s%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1254396683,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nA live performance by Lady GaGa - Paparazzi from the 2009 VMA's.\n\n\n&quot;Paparazzi&quot; is a song by American pop recording artist, Lady Gaga from her debut album, The Fame. Written by Rob Fusari and Gaga, the song served as the album's third single in the United Kingdom, Ireland and Italy, the fourth single in Canada and the United States and the fifth single in Australia and New Zealand. It was released on July 6, 2009 in the United Kingdom, and on July 10, 2009 in Australia. Initially, &quot;LoveGame&quot; had been planned to be released as the third single in the United Kingdom, but it was decided that &quot;Paparazzi&quot; would be released instead because of the potentially controversial lyrics and video of &quot;LoveGame&quot;. The song was written by Gaga to portray her struggles and her love for fame. A mid-tempo dance song, the lyrics of &quot;Paparazzi&quot; depict the idea of a stalker following somebody to grab attention and fame.\n\n&quot;Paparazzi&quot; has been critically acclaimed for its fun-filled, club-friendly nature and is deemed the most memorable and telling song from the album. The accompanying music video for the song is a mini-movie starring Gaga as a doomed starlet who is hounded by the photographers and in the process is almost killed by her boyfriend. The video shows how she survives and makes a comeback while taking revenge on her boyfriend. It portrays the situations that a person goes through in order to be famous. The song has charted in Australia, Canada, United Kingdom and Ireland, becoming a top five single in their charts. In the United States it has reached seven on the Billboard Hot 100. Gaga performed the song in a number of live appearances including her first headlining The Fame Ball Tour where she performed it as the opening number of the show, wearing a geometric patterned shaped black dress, as well as at the 2009 MTV Video Music Awards, where Gaga won Best Art Direction and Best Special Effects awards.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:cd7639ac0029cf379d606664a37e3de3934f9eae","amp;dn":"Lady+GaGa+-+Paparazzi++%28Live+-+2009+VMA%5C%27s%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd7639ac0029cf379d606664a37e3de3934f9eae","infoHashBuffer":{"type":"Buffer","data":[205,118,57,172,0,41,207,55,157,96,102,100,163,126,61,227,147,79,158,174]},"announce":[],"urlList":[]}}