{"title":"Terminator 3: Rise of the Machines (2003) Untouched DVD","uid":6422221,"size":3779196928,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ce77b672875d107af950c190708e72f67e4d5de2&amp;dn=Terminator+3%3A+Rise+of+the+Machines+%282003%29+Untouched+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rjaa","files":8,"time":1306338274,"description":"\n\nDirector: Jonathan Mostow.\nCountries: USA, UK, Germany, Japan and Australia.\nYear: 2003.\nLength: 108 min.\nCast: Arnold Schwarzenegger (Terminator), Kristanna Loken (TX), Nick Stahl (John Connor), Claire Danes (Kate Brewster), David Andrews (Robert Brewster), Mark Famiglietti (Scott Petersen), Earl Boen (Dr. Peter Silberman) Moira Harris (Betsy), Chopper Bernet (Chief Engineer), Brian Sites (Bill Anderson).\nWriter: John D. Brancato and Michael Ferris, based on a story by John D. Brancato, Michael Ferris and Tedi Sarafian, and on characters created by James Cameron and Gale Anne Hurd.\nProducer: Mario Kassar, Hal Lieberman, Joel B. Michaels, Andrew G. Vajna, Colin Wilson.\nMusic: Marco Beltrami.\nPhotography: Don Burgess.\nEditing: Neil Travis.\nProduction designer, Jeff Mann.\nArt Director: Shepherd Frankel, Beat Frutiger, Andrew Menzies and Mark Zuelzke.\nCostumes: April Ferry.\nUSA release: July 4, 2003.\nReleased in Spain: July 30, 2003.\n\n\nA decade has passed since John Connor (Nick Stahl) helped prevent price Jui-Final and thus save mankind from mass destruction. Now, at 25, Connor lives &quot;off game&quot;: no home, no credit cards, mobile phone and no job. There is no evidence of their existence. There is no way he can be traced by Skynet, the highly developed network of machines that once tried to kill him and wage war to the world. Until, out of the shadows of the future, the TX (Kristanna Loken), a killing machine, the cyborg murderer Skynet's most sophisticated to date. Sent back through time by his predecessor to complete unfinished work, this machine is as relentless as beautiful. Now the only hope of survival for Connor's Terminator (Arnold Schwarzenegger-Zeneggen). Together they must triumph over the technologically superior TX and forestall the threat of the Final Judgement in sight ... or face the apocalypse and the fall of civilization as we know it.\n\n\nMulty Audio,Multy Subtittle\n","torrent":{"xt":"urn:btih:ce77b672875d107af950c190708e72f67e4d5de2","amp;dn":"Terminator+3%3A+Rise+of+the+Machines+%282003%29+Untouched+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce77b672875d107af950c190708e72f67e4d5de2","infoHashBuffer":{"type":"Buffer","data":[206,119,182,114,135,93,16,122,249,80,193,144,112,142,114,246,126,77,93,226]},"announce":[],"urlList":[]}}