{"title":"Firegraphic 10.0.0.1018-serial incl(work with windows 7)","uid":5004969,"size":5053854,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cef9994f8cdc333a51bf2c62ac8ac4216246597f&amp;dn=Firegraphic+10.0.0.1018-serial+incl%28work+with+windows+7%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jmb2012","files":2,"time":1247682335,"description":"PLAYS ALL VIDEO FILES ALSO\n\n\n\nFiregraphic is an all-in-one photo viewer for serious photographers and people at work. You can easily import, view, organize, edit, print and share your photos.\n\n    * Lightening fast.\n      No more waiting for the photo to open. Firegraphic starts up instantly and displays your photos into thumbnail images in seconds.\n\n    * View photos and folders all at once.\n      All your photos and folders are listed on screen, just scroll through the page and you'll see all the files in each folder and subfolder. When you organize your photo collections, you can move your photos, even folders, around by drag and drop.\n\n    * Full screen mode.\n      Full screen mode for the Explorer window utilizes all your screen space to display the thumbnails and the preview image. You can also hide the folder panel and the preview panel to maximize the number of thumbnails on screen.\n\n    * Pop-up photo preview.\n      Move your mouse over a thumbnail image and take a quick preview of your photo in the pop-up preview window.\n\n    * Compact mode.\n      The Compact mode makes it more convenient to work with 3rd party image editor. Align both Firegraphic and the image editor together, then drag the photo directly to the image editor for editing.\n\n    * Play videos.\n      Play your videos with Firegraphic's built-in media player while organizing your video collections. The built-in media player supports variety of video file formats, including AVI, MOV, MP4, MPEG, MPG and WMV.\n    * Capture video screen.\n      You can capture a screen shot of a video being played. Just click the video screen capture button and take a snap shot of the video.\n\n\n\n    * Import and rename photos.\n\n      Browse and import images directly from cameras and storage devices. You can define name for the images as you download them from your digital camera or memory card to your computer. This saves you a step from going back to rename the images.\n          o Compact Flash I, Compact Flash II\n          o Microdrive\n          o Memory Stick and Memory Stick Duo\n          o Secure Digital, MultiMedia, and SmartMedia cards\n          o xD-Picture cards\n\n\n    * Organize photos in Favorites.\n      Add your home, work, travel photos to the Favorites folders and categorize them into different albums for easy access later.\n\n\n\n    * Compare photos side-by-side.\n      Open two or more photos in Viewers and compare similar photos side by side to choose your best shots.\n\n\n\n    * Open multiple Viewers.\n      Open as many Viewers as you like and Firegraphic will arrange them automatically so you can see all the opened photos at once.\n\n\n\n    * Fix and enhance photos.\n      Fix your photos with the adjustment tools, including color balance, brightness/contrast, and see the changes you made in the before and after screen instantly.\n\n\n    * Lossless JPEG compression.\n\n      With the lossless JPEG compression feature, you can edit and re-save your JPEG images without recompression.\n\n      Adjust images with the nondestructive editing tools:\n          o Crop\n          o Rotation\n          o Flip image\n          o Color balance\n          o Brightness/contrast\n          o Hue/Saturation\n          o Desaturate\n    * Batch process.\n      Save hours of effort by processing photos in batch. Rename, resize, rotate, convert to different formats, photo adjustments, and more.\n\n\n    * Crop photos.\n      You can manually select or define a specific dimension such as 4 x 6 to crop your photo to remove unwanted portion. The area which is going to be deleted is darkened, giving you an idea on how your photo will look like when the photo is cropped.\n\n    * Print your photos.\n      With just a few clicks, you can turn your photos into wallet sized or 4 x 6 prints, print contact sheets of your photos for future reference, or quickly arrange photos to print in different sizes on a page with the pre-designed templates. Simply select the photos you want to print and choose the photo print size, Firegraphic will automatically arrange maximum number of photos possible on one page, and you'll see how your printouts look like instantly.\n\n\n    * Print tray.\n      Use the Print Tray to hold and organize the photos to be printed. Drag the thumbnail images to the Print Tray and move them around into the order you want.\n\n    * Share photos via email.\n      Reduce the size of the photos and email them to friends and family without altering the originals.\n\n    * Supported file formats.\n      Firegraphic supports variety of images, video, and audio file formats, including AVI, BMP, GIF, JPEG, MP3, MP4, MPEG, MPG, PCX, PNG, PSD, RAS, RAW, TGA, TIFF, WAV, WMA and WMV. Take a look of the complete supported file format list.\n\n    * Supported RAW formats.\n      Using Firegraphic, you can import JPEG images from virtually all digital cameras. Firegraphic also supports the RAW formats from a wide range of digital cameras. You'll find an extensive list of supported camera models on the RAW supported page.\n\n\nSystem Requirements:\n\n    * Microsoft Windows Vista (32-bit editions)/XP/2000 \n    * An Intel Pentium 4 (or compatible) Processor\n    * 100 MB hard disk space\n    * 512 MB RAM (1 GB recommended)\n    * Microsoft Internet Explorer 6 or 7\n    * Color monitor capable of displaying thousands of colors at a resolution of 1024x768 or higher\n\nVersion: 10.0.0.1018\nLanguage: English\nFile size: 5 MB\n(Last updated: July 15, 2009)\n","torrent":{"xt":"urn:btih:cef9994f8cdc333a51bf2c62ac8ac4216246597f","amp;dn":"Firegraphic+10.0.0.1018-serial+incl%28work+with+windows+7%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef9994f8cdc333a51bf2c62ac8ac4216246597f","infoHashBuffer":{"type":"Buffer","data":[206,249,153,79,140,220,51,58,81,191,44,98,172,138,196,33,98,70,89,127]},"announce":[],"urlList":[]}}