{"title":"Alexander Knaifel  Svete Tikhiy","uid":5014814,"size":168194616,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cf34ef1f127b105b65696e1e13456f02164adc15&amp;dn=Alexander+Knaifel++Svete+Tikhiy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":8,"time":1248173341,"description":"ECM's documentation of outstanding music from the former Soviet Union continues with Svete Tikhiy, the first of several albums from the Uzbekistan-born and St Petersburg-based composer, Alexander Knaifel. This recording - featuring the distinguished Keller Quartett with pianist Oleg Malov, and the voice of Tatiana Melentieva processed by Andrei Siegle - brings together important new developments and impulses in Knaifel's music. The Keller Quartet play with the conviction and imagination they also brought to their prize-winning and critically acclaimed New Series recordings of the string music of Gyorgy Kurtag (&quot;Musik fur Streichinstrumente&quot;) and Bach's &quot;Die Kunst der Fuge&quot;.\n\n========= from the cover ==========\n\nAlexander Knaifel, Svete Tikhiy\n\nWhile you have light, believe in the light, that you may become sons of light (John 12:36) These recordings present two works composed by Alexander Knaifel in the early 1990s: &quot;In Air Clear and Unseen, stanzas with Tyutchev for piano and string quartet&quot; (1994), and &quot;Svete Tikhiy (O Gladsome Light), the Song of the Most Holy Theotokos for Tatiana Melentieva&quot; (1991).\n\n&quot;Svete Tikhiy (O Gladsome Light)&quot;, both the name of the CD and the final composition, has not been chosen by the author by chance. &quot;O Gladsome Light&quot; is one of the three oldest Christian hymns included in the Russian Orthodox Vespers. It prersents Christ as the Light of the world (&quot;I am the light of the world. He who follows Me shall not walk in darkness, but have the light of life&quot; [John 8:12]). &quot;O Gladsome Light&quot;, like other Knaifel works of the 1990s, uses the canonical liturgical texts of the Russian Orthodox Church and expresses vividly the image of time expanding to the borders of eternity. And it is not just the reality of the future but the eternity brought to us in Christ's incarnation as if His coming is a seed containing this eternity (Metropolitan Anthony of Sourozh).\n\nKnaifel himself once defined his compositions of the 1980s and 90s as &quot;quiet giants&quot;. In these works, the metaphorical concept of eternity-time is expressed by irrationally slow tempos, the feeling that each sounding moment is unique, the author's attitude to the word as the meaningful heart and the structure of the composition, as well as the performers' function as participants of the creative co-operation. Knaifel's instrumental music of this period has become a sort of extension of human singing. The composer shares the opinion that &quot;a word once uttered, once defined, loses its absolute power&quot;. So, for it to stay profound and intimate the text in Knaifel's compositions does not ring out loud but is sung by the performers &quot;to themselves&quot;, as if it were sounded. Intonation gesture of the compositions is laconic; stylistic analogies with idioms of any musical styles are annihilated; and the performers concentrate their attention entirely on the touching quality. Careful pianissimo-dolcissimo sempre, along with the inner continuity of the intonational flow, creates the crystal-clear texture of Stanzas with Tyutchev &quot;In Air Clear and Unseen&quot; (the last verse of Tyutchev's &quot;The-soul would want to be a star...&quot;).\n\nKnaifel heard the verses by Fyodor Tyutchev (1803-1873), Pushkin's successor and one of the best Russian poets of the 19th century, in the timbre of the piano and string quartet his father was the leader of. He knew that timbre since his childhood. It stayed in the composer's musical intonation memory as an unreachable ideal transformed into the image of the distant star of the stanzas &quot;Of longing born, a past love's madness.. (1848) in the third movement of the cycle:\n\nI think of it with endless yearning,\n\n'Tis e'er with me though from me far,\n\nUnreachable, unchanged, bright-burning\n\nAs in the sky of night a star...\n\nIt is in striving for the ideal of the 19th century chamber music performance he had acquired from his father that Knaifel found the new potential for the traditional instrumental ensemble: there is neither the first nor the second part, neither violin nor cello; in other words, as regards timbre, there is no individualization of single instruments but all of them singing as one. Creating his cycle, Knaifel had a feeling that it was more natural for him &quot;to speak in a quiet voice and address others (maybe in a dialogue) hoping for the opportunity to hear an inner voice, within each of us, and get in resonance with it&quot;. And this voice rings out in the sound continuum of his cycle with a tender, trembling note expressing the Christian ideal of humanity &quot;in the inmost self, with its imperishable quality of a gentle, quiet spirit, which is of the highest value in the sight of God&quot; (1 Peter 3:4).\n\nThe cycle &quot;In Air Clear and Unseen, stanzas with Tyutchev&quot; opens in an unusual way: with a solo postlude for the piano, &quot;In Some Exhausted Reverie&quot; (the title is taken from Tyutchev's landscape diptych &quot;On the Way Back&quot;, written as he was returning to St. Petersburg from Konigsberg in 1859).\n\nThe middle movement of the cycle, &quot;An Autumn Evening&quot;, is performed just by the quartet without the piano, thus applying the original principle of the string singing derived, as the composer puts it, from the feeling of the instrumental &quot;chain breathing&quot;. Here the string quartet, on the one hand, is the symbol of romantically beautiful art of the 19th century, the supreme chamber ensembles of Tchaikovsky and Borodin, on the other hand, it is the expression of the absolute timbral unity akin to a chorus of human voices. In Tyutchev's &quot;An Autumn Evening&quot; (1830) the Theotokos' color symbols blend into the landscape lyrics. From the autumn palette the poet chooses the colors of Theotokos' iconography: golden, crimson and azure. Her face in icons appears &quot;in the sea of golden grace&quot;. Crimson is the color of the Burning Bush - the icon showing the prototypes from the Old Testament of Christ's incarnation. The azure is the symbol of Theotokos' virginity: &quot;without defilement you gave birth to God the Word&quot;. In Tyutchev, nature's anguish in autumn with its warning of &quot;pending storms&quot; and winter inexistence is chaste and religious - nature retires to rest and sleep so that in spring it may blossom into life. &quot;The godlike pride of anguish&quot; bears the stamp of humble martyrdom -the theme of Christian sacrifice, anticipation of the unspeakable glory that is to appear in the world, of the joy into which the pains of spiritual birth shall pass.\n\nIn the third movement &quot;In Air Clear and Unseen&quot; the restrained &quot;recitation&quot; of the piano (un solo pedale alla fine as in the first movement), which starts playing, as the composer notes, as if &quot;under the veil of the fading sounds of the quartet&quot;, naturally answers the descending &quot;cues&quot; of the strings from the previous movement. The transparency of the dialogue melts away in the &quot;instrumental gesture&quot; of the cycle's last phrase, each syllable of which is gently passed from one instrument to another as if following the light of the distant star.\n\nKnaifel, similarly to Tyutchev, transforms the tangible light flows into music -no matter what they may be: &quot;a tenderness, mysterious and soft, in autumn's even&quot;, azure &quot;above the sad and orphaned earth&quot;, or the light of distant stars glowing&quot; in air clear and unseen&quot;.\n\nIn the composition &quot;Svete Tikhiy (O Gladsome Light), the Song of the Most Holy Theotokos for Tatiana Melentieva&quot; the light is no longer perceived through the senses but through the heart - it is above all the spiritual image. It covers a lot of symbolic interpretations of the Russian word &quot;light&quot; (&quot;svet&quot;). In the Old Testament, it is the light of the Law, Wisdom and Word; in the New Testament, it is the Light that leads the saved into the Kingdom of Heaven where the Light of the chosen is the Lord God (Revelation 22:5). In Russian the word &quot;light&quot; also means the world around us (&quot;God's World&quot;) and holy (&quot;svet&quot;-&quot;sviat&quot;). At this perceptible intersection of sensuous and spiritual reality, the inner unity of both compositions is evident. It is explained by the similar methods of structuring the sound-space, which reflect the continuity and symbolism of the flows of light in Tyutchev's poetry and the Vesper hymn &quot;Svete Tikhiy&quot; (O Gladsome Light). The second word of this title, which is translated into Slavonic as &quot;quiet&quot;, means &quot;joyful&quot;, &quot;joy-creating&quot; light in Greek. And indeed, &quot;The Song of the Most Holy Theotokos for Tatiana Melentieva&quot; is full of Christmas triumph. The composition's sounding space is woven out of various forms of praying intonation: from the inner throbbing semitone-recitation to &quot;echoing&quot; antiphones and cantilena. According to tradition, the Russian Orthodox liturgical music is vocal, therefore it is the female singer's voice that makes the church celebration whole by penetrating it and bringing together its elements of space, rhythm and light.\n\nThe order in the sequence of liturgical texts from the Vespers is arbitrary in Knaifel. The vocal rendering of the &quot;Ringing of the Church Bells&quot; on the text of the &quot;Angelic Greeting of the Virgin Mary&quot; (&quot;Hail Mary&quot;) (Luke 1:28; 1:42; 2:11) is followed by the &quot;surge&quot; of the &quot;Song of the Most Holy Theotokos&quot; (Luke 1:46-56) against the background ostinato of &quot;Rejoice, O Virgin Theotokos&quot; as low murmuring, and by the singing of &quot;More honorable than the Cherubim&quot;, which sounds here only once, unlike the canonical order . of the morning service, as if in answer to the Virgin Mary's foresight: &quot;from henceforth all generations shall call me blessed&quot;. The song that ends the composition, &quot;Svete Tikhiy (O Gladsome Light)&quot;, is a precious melodic revelation, the humble hope of the transfigured world, the celestial light of the Kingdom of God.\n\nKnaifel's music leads to a spiritual ascent towards an ever-deepening knowledge of the life-giving love of God, towards meeting God in one's heart.\n\n-Ekaterina Blazkhova ","torrent":{"xt":"urn:btih:cf34ef1f127b105b65696e1e13456f02164adc15","amp;dn":"Alexander+Knaifel++Svete+Tikhiy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf34ef1f127b105b65696e1e13456f02164adc15","infoHashBuffer":{"type":"Buffer","data":[207,52,239,31,18,123,16,91,101,105,110,30,19,69,111,2,22,74,220,21]},"announce":[],"urlList":[]}}