{"title":"Destiny's Child - Cater 2 U (Live - 2005 BET Awards Show)","uid":4992624,"size":208816132,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cf6ce6ab1d16e87d2f6067073aca1e9915431305&amp;dn=Destiny%5C%27s+Child+-+Cater+2+U+%28Live+-+2005+BET+Awards+Show%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247122655,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nThis video has no logos or titles except for a PG logo at the beginning of the video.\n\n\n&quot;Cater 2 U&quot; is an R&amp;B song written by BeyoncÃƒÂ© Knowles, Kelly Rowland, Michelle Williams, Rodney Jerkins, Ricky &quot;Ric Rude&quot; Lewis, Robert Waller for Destiny's Child's fourth studio Destiny Fulfilled (2004). It was produced by Knowles, Rude and Jerkins and released as the album's fourth and final single in summer 2005, while the song peaked at number 14 on the U.S. Billboard Hot 100. &quot;Cater 2 U&quot; was nominated for two Grammy Awards for Best R&amp;B Song and Best R&amp;B Vocal Performance by a Duo Or Group.\n\nDestiny Fulfilled is the fourth and final studio album by American R&amp;B trio Destiny's Child, released by Columbia Records on November 15, 2004 in North America.\n\nThe album's production began after each member completed solo album releases. The record saw each member active in songwriting and producing. The underlying theme of love, which the group referred to as friendship they found in themselves, reveals their individual experiences.\n\nDestiny Fulfilled was released to generally mixed or negative reviews among critics. The album has reached number two on the US Billboard 200, and has since been certified triple platinum by the Recording Industry Association of America.\n\nThe album debuted at number fifty on the Billboard 200 for amassing sales of 61,000 copies. In its first official week of sales, the album sold over 497,000 copies, with an increase of 713% compared to its early sales; the album's chart position rocketed to number two on the Billboard 200. In the same week, it peaked at number one on the Top R&amp;B/Hip-Hop Albums chart for two weeks. Destiny Fulfilled has sold over three million copies in the US, and has been certified triple platinum by the Recording Industry Association of America on January 14 2005.The has sold over 9 million copies worldwide.\n\nDestiny Fulfilled was named the seventh best-selling album of the year worldwide by the IFPI. It charted in many countries including the United Kingdom at #5 and was certified platinum there, Germany, Ireland, and Canada. In Japan, it debuted at number four due to the huge success of &quot;Lose My Breath&quot; which reached number one on the singles chart there. The album has sold over 625,000 copies there and was certified double platinum by Oricon making it Destiny's Child's biggest success there to date.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:cf6ce6ab1d16e87d2f6067073aca1e9915431305","amp;dn":"Destiny%5C%27s+Child+-+Cater+2+U+%28Live+-+2005+BET+Awards+Show%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf6ce6ab1d16e87d2f6067073aca1e9915431305","infoHashBuffer":{"type":"Buffer","data":[207,108,230,171,29,22,232,125,47,96,103,7,58,202,30,153,21,67,19,5]},"announce":[],"urlList":[]}}