{"title":"I Know More Than God by philhellenes","uid":5170831,"size":20397606,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cfd4ca7f9306edf2e722d3c1649121f5408025b2&amp;dn=I+Know+More+Than+God+by+philhellenes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pastafarian101","files":-1,"time":1258673333,"description":"40 things God SHOULD have known:\n\n1. The Universe began with light. (No Christians, God screwed up in verse 3 of Genesis because in verses 1 and 2 He already said He made the Earth and was hovering over &quot;the waters&quot; BEFORE there was light, and in verse 9 he said the world was first covered in sea, when it was too hot for puddle, and it wasn't until verse 16 that He made the stars, so just don't go there, ok?)\n2. The light (energy) was too intense for anything else to exist.\n3. Space expanded faster than light. Inflation, while still theoretical, is looking good).\n4. Expansion reduced the energy density and allowed quarks to form.\n5. All matter was formed from light/energy as per E=MC2.\n6. Atomic nuclei remained &quot;naked&quot; for about 380,000 years after the B of the Bang due to the intensity of energetic photons (particles of light). After this point electrons were able to bond to atomic nuclei.\n7. Accurate ratio of size between an atom and the Earth.\n8. Vast (and I mean VAST!) clouds of the simplest atoms (mostly hydrogen) were able to gather under gravity.\n9. At the core of such clouds, when massive enough, nuclear fusion began and emitted light.\n10. Hydrogen atoms fuse to form helium releasing &quot;unneeded&quot; energy (light/heat) in the process.\n11. Accurate numbers of stars per galaxy.\n12. Accurate description of the shape of most galaxies (i.e., &quot;discs&quot;).\n13. Each galaxy separated.\n14. Each galaxy moving apart from all others at speed.\n15. Accurate description of the numbers of galaxies in the visible Universe (though the actual number in existence will be far, far greater (but God/Allah didn't even mention ONE!).\n16. Description of red dwarfs.\n17. Description of blue giants.\n18. The link between a star's mass, its light output and its life-expectancy (the rate at which it &quot;burns&quot; nuclear fuel).\n19. The sequence of elemental &quot;burning&quot;, from hydrogen (element 1) up to element 26 (with 26 protons), iron. Ordinary nuclear fusion cannot proceed any further as iron is too stable.\n20. A star dies when it has fused all its silicon into iron. The end comes quickly, in tenths of a second, as the star, with no energy to &quot;hold it up,&quot; collapses on its core. This is a supernova.\n21. The collapse of the star briefly provides the energy to fuse heavy atoms, like iron, at the core into the less stable remainder of the table of chemical elements, up to element 92 (uranium) and beyond (the highly unstable plutonium for instance, at atomic number 94).\n22. Chemical elements heavier than Hydrogen are produced in stars then spread out into the cosmos via supernovae.\n23. The shockwaves from these events trigger the births of stars in &quot;nearby&quot;, previously stable clouds of hydrogen gas, beginning the cycle again.\n24. Second generation stars coalesced from the ashes of earlier stars and the first rocky planets formed out of the heavy elements produced by the first generation stars.\n25. The &quot;geography&quot; of the solar system: The rocky, metallic planets of Mercury, Venus, Earth and Mars are to be found closer to the sun while the gas and ice giants of Jupiter, Saturn, Uranus and Neptune are to be found further out.\n26. The relationship between orbital speed and distance from the star.\n27. Earth was formed 9 billion years after the Beginning.\n28. Due to the relatively low temperatures on Earth when compared to the stars, elements can form chemical bonds and grow in complexity.\n29. Asteroid bombardment of the early Earth (&quot;mountains from the sky&quot;).\n30. Chemical reactions proceed for approximately half a billion years before biogenesis occurs.\n31. Chemical reactions caused by electromagnetism (&quot;the law of the magnet and the lodestone&quot;).\n32. Absorption of early (poisonous) atmosphere by early organisms to produce a breathable atmosphere.\n33. The sky of the Earth tuned blue only after life had begun, 500 million years after the planet's formation.\n34. Asteroid bombardment largely over by this time.\n35. Mankind in existence 4,000,000,000 later.\n36. The study of the &quot;solid and the light&quot;, the interaction of light and matter, of forces and matter, leads to physics.\n37. Prediction of the coming of telescopes, from lenses made from sand.\n38. Prediction of astronomical objects unknown at the time of the Bible or the Quran.\n39. Prediction of black holes and their ability to &quot;withhold&quot; light.\n40. The world is a sphere (the Qur'an DID contain this information, but then, contrary to what many believe, it was common knowledge at the time due to Eratosthenes discovering it almost 1,000 years BEFORE the Qur'an was written).\n\nOh, and Allah said iron fell to Earth? Well, seeing as meteorites were well known LONG before then, and one sits at the heart of Mecca (the &quot;Hadschar al Aswad&quot;), and seeing as how Allah did not mention that the other 90+ elements also &quot;fell from the skies&quot;, forgive me if I don't convert just yet.\n\nAuthor: philhellenes","torrent":{"xt":"urn:btih:cfd4ca7f9306edf2e722d3c1649121f5408025b2","amp;dn":"I+Know+More+Than+God+by+philhellenes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfd4ca7f9306edf2e722d3c1649121f5408025b2","infoHashBuffer":{"type":"Buffer","data":[207,212,202,127,147,6,237,242,231,34,211,193,100,145,33,245,64,128,37,178]},"announce":[],"urlList":[]}}