{"title":"Crash Kelly-One More Heart Attack-2008","uid":4991477,"size":90607683,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d024aaa84e611febbe8985f905af97f36834234e&amp;dn=Crash+Kelly-One+More+Heart+Attack-2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PoisonI","files":10,"time":1247068663,"description":"Artist: Crash Kelly\nTitle: One More Heart Attack\nGenre: Glam/Melodic Hard Rock\nType: Album\nSize: 86,4 MB\nTracks: 10\nQuality: 320 kbps\n\nTrack List:\n\n01. One More Heart Attack 3:55\n02. Jenny Jet 4:40\n03. Old Habits Die Hard (And The Good Die Young) 3:55\n04. The Devil You Know 3:31\n05. Love Won't Die 4:30\n06. Nottingham Rock City Blues 2:48\n07. Right Girl, Wrong Time 3:58\n08. Trash Talk 3:02\n09. Falling In And Out 3:18\n10. 16 On A Summer Night 4:04 \n\nRelease Notes:\n\nThere was a magical time in music where one could turn on their favourite\nFM radio station and be rewarded for their efforts with a stream of truly\nclassic rock n' roll. The sounds of T-Rex melding into Thin Lizzy, the Alice\nCooper Group played back to back against a Cheap Trick album track.\n\nThe 70s era of rock n' roll was a time when the purchase of an album was\na sacred rite of passage, attending a concert equivalent to a mass religious\nexperience, when the image and art of the rock n' roll performer merged as\none. CRASH KELLY wants to take you back... Ladies and gentlemen, please\nadjust your Hi-Fi players for the next rock n' roll transmission. Crash\nKelly is the soulchild of Sean Kelly, a Toronto session musician who has\ntoured and recorded with some of the biggest names in Canadian music.\nAfter years of playing sideman to various and sundry artists, the Rock n'\nRoll animal in Sean could no longer be contained. In 2002, Crash Kelly was born.\n\nCrash Kelly comes by its' influences honestly. Weaned on Aerosmith, the\nRolling Stones, KISS and T-Rex, Sean quickly fell under the spell of the\nsound of twin guitars, slamming glam-rock beats and performance based rock\nn' roll courtesy of his older sister's record collection.\n\nBeing a child of the 80s, Sean was able to separate the wheat from the\nchaff of the hard rock artists of the famed Sunset Strip. Early Motley\nCrue and Hanoi Rocks are considered essential listening in the Kelly\nhousehold. It's the combination of these influences filtered through\nthe classic 70s structure and sound that forms the foundation for Crash Kelly. \n\nEnjoy and please seed after you have finished download as long as you can. ","torrent":{"xt":"urn:btih:d024aaa84e611febbe8985f905af97f36834234e","amp;dn":"Crash+Kelly-One+More+Heart+Attack-2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d024aaa84e611febbe8985f905af97f36834234e","infoHashBuffer":{"type":"Buffer","data":[208,36,170,168,78,97,31,235,190,137,133,249,5,175,151,243,104,52,35,78]},"announce":[],"urlList":[]}}