{"title":"THE_MATRIX.DVDrip(vice)","uid":5006679,"size":504636310,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:d1341cf7f4c898b892a2b8c139e0304600cb3583&amp;dn=THE_MATRIX.DVDrip%28vice%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1247759173,"description":"THE MATRIX DVDrip...PSP...IPOD\n\n\nResolution : 368X208 (Wide Screen)\n\nVideo Codec : MPEG4\nVideo Bitrate : 448 Kbps\nAudio Codec : AAC\nAudio Bitrate : 64 Kbps\n\n\nComputer programmer Thomas A. Anderson leads a secret life as a hacker under the alias &quot;Neo&quot;, and wishes to learn the answer to the question, &quot;What is the Matrix?&quot; Cryptic messages appearing on his computer monitor and encounters with three sinister agents lead him to a group led by the mysterious Morpheus, a man who offers him the chance to learn the truth about the Matrix. Neo accepts by swallowing an offered red pill, and subsequently finds himself naked in a liquid-filled pod, his body connected by wires to a vast mechanical tower covered with identical pods. The connections are severed, and he is rescued by Morpheus and taken aboard his hovercraft, the Nebuchadnezzar. Neo's neglected physical body is restored, and Morpheus explains the situation.\n\nMorpheus informs Neo that the year is not 1999, but estimated to be closer to 2199, and that humanity is fighting a war against intelligent machines created in the early 21st century. The sky is covered by thick black clouds created by the humans in an attempt to cut off the machines' supply of solar power. The machines responded by using human beings as their energy source in conjunction with nuclear fusion, later growing countless people in pods and harvesting their bioelectrical energy and body heat. The world which Neo has inhabited since birth is the Matrix, an illusory simulated reality construct of the world as it was in 1999 developed by the machines to keep the human population docile in their captivity. Morpheus and his crew are a group of free humans who &quot;unplug&quot; others from the Matrix and recruit them to their resistance against the machines. Within the Matrix, they are able to use their understanding of its nature to bend the laws of physics within the simulation, giving them superhuman abilities. Morpheus believes that Neo is &quot;the One&quot;, a man prophesied to end the war through his limitless control over the Matrix.\n\nNeo is trained to become a member of the group. A socket in the back of Neo's skull, formerly used to connect him to the Matrix, allows knowledge to be uploaded directly into his mind. In this way, he learns numerous martial arts disciplines, and demonstrates his kung fu skills by sparring with Morpheus in a virtual reality &quot;construct&quot; environment similar to the Matrix, impressing the crew with his speed. Further training introduces Neo to the key dangers in the Matrix itself. Injuries suffered there are reflected in the real world; if he is killed in the Matrix, his physical body will also die. He is warned of the presence of Agents, fast and powerful sentient computer programs with the ability to take over the virtual body of anyone still directly connected to the Matrix, whose purpose is to seek out and eliminate any threats to the simulation. Morpheus is confident that once Neo fully understands his own abilities as &quot;the One&quot;, they will be no match for him.\n\n\nPLEASE...SEED...AND...ENJOY...THANKS","torrent":{"xt":"urn:btih:d1341cf7f4c898b892a2b8c139e0304600cb3583","amp;dn":"THE_MATRIX.DVDrip%28vice%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1341cf7f4c898b892a2b8c139e0304600cb3583","infoHashBuffer":{"type":"Buffer","data":[209,52,28,247,244,200,152,184,146,162,184,193,57,224,48,70,0,203,53,131]},"announce":[],"urlList":[]}}