{"title":"Mr. Brooks [DVDrip]dual[2007].","uid":5147731,"size":1872721920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d2306601cb77b4fa1352dde8e21164dbb8a380d6&amp;dn=Mr.+Brooks+%5BDVDrip%5Ddual%5B2007%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":1,"time":1257363524,"description":"Mr. BrooksRepartoKevin Costner, Demi Moore, Dane Cook, William Hurt, Marg Helgenberger, Ruben Santiago-Hudson, Danielle PanabakerDirectorBruce A. EvansProductorKevin Costner, Raynold Gideon, Jim Wilson, Jeffrey BeecroftDuraciÃƒÂ³n02:00:00EstrenomiÃƒÂ©rcoles 5 diciembre 2007GÃƒÂ©neroIntrigaPaÃƒÂ­sEE.UU.DistribuidoraManga FilmsSinopsis\n\n\n\n\n\n\nEarl Brooks lo tiene todo: una esposa encantadora y una hija que le adora, una excelente reputaciÃƒÂ³n en la comunidad, ademÃƒÂ¡s de su propio y prÃƒÂ³spero negocio. Sin embargo, el Sr. Brooks tiene una doble vida que nadie sospecha siquiera. TambiÃƒÂ©n es el cÃƒÂ©lebre asesino en serie apodado como el &quot;Asesino de la huella del pulgar.&quot; Aunque se halla inactivo por el momento, su compulsiÃƒÂ³n patolÃƒÂ³gica se ve inflamada una vez mÃƒÂ¡s por su alter ego astuto y perverso, a quien el Sr. Brooks culpa de sus transgresiones. Sin embargo, al ceder a un nuevo y malvado impulso de asesinar a una pareja desprevenida, el Sr. Brooks comete su primer error pues es observado por un fotÃƒÂ³grafo voyerista, quien opta por hacerle chantaje mediante una demanda extraÃƒÂ±a. Sin embargo, este ÃƒÂºltimo crimen hace que una detective tenaz cuya propia crisis personal la empuja con furia a querer resolver la identidad del &quot;Asesino de la huella del pulgar,&quot; se sitÃƒÂºe tras la pista del Sr. Brooks.\n\nAhora, por primera vez, el Sr. Brooks se enfrenta al final del juego, a menos que pueda seguir ocultando su sorprendente doble vida y su autÃƒÂ©ntica identidad para siempre.","torrent":{"xt":"urn:btih:d2306601cb77b4fa1352dde8e21164dbb8a380d6","amp;dn":"Mr.+Brooks+%5BDVDrip%5Ddual%5B2007%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2306601cb77b4fa1352dde8e21164dbb8a380d6","infoHashBuffer":{"type":"Buffer","data":[210,48,102,1,203,119,180,250,19,82,221,232,226,17,100,219,184,163,128,214]},"announce":[],"urlList":[]}}