{"title":"Wolven Ancestry - Silence of the Boreal (2009)  Melodic Black Me","uid":4997062,"size":72959238,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d24974624824747527a79722595a154a8bee62d7&amp;dn=Wolven+Ancestry+-+Silence+of+the+Boreal+%282009%29++Melodic+Black+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Baphom3t","files":10,"time":1247336209,"description":"Wolven Ancestry began in 2006 with the release of their demo album &quot;THE WRATH OF GAIA&quot;. It was written entirely in late 2005 by founding member FRAUST. Vocals and lyrics were needed and LORD DEFILER from the band FLESHCRAFT was chosen for the duties. In February 2006, the first WOLVEN ANCESTRY album was completed. A very talented and solid line up was sought out by the founding members and the brother of FRAUST, VESPER was chosen for guitar. SILDAV was also brought into the band to play bass along with NAGOLHAMMER for drums. After some jams and also naming the band it was decided that percussion duties should be accomplished by GUYZUS, also from the band FLESHCRAFT. \n\nAfter spending some time learning and jamming the songs from the self produced album, the band played their first live show with local bands in their Northern Ontario town Sudbury. The band performed well and their hometown knew there was a new band with skill amongst them. Their second show seen them opening for Belgium greats LENG T'CHE and Canadian greats BENEATH THE MASSACRE and FUCK THE FACTS.\n\nCD-R copies of the WRATH OF GAIA were made and distributed independently by the band. Many copies were requested from around the world almost immediately from orders online and in July of 2006 the band pressed the album through the label/booking agency ARCHAIC NORTH ENTERTAINMENT, also home of EMPYREAN PLAGUE and many other great artists.\n\nAugust of 2006 saw the band on a successful headlining tour of the United States and Canada with NEFASTUS DIES. The bands fan base grew considerably during this tour.In April the band shares the stage with 1349, GOATWHORE, NACHTMYSTIUM, and AVERSE SEFIRA. A few videos from this event were posted onand the band gained much more recognition as a great live band including a menacing cover of SATYRICON'S &quot;Mother North&quot;.\n\nThe band is steadily on the rise, having shared the stage with many great bands including an Eastern Canadian tour in November in direct support for the legendary ROTTING CHRIST and also sharing the stage on off dates with many other great acts including ENSIFERUM, MACABRE and many more. New materials were being completed and peformed at this time at live events.\n\nMany shows are played in 2007 to support the Wrath of Gaia, which is re-released on pressed CD's by Archiac North Entertainment. The album is sold around the world and the bands fanbase steadily grows.\n\nThe band records a video for the track &quot;A Bloodline of Immortal Passion Bestowed The Harmony of Man and Wolf&quot;.\n\nSeveral festival appearances are made including The Heathen Crusade 3 Festival, Sudbury Metal Feast 4, Quevellion Metalfest 2 and several other live shows in many different cities. The band shares the stage with great bands such as SIGH, IMPALED NAZARENE, MOONSORROW, EMETH, and UNEXPECT to name a few.\n\nIn November 2008 the band performs an extensive tour of Ontario, Quebec, Manitoba and select US dates with local Ontario brothers WOODS OF YPRES. Materials for the new album are near completed, and will be available in the summer of 2009 through Archaic North Entertainment.\n\nNew album to be released summer 2009, as well as an extensive tour in August. Full details will be available soon.\n\nCurrent line-up \nLord Defiler - Vocals (Fleshcraft, Fractal Generator, Amaranth, Darkblood)\nFraust - Backing/Clean Vocals, Guitar (Beyond Within, Aastyra, Fractal Generator, Prophecy of the Wolves, Amaranth)\nVesper - Guitar (Fractal Generator, 85 Pound Poutine)\nMars - Bass (Grim)\nSwordan - Keyboards\nGuyzus - Drums (Fleshcraft)\n\nGenre = Melodic Black Metal\nFormat = Mp3\nBit Rate = 192 kbps\n\nTrack Listing\n1. Intro \n2. Silence of the Boreal \n3. An Animistic Awakening \n4. Memories of Life Forgotten With Time  \n5. A Trail of Blood in Snow \n6. Hymn of the Fallen \n7. March Forth Under Tortured Skies \n8. Codex Canadiensis \n9. The Bering Descent\n\n","torrent":{"xt":"urn:btih:d24974624824747527a79722595a154a8bee62d7","amp;dn":"Wolven+Ancestry+-+Silence+of+the+Boreal+%282009%29++Melodic+Black+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d24974624824747527a79722595a154a8bee62d7","infoHashBuffer":{"type":"Buffer","data":[210,73,116,98,72,36,116,117,39,167,151,34,89,90,21,74,139,238,98,215]},"announce":[],"urlList":[]}}