{"title":"CARRIERS.2009.DVDrip[vice]","uid":5178058,"size":410216611,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d2d3119ea6b5628d27244e4bda303108180a1137&amp;dn=CARRIERS.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1259084282,"description":"CARRIERS 2009 DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 01:24:33\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCast\n\n* Christopher Meloni - Frank\n* Piper Perabo - Bobby\n* Chris Pine - Brian\n* Emily VanCamp - Kate\n* Lou Taylor Pucci - Danny\n* Kiernan Shipka - Jodie\n* Dale Malley - Luke[\n\nPlot\n\nThe horror starts with a pandemic virus that spreads world-wide. Two brothers, Brian and Danny, along with Brian's girlfriend Bobby and Danny's friend Kate, are heading to a place where they believe they can wait for the viral pandemic to die out, along with the infected-- namely a place called Turtle Beach, where Brian and Danny used to spend their holidays as children. They come across a van parked in the middle of the road, where a man stops them, looking for fuel for his car. They realise his daughter, who is in the backseat of the van is infected and they refuse to help, attempting to drive around the van which is blocking the road. The man attacks their car, and while trying to evade him, their car is irrevocably damaged. The four teenagers have no choice but to join the father and his infected daughter in order to use their fully functioning van, providing the gas from their own car, making a deal with the man that they will drive him to a school where it is rumoured that a serum has been developed that could help the infected, in order to help the little girl. Upon reaching the school however, they encounter a doctor with several infected children. The doctor explains the serum only slowed down the virus, prolonging the disease by three days, and that as a result he is planning on euthanizing the children, claiming that &quot;living is sometimes a more painful way of dying&quot;. Meanwhile in the car the little girl's breathing becomes compromised and Bobby (who remained with her while the others went into the school) tries to help, taking off the child's mask to help her breathe. However the little girl begins to cough, and coughs blood into Bobby's face. Fearing that she may be infected, she doesn't tell the others when they return, still in shock. The little girl asks to go to the bathroom, and her father reluctantly takes her, knowing the teenagers will take his car and leave them behind, but seeing no other choice. Before he walks away he tells Danny that he seems like a good man. The teenagers drive away, knowing they are leaving father and daughter to their deaths.\n\nSoon they come across an hotel and relax, playing golf. Bobby refuses to have any physical contact with Brian, to his bewilderment. Eventually he grabs her and kisses her passionately, to which she pushes him away in terror. Unknown to them, the hotel is already occupied, and when several men in hazmat suits appear, they take the teenagers hostage, and it is implied that they are going to rape Bobby and Kate. However they order the girls to strip to see if they are infected, revealing a tell-tale symptomatic rash on Bobby's body, to Brian's horror. In their hysterical fear, Brian, Bobby, Kate and Danny run to the van and drive away, now knowing that Bobby is infected. When they reach a gas station, Kate tells Danny they will end up dead if Bobby comes with them. Danny reluctantly goes to speak to his brother, who simply tells them to get in the car. From there, he forces Bobby out the van. Brian and Bobby argue and Bobby begs him not to leave her behind, telling him she loves him. Feeling there's no other choice, Brian and the rest of the group leave Bobby at the gas station and drive away.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0806203/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0806203/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:d2d3119ea6b5628d27244e4bda303108180a1137","amp;dn":"CARRIERS.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2d3119ea6b5628d27244e4bda303108180a1137","infoHashBuffer":{"type":"Buffer","data":[210,211,17,158,166,181,98,141,39,36,78,75,218,48,49,8,24,10,17,55]},"announce":[],"urlList":[]}}