{"title":"Killchain  - They (2009)","uid":5173678,"size":71578467,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d35db1ab5513f6c080edef86baf6bc1cc3eb4a51&amp;dn=Killchain++-+They+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Baphom3t","files":14,"time":1258835708,"description":"KILLCHAIN, founded in autumn 2005 in Kosice, Slovakia, delivered with &quot;They&quot; their second long player. Their debut album in 2007, &quot;One More Victim&quot;, earned very different feedback within Germany and europe. The half of reactions praised the band and their honest pure death metal style, the other half reviled them for being too old school with no modern worldshaking impulse. But Killchain is in fact a death metal band and they never wanted to be something else. \nConcerning this, it is no suprise, that the band follows this path also with their now available second release, doing that much more constantly!\n\nOn &quot;They&quot; you can await one brute riffing-thunderstorm after the other, garnished with the genre typical growls and a portion of technical finesse, representing a lot of joy playing music. KILLCHAIN are doing in 2009 what they always have done.. They are playing Death Metal. Death Metal as Death Metal can be. If you except something else or you don't like this kind of sound, you better stop listening and reading now.\nAfter touring through europe during the last years, their standing in the scene has increased. They could convince some well known musicians like Trevor Nadir (SADIST) and Dave Kibler (Lividity) to contribute some guest vocals on the album, which can be enjoyed in tracks like &quot;Erruption-Devotion&quot; and &quot;Bloodstained On My ...&quot;.\n\nThe album was recorded and produced at Kosice Klakson Studio, and is mixed and mastered by Martin Barla, who is giving this masterpiece a sound, which fits to the point for an death metal album with old school and brutal roots. Everybody that is into this kind of music will enjoy it. Killchain follow their way straightly and &quot;They&quot; is just the logical result of their work. Enjoy!\n\nCurrent line-up \nGabi - Vocals (Obliterate, Thorwald, Epitome (Pol))\nFrenky - Guitar (Infer, Perversity)\nStano - Guitar (Erytrosy, Feast of Rotten Corpses)\nTonka - Bass (Ravenclaw (Svk))\nKubo - Drums (Defender, Ownbliss) \n\nGenre = Death Metal\nFormat = mp3\nBit Rate = vbr\n\nTrack Listing\n1. Touch-ik   \n2. They   \n3. Have A Nice Day Your Piece Of Shit  \n4. Erruption-devotion   \n5. Pretty Face  \n6. Not Yet, Maybe Never   \n7. Every Idea Cost Something   \n8. Wall Of Buried Souls   \n9. Rhymes Only \n10. Afterparty At The Minefield   \n11. Bloodstain On My ...  \n12. Newborn Earth   \n13. Details Of Madness","torrent":{"xt":"urn:btih:d35db1ab5513f6c080edef86baf6bc1cc3eb4a51","amp;dn":"Killchain++-+They+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d35db1ab5513f6c080edef86baf6bc1cc3eb4a51","infoHashBuffer":{"type":"Buffer","data":[211,93,177,171,85,19,246,192,128,237,239,134,186,246,188,28,195,235,74,81]},"announce":[],"urlList":[]}}