{"title":"Last Letters from Monte Rosa (2010) (NL SUBS)","uid":6413610,"size":4154028697,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d3741fae332b75e6c64537979e2f827c5d050927&amp;dn=Last+Letters+from+Monte+Rosa+%282010%29+%28NL+SUBS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":11,"uploader":"Vlinder2","files":-1,"time":1306086749,"description":"Last Letters from Monte Rosa (2010) \t\n\nAlternatieve titel: The Final Sacrifice \t  \t\n\nVerenigde Staten\nActie / Drama\n88 minuten\n\nmet C.J. Barkus, Gianluca Bianco en Daniel Asher\n\nGemiddelde:\nMoviemeter: 2.72\nIMDB: 6.2/10\n\nLiefhebbers van een avondje film, vergeet niet dat er naast de \\\\\\&quot;Grote Hollywoodreleases\\\\\\&quot; nog tig van \\\\\\&quot;andere\\\\\\&quot; (kwaliteits) films zijn, die te goed zijn om in de anonimiteit te verzwelgen.\n\n\nEen film geregisseerd door Ari Taub, gebaseerd op de brieven die de Duitse nazi-soldaten naar hun familie stuurden tijdens de laatste dagen van de oorlog te Monte Rosa, ItaliÃƒÂ«.\n\nSamenvatting\nNa bijna een week zonder bevoorrading wacht een peleton van het Duitse leger op versterking van hun Italiaanse bondgenoten. De soldaten hebben honger en zijn ontmoedigd. Bovendien worden ze constant geteisterd door bombardementen van de geallieerde troepen en bedreigd door lokale verzetsstrijders. Wanneer de Italiaanse versterking uiteindelijk arriveert, blijken deze soldaten nog in slechtere conditie te zijn dan de Duitsers die ze moeten beschermen. De twee bondgenoten kunnen niets anders doen dan weerstand proberen te bieden tegen de oprukkende geallieerden.\n\nRecensie\nDe samenwerking tussen de Duitsers en de Italianen staat centraal in deze film. Er zijn geen grootschalige veldslagen of voortdurend contact met de vijand, maar de constante spanning tussen de Duitse en Italiaanse soldaten. Zoals verwacht verloopt dit in het begin nogal stroef, wat uitmondt in enkele vechtpartijen tussen de verschillende kampen maar krijgen de Duitse en Italiaanse officier toch al snel enig respect voor elkaar. Last Letters from Monte Rosa is realistisch gefilmd. Een sterke sympathieke film.\n\nVerhaal\nIn deze film zien we een Duitse defensieve reserve-eenheid die de opmars van de Amerikaanse troepen moet zien te vertragen. Hoewel er van de Amerikanen nog niet veel te zien is worden ze ingesloten door Italiaanse partizanen. De Duitse eenheid kampt onder meer met voedseltekort omdat de bevoorrading steevast door de partizanen wordt overvallen. Luitenant BrÃƒÂ¼chner wacht met smart op versterking van de nog loyale troepen van Mussolini. Wanneer deze arriveren blijken ze er niet veel beter aan toe te zijn dan de Duitse soldaten en bovendien stuit het hen tegen het hoofd om tegen landgenoten te moeten vechten.\n\nMoviemeter info\n\nVerenigde Staten\nActie / Drama\n88 minuten\n\ngeregisseerd door Ari Taub\nmet C.J. Barkus, Gianluca Bianco en Daniel Asher\n\nTijdens de Tweede Wereldoorlog wordt een Duitse defensieve reserve-eenheid onder leiding van luitenant BrÃƒÂ¼chner ingesloten door guerrilla-aanvallen van de Italiaanse partizanen. Ze gaan wanhopig op zoek naar voedselvoorraden en wachten op versterkingen van de resterende loyale troepen van Mussolini. Maar als de Italiaanse versterkingen van luitenant Gianini aankomen, zijn zijn mannen terughoudend om te vechten tegen collega-Italianen en zijn zij nog minder enthousiast over hun Duitse \\'wapenkameraden\\' waarvan er nu al velen inzien dat deze oorlog een verloren zaak is.\n\nEnglish\n\nRelease Date: 2010   Duration: 88 min\n\nCast: Ari Taub, Fabio Sartor, Thomas Pohn, Dirk Schmidt\n\nCategories: Movies War Drama War\n\n\n\nDirected by Ari Taub as a companion piece to his earlier WWII feature The Fallen, Last Letters from Monte Rosa re-examines the Second World War from the perspective of an ill-fated German Army platoon waiting out their final days in Northern Italy. The saga begins in 1944, when Lieutenant BrÃƒÂ¼chner (Thomas Pohn), a man in charge of a German reserve defense unit, must contend with the ill plight of his men: starving, physically unclean, and desperately in need of reinforcements from Mussolini\\'s loyalists, they appear to stand little chance of survival. The reality of this situation grows even clearer when the loyalists actually show up, led by Lieutenant Gianini (Fabio Sartor), and refuse to fight against their fellow countrymen in a battle that they uniformly perceive as a lost cause. ~ Nathan Southern, Rovi LESS\n\n\nInfo:\nBron: Retail\nTaal: Italiaans, en Duits\nAudio: DD 2.0\nOndertitels: Nederlands\n\nMet dank en alle eer voor de originele poster\n\n\n &lt;a href=&quot; http://www.monterosamovie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.monterosamovie.com/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/71369&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/71369&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1305039/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1305039/&lt;/a&gt;\n\nTBS\n \t","torrent":{"xt":"urn:btih:d3741fae332b75e6c64537979e2f827c5d050927","amp;dn":"Last+Letters+from+Monte+Rosa+%282010%29+%28NL+SUBS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3741fae332b75e6c64537979e2f827c5d050927","infoHashBuffer":{"type":"Buffer","data":[211,116,31,174,51,43,117,230,198,69,55,151,158,47,130,124,93,5,9,39]},"announce":[],"urlList":[]}}