{"title":"Symantec System Recovery (2011) [Multilenguaje]","uid":6422224,"size":333164887,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d47198032b22f22b45abcd57b10fd0a0d2262e30&amp;dn=Symantec+System+Recovery+%282011%29+%5BMultilenguaje%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":4,"time":1306338301,"description":"Symantec System Recovery (2011) [Multilenguaje]\n\nEnglish:\n------------\nCategory: Programs \nLanguage: Multilenguaje including Spanish \nVersion: v10.0.0.39952 \nIncluding medicine \n\nSymantec Backup Exec System Recovery Desktop Edition 2011 is a solution for backup and recovery simple and cost effective for small businesses, which helps minimize downtime and prevent disasters through simple recovery in a matter of minutes instead of hours or days, data files or folders or individual desktops or laptops running Windows full, even to dissimilar hardware, virtual environments or remote locations. \n\n\nKey Features \n\n* Make backups of desktop and laptop computers automatically, without interrupting employee productivity, and saves any disk storage device. \n\n* Recovers complete systems in minutes, on the same hardware or heterogeneous hardware Restore Anyware technology, and includes support for Windows 7. \n* Restores individual files or folders in seconds with built-in search tool or Google Desktop. \n\n\n* Enables offsite backup to an FTP location or secondary disk drive for better resilience after a disaster \n\nSystem Requirements \nOperating Systems \nWindows operating systems 32-bit or 64-bits: \n\n* Windows Vista Ultimate \n* Windows Vista Business \n* Windows Vista Enterprise \n* Windows XP Professional / Home (SP2 or later) \n* Windows XP Media Center \n* Windows 7 Ultimate \n* Windows 7 Enterprise \n* Windows 7 Professional \n\nProcessor \n233 MHz or higher, as required by operating system \nRAM \nMemory requirements for key components: \n\n* Backup Exec System Recovery Agent: 512 MB \n* User Interface Backup Exec System Recovery and Recovery Point Browser: 512 MB \n* Symantec Recovery Disk: 1 GB minimum (dedicated) \n* LightsOut Restore feature of Backup Exec System Recovery: 1 GB \n\nAvailable space on the hard disk \nWhen installing the entire product: up to 430 MB, depending on the language of the product installed \n\n* Microsoft. NET Framework 2.0: 280 MB of hard disk space required for 32 bits, and 610 MB for 64-bit computers. \n* Recovery points: insufficient space on the hard disk, local hard disk or a network server for storing recovery points. \n* LightsOut Restore feature of Backup Exec System Recovery: 2 GB\n\n\nEspaÃƒÂ±ol:\n-------------\nCategoria: Programas\nIdioma: Multilenguaje incluido EspaÃƒÂ±ol\nVersion: v10.0.0.39952 \nMedicina incluida\n\nSymantec Backup Exec System Recovery 2011 Desktop Edition es una soluciÃƒÂ³n de copia de seguridad y recuperaciÃƒÂ³n simple y rentable para pequeÃƒÂ±as empresas, que ayuda a minimizar el tiempo fuera de servicio y a evitar desastres mediante la recuperaciÃƒÂ³n sencilla, en cuestiÃƒÂ³n de minutos, en lugar de horas o dÃƒÂ­as, de carpetas o archivos de datos individuales o de equipos de escritorio o portÃƒÂ¡tiles completos que ejecuten Windows, incluso en hardware heterogÃƒÂ©neo, entornos virtuales o ubicaciones remotas.\n\n\nFunciones principales\n\n* Realiza copias de seguridad de equipos portÃƒÂ¡tiles y de escritorio automÃƒÂ¡ticamente, sin interrumpir la productividad de los empleados, y las guarda en cualquier dispositivo de almacenamiento en disco.\n\n* Recupera sistemas completos en cuestiÃƒÂ³n de minutos, en el mismo hardware o en hardware heterogÃƒÂ©neo con tecnologÃƒÂ­a Restore Anyware, e incluye compatibilidad con Windows 7.\n* Restaura archivos o carpetas individuales en cuestiÃƒÂ³n de segundos con la herramienta de bÃƒÂºsqueda integrada o con Google Desktop.\n\n\n* Permite realizar copias de seguridad externas en una ubicaciÃƒÂ³n FTP o una unidad de disco secundaria para lograr una mejor capacidad de recuperaciÃƒÂ³n despuÃƒÂ©s de un desastre\n\nRequisitos del sistema\nSistemas operativos\nSistemas operativos Windows de 32 bits o de 64 bits:\n\n* Windows Vista Ultimate\n* Windows Vista Business\n* Windows Vista Enterprise\n* Windows XP Professional/Home (SP2 o posterior)\n* Windows XP Media Center\n* Windows 7 Ultimate\n* Windows 7 Enterprise\n* Windows 7 Professional\n\nProcesador\n233 MHz o superior, segÃƒÂºn lo requiera el sistema operativo\nRAM\nRequisitos de memoria por componente clave:\n\n* Backup Exec System Recovery Agent: 512 MB\n* Interfaz de usuario de Backup Exec System Recovery y Navegador de puntos de recuperaciÃƒÂ³n: 512 MB\n* Symantec Recovery Disk: 1 GB como mÃƒÂ­nimo (dedicado)\n* FunciÃƒÂ³n LightsOut Restore de Backup Exec System Recovery: 1 GB\n\nEspacio disponible en el disco duro\nCuando instale el producto entero: hasta 430 MB, segÃƒÂºn el idioma del producto que instala\n\n* Microsoft .NET Framework 2.0: 280 MB de espacio en el disco duro necesario para equipos de 32 bits, y 610 MB para equipos de 64 bits.\n* Puntos de recuperaciÃƒÂ³n: espacio suficiente en el disco duro, en un disco duro local o en un servidor de red para puntos de recuperaciÃƒÂ³n de almacenamiento.\n* FunciÃƒÂ³n LightsOut Restore de Backup Exec System Recovery: 2 GB\n\n","torrent":{"xt":"urn:btih:d47198032b22f22b45abcd57b10fd0a0d2262e30","amp;dn":"Symantec+System+Recovery+%282011%29+%5BMultilenguaje%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d47198032b22f22b45abcd57b10fd0a0d2262e30","infoHashBuffer":{"type":"Buffer","data":[212,113,152,3,43,34,242,43,69,171,205,87,177,15,208,160,210,38,46,48]},"announce":[],"urlList":[]}}