{"title":"Democracy Now - 03 may 2011","uid":6363991,"size":445446407,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d483e580df5c8bc830c2e97e95ac270fdbbd2a99&amp;dn=Democracy+Now+-+03+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1304440072,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 03, 2011\n\n- Obama Urged To Rethink Pakistan Following Assassination of Bin Laden\n- Turkish Prime Minister Calls For Gaddafi To Step Down\n- Syria Intellectuals, Activists Go Into Hiding As Security Forces Crack Down\n- AFL-CIO Urges Obama Administration To Suspend Pact With Bahrain\n- United Arab Emirates Shuts Down Teachers' Association Board of Directors\n- Ousted Egyptian President Faces Potential Death Penalty\n- Palestinian Factions Sign Deal, Israel Withholds Millions In Funds As Punishment\n- Canada: Conservative Party Wins Parliament Majority, NDP Becomes Opposition Party\n- Japan Parents Deliver Radioactive Playground Dirt To Protest High Radiation Levels\n- Google Offices Raided In South Korea\n- 360 People Missing Following Alabama Tornadoes, Scientists Link Storms to Global Warming\n- Honduras Drops Charges Against Ousted President Zelaya\n- Vermont Protesters Rally To Support Single-Payer Healthcare\n\n\nSpecial reports\n\n- 10 Years Too Long: Rep. Barbara Lee Renews Calls For End to Afghan War After Killing of Osama bin Laden\n\nIn September 2001, Rep. Barbara Lee was the only lawmaker in either chamber of Congress to vote against the 2001 resolution authorizing the use of force in Afghanistan. Today she is a leading advocate for immediate withdrawal of troops and to repeal the authorization that grants a president the authority to use force without a formal declaration of war issued by Congress. &quot;While the head of Al Qaeda is no longer around, we have to really address the root causes of terrorism and understand that we have to refocus our resources and our strategy in a way that begins to get us out of Afghanistan,&quot; Lee says. We also speak to filmmaker Robert Greenwald about his Rethink Afghanistan campaign and journalist Anand Gopal reporting from Kabul, Afghanistan.\n\n\n- The Right and Left Claim Success in Canada: The Conservatives Win Majority in Canada As Left-Leaning NDP Party Makes Historic Gains\n\nThe Conservative party, led by Prime Minister Stephen Harper, was elected to a majority in the Canadian parliament, ending five years of minority government. Harper has vowed to continue pro-corporate policies that have led critics to label his government the most right-wing in recent Canadian history. But the election also saw major gains for the left-leaning National Democratic Party, which won enough seats to become the official opposition party for the first time. We speak to Stephen Lewis, former Canadian diplomat and former leader of the NDP, and the Canadian activist and writer Judy Rebick.\n\n\n- &quot;A Violation of Norms&quot;: U.S. &amp; Allies Kill Gaddafi's Son and Three Grandchildren in Bombing of Compound in Tripoli\n\n&quot;How is hitting a residential compound and killing the children of the leader of Libya protecting civilians? It also undermines international norms. You do not go after the children of leaders and grandchildren of leaders,&quot; says Alan Kuperman, a University of Texas professor and author of &quot;The Limits of Humanitarian Intervention.&quot; &quot;I think this is a violation of norms and counterproductive for the goal of protecting noncombatants.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d483e580df5c8bc830c2e97e95ac270fdbbd2a99","amp;dn":"Democracy+Now+-+03+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d483e580df5c8bc830c2e97e95ac270fdbbd2a99","infoHashBuffer":{"type":"Buffer","data":[212,131,229,128,223,92,139,200,48,194,233,126,149,172,39,15,219,189,42,153]},"announce":[],"urlList":[]}}