{"title":"The Hangover/2009/PAL/RETAIL - RENTAL/Multi Audio+Subs","uid":5191166,"size":4525588480,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d5d617e00217e9f6c306f04c2e60e6dcae7aa68a&amp;dn=The+Hangover%2F2009%2FPAL%2FRETAIL+-+RENTAL%2FMulti+Audio%2BSubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NLUPPER","files":-1,"time":1259695490,"description":"THE HANGOVER 2009\n\nPLOT\n\nAngelenos Doug Billings and Tracy Garner are about to get married. Two days before the wedding, the four men in the wedding party - Doug, Doug's two best buddies Phil Wenneck and Stu Price, and Tracy's brother Alan Garner - hop into Tracy's father's beloved Mercedes convertible for a 24-hour stag party to Las Vegas. Phil, a married high school teacher, has the same maturity level as his students when he's with his pals. Stu, a dentist, is worried about everything, especially what his controlling girlfriend Melissa thinks. Because she disapproves of traditional male bonding rituals, Stu has to lie to her about the stag, he telling her that they are going on a wine tasting tour in the Napa Valley. Regardless, he intends on eventually marrying her, against the advice and wishes of his friends. And Alan seems to be unaware of what are considered the social graces of the western world. The morning after their arrival in Las Vegas, they awaken in their hotel suite each with the worst hangover. None remembers what happened in the past twelve or so hours. The suite is in shambles. And certain things are in the suite that shouldn't be, and certain things that should be in the suite are missing. Probably the most important in the latter category is Doug. As Phil, Stu and Alan try to find Doug using only what little pieces of information they have at hand, they go on a journey of discovery of how certain things got into the suite and what happened to the missing items. However they are on a race for time as if they can't find Doug in the next few hours, they are going to have to explain to Tracy why they are not yet back in Los Angeles. And even worse, they may not find Doug at all before the wedding\n\n\nIMDB............: http://www.imdb.com/title/tt1119646/\n\n\n\nThe Hangover 2009 PAL DVDr-DELERiUM\n\nVerenigde Staten / Duitsland\nKomedie\n99 minuten / 108 minuten (unrated version)\n\ngeregisseerd door Todd Phillips\nmet Bradley Cooper, Ed Helms en Zach Galifianakis\n\nTwee dagen voor zijn huwelijk, gaat Doug met drie vrienden naar Las Vegas, om daar een knallend vrijgezellenfeest te houden. Ze feesten er op los, maar als ze de volgende morgen wakker worden weten ze niks meer van de vorige avond. Om ÃƒÂ©ÃƒÂ©n of andere reden vinden ze een tijger in de douche en zitten ze opgescheept met een zes maanden oude baby. Doug is echter nergens te bekennen. Een race tegen de klok volgt om Doug toch nog op tijd voor het altaar te laten verschijnen.\n\nMM...........: http://www.moviemeter.nl/film/54691\n\n\nTECHNiCAL iNFO:\n\nVideo Type...: PAL\nSource.......: DVD5\nImdb.........: 8.0/10 (81,866 votes)\nGenre........: Comedy\nRuntime......: 108 Min\nRelease date.: 25-11-2009\n\nVideo........: Untouched\nVideo Aspect.: 16x9\nAudio Type...: DD 5.1\nLanguages....: English, German, Spanish\nSubtitles....: English FHI, German, German FHI,\nSpanish, Dutch, Portuguese\n\nMenu Language: English\nMenu.........: Untouched\nExtras.......: Untouched, Partially stripped, Stripped intros\n\nADDiTiONAL NOTES:\n\nEnjoy.\nThe Hangover 2009 PAL DVDr-DELERiUM","torrent":{"xt":"urn:btih:d5d617e00217e9f6c306f04c2e60e6dcae7aa68a","amp;dn":"The+Hangover%2F2009%2FPAL%2FRETAIL+-+RENTAL%2FMulti+Audio%2BSubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5d617e00217e9f6c306f04c2e60e6dcae7aa68a","infoHashBuffer":{"type":"Buffer","data":[213,214,23,224,2,23,233,246,195,6,240,76,46,96,230,220,174,122,166,138]},"announce":[],"urlList":[]}}