{"title":"Steppenwolf The second","uid":5165148,"size":78989146,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d6a19d4be377367212e69acd211c07d29b81dbf6&amp;dn=Steppenwolf+The+second&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gubbij","files":16,"time":1258365787,"description":"The group's second album was virtually a re-creation of its predecessor, only slightly more sophisticated in its range of songs and the manner of playing them, and the in-house writing had improved, though the latter also became highly derivative. Steppenwolf the Second embraces everything from hard rock to psychedelia to blues, and the band is in excellent form, playing very hard and edgy, except on the deliberately lyrical, reflective &quot;Spiritual Fantasy,&quot; a rare acoustic number for the group. Much more to the point of the group was the single &quot;Magic Carpet Ride,&quot; the ultimate psychedelic pop dance number of the decade, and the marijuana anthem &quot;Don't Step on the Grass, Sam,&quot; the pounding &quot;28,&quot; and the album-opener &quot;Faster Than the Speed of Life.&quot; Side two of the original LP was a great achievement in its own right, opening with &quot;Magic Carpet Ride,&quot; which leads into a nonstop extended array of hard-rocking numbers, mostly in a blues idiom: &quot;Disappointment Number (Unknown),&quot; &quot;Lost and Found by Trial and Error,&quot; &quot;Hodge Podge, Strained Through a Leslie,&quot; and &quot;Resurrection.&quot; The playing was as good as the first album, and though there's nothing quite comparable to &quot;Born to Be Wild&quot; here in terms of cultural impact, the level of the surrounding numbers is higher. ~ Bruce Eder, All Music Guide \n\n[img]http://imgkk.com/i/pq0GKB.jpg[/img]","torrent":{"xt":"urn:btih:d6a19d4be377367212e69acd211c07d29b81dbf6","amp;dn":"Steppenwolf+The+second","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6a19d4be377367212e69acd211c07d29b81dbf6","infoHashBuffer":{"type":"Buffer","data":[214,161,157,75,227,119,54,114,18,230,154,205,33,28,7,210,155,129,219,246]},"announce":[],"urlList":[]}}