{"title":"The Mommy X-Perience 4 (2011)","uid":6415973,"size":2203817984,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d8b0dba05db581a998ab6f9025c10074d02a8999&amp;dn=The+Mommy+X-Perience+4+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":3,"time":1306161797,"description":"The Mommy X-Perience 4 (2011)\n &lt;a href=&quot;\nhttp://www.excaliburfilms.com/AdultDVD/830515D4_Mommy_X-Perience_The_4_dvd.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.excaliburfilms.com/AdultDVD/830515D4_Mommy_X-Perience_The_4_dvd.htm&lt;/a&gt;\n\nStudio  Evil Angel \nRelease Date  May 17, 2011 \nCategory  All Sex, Older, MILF / Cougar \nDirector  Joey Silvera \nStarring  Inari Vachs, Aiden Starr, Brooklyn Lee, Jewels Jade, Sophia Lomeli, Tacori Blu, Rocco Reed, Christian, Ramon Nomar, Jerry \n\nJoey Silvera shoots what he likes. The veteran director has always been about setting trends, not following them, so when Joey shoots a MILF movie, you know it's going to embody his own... unusual perspective. The Mommy X-Perience 4 continues ...    Full DescriptionJoey's quirky take on mature attraction, pairing seasoned, sexy bitches in their hormone-crazed sexual prime with young, fit dudes who know how to satisfy an older broad's cravings. (And in one kinky threesome, the generation gap spans two females as MILF Sophia Lomeli and hot, young Brooklyn Lee show stud Rocco Reed the best of both worlds.) Classic porn star Inari Vachs returns to the screen, looking better than ever in business attire with a plunging neckline and sheer pantyhose that perfectly mold her incredible legs and big ass. The all-natural mommy has an intimate, sensual kitchen fuck-and-suck session with Ramon Nomar, riding his fat cock to multiple, squirting climaxes. Busty, tattooed Jewels Jade gets her pussy plowed by muscle boy Christian, and takes a gooey cum load that spills from her mouth onto her giant knockers. Brunette MILF Tacori Blu pulls aside her skimpy bikini to allow Ramon access to her big, round tits, hairy cunt and hungry asshole. Experience is an advantage when we're talking sex-mad females like these! \n\n","torrent":{"xt":"urn:btih:d8b0dba05db581a998ab6f9025c10074d02a8999","amp;dn":"The+Mommy+X-Perience+4+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8b0dba05db581a998ab6f9025c10074d02a8999","infoHashBuffer":{"type":"Buffer","data":[216,176,219,160,93,181,129,169,152,171,111,144,37,193,0,116,208,42,137,153]},"announce":[],"urlList":[]}}