{"title":"The Holy Modal Rounders-3 album","uid":4993690,"size":391495380,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d8feb1681e8dadc2fbfdda75b2df62184434bdb7&amp;dn=The+Holy+Modal+Rounders-3+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SecondOpinion","files":-1,"time":1247170555,"description":"\n      ((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\n\nThe Holy Modal Rounders were an American folk music duo from the Lower East Side of New York City which started in the early 1960s, consisting of Peter Stampfel and Steve Weber. Their unique blend of folk music revival and psychedelia gave them a cult-like following from the late 1960s into the 1970s. For a time the band also featured prolific and famous playwright and actor, Sam Shepard.\nStampfel also formed the short-lived (1975-77) Unholy Modal Rounders with Kirby Pines, Charlie Messing, Jeff Berman and Paul Presti. The Unholy Modal Rounders were part of the collaboration, Have Moicy!, along with Michael Hurley and Jeffrey Frederick and the Clamtones.\nAfter releasing Last Round in 1978, the Holy Modal Rounders broke up once again.\nStampfel and Weber reunited briefly to record Going Nowhere Fast (1980). While working for his wife, Betsy Wollheim, as submissions editor of DAW Books, Stampfel formed the Bottle Caps, releasing Peter Stampfel and the Bottlecaps (1986) and The People's Republic of Rock n' Roll (1989), as well as an album of standards, You Must Remember This (1994). Rather surprisingly, perhaps, he won a Grammy in 1998 for writing part of the liner notes for the CD reissue of the Anthology of American Folk Music. When asked if he had plans for his award, he was quoted in the New York Times as saying &quot;I'm going to put honey on mine and lick it off.&quot;[4] The Holy Modal Rounders continued for 20 years sans Stampfel--as the band relocated to Portland Or. as Stampfel opted to stay In New York. The band toured the country and Scandinavia-yet rooted in Portland. They still were billed as The Holy Modal Rounders, although some fans nicknamed them &quot;The Electric Rounders&quot; since, like many other bands, they had changed their acoustic sound to try and attract larger audiences. Stampfel and Weber reunited again under the Rounders name for 1999's Too Much Fun. Since then, Stampfel has released records with the Du-Tels (No Knowledge of Music Required, 2001) and the Bottle Caps (The Jig Is Up, 2004). A number of Rounders live albums have also surfaced over recent years. Weber, meanwhile, is reportedly working on solo material. He recently released Steve Weber and the Holy Modal Rounders, B.C. Stampfel continues to be highly active musically, playing with a number of aggregations, largely in New York City. Some of the performances from a 2008 tour in the Pacific Northwest are scheduled to be released by Frederick Productions in 2009.\n\n","torrent":{"xt":"urn:btih:d8feb1681e8dadc2fbfdda75b2df62184434bdb7","amp;dn":"The+Holy+Modal+Rounders-3+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8feb1681e8dadc2fbfdda75b2df62184434bdb7","infoHashBuffer":{"type":"Buffer","data":[216,254,177,104,30,141,173,194,251,253,218,117,178,223,98,24,68,52,189,183]},"announce":[],"urlList":[]}}