{"title":"health","uid":4991615,"size":12504169627,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d99634855fbbaa98ec125231b29f5085d7d426b4&amp;dn=health&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TRUhealth","files":37,"time":1247075500,"description":"I made this torrent as a public service rather than for entertainment value. This torrent contains all you need to know to grasp the concept that health is in your hands it is up to you if you get sick or not \n\nI wish to help inform people so they have the choice to make an 'informed choice' over how they decide to live, what they consume and how they think and even how they are treated when they are sick.\n \nI would recommend anyone that is interested in finding the reality of health check out one of Dr Robert O Youngs books the best one is probably The pH Miracle. He will, can, does explain how every therapy that works, works. In my mind there is no question over the accuracy of his theory to health as sickness.\n\nIt is challenging for many to get to grips with but remember the model of health all of the western world works to is still a theory not proven science and when put that way it is easy to see how we have been led down a path of wrong theory where money making is the main concern.\n\nThis is a very big torrent it will take a long time for me to fully seed so it is important that everyone that downloads seeds this. This information should be accessible to all so please make that happen by sharing it and informing others\n\nThis torrent contains.... \n \n\nfood matters\n\nthe future of food\n\ndying to have known\n\nthe beautiful truth - gerson cancer cure\n\ncrazy sexy cancer\n\nG. Edward Griffin - A World Without Cancer\n\nhealing cancer from inside out \n\nSimply Raw - Reversing Diabetes in 30 Days\n\nRaw for Life - The Ultimate Encyclopedia of the Raw Food Lifestyle \n\nSicko\n\nking corn\n\nflow for the love of water\n\nVaccines - The Risks, The Benefits, The Choices\n\nBruce Lipton - As Above So Below, An Introduction To Fractal Evoloution\n\nBruce Lipton - The New Biology - Where Mind and Matter Meet\n\nNature, Nurture, &amp; the Power of Love- Conscious Parenting \n\nDr. Robert Young's lecture in Omaha part  1 to 7 (most important doctor on the list)\n\nHoxsey How Healing Becomes A Crime alt. cancer cure \n\nbob beck video workshsop\n\nThe 11th Hour\n\nSuper Size Me","torrent":{"xt":"urn:btih:d99634855fbbaa98ec125231b29f5085d7d426b4","amp;dn":"health","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d99634855fbbaa98ec125231b29f5085d7d426b4","infoHashBuffer":{"type":"Buffer","data":[217,150,52,133,95,187,170,152,236,18,82,49,178,159,80,133,215,212,38,180]},"announce":[],"urlList":[]}}