{"title":"Kika Superbruja y el libro de los hechizos[DVDrip][AC3 Spanish]","uid":5182683,"size":1468452864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9ddc590f5d4f019ac4cac53e32bbe13f0cca819&amp;dn=Kika+Superbruja+y+el+libro+de+los+hechizos%5BDVDrip%5D%5BAC3+Spanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sahae","files":2,"time":1259322178,"description":"TÃƒÂ­tulo Original: Hexe Lilli, der Drache und das magische Buch\nAÃƒÂ±o: 2009\nPaÃƒÂ­ses: Alemania - Austria - EspaÃƒÂ±a - Italia\nGÃƒÂ©nero: Comedia - FantÃƒÂ¡stico - Familiar\nDuraciÃƒÂ³n: 89 minutos\nCalificaciÃƒÂ³n moral: Todos los pÃƒÂºblicos\nDirector: Stefan Ruzowitzky\nProductor: Corinna Mehner, Michael Coldewey y Martin Husmann\nGuiÃƒÂ³n: Stefan Ruzowitzky, Armin Toerkell y Ralph Martin\nFotografÃƒÂ­a: Peter Von Haller\nMÃƒÂºsica: Klaus Badelt\nMontaje: Britta Nahler\nDiseÃƒÂ±o de producciÃƒÂ³n: Isidor Wimmer\nVestuario: Nicole Fischnaller\nReparto:Alina Freund (Kika), Sami Herzog (Dani), Anja Kling (Madre), Pilar Bardem (Elviruja), Ingo Naujoks (JerÃƒÂ³nimo), Jordi Estadella (Voz de HÃƒÂ©ctor), Yvonne Catterfeld (La rubia), Sven Pippig (Cabeza de SerafÃƒÂ­n), Karl Markovics (Alfred)\n\nSinopsis\n\nÃ‚Â¡La anciana bruja Elviruja (Pilar Bardem) estÃƒÂ¡ llegando al lÃƒÂ­mite de su paciencia! Y es que el malvado hechicero JerÃƒÂ³nimo (Ingo Naujoks) ha vuelto a colarse en su idÃƒÂ­lica casita de bruja para apoderarse de su valioso libro de brujerÃƒÂ­a. Menos mal que el pequeÃƒÂ±o dragÃƒÂ³n volador HÃƒÂ©ctor (voz de Michael Mittermeter), algo rechoncho por culpa de su glotonerÃƒÂ­a, estÃƒÂ¡ ahÃƒÂ­ cuando se le necesita. Elviruja debe ponerse en acciÃƒÂ³n: ha llegado la hora de buscar una sucesora. HÃƒÂ©ctor tambiÃƒÂ©n empieza a buscar una guardiana digna del libro de brujerÃƒÂ­a, y aterriza con el libro (y en medio de un gran estruendo) en la casa de Kika (Alina Freund). Cuando Kika descubre el libro de brujerÃƒÂ­a, comienza el caos... Kika solo consigue hacer hechizos disparatados: primero invoca la presencia de monos en su habitaciÃƒÂ³n y los convierte a todos en cabritos, ademÃƒÂ¡s de inundar de agua su clase. Por eso, HÃƒÂ©ctor se empeÃƒÂ±a en explicar a Kika que con esos lamentables hechizos nunca jamÃƒÂ¡s podrÃƒÂ¡ ser la sucesora de Elviruja. Y mientras Kika intenta convertirse rÃƒÂ¡pidamente en una buena bruja durante su &quot;periodo de prueba&quot;, el hechicero JerÃƒÂ³nimo, deseoso de conquistar el mundo, vuelve a la carga con su no menos maligno perro faldero SerafÃƒÂ­n, dispuesto a apoderarse por fin del libro de brujerÃƒÂ­a y dominar el mundo de una vez por todas...\n\n","torrent":{"xt":"urn:btih:d9ddc590f5d4f019ac4cac53e32bbe13f0cca819","amp;dn":"Kika+Superbruja+y+el+libro+de+los+hechizos%5BDVDrip%5D%5BAC3+Spanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9ddc590f5d4f019ac4cac53e32bbe13f0cca819","infoHashBuffer":{"type":"Buffer","data":[217,221,197,144,245,212,240,25,172,76,172,83,227,43,190,19,240,204,168,25]},"announce":[],"urlList":[]}}