{"title":"Chicago Hope S03E03 - Papa's Got A Brand New Bag.avi","uid":5000389,"size":359519474,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:da92ca3fa092f87a6f6b00bfe337b193b1c6c2a8&amp;dn=Chicago+Hope+S03E03+-+Papa%5C%27s+Got+A+Brand+New+Bag.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"blueboy2419","files":1,"time":1247446356,"description":"Aaron and Jack join forces in operating on a man who sustained multiple fractures in a parachute jumping accident. Jack takes one on the chin when he gives the parachutist's would-be bride some bad news. Diane rejoins the staff as a teaching attending in internal medicine, and quickly draws a demanding and manipulative patient who's making the staff miserable. Diane unsuccessfully seeks some moral support from Dennis and Philip. Kate's grief over her father's death is compounded when she's carjacked on her way home from his funeral and his ashes are not recovered with the car. After Tommy tells her some hard truths about creating her own misery, Kate decides to take responsibility for the choices she's made, and starts by telling Peggy Harrod the truth about her daughter's death. Kate returns home to find the carjacker has returned her father's ashes while burglarizing her home. Philip has it out with Aaron and reaffirms his intention to keep Tommy from closing the hospital. \n\n\n\nMore to follow, please give back as much as you take.","torrent":{"xt":"urn:btih:da92ca3fa092f87a6f6b00bfe337b193b1c6c2a8","amp;dn":"Chicago+Hope+S03E03+-+Papa%5C%27s+Got+A+Brand+New+Bag.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da92ca3fa092f87a6f6b00bfe337b193b1c6c2a8","infoHashBuffer":{"type":"Buffer","data":[218,146,202,63,160,146,248,122,111,107,0,191,227,55,177,147,177,198,194,168]},"announce":[],"urlList":[]}}