{"title":"Gary Unmarried Season 1","uid":5197274,"size":3665406616,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:db0f3e25bd8a8f6225919c89dd83a3043e41cad0&amp;dn=Gary+Unmarried+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"byronb31","files":-1,"time":1259981877,"description":"Gary Unmarried - Season 1\n\nSeason 1 Plots\n\nEpisode 1 - Pilot\nGary must deal with the news that his ex-wife is engaged to another man all while trying to balance single fatherhood and a new relationship of his own.\n\nEpisode 2 - Gary Gets Boundaries\nGary and Allison decide they need to make some new boundaries and distance themselves from each other after he undressing in front of her.\n\nEpisode 3 - Gary Marries off His Ex\nGary pushes Dr. Krandall to set a wedding date with Allison so he will no longer be required to pay her alimony.\n\nEpisode 4 - Gary Gets His Stuff Back\nGary makes a threat to show Allison's racy photographs he received from her on their first anniversary to everyone, when she refuses to give back his pool table he bought for her as a gift.\n\nEpisode 5 - Gary Breaks Up His Ex-wife and Girlfriend\nGary is afraid that Vanessa and Allison's blooming friendship will mean doom for his relationship with Vanessa once Allison sets up a gloomy impression of him. Gary wishes all the former women in his life will make friendships elsewhere.\n\nEpisode 6 - Gary Meets The Gang\nGary and Allison have hit that point where their relationship moves ahead, by meet each others friends. But neither felt like they had made a great impression.\n\nEpisode 7 - Gary and Allison's Restaurant\nGary ends up in Vanessa's doghouse after finally taking her on a real date, but brings her to a restaurant that he used to frequent with Allison.\n\nEpisode 8 - Gary and Allison Brooks\nGary pretends he is still married while attending the vow-renewal of a friend, as a favor to Allison. But the plan backfires when Gary finds himself attracted to one of the guests.\n\nEpisode 9 - Gary Gives Thanks\nBeing it is the first Thanksgiving as a divorced couple, Gary and Allison find themselves competing for dinner guests.\n\nEpisode 10 - Gary Goes First\nGary and Allison try to one-up each other as they try to impress the kids with &quot;first&quot; experiences. Allison takes the kids to their first concert, while Gary decides to teach Tom to shave and buy Louise her first bra.\n\nEpisode 11 - Gary Toughens Up Tom\nGary begins to feel threatened by Tom's relationship with Dr. Krandall, leading him to change the relationship he has with his son.\n\nEpisode 12 - Gary Dates Louise's Teacher\nTo prove that men are not only interested in only beautiful women, Gary dates Louise's favorite, but plain school teacher.\n\nEpisode 13 - Gary Moves Back In\nWhile his home is under repair, Gary moves back in with Allison.\n\nEpisode 14 - Gary and Dennis' Sister\nGary freaks out after learning that Dennis has made plans for his marriage to his younger sister, after they begin dating.\n\nEpisode 15 - Gary's Ex-Brother-In-Law\nGary reluctantly takes financial advice from Allison's brother, after receiving an notice from the IRS about an audit.\n\nEpisode 16 - Gary Uses His Veto\nWhen Gary vetoes Louise from taking Chinese, Allison uses her veto to put a stop to Louise taking golf lessons.\n\nEpisode 17 - Gary Hooks Up Allison\nWhen Allison breaks up with Krandall, she begins showing up at Gary's house, forcing Gary to find her someone new.\n\nEpisode 18 - Gary and the Trophy\nAfter a bowling teammate quits before the championships, Gary rushes to find a replacement.\n\nEpisode 19 - Gary and His Half Brother\nGary's half-brother has returned from the war and needs a place to stay. The full house finds Gary spinning out of control as he finds himself playing parent to both his children and a sibling.\n\nEpisode 20 - Gary Fixes Allison's Garbage Disposal\nGary sets out to repair Allison's garbage disposal but find themselves inside her bedroom fixing their lust for sex.","torrent":{"xt":"urn:btih:db0f3e25bd8a8f6225919c89dd83a3043e41cad0","amp;dn":"Gary+Unmarried+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db0f3e25bd8a8f6225919c89dd83a3043e41cad0","infoHashBuffer":{"type":"Buffer","data":[219,15,62,37,189,138,143,98,37,145,156,137,221,131,163,4,62,65,202,208]},"announce":[],"urlList":[]}}