{"title":"Seven Wishes - Utopia","uid":5175444,"size":64438889,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:db231396af4ad15ee3b35cdd86df0bb05b0e7be3&amp;dn=Seven+Wishes+-+Utopia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1258941397,"description":"Sometime, around 1991, the members of Seven Wishes were all playing in different local bands. After too many years, they finally found each other and decided to start the band they had always dreamed of. A couple of month later the band Love Child was born. They recorded a lot of demos and in late 1993  signed a record deal in Japan. In the following years the music climate was changing as grunge took over the playlists, but Love Child kept going their own way and continued to record demos. In mid 1995 they decided to split with their singer, and carried out auditions with several vocalists but to no avail. (or, some people didn't find it cool enough to play melodic rock during that time). Tony and Anthony continued writing material as usual.   Suddenly they  discovered a great singer named Pelle Andersson and &quot;forced&quot; him to audition. He really was the right guy and he was really anxious to join the band. (Actually, he is, in the band's opinion, the only singer the band ever had). Back on track, they started to write better and better material, and became much more gelled together as a group. This was a kind of &quot;new beginning&quot; and in 1998 the they signed to Z Records and decided to give the band the name, SEVEN WISHES. They released their self titled debut shortly after that and now are back with &quot;Utopia&quot; their second release.","torrent":{"xt":"urn:btih:db231396af4ad15ee3b35cdd86df0bb05b0e7be3","amp;dn":"Seven+Wishes+-+Utopia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db231396af4ad15ee3b35cdd86df0bb05b0e7be3","infoHashBuffer":{"type":"Buffer","data":[219,35,19,150,175,74,209,94,227,179,92,221,134,223,11,176,91,14,123,227]},"announce":[],"urlList":[]}}