{"title":"Muse - Uprising   (2nafish)","uid":5164956,"size":155305988,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:db287992ef8edde0ffb472c4a7e5191d0fae2081&amp;dn=Muse+-+Uprising+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258355727,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Uprising&quot; is a song by alternative rock band Muse, featured on their fifth studio album The Resistance. Written by vocalist and guitarist Matthew Bellamy, the song was released as the lead single from the album on 7 September 2009.\n\nThe music video, directed by Hydra, first aired on MTV2 on 17 September 2009. The band performs through a miniature city in a small truck, with a lit fuse following behind. At times, they are also seen performing inside a trailer which seems to be exploding. Through the window of a TV shop the band at one point looks at TV's with teddy bears on the screens; Matt smashes the window and TV's with his guitar. At the end of the video a group of teddy bears rise up from the ground and start destroying the miniature city, only to fall down at the end of the video.\n\nWhile &quot;United States of Eurasia&quot; was initially thought by the Muse fan community to be the first single due for release, Muse revealed, via their Twitter page, that it would in fact be &quot;Uprising&quot;. It was revealed in July 2009 that the band would perform at the 2009 MTV Video Music Awards. They played at the theatre across the street from where the VMAs were held, and were introduced by Gerard Butler. On July 28, 2009 Zane Lowe played a 32 second sample on BBC Radio 1 ahead of its first play in full on August 3, 2009. After being released to radio in the US, the single reached #1 on the Billboard Hot Alternative Songs chart on September 9, 2009 , becoming Muse's 6th Top 10 single and first #1 on that chart. Additionally, it became their first Billboard Hot 100 single, peaking at #37, achieving this with virtually no pop radio airplay, instead relying on iTunes sales and alternative rock radio airplay. The song peaked at #9 on the UK Singles Chart and is the band's fourth top 10 single on that chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:db287992ef8edde0ffb472c4a7e5191d0fae2081","amp;dn":"Muse+-+Uprising+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db287992ef8edde0ffb472c4a7e5191d0fae2081","infoHashBuffer":{"type":"Buffer","data":[219,40,121,146,239,142,221,224,255,180,114,196,167,229,25,29,15,174,32,129]},"announce":[],"urlList":[]}}