{"title":"Mahler's Aggressive Strength","uid":5104320,"size":2517331236,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:dbcbc00734807b54ca12780f09441b15c4f7033f&amp;dn=Mahler%5C%27s+Aggressive+Strength&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FuTG","files":2,"time":1254246780,"description":"File 1: Mahler's Kettlebell Solution for Fat Loss &amp; Mental Toughness\n\nMahler's Aggressive Strength \n\nBuild muscle and keep fat off... for good! \nAttain pure muscle that will provide a sleek, strong, and hard physique \nLearn the advantages of organic food and why they are necessary for fat loss \nI kid you not, fat loss training is hard. It takes mental toughness to eat right and avoid junk food. Junk food is everywhere and you need to constantly fight off the negativity. It takes mental toughness to put in four to six strength training workouts per week; workout frequency is critical to get the best results. It takes will power and tenacity to finish what you start. In addition to effective training and diet, a program that fails to address the importance of optimizing sex hormones is clearly an incomplete product.\nWhen you build muscle, your body burns more calories to maintain muscle. This means you are burning calories when you are sitting around doing nothing. Cardio is only beneficial while you do it. Once you stop the calorie burning stops as well.\nIn this video, Mahler delves into the importance of losing fat, keeping it off permanently, and staying strong mentally.\n\n\nProgram Title Duration \nKettlebell Fat Loss - First Pillar 21:31 \nMahler's Kettlebell Solution for Fat Loss &amp; Mental Toughness - Second Pillar 13:12 \nMahler's Kettlebell Solution for Fat Loss &amp; Mental Toughness - Third Pillar 14:52 \nMahler's Kettlebell Solution for Fat Loss &amp; Mental Toughness - Fourth Pillar 08:24 \nMahler's Kettlebell Solution for Fat Loss &amp; Mental Toughness - Fifth Pillar 08:11 \nMahler's Kettlebell Solution for Fat Loss &amp; Mental Toughness - Finishers 06:39 \nMahler's Kettlebell Solution for Fat Loss &amp; Mental Toughness - Lifeline 05:51 \nMahler's Kettlebell Solution for Fat Loss &amp; Mental Toughness - Nutrition Lecture 15:49 \nMahler's Kettlebell Solution for Fat Loss &amp; Mental Toughness - Hormones Lecture 49:46 \nMahler's Kettlebell Solution for Fat Loss &amp; Mental Toughness - Final Comments 03:35 \nTotal Time 2:27:50\n \n\nFile 2: Mahler's Kettlebell Solutions for Speed and Explosive Strength\n\nMahler's Aggressive Strength \n\nIncrease your speed and explosiveness to unimaginable levels \nExplore different variations of kettle bell training and find the one that suits you best \nUse this workout to see the results you've been looking for! \nThis video is a super comprehensive kettle bell training session that focuses on building speed and explosive power in four different categories: Full body explosive power, upper body explosive power, lower body explosive power, and rotational explosive power. Translation? You will be one fiery hombre after you practice the exercises revealed in this video. I did not leave out anything. Even if you do not care about getting faster and more explosive, you will love the wide variety of exercises that this kettle bell training video contains.\nImagine having more speed and explosive power. If you are an athlete, increasing speed, strength, and explosive power are critical components of success. Even if you consider yourself to be just a weekend warrior this workout will benefit you tremendously!\nEven if you do not care about getting faster and more explosive, you will love the wide variety of exercises that this video contains. We all know how boring training can get when you do the same exercises over and over again. With this video you can be rest assured that boredom will be the least of your worries for many moons.\nProgram Title Duration \nMahler's Kettlebell Solutions for Speed and Explosive Strength - Intro 03:51 \nMahler's Kettlebell Solutions for Speed and Explosive Strength - Full Body Explosive Power 33:33 \nMahler's Kettlebell Solutions for Speed and Explosive Strength - Upper Body Explosive Power 24:03 \nMahler's Kettlebell Solutions for Speed and Explosive Strength - Lower Body Explosive Power 17:07 \nMahler's Kettlebell Solutions for Speed and Explosive Strength - Rotational Explosive Strength 04:51 \nMahler's Kettlebell Solutions for Speed and Explosive Strength - Final Comments 02:36 \nTotal Time 1:26:01\nLanguage: English, no subtitles available.","torrent":{"xt":"urn:btih:dbcbc00734807b54ca12780f09441b15c4f7033f","amp;dn":"Mahler%5C%27s+Aggressive+Strength","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbcbc00734807b54ca12780f09441b15c4f7033f","infoHashBuffer":{"type":"Buffer","data":[219,203,192,7,52,128,123,84,202,18,120,15,9,68,27,21,196,247,3,63]},"announce":[],"urlList":[]}}