{"title":"Mary, Mary - James Patterson-viny","uid":6416005,"size":770036,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbe6cd8def551fe506b2a3c80e411edc1b4c5e92&amp;dn=Mary%2C+Mary+-+James+Patterson-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"daemonx0x","files":-1,"time":1306162594,"description":"Mary, Mary - James Patterson-viny\n\n&quot;FBI agent Alex Cross is on vacation with his family in Disneyland when he gets a call from the director. A top actress has been shot outside her home in Beverly Hills. Shortly afterward, an editor for the Los Angeles Times receives an e-mail recounting the murder in shocking detail, signed Mary Smith.&quot; &quot;The authorities fear this is only the beginning. More killings follow, and more e-mails arrive immediately after. Mary Smith is targeting Hollywood stars and power brokers, and she is getting better every time.&quot; &quot;Right from the start, this case is like nothing Alex has ever confronted before. Could this be the plan of an obsessed fan or a spumed actor, or is it part of something much more terrifying? And how could a woman be capable of these vicious crimes?&quot; People make enemies easily in Hollywood. To track down a merciless killer, Alex must navigate a world where the stars and players sip San Pellegrino at the Ivy as hopefuls hover around studio gates armed with 8 x 10 glossies. Everyone is desperate for a close-up, but this is one fan Hollywood could do without. Members of the A-list fear they're next on Mary's list, and the case catapults into blockbuster proportions as Cross and the LAPD scramble to find a pattern before Mary can send one more chilling update","torrent":{"xt":"urn:btih:dbe6cd8def551fe506b2a3c80e411edc1b4c5e92","amp;dn":"Mary%2C+Mary+-+James+Patterson-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbe6cd8def551fe506b2a3c80e411edc1b4c5e92","infoHashBuffer":{"type":"Buffer","data":[219,230,205,141,239,85,31,229,6,178,163,200,14,65,30,220,27,76,94,146]},"announce":[],"urlList":[]}}