{"title":"Watchmen (2009) [Chufao]","uid":4988854,"size":4749785399,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:dca67d9b1d073d9abd51be66045029ac991cd02b&amp;dn=Watchmen+%282009%29+%5BChufao%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1246923650,"description":"Watchmen 2009\n\nInfo\n\nSource: DVD9 NTSC R1\nMenus: Untouched\nExtras: Completely removed\nLength: 162 min.\nBitrate: CCE-6 3500 kbps\nVideo Type: NTSC\nAspect Ratio: 16:9\nAudio Format: Dolby Digital 5.1\nLanguages: English\nSubtitles: English and Spanish\n\n\nSynopsis\n\n300's Zack Snyder brings Alan Moore and Dave Gibbons' critically acclaimed comic book Watchmen to the big screen, courtesy of DC Comics and Warner Bros. Pictures. Set in an alternate universe circa 1985, the film's world is a highly unstable one where a nuclear war is imminent between America and Russia. Superheroes have long been made to hang up their tights thanks to the government-sponsored Keene Act, but that all changes with the death of The Comedian (Jeffrey Dean Morgan), a robust ex-hero commando whose mysterious free fall out a window perks the interest of one of the country's last remaining vigilantes, Rorschach (Jackie Earle Haley). His investigation leads him to caution many of his other former costumed colleagues, including Dr. Manhattan, Night Owl (Patrick Wilson), Ozymandias (Matthew Goode), Sally Jupiter (Carla Gugino), and her daughter, The Silk Spectre (Malin Akerman). Heralded for bringing the world of superheroes into the literary world, Watchmen gave the super-powered mythos a real-life grounding that had been missing in mainstream comics to that point. The film adaptation had languished in one form of development hell or another for years after the book's release, with various directors on and off the project, including Terry Gilliam, David Hayter, and Darren Aronofsky, as well as Paul Greengrass, whose eventual dismissal stemmed from budget conflicts with the studio. ~ Jeremy Wheeler, All Movie Guide","torrent":{"xt":"urn:btih:dca67d9b1d073d9abd51be66045029ac991cd02b","amp;dn":"Watchmen+%282009%29+%5BChufao%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dca67d9b1d073d9abd51be66045029ac991cd02b","infoHashBuffer":{"type":"Buffer","data":[220,166,125,155,29,7,61,154,189,81,190,102,4,80,41,172,153,28,208,43]},"announce":[],"urlList":[]}}