{"title":"Taylor Swift - White Horse (Live)   (2nafish)","uid":5177475,"size":140773380,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dd1b5b41885f916c48c97db7d52be1e1b81d87e0&amp;dn=Taylor+Swift+-+White+Horse+%28Live%29+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259054738,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nA live performance by Taylor Swift - White Horse from the show CMT Studio 330 Sessions.\n\n\n&quot;White Horse&quot; is the title of a song written by Liz Rose and co-written and recorded by American country singer Taylor Swift. It is the second official single released from her album Fearless. It is the seventh official single release of her career. This song is featured in the fifth season premiere of Grey's Anatomy, &quot;Dream a Little Dream of Me&quot;. &quot;White Horse&quot; became the first video ever to debut at #1 on CMT's Top Twenty Countdown.\n\nThe song is a mid-tempo ballad teen pop song mostly backed by with piano. Its female narrator tells of being rejected in a relationship. She uses fairy tale image to describe this point, especially in the metaphor of her ex boyfriend being a prince on a white horse, and by saying &quot;I'm not a princess, this ain't a fairy tale&quot; after realizing that the relationship was not what she had expected. &quot;In the song &quot;White Horse&quot;, you put everything you have into love and you get your heart broken,&quot; Swift tells The Boot. &quot;More people have been able to relate to those songs -- the ones that I wrote when I was really going through something terrible.&quot;\n\nAccording to Country Weekly magazine, Swift says she wrote the song within weeks of writing &quot;Love Story&quot;. Swift said the guy from the previous song &quot;reminded [her] a lot of fairy tales and Prince Charming.&quot; After she wrote part of the first verse, she placed a call to her friend, co-writer Liz Rose, to help her write the song. Swift and Rose had finished &quot;White Horse&quot; within 45 minutes.\n\n&quot;White Horse&quot; peaked at #2 on Billboard's Hot Country Songs for the week of April 11, 2009, and peaked at #13 on the Billboard Hot 100, becoming Swift's second Top 20 hit from her sophomore album and 5th Top 20 hit overall. It will be the third official single release for Taylor Swift in New Zealand. the single was certfied platinum by the RIAA for shipments of 1 million copies.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:dd1b5b41885f916c48c97db7d52be1e1b81d87e0","amp;dn":"Taylor+Swift+-+White+Horse+%28Live%29+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd1b5b41885f916c48c97db7d52be1e1b81d87e0","infoHashBuffer":{"type":"Buffer","data":[221,27,91,65,136,95,145,108,72,201,125,183,213,43,225,225,184,29,135,224]},"announce":[],"urlList":[]}}