{"title":"DJ  Melodic Notes - FINALLY RELEASED HIS 2009 PROMO CD ARCHIVES","uid":5014451,"size":773555650,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:dd7f291054c23f1771031ec4a2016ecb5834e7d4&amp;dn=DJ++Melodic+Notes+-+FINALLY+RELEASED+HIS+2009+PROMO+CD+ARCHIVES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DJMNotes","files":7,"time":1248155204,"description":"I am a local D-Jay from Bridgeport, Connecticut. I spin Hip-Hop, R&amp;B, Reggae, Mainstream and the Billboards Top 100. I am capable of providing music for Promotional Events, Parties, Clubs, or even blend simple mix Cds to listen to for whenever you like.  I usually get New Exclusive releases and remixes from the record labels weeks before they are heard on the Radio. Please get with me if i can help you with any of your events. I am looking to become a full resource all-out Event Coordinator, with various acts, and maybe becoming a talent scout or agent some day. This torrent allows you to download my current Promo Mix CD's 23-25 songs of Exclusive, New Jams!!! Enjoy and Remember where you heard it first!!\n\n\n\nDJ M-Notes\n\n\n-\n-\n-\n-\n-\n-\n\n\n\nThis is all of my published Promo CD's in one Torrent, please feel free to use them for your parties and at your own will.\n\nYou can never be heard if you charge everyone to listen. \n\nJust show respect and give props, please don't plagiarize. \n\nmore music at\n\nIn this torrent is \n\n1) Bac In My Day...... (Old School)\n2) Utopia I (URBAN)\n3) Utopia II (URBAN)\n4) Utopia III (URBAN)\n4) Utopia VI (URBAN)\n5) Booty Blends I (Dirty South)\n6) Booty Blends II (Dirty South)\n\n\nWWW(DOT)Myspace(DOT)com(FORWARDSLASH)MelodicNotes has a link to all of my new music - I will soon post a new mixtape every month with 13 exclusives and 13 hot hits!\n\nBe on the look out, I have been D-JAying for almost a decade, and i will post all of my music in MP# Format Uneddited, for those DJAY's who are just starting out. I know its hard to build your collection so little by little i will start you off new djay's - Contribute to the art form of turntablism and PLEASE, PLEASE, COMMENT!","torrent":{"xt":"urn:btih:dd7f291054c23f1771031ec4a2016ecb5834e7d4","amp;dn":"DJ++Melodic+Notes+-+FINALLY+RELEASED+HIS+2009+PROMO+CD+ARCHIVES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd7f291054c23f1771031ec4a2016ecb5834e7d4","infoHashBuffer":{"type":"Buffer","data":[221,127,41,16,84,194,63,23,113,3,30,196,162,1,110,203,88,52,231,212]},"announce":[],"urlList":[]}}