{"title":"We The Kings - Heaven Can Wait","uid":5174249,"size":123897860,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dd878a37d96b92441b55487ccf1293ccb8c35408&amp;dn=We+The+Kings+-+Heaven+Can+Wait&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258868471,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Heaven Can Wait&quot; is a song by American pop-punk band We the Kings from their second studio album, Smile, Kid. It will serve as the album's lead single and was released digitally on September 1, 2009.\n\nThe song has been getting much airplay recently on some hit radio stations such as KRUF. A music video has been recorded for the single, and it's out.\n\nWe the Kings is an American band from Bradenton, Florida. They are currently signed to record label S-Curve Records. They have released one self-titled full-length album in 2007 which peaked at #151 on the Billboard 200. Since then they have completed a variety of tours. The band also sports their own miniature series of webisodes, called The King's Carriage, detailing life on their tour bus. Their second full-length album will be released December 8th 2009.\n\nSmile, Kid is the upcoming second studio album by American pop punk band We the Kings, set to be released through S-Curve Records on December 8, 2009.\n\nThe band's frontman, Travis Clark, announced on his Twitter that they had recorded new songs. The band's second album is currently in the works. The first single was confirmed in a band interview and was released on September 1, 2009. It has been given the title &quot;Heaven Can Wait&quot;. It was made available for purchase on September 1, 2009. Travis Clark also confirmed that the new album would be spawning two more singles, one of them to be named &quot;Rain Falls Down&quot;. During the We The Kings's &quot;Rock In The Park&quot; Concert in the Yigo Amusment Park, Guam on September 26, 2009, they played for the first time, their new song &quot;She Takes Me High&quot;. Front man, Travis Clark, announced the new album's released date in his twitter to be December 8, 2009. It was also announced that Hey Monday frontwoman Cassadee Pope and Demi Lovato would be contributing guest vocals on the album.\n\nThe track listing was announced on November 17, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:dd878a37d96b92441b55487ccf1293ccb8c35408","amp;dn":"We+The+Kings+-+Heaven+Can+Wait","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd878a37d96b92441b55487ccf1293ccb8c35408","infoHashBuffer":{"type":"Buffer","data":[221,135,138,55,217,107,146,68,27,85,72,124,207,18,147,204,184,195,84,8]},"announce":[],"urlList":[]}}