{"title":"Democracy Now - 09 jun 2011","uid":6457695,"size":452172332,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ddc8231ba43e7e6e9335b505d61c692ab2d5c3b4&amp;dn=Democracy+Now+-+09+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1307637057,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 09, 2011\n\n- U.S. Increases Secret Yemen Bombings in Saleh's Absence\n- Clinton Meets With Libya Contact Group in UAE\n- ICC Prosecutor: Gaddafi Sanctioned Rape Against Opponents\n- U.N. Security Council to Debate Syria Censure\n- Senate Panel Questions Afghan Spending\n- Obama Expresses &quot;Sorrow&quot; for Afghan Deaths\n- Al-Qaeda Leader Threatens U.S.\n- Egypt-Gaza Border Reopens\n- U.N. Convenes AIDS Session, Hundreds Protest for Universal Treatment\n- Sudan Rejects New Genocide Allegations From ICC\n- Prosecution of NSA Whistleblower Thomas Drake in Doubt\n\n\nSpecial reports\n\n- Obama Hides Meeting With Top Bahraini Leader-And Mutes Criticism of Ongoing Crackdown\n\nAmidst an intensifying crackdown on anti-government protesters in the tiny Gulf island Kingdom of Bahrain, President Obama met Tuesday with Crown Prince Salman bin Isa al-Khalifa, a visit that was not announced beforehand. We speak with Nabeel Rajab, president of Bahrain's Center for Human Rights, based in Manama. &quot;We do not see anything that makes us optimistic that the government has the willingness to go for a dialogue with the opposition and to listen to the grievances and demands of the people,&quot; says Rajab, noting that soldiers from Saudi Arabia, Jordan and Bahrain continue to arrest protesters and the doctors treating those injured during pro-democracy demonstrations.\n\n\n- Critics Dub Planned Puerto Rico Pipeline the &quot;Death Route&quot; for Alleged Threat to Environment, Public Health\n\nPresident Barack Obama is due to visit Puerto Rico next week in what will be the first official U.S. presidential visit to the territory in 50 years. His trip comes as controversy grows over a proposed 92-mile natural gas pipeline that would cut across much of the island. Puerto Rico Governor Luis FortuÃƒÂ±o has made the $450 million project a central goal of his administration and insists it is a safe and environmentally friendly way to lower utility bills. Called VÃƒÂ­a Verde (Green Way), the pipeline has been dubbed VÃƒÂ­a de la Muerte (Death Route) by critics who say it will expose people living near it to deadly explosions, and cause irreversible damage to the island's environmental and cultural resources. We speak with Dr. Arturo Massol, a biology professor and director of the Scientific and Technical Commission of Casa Pueblo, a community-based organization in Puerto Rico that is leading opposition against the pipeline project. He calls for development of infrastructure that can harness the island's solar and wind power to meet its energy needs.\n\n\n- Annie Jacobsen on New Book, &quot;Area 51: An Uncensored History of America's Top Secret Military Base&quot;\n\nLocated some 80 miles north of Las Vegas, the secret U.S. military base Area 51 in Nevada was established in the 1950s to build and test hi-tech spy and war planes including the U2, the stealth bomber and surveillance drones. Located inside the Nevada Test and Training Range, Area 51 also played a key role in nuclear weapon tests. For decades, the government denied Area 51 even existed, but in recent years many CIA and military documents have been declassified. We speak with Annie Jacobsen, author of the new book, &quot;Area 51: An Uncensored History of America's Top Secret Military Base.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:ddc8231ba43e7e6e9335b505d61c692ab2d5c3b4","amp;dn":"Democracy+Now+-+09+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddc8231ba43e7e6e9335b505d61c692ab2d5c3b4","infoHashBuffer":{"type":"Buffer","data":[221,200,35,27,164,62,126,110,147,53,181,5,214,28,105,42,178,213,195,180]},"announce":[],"urlList":[]}}