{"title":"c't Desinfekt 2011","uid":6416770,"size":2125069518,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ddf60c93418a355eb58fcea4267eaf199e7a2b65&amp;dn=c%5C%27t+Desinfekt+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Poppeye","files":3,"time":1306190977,"description":"Wenn Sie befÃƒÂ¼rchten, dass Ihr PC von Viren befallen ist, kommt Desinfec't zur Rettung. Es startet eine garantiert virenfreie Umgebung, in der Sie Ihr System mit bis zu vier Virenscannern testen und anschlieÃƒÅ¸end reinigen kÃƒÂ¶nnen.\n\nMit dem auf Ubuntu 10.10 basierenden Knoppicillin-Nachfolger Desinfec't von c't lassen sich Rechner in einer garantiert virenfreien Umgebung auf SchÃƒÂ¤dlinge ÃƒÂ¼berprÃƒÂ¼fen. DafÃƒÂ¼r schickt das Tool gleich vier verschiedene Scanner an den Start: die renommierten Scan-Engines von Avira, BitDefender und Kaspersky sowie das Open-Source-Projekt ClamAV.\n\nDie als Live-System bootende Sicherheitssuite startet vollstÃƒÂ¤ndig von CD, weswegen sie immun gegen Viren und Rootkits auf den Laufwerken ist. Desinfec't kommt mit einer grafischen BedienoberflÃƒÂ¤che samt Browser (Firefox), E-Mail-Client, Brennprogramm (Brasero) und einigen anderen Tools, die bei der SchÃƒÂ¤dlingsrecherche im Internet und dem Daten-Backup behilflich sein sollen. FÃƒÂ¼r Kommandozeilen-Fans steht der Befehl dtool bereit, der die Update- und Virenscanner-Funktionen steuern kann.","torrent":{"xt":"urn:btih:ddf60c93418a355eb58fcea4267eaf199e7a2b65","amp;dn":"c%5C%27t+Desinfekt+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddf60c93418a355eb58fcea4267eaf199e7a2b65","infoHashBuffer":{"type":"Buffer","data":[221,246,12,147,65,138,53,94,181,143,206,164,38,126,175,25,158,122,43,101]},"announce":[],"urlList":[]}}