{"title":"Traffic - Miniserie Completa DVDRip Spanish","uid":4993784,"size":2935975923,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:df0f0756b168a288a7b7cbc4f64b38cc14776d41&amp;dn=Traffic+-+Miniserie+Completa+DVDRip+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":6,"time":1247177070,"description":"Traffic es una miniserie basada en la pelÃƒÂ­cula del mismo nombre, ganadora de cuatro Oscar de la Academia de Hollywood en el aÃƒÂ±o 2000, dirigida y producida por Stephen Hopkins (Bajo Sospecha, Los demonios de la noche y Pesadilla en Elm Street V). TambiÃƒÂ©n ha sido escrita y producida por Ron Hutchinson, ganador de un Emmy y guionista de pelÃƒÂ­culas como Contra el Muro o La Isla del Dr. Moreau.\n\nGracias a una magnÃƒÂ­fica labor de producciÃƒÂ³n, Traffic muestra una historia original, utilizando las tÃƒÂ©cnicas innovadoras de la pelÃƒÂ­cula en la que se basa, con personajes ÃƒÂºnicos que habitan en un mundo dominado por el peligro y la intriga. La miniserie retrata el ambiente ilegal e inmensamente lucrativo del trÃƒÂ¡fico en todas sus expresiones: drogas, armas y seres humanos. Hace un seguimiento de las rutas de un negocio que ha existido durante cientos de aÃƒÂ±os, explorando los aspectos mÃƒÂ¡s oscuros, inherentes a esta actividad, donde el ansia de dinero y poder eclipsa por completo el valor del ser humano.\n\nTraffic cuenta tres historias entrelazadas que tienen lugar en Seattle y AfganistÃƒÂ¡n, y muestra el negocio del contrabando de drogas, armas y seres humanos con un crudo realismo y detalle nunca vistos anteriormente en la televisiÃƒÂ³n. De forma convincente y oportuna, la miniserie explora el ambiente post-talibÃƒÂ¡n de AfganistÃƒÂ¡n y bucea en la amenazadora realidad de las armas quÃƒÂ­micas, convirtiÃƒÂ©ndose en un cuento con moraleja sobre los turbulentos momentos actuales.\n\nEspecialmente producida para su consumo en televisiÃƒÂ³n y con un fuerte vÃƒÂ­nculo con la temÃƒÂ¡tica y estÃƒÂ©tica que aborda la pelÃƒÂ­cula original, Traffic es una historia apasionante sobre la cruda realidad de las rutas de la droga y de todo lo que ÃƒÂ©ste trÃƒÂ¡fico conlleva: acciÃƒÂ³n, intriga y suspense estÃƒÂ¡n aseguradas desde el primer minuto. Todo un concentrado de seis horas de producciÃƒÂ³n de mÃƒÂ¡xima calidad para la pequeÃƒÂ±a pantalla.","torrent":{"xt":"urn:btih:df0f0756b168a288a7b7cbc4f64b38cc14776d41","amp;dn":"Traffic+-+Miniserie+Completa+DVDRip+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df0f0756b168a288a7b7cbc4f64b38cc14776d41","infoHashBuffer":{"type":"Buffer","data":[223,15,7,86,177,104,162,136,167,183,203,196,246,75,56,204,20,119,109,65]},"announce":[],"urlList":[]}}