{"title":"The Dirty Dozen Dvdrip H264 Bookerdog.mp4","uid":4988736,"size":1018022639,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:df663ef54ac075843aae02086ea5bf802d9d0c98&amp;dn=The+Dirty+Dozen+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookerdog","files":-1,"time":1246919004,"description":"Category\tWar, Action, Action/Adventure, Thriller, Recommended, Essential Cinema, World War II, Military, AFI Top 100 Thrills\nStarring\tLee Marvin, Ernest Borgnine, Donald Sutherland, Charles Bronson, George Kennedy, Robert Ryan, Jim Brown, John Cassavetes, Trini Lopez\nDirector\tRobert Aldrich\nComposer\tFrank DeVol\nDirector of Photography\tEdward Scaife\nEditor\tMichael Luciano\nProducer\tKenneth Hyman\nScreenwriter\tNunnally Johnson, Lukas Heller\n\nAn all-star cast energizes Robert Aldrich's classic World War II action drama about a group of 12 American military prisoners assembled by tacticians and ordered to perform a suicide mission: infiltrate a well-guarded chÃƒÂ¢teau and kill the Nazi officials vacationing there. The incarcerated soldiers, most of whom are facing death sentences for a variety of violent crimes, jump at the chance to redeem themselves. Major Reisman (Lee Marvin), the noncriminal in charge of the group, whips the men into a crack unit, uses them to best the troops of his by-the-book superior officer, Colonel Breed (Robert Ryan), in war games, then leads the steely antiheroes on their perilous assault. The film is studded with standout performances, including Telly Savalas as a religious psychopath with a febrile animosity toward Germans and John Cassavetes in an Oscar-nominated portrayal as an insubordinate, poison-tongued hothead. Ernest Borgnine, Donald Sutherland, Charles Bronson, and football legend Jim Brown further round out the impressive collection of talent. Aldrich, who by the time of THE DIRTY DOZEN had been fathoming the darker side of life onscreen for more than a decade (KISS ME DEADLY, WHAT EVER HAPPENED TO BABY JANE?), scored a huge hit with this rousing thriller laced with a stinging cynicism perfectly in tune with the increasingly skeptical tenor of the times.","torrent":{"xt":"urn:btih:df663ef54ac075843aae02086ea5bf802d9d0c98","amp;dn":"The+Dirty+Dozen+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df663ef54ac075843aae02086ea5bf802d9d0c98","infoHashBuffer":{"type":"Buffer","data":[223,102,62,245,74,192,117,132,58,174,2,8,110,165,191,128,45,157,12,152]},"announce":[],"urlList":[]}}