{"title":"Miranda Cosgrove - Raining Sunshine","uid":5102738,"size":133859332,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dfe4ac3b5d50d3e4ad3bdefee9648cdf30effcfe&amp;dn=Miranda+Cosgrove+-+Raining+Sunshine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1254118795,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nMiranda Taylor Cosgrove (born May 14, 1993) is an American teen actress and singer. She is best known for her roles as Megan Parker in Drake and Josh, Summer Hathaway in School of Rock and Carly Shay in iCarly.\n\nHer career began at the age of three when she was spotted by an agent while singing and dancing in a restaurant. She was signed up for a number of small roles in commercials.\n\nCosgrove made her music debut in 2007, singing the theme song for iCarly called Leave It All to Me, which features her former Drake and Josh co-star, Drake Bell and written by Drake's fellow band member. On June 10, 2008 the soundtrack to iCarly was released, including Leave It All to Me and three other songs, including the next singles, the cover of Amy Diamond's song Stay My Baby, and About You Now, originally by the Sugababes, and another track called &quot;Headphones On&quot;.\n\nCosgrove's version of &quot;About You Now&quot; reached number forty-seven on the Billboard Hot 100. The single was later featured on the hit compilation album Now That's What I Call Music! 30.\n\nOn December 23, 2008, Cosgrove released a cover of the song Christmas Wrapping as a digital download.\n\nIt has also been revealed that Cosgrove is in the middle of recording her debut solo album, possibly with a collaboration with the band Boys Like Girls. She was helped by famous pop producers the Matrix and Dr. Luke for her debut album. The album will include songs co-written by Cosgrove.\n\nAn extended play entitled &quot;About You Now&quot; was released on February 3, 2009. It included two new tracks, &quot;Party Girl&quot; and &quot;FYI.&quot; It also included the single &quot;About You Now,&quot; as well as remixes of &quot;About You Now&quot; and the previously released &quot;Stay My Baby.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:dfe4ac3b5d50d3e4ad3bdefee9648cdf30effcfe","amp;dn":"Miranda+Cosgrove+-+Raining+Sunshine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfe4ac3b5d50d3e4ad3bdefee9648cdf30effcfe","infoHashBuffer":{"type":"Buffer","data":[223,228,172,59,93,80,211,228,173,59,222,254,233,100,140,223,48,239,252,254]},"announce":[],"urlList":[]}}