{"title":"The.H.P.Lovecraft.Collection.Volume.1.DVDRip.Xvid","uid":5166055,"size":1371686496,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e11d4e8b8a0da76b291ffd49419eede39d2c27cf&amp;dn=The.H.P.Lovecraft.Collection.Volume.1.DVDRip.Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":11,"uploader":"vakul","files":-1,"time":1258409265,"description":"-from IMDB:\n\nBorn in Providence, Lovecraft was a sickly child whose parents died insane. When he was 16, he wrote the astronomy column in the Providence Tribune. Between 1908 and 1923, he wrote short stories for Weird Tales magazine, among others. He died in Providence, in poverty, on March 15, 1937. His most famous novel is considered to be &quot;At the Mountains of Madness,&quot; about an expedition to the South Pole, which discovers strange creatures beneath a mountain.\n\nUniversally considered to be the father of modern horror.\n\nBuried in Swan Point Cemetery.\n\nHis fictitious book, the Necronomicon, is referred to in many of his stories -- allegedly written by &quot;The Mad Arab&quot; in the eighth century and containing horrendous spells, evil workings and Dark Things Best Left Alone. In a bizarre literary reversal, several people have written and published imaginative full-length editions, giving this mythical work a macabre, eldritch life of its own.\n\nOne of his other inventions, the fictitious Miskatonic University, appears prominently in his tales, and its library is often where the evil Necronomicon can be found.\n\nThe statuette for the World Fantasy Award is a bust of Lovecraft, in honor of his writing. The award is informally referred to as a Howard.\n\nResponsible for creating the nucleus of the &quot;Cthulhu Mythos,&quot; a cycle of loosely-related stories that he (and other writers including Robert Bloch, August Derleth, Robert Howard, Clark Ashton Smith, and Brian Lumley) conceived that concerned the &quot;Great Old Ones,&quot; beings from outer space who took up residence on Earth to cause havoc. Ironically, although Lovecraft was an atheist (having renounced his family's Baptist faith at an early age), the mythos' stories have spawned a sort of pseudo-religion among the very hard-core readers of his stories, including the Temple of Set and the Church of Satan.\n\nWrote the short story &quot;Imprisoned With The Pharaohs&quot; as a ghostwriter for Harry Houdini. But on the day he brought it in person, he left the original copy at the train station, but fortunately had a copy saved at home. So somewhere in Providence there was a story titled &quot;Under the Pyramids&quot; by Lovecraft floating around.\n\nWas known to remain awake for prolonged periods of time, often 36 hours straight, without showing the slightest signs of fatigue or irritability. In one case, in order to meet a deadline, he had to stay awake for 60 hours straight in order to complete a story.\n\nIt has been said by one biographer that he was literally &quot;cold blooded&quot; due to a very rare, and still little-understood affliction called poikilothermism, making him feel cold to the touch. However this is probably untrue, and basically disproved by biographer T. S. Joshi, seeing as poikilothermism is not a disease, but a characteristic of certain non-mammals such as reptiles, and is only commonly seen in mammals as a symptom of rabies, which it is highly unlikely Lovecraft suffered from. The belief that he was poikilothermic is a common misconception, however.\n\nInspired modern-day stories of success such as Stephen King (&quot;The Shining&quot;), John Carpenter (&quot;In the Mouth of Madness&quot;), Robert Bloch (&quot;Psycho&quot;), Clive Barker (&quot;Hellraiser&quot;) and Anne Rice (&quot;Interview with the Vampire&quot;).\n\nIs notorious as being the 20th Century's most prolific letter writer scripting somewhere between 40,000 to 100,000 letters within his lifetime.\n\nThe Vision Bleak, a German horror metal band, dedicated the album &quot;Carpathia, A Dramatic Poem&quot; (2005) to Lovecraft. They also made other references, such as a track being called &quot;Kutulu!&quot;.\n\nWas raised by two maiden aunts.\n\nThe house in which Lovecraft was raised was very dirty and poorly lighted, with lots of cobwebs.\n\nBecause he was orphaned young, his aunts indulged him, so Lovecraft's early diet was high on candy and other sweets and lacked proper nutrition. This contributed to his sickly appearance.\n\nHis father's insanity was caused by syphilis.\n\nHis wife, Sonia Haft Shifirkin Greene, was seven years his senior.\n\nPlayed a harmonica-like instrument called a zobo.\n\nSuffered two nervous breakdowns before he was fifteen.\n\nHad an active correspondence with writer Robert E. Howard.\n\nWas close friends with writer Frank Belknap Long, and they were frequent traveling companions.\n\nNever actually finished high school, a fact which bothered him clear up to his death.\n\n\n\nAmong other short movies, it contains:\n\n\n1. A tale of the Re-Animator\n\n2. Cool Air\n\n3. Nyarlathothep\n\n4. The Hapless Antiquarian\n\n5. The Hound\n\n\nPLEASE SEED! I have a poor connection...","torrent":{"xt":"urn:btih:e11d4e8b8a0da76b291ffd49419eede39d2c27cf","amp;dn":"The.H.P.Lovecraft.Collection.Volume.1.DVDRip.Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e11d4e8b8a0da76b291ffd49419eede39d2c27cf","infoHashBuffer":{"type":"Buffer","data":[225,29,78,139,138,13,167,107,41,31,253,73,65,158,237,227,157,44,39,207]},"announce":[],"urlList":[]}}