{"title":"Bloodbath - Bloodbath Over Bloodstock (2011) [DVDR5]","uid":6406580,"size":4718596096,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e1bf9670742a06929ec40014783e720613b9cb3a&amp;dn=Bloodbath+-+Bloodbath+Over+Bloodstock+%282011%29+%5BDVDR5%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":2,"time":1305826876,"description":"Bloodbath - Bloodbath Over Bloodstock (2011) [DVDR5][NTSC]\n &lt;a href=&quot;\nhttp://bloodbath.biz/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bloodbath.biz/&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Bloodbath&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Bloodbath&lt;/a&gt; &lt;a href=&quot;\nhttp://www.burningshed.com/store/peaceville/product/261/2748/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.burningshed.com/store/peaceville/product/261/2748/&lt;/a&gt;\n\nTitle: Bloodbath - Bloodbath Over Bloodstock\nYear: 2011 \nGenre: Death Metal\nLabel: Peaceville\nRuntime: Not long enough\nDVD Release Date: 9 May 2011\n\nDisc1: Disc2:\nSource: 16:9 NTSC DVD9 \nVideo: 4421 @ CCE  \nPasses 6  \nAudio: 2ch \nLanguage: English \n\nPartySan festival in 2008:\n--------------------------------------\n01. Blasting The Virginborn\n02. Bathe In Blood\n03. Weak Aside\n04. So You Die\n05. Cry My Name\n\nBloodbath Over Bloodstock:\n-----------------------------------------\n01. Ways to the Grave\n02. Soul Evisceration\n03. Process of Disillumination\n04. Iesous\n05. Breeding Death\n06. Mouth of Empty Praise\n07. Mass Strangulation\n08. Cancer of the Soul\n09. Mock the Cross\n10. Like Fire\n11. Outnumbering the Day\n12. Eaten\n01. Official Promo video for &quot;Hades Rising&quot;\n\nAfter the barebones The Wacken Carnage release from 2008, it's nice to see Bloodbath getting the DVD treatment they deserve, and even nicer considering their limited catalogue and live history of less than ten shows.\n\nI'll post the tracklisting at the bottom as Amazon hasn't it listed (as of May 2011). What you get for your hard earned or government-donated pounds is a full set from 2009, a selection of songs from 2008 with mercifully NO overlap, an absolutely awful music video and an informative if slightly repetitive interview.\n\nIn the opening moments of the Bloodstock show that serves as this disc's main attraction you'll notice that same scratchy filter effect that made Bloodbath's first DVD slightly irksome to watch. Thankfully, as soon as the band kicks off it vanishes, giving way to a clear and contemporary visual that offers no opportunity for criticism throughout. The show is well shot and superbly edited. Sonically, it's not unfair to say that this set at least matches the studio recordings of these songs. The clarity of the lead work is remarkable, and the toms, snare, bass and cymbals are mixed evenly with no loss in any one sector of the drum track (often a problem with festival-shot DVDs). The guitar tone (borrowed from Entombed) is wonderful and the bass is loud and clear. I was seriously surprised at just how well this sounds, again, because it's a festival recording. The band is tight and album-faithful and the selection of songs is excellent, though there are some repeated from the first DVD at the expense of newer material. Still, each release is well represented.\n\nThe five songs from Party.San in 2008 are also well mixed and though the footage is at first claustrophobically restrictive it soon opens up for a more traditional concert video viewing experience. There's no dropoff in sound quality and the pair of tracks from the Unblessing the Purity EP are particularly welcome.\n\nThe documentary sees the band interviewed (mostly separately) about their influences and how Bloodbath evolved from tributary jam sessions to the infrequently-touring metal behemoth it has become. Like I mentioned earlier, you'll have to put up with a little repetition but it's a worthy addition and rounds out the package nicely, providing you ignore the &quot;Hades Rising&quot; video which, like all modern metal vids is redundant and downright silly.\n\nIf you enjoyed The Wacken Carnage I can guarantee you'll like this as it's better in every way. Fans of early Swedish and American death metal should also check it out, and I imagine Opeth and Katatonia fans will lap it up. Far, far better than I expected and in all honesty could have hoped for.\n\n","torrent":{"xt":"urn:btih:e1bf9670742a06929ec40014783e720613b9cb3a","amp;dn":"Bloodbath+-+Bloodbath+Over+Bloodstock+%282011%29+%5BDVDR5%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1bf9670742a06929ec40014783e720613b9cb3a","infoHashBuffer":{"type":"Buffer","data":[225,191,150,112,116,42,6,146,158,196,0,20,120,62,114,6,19,185,203,58]},"announce":[],"urlList":[]}}