{"title":"CurrPorts 1.75","uid":5103573,"size":60207,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e2bd1c88de49c060b438bf9f6452b67dac55d087&amp;dn=CurrPorts+1.75&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1254184539,"description":"Copied from Nirsoft Homepage:\n\n\nCurrPorts is network monitoring software that displays the list of all currently opened TCP/IP and UDP ports on your local computer.\nFor each port in the list, information about the process that opened the port is also displayed, including the process name, full path of the process, version information of the process (product name, file description, and so on), the time that the process was created, and the user that created it. \nIn addition, CurrPorts allows you to close unwanted TCP connections, kill the process that opened the ports, and save the TCP/UDP ports information to HTML file , XML file, or to tab-delimited text file. \nCurrPorts also automatically mark with pink color suspicious TCP/UDP ports owned by unidentified applications (Applications without version information and icons)\n\n\nSystem Requirements\n\nThis utility works perfectly under Windows NT, Windows 2000, Windows XP, Windows Server 2003, Windows Server 2008, Windows Vista, and Windows 7.\nThere is also a separated download of CurrPorts for x64 versions of Windows.\nIf you want to use this utility on Windows NT, you should install psapi.dll in your system32 directory. \nYou can also use this utility on older versions of Windows (Windows 98/ME), but in these versions of Windows, the process information for each port won't be displayed.\n\n\nLicense\n=======\n\nThis utility is released as freeware. You are allowed to freely distribute this utility via floppy disk, CD-ROM, Internet, or in any other way, as long as you don't charge anything for this. If you distribute this utility, you must include all files in the distribution package, without any modification!\n\n\nChangelog:\n\n\nVersion 1.75: \n\nAdded 'Exclude Selected Processes In Filters' option in the context menu. \n\nAdded accelerator key for 'Include Selected Processes In Filters' option. \n\nFixed bug 'Include Selected Processes In Filters' option: failed to work on system process. \n\nAdded 'Disable All Filters' option to easily toggle between active filter state and no filter state, as an alternative for 'Clear All Filters', which doesn't allow you to return back the filters. \n\n\nVersion 1.70:\n\nAdded /sort command-line option for sorting the connections list saved from command-line. \n\n\nVersion 1.66: \n\nFixed issue: When CurrPorts window is hidden and there is an icon in the taskbar, running CurrPorts again will open the existing instance of CurrPorts, instead of creating another one.\n\n\nED2K Link:\ned2k://|file|cports.zip|60207|BB9E452F38FEB46D9512198699BB0F0F|h=ZXZOC7C5I5H7LXZAHL4V55QV6QSPFDRM|/","torrent":{"xt":"urn:btih:e2bd1c88de49c060b438bf9f6452b67dac55d087","amp;dn":"CurrPorts+1.75","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2bd1c88de49c060b438bf9f6452b67dac55d087","infoHashBuffer":{"type":"Buffer","data":[226,189,28,136,222,73,192,96,180,56,191,159,100,82,182,125,172,85,208,135]},"announce":[],"urlList":[]}}