{"title":"WALLANDER2_01_DE_WRAAK","uid":5155071,"size":4141027328,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e365259e6a594b2114a4fa424b981574e76b42fa&amp;dn=WALLANDER2_01_DE_WRAAK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kaatje.nl","files":-1,"time":1257797394,"description":"Movie:main only\nAudio: Swedish\nSubs:DUTCH\n\n\n1. WRAAK \nKurt Wallander heeft zijn levensdroom gerealiseerd. Hij heeft een huis aan zee gekocht, waar hij lange wandelingen met zijn trouwe labrador Jussi maakt. Kurt heeft zich al heel lang niet meer zo tevreden en evenwichtig gevoeld. Plotseling wordt de rust in het idyllische Ystad verbroken door een krachtige explosie. Ystads enige transformatorstation is in de lucht gevlogen. Vlak daarna worden er ook enkele mensen vermoord. Het leger wordt ingeschakeld en de noodtoestand wordt uitgeroepen in de kleine stad. Het begint op een oorlogsgebied te lijken. Is het sabotage of een terroristische aanslag? De chaos is compleet, en met de media op zijn hielen tast Wallander volledig in het duister voor wat betreft de daders. \n\n\nThe Revenge\n\nKurt Wallander has made the dream of his life come true. He has bought a house by the sea. He takes long walks with his faithful companion, the Labrador Jussi. Kurt feels more content and in harmony with his life than ever. All of a sudden the calm in idyllic Ystad is broken by a powerful explosion which makes the entire town go black. What has been blown up is the only transformer station in Ystad.\n\nThe explosion is followed by several other deeds. Military is called in and a state of emergency is proclaimed. Ystad starts to look like a war zone. But is it sabotage or an act of terrorism? There is chaos and chased by media, Wallander fumbles in the dark, looking for terrorists or perpetrators.\n\n\nGr Kaatje\n","torrent":{"xt":"urn:btih:e365259e6a594b2114a4fa424b981574e76b42fa","amp;dn":"WALLANDER2_01_DE_WRAAK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e365259e6a594b2114a4fa424b981574e76b42fa","infoHashBuffer":{"type":"Buffer","data":[227,101,37,158,106,89,75,33,20,164,250,66,75,152,21,116,231,107,66,250]},"announce":[],"urlList":[]}}