{"title":"Las Ketchup - Asereje (Spanglish Version)  (2nafish)","uid":5184052,"size":107188228,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e3eeb81c1ec37c53df6d996e98972f2b8423db04&amp;dn=Las+Ketchup+-+Asereje+%28Spanglish+Version%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259385976,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Ketchup Song&quot; is the English title of the song &quot;AserejÃƒÂ©&quot;, performed by the Spanish pop group Las Ketchup, which was an international hit in 2002. The song exists in two versions, Spanish and English, with the latter performed in a mixture of English and Spanish, described as &quot;Spanglish&quot;. The chorus is identical in both versions. This song reached #1 in the UK charts, as well as 26 other charts worldwide.\n\nThe song tells the story of a pimp-like &quot;afro-gipsy, rastafari&quot; character named Diego who walks into a crowded nightclub at midnight, and the DJ, as he sees Diego walk in, plays the &quot;twelve-o'clock anthem&quot;, &quot;the song he desires most&quot;, which happens to be the 1979 rap hit &quot;Rapper's Delight&quot; by Sugarhill Gang. Its first verse: &quot;I say the hip hop, the hippie...&quot;, pronounced phonetically in Spanish, the way it would sound to someone who does not understand English, becomes the song's chorus. Although technically meaningless and sometimes referred to as gibberish, the chorus is a more-or-less phonetic pronunciation of the first verse almost in its entirety.\n\nI said a hip hop, the hippie, the hippie\n    AserejÃƒÂ© ja de jÃƒÂ© de jebe\ndo the hip hip hop, a you don't stop\n    tu de jebere sebiunouva\nthe rockin' to the bang bang boogie say up jumped the boogie\n    majabi an de bugui\nto the rhythm of the boogie, the beat\n    an de buididipÃƒÂ­\n\nThe song was performed by a three-girl Spanish group called Las Ketchup, and had a distinctive accompanying dance known as &quot;The Ketchup Dance&quot;. The song is performed in 180 beats per minute and in the key D# minor.\n\nLas Ketchup is a Latin Grammy Award nominated 4-girl group composed of sisters Lola, Pilar, LucÃƒÂ­a, and RocÃƒÂ­o MuÃƒÂ±oz from CÃƒÂ³rdoba in Andalucia, Spain. They are the daughters of Juan MuÃƒÂ±oz, a flamenco guitarist known as El Tomate (The Tomato). Before RocÃƒÂ­o's addition to the group in 2006, the other three girls had success with their worldwide hit &quot;AserejÃƒÂ©&quot;, also known as &quot;The Ketchup Song&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e3eeb81c1ec37c53df6d996e98972f2b8423db04","amp;dn":"Las+Ketchup+-+Asereje+%28Spanglish+Version%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3eeb81c1ec37c53df6d996e98972f2b8423db04","infoHashBuffer":{"type":"Buffer","data":[227,238,184,28,30,195,124,83,223,109,153,110,152,151,47,43,132,35,219,4]},"announce":[],"urlList":[]}}