{"title":"Popper. La Patagonia del Oro [E-BOOK].","uid":6407231,"size":1847010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e571976443fcb98affdf1d5ba2b6d6bd6703670c&amp;dn=Popper.+La+Patagonia+del+Oro+%5BE-BOOK%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zurera","files":-1,"time":1305849600,"description":"En la medianoche del 5 de junio de 1893, avivado por el entusiasmo del alcohol y la victoria, Julio Popper planeaba su inminente expediciÃƒÂ³n al Polo Sur y veÃƒÂ­a su nombre escrito en letras de oro junto a NapoleÃƒÂ³n, Bismarck y Cromwell, cuando lo sorprendiÃƒÂ³ la muerte. Ã‚Â¿Asesinado?, Ã‚Â¿ejecutado? Para descifrar el enigma es preciso desandar su extraordinaria vida, y el papel que personajes como julio Roca, Lucio V. LÃƒÂ³pez, Eduardo Wilde y Julio Belfort jugaron en ella.\n\n\nNacido en el seno de una prestigiosa familia judÃƒÂ­a. de Bucarest, luego de estudiar ingenierÃƒÂ­a en ParÃƒÂ­s, iniciarse en la masonerÃƒÂ­a y alternar con lo mejor de la sociedad francesa, Popper recorre AmÃƒÂ©rica y diseÃƒÂ±a la ciudad de La Habana antes de llegar, a instancias de la Orden de la Rosa del Perfecto Silencio, a la Argentina de la dÃƒÂ©cada del ochenta: un paÃƒÂ­s donde todo es esplendor, progreso y dividendos. A partir de entonces su historia se desarrolla sin respiro entre Buenos Aires y los confines de una Patagonia convulsionada por la fiebre del oro, en la que deberÃƒÂ¡ enfrentarse a los indios, los bandoleros, los fugitivos y los poderosos. En la penÃƒÂ­nsula de El PÃƒÂ¡ramo -un infierno intransitable de piedra y viento-, fundarÃƒÂ¡ un pequeÃƒÂ±o y efÃƒÂ­mero imperio, con ejÃƒÂ©rcito, moneda, estampilla y leyes propias, cuya memoria resiste el paso del tiempo.","torrent":{"xt":"urn:btih:e571976443fcb98affdf1d5ba2b6d6bd6703670c","amp;dn":"Popper.+La+Patagonia+del+Oro+%5BE-BOOK%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e571976443fcb98affdf1d5ba2b6d6bd6703670c","infoHashBuffer":{"type":"Buffer","data":[229,113,151,100,67,252,185,138,255,223,29,91,162,182,214,189,103,3,103,12]},"announce":[],"urlList":[]}}