{"title":"Windows 7 Language Packs in bengali","uid":6397581,"size":2971156,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e593d8d2a91203feaf154fde26c40cc81d7a5e23&amp;dn=Windows+7+Language+Packs+in+bengali&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dell-1525","files":1,"time":1305563173,"description":"When you install a language pack, you can change the interface language of Windows 7 to the language that you select.\n\nLanguage packs also let multiple users who share a computer select distinct display languages. For example, one user can select to see the dialog boxes, menus, and other text in Japanese, whereas another user can select to see the same content in French.\n\nTo change the display language, follow these steps:\n\n   1. Click Start, and then type Change display language in the Start Search box.\n   2. Click Change display language.\n   3. In the drop-down list that appears, select the language that you want, and then click OK. \n\nTo uninstall a language pack, follow these steps:\n\n   1. Click Start, and then type Uninstall display language in the Start Search box.\n   2. Click Install or uninstall display languages.\n   3. Click Uninstall display languages.\n   4. Select the language or the languages that you want to uninstall, and then click Next.\n   5. Follow the rest of the steps to uninstall this language or these languages. \n\nAfter you install the desired language packs, you can hide unwanted language packs in Windows Update. To hide unwanted language packs in Windows Update, follow these steps:\n\n   1. Click the Windows 7 Language Packs category in the Select the updates you want to install page to highlight all the language packs.\n   2. Right-click the highlighted updates, and then select Hide update.","torrent":{"xt":"urn:btih:e593d8d2a91203feaf154fde26c40cc81d7a5e23","amp;dn":"Windows+7+Language+Packs+in+bengali","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e593d8d2a91203feaf154fde26c40cc81d7a5e23","infoHashBuffer":{"type":"Buffer","data":[229,147,216,210,169,18,3,254,175,21,79,222,38,196,12,200,29,122,94,35]},"announce":[],"urlList":[]}}