{"title":"PopuSoft Instant File Find 1.10.2 [ak]","uid":6416089,"size":1359040,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e5aae40be38b9f975ac85356d9c13b5826d279c3&amp;dn=PopuSoft+Instant+File+Find+1.10.2+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306166150,"description":"PopuSoft Instant File Find 1.10.2\n\nInstant File Find is a desktop search tool that lets you find files instantly on your computer. It is designed to speed up your daily work by helping you locate files instantly. With quick buttons, you can list all music or document files ( or other types) on your computer instantly. Quick buttons are customizable, so you can customize your own search toolbar. Instant File Find can sort results by size and date, helping you cleanup hard-drive easier. You can limit results by specify modified date ,size and location.\n\nKey Features:\nSearch\n- Search functions\n\n* Instant Search - Delivers search results instantly while you are typing.\n* Detailed Search\n1. You can specify a location to search in.\n2. You can customize a search by specify size and date range.\n3. For more detailed search, you can use the advanced pane.\n* Search network drives - Finding shared files on your corporate network\n* Search external drives - Supports USB drive and external hardrive\n* Advanced Search - sophisticated search support (such as wildcards)\n* Browing music, video or document files - Quick Buttons enable you browing all your music or video files on your computer instantly.\n* Quick Buttons\n1. You can add a frequent search as a quick button.\n2. It is fully customizable, so you can customize your own search toolbar.\n3. You can customize default buttons, even change its search action.\n* Save search results - Export search results as a file, it is customizable.\n\nHome Page - http://www.popusoft.com/instant-file-find/\n","torrent":{"xt":"urn:btih:e5aae40be38b9f975ac85356d9c13b5826d279c3","amp;dn":"PopuSoft+Instant+File+Find+1.10.2+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5aae40be38b9f975ac85356d9c13b5826d279c3","infoHashBuffer":{"type":"Buffer","data":[229,170,228,11,227,139,159,151,90,200,83,86,217,193,59,88,38,210,121,195]},"announce":[],"urlList":[]}}