{"title":"Wale featuring Lady GaGa - Chillin'","uid":5010418,"size":114057220,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e5ece6c10729b93f2d8c1fb5deb2c5bad75fc5f9&amp;dn=Wale+featuring+Lady+GaGa+-+Chillin%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1247957942,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Chillin&quot; is the first single off Wale's debut album, Attention: Deficit. It features pop star Lady Gaga and was officially released on June 2, 2009 . A remix of the song is present on Wale's Back to the Feature mixtape, under the name &quot;Chillin&quot; (Catch vs 9th).  So far, the single has recieved mixed to positive reviews from critics and has yet to chart on the main Billboard Hot 100. The accompanying music video for the single features both Wale and Gaga in various locations in or near Washington D.C..\n\nThe video was directed by Chris Robinson and was first announced on the 7th May 2009 when a behind-the-scenes preview was posted on KarmaloopTV. The video was directed by Chris Robinson. A thirty second look at the video was later posted on the official MTV Samedi web site. The video took 26 hours to film over two days of filming.\n\nThe full video was posted on Interscope'schannel on the 2nd of June 2009. It features Wale and Gaga on a pier and Wale in various venues and streets in Washington D.C.. This includes one scene in the famous hidden clothing store Bodega in Boston where Wale tries on various clothes. Gaga's trademark Great Danes also appear in the video in Beats by Dr. Dre headphones. Several posters of Barack Obama and a banner which depicts a line from the famous Martin Luther King, Jr. speech I Have a Dream are also featured. The video also features Wale walking through the &quot;I Have a Dream&quot; poster, as is done in N.W.A.'s Express Yourself. \n\nAttention: Deficit is the upcoming debut album from American rapper Wale, scheduled to be released September 22, 2009, one day after Wale's twenty-fifth birthday. The album's first single is Chillin, which features Lady Gaga. Production is set to come from Mark Ronson, Cool &amp; Dre, David Andrew Sitek, Sleepwalkers, and Sean C &amp; LV of The Hitmen among others, with collaborators including Bun B, Jazmine Sullivan, K'Naan, and Marsha Ambrosius. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e5ece6c10729b93f2d8c1fb5deb2c5bad75fc5f9","amp;dn":"Wale+featuring+Lady+GaGa+-+Chillin%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5ece6c10729b93f2d8c1fb5deb2c5bad75fc5f9","infoHashBuffer":{"type":"Buffer","data":[229,236,230,193,7,41,185,63,45,140,31,181,222,178,197,186,215,95,197,249]},"announce":[],"urlList":[]}}