{"title":"Wham! - I'm Your Man   (2nafish)","uid":5195644,"size":144216068,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e6c6afd172fb9f4b08a5a7ead2d51c25095c46b7&amp;dn=Wham%21+-+I%5C%27m+Your+Man+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259912029,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I'm Your Man&quot; is a song by British pop duo Wham!, released on Epic Records in 1985. It was written by George Michael, one half of the duo.\n\nThe song was long-awaited, as Wham! had spent much of 1985 touring and then resting. A groundbreaking appearance in China had been followed by a stint at Live Aid, but there had been no new Wham! material until November and the release of &quot;I'm Your Man&quot;, a straightforward song of seduction through personality.\n\nThe video was similar to that of previous hit &quot;Wake Me Up Before You Go-Go&quot; (which had been a huge success the previous year), in that it was essentially an &quot;as live&quot; performance of the song in front of a crowd of fans, although the occasional appearance of a counter clock revealed George's lyrical thinking with the word SEX appearing instead of SIX. It was also shot in black and white rather than colour.\n\n&quot;I'm Your Man&quot; became Wham!'s third #1 but did not feature on a studio album, and was essentially an isolated single which was only followed up by a re-issue of the previous year's Christmas hit, &quot;Last Christmas&quot;. Already the signs were there that George, now bearded, was ready to move his career into an adult market. The song also reached #3 in the US singles chart.\n\nWithin six months of &quot;I'm Your Man&quot;, Wham! had announced their split. They had a fourth and final number one and released a farewell album, prior to a concert at Wembley Stadium, at which &quot;I'm Your Man&quot; was the last song George performed with partner Andrew Ridgeley, who has since drifted into relative obsecurity while George has achieved further high profile success as a solo artist.\n\nAn extended mix of the song was released on Wham!'s 1986 album Music from the Edge of Heaven (the U.S. version of their final album The Final). Added to the song are tape effects (including several repeating words and phrases), a bass solo at the halfway mark, and a segment based on Andrew Ridgeley's race car driving hobby: an announcer saying, &quot;He's brave! He's tough! Mr. Ridgeley, do your stuff!&quot;, racing cars zooming past, the sounds of a car crashing, maniacal laughing from Ridgeley, and Ridgeley saying &quot;Now where's the bar?&quot; in a high-pitched voice. Furthermore, the 12-inch version features even more new material added, with dialogue between a man and a woman (really Michael and Ridgeley with their voices altered), with the man trying to persuade the woman in a &quot;magic car&quot;, replacing an entire verse in the song.\n\n&quot;I'm Your Man&quot; was subsequently covered by Lisa Moorish in 1995. Shane Richie also covered the song in 2003 as a fundraising song for the BBC charity Children in Need. In addition, George Michael re-recorded the song in a funkier style in 1996; &quot;I'm Your Man '96&quot; appeared on the &quot;Fastlove&quot; CD single.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e6c6afd172fb9f4b08a5a7ead2d51c25095c46b7","amp;dn":"Wham%21+-+I%5C%27m+Your+Man+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6c6afd172fb9f4b08a5a7ead2d51c25095c46b7","infoHashBuffer":{"type":"Buffer","data":[230,198,175,209,114,251,159,75,8,165,167,234,210,213,28,37,9,92,70,183]},"announce":[],"urlList":[]}}