{"title":"SBK 2011 Superbike World Championship [USA][PS3][Spanish][www.co","uid":6364225,"size":2051936000,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e77816a389eed1e18e35bc0bc1b4da5dc6c84945&amp;dn=SBK+2011+Superbike+World+Championship+%5BUSA%5D%5BPS3%5D%5BSpanish%5D%5Bwww.co&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"consolasatope","files":47,"time":1304446974,"description":"A pesar de que en los ÃƒÂºltimos tiempos las nuevas entregas de las series SBK han sido mÃƒÂ¡s que discretas, los chicos de Black Bean pretenden recuperar el pulso de la franquicia con la entrega de este aÃƒÂ±o. Grandes cambios artÃƒÂ­sticos, grÃƒÂ¡ficos y jugables para un videojuego con el que se busca estar a la altura de una competiciÃƒÂ³n que merece un representante sobresaliente.\n\nSuperBike World\nA pesar de que habitualmente no acostumbramos a hablar del apartado grÃƒÂ¡fico como elemento primordial de un videojuego nunca, y por ello lo solemos mencionar al final de un texto, el enorme cambio estÃƒÂ©tico y lavado de cara de este SBK 2011 nos obliga a comenzar reseÃƒÂ±ÃƒÂ¡ndolo.\n\nEquiparar al juego que nos ocupa con tÃƒÂ­tulos de velocidad recientes como los ÃƒÂºltimos representantes de las franquicias Forza Motorsport o Gran Turismo serÃƒÂ­a absurdo puesto que, lÃƒÂ³gicamente, no estÃƒÂ¡ a su altura; sin embargo el videojuego de Milestone hace los deberes para ofertar un tÃƒÂ­tulo de motociclismo potente en lo visual y con enorme atenciÃƒÂ³n volcada sobre el modelado de nuestras balas de dos ruedas. \n\nEl mayor punto de atenciÃƒÂ³n en este sentido es precisamente el de la incorporaciÃƒÂ³n de un motor grÃƒÂ¡fico completamente nuevo, que renderiza unos escenarios y unas motos fantÃƒÂ¡sticas, que cuenta con un nuevo procedimiento de iluminaciÃƒÂ³n mÃƒÂ¡s cuidado, y un motor que permite ademÃƒÂ¡s una tasa de imÃƒÂ¡genes por segundo muy alta y estable, aunque sin llegar a los lÃƒÂ­mites de 60 frames por segundo de otros tÃƒÂ­tulos de velocidad que ya hemos mencionado.\n\nNo obstante este interÃƒÂ©s fundamental en promover un aspecto grÃƒÂ¡fico y artÃƒÂ­stico que haga avanzar al juego, no estÃƒÂ¡ reÃƒÂ±ido con el pulido que estÃƒÂ¡n sufriendo otros aspectos mÃƒÂ¡s puramente jugables como, por ejemplo, el que tiene que ver con el control. La anterior entrega fallÃƒÂ³ a ojos de muchos aficionados precisamente en este aspecto, de modo que ÃƒÂ©ste era uno de los puntos en los que el salto tenÃƒÂ­a que ser serio, puesto que es fundamental en un videojuego en el que la conducciÃƒÂ³n de cualquier tipo tiene importancia. La necesidad de ofertar una experiencia precisa y satisfactoria de cara al usuario es fundamental en este sentido, y el lograr un feedback entre aspectos como la pista y la propia motocicleta con el jugador son fundamentales.\n\n","torrent":{"xt":"urn:btih:e77816a389eed1e18e35bc0bc1b4da5dc6c84945","amp;dn":"SBK+2011+Superbike+World+Championship+%5BUSA%5D%5BPS3%5D%5BSpanish%5D%5Bwww.co","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e77816a389eed1e18e35bc0bc1b4da5dc6c84945","infoHashBuffer":{"type":"Buffer","data":[231,120,22,163,137,238,209,225,142,53,188,11,193,180,218,93,198,200,73,69]},"announce":[],"urlList":[]}}