{"title":"Funny-People.unrated.2009.DVDrip[vice]","uid":5159156,"size":739648997,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e79369b15a072a47d5af980ade264a70087869b8&amp;dn=Funny-People.unrated.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vicerock","files":-1,"time":1258041314,"description":"FUNNY PEOPLE DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 02:32:27\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCast\nLeslie Mann, Adam Sandler and Judd Apatow in Berlin (2009)\n\n* Adam Sandler as George Simmons\n* Seth Rogen as Ira Wright\n* Leslie Mann as Laura\n* Eric Bana as Clarke\n* Jonah Hill as Leo Koenig\n* Jason Schwartzman as Mark Taylor Jackson\n* Aubrey Plaza as Daisy Danby\n* RZA as Chuck\n* Aziz Ansari as Randy Springs\n* Torsten Voges as Dr. Lars\n* Maude Apatow as Mable\n* Iris Apatow as Ingrid\n* Nicole Parker as Dawn\n* George Coe as George's Dad\n* Nicol Paone as Lisa, George's Sister\nPLOT\n\nGeorge Simmons (Adam Sandler) is an extremely successful comedian and actor, having starred in a number of successful lowbrow comedy films. But he is also very self-absorbed, lonely and estranged from his family by choice. When he finds out that he suffers from a rare form of leukemia and his treatment has only an 8 percent chance of success, he falls into a depression, where he finds solace watching old videos of his early stand-up and other work. It is then, he decides to go back to his roots and start performing standup comedy again.\n\nMeanwhile, Ira Wright (Seth Rogen) is an aspiring stand-up comedian who dreams of quitting his day job at a deli. He shares an apartment with roommates Leo Koenig (Jonah Hill), another aspiring comedian who has found more success than Ira, and Mark Taylor Jackson (Jason Schwartzman), an actor who has recently come into wealth and fame as the star of a lame NBC sitcom called Yo Teach! Ira has a crush on Daisy (Aubrey Plaza), a female comedian who lives nearby, but has been unable to act on it, and Mark gives him an ultimatum to act on it or else he will sleep with her.\n\nGeorge and Ira meet at a comedy club, where George unexpectedly takes the stage to deliver a dark, depressing routine which Ira has to follow. Ira draws some laughs by mocking George's morbidity while George watches from the back. The next morning, George calls Ira and invites him and Leo to write some jokes for George to perform at a MySpace corporate event. Ira eagerly agrees, but claims that Leo is too busy.\n\nThe event goes over well, and George hires Ira as a joke writer and personal assistant. The next morning, George informs Ira of his health condition. Ira supports and cares for George as the illness and treatment take their toll on his health; meanwhile, both comedians work on their acts. Eventually, Ira breaks down while with George at a restaurant, begging George to tell more people about his prognosis so Ira doesn't have to carry the whole burden.\n\nGeorge is reluctant but agrees, talking about his disease with his comedian friends and making amends with his estranged family. He also receives a visit from his ex-fiancÃƒÂ© Laura (Leslie Mann), now married with two daughters. Laura says that her husband Clarke (Eric Bana) is always away to China on business and that he cheats on her, the same way that George did, and she regrets breaking up with George. They tearfully reconcile.\n\nGeorge comes to Thanksgiving at Ira's apartment, along with Ira's roommates and the cast of Yo Teach! Leo finds out that George had asked him, as well as Ira, to write jokes for him, and is angry at Ira for not telling him. Ira is angry at Daisy for sleeping with Mark before the two were set to go on their first date at a Wilco concert, and Ira calls off their date. Leo later accepts a role on Yo Teach!\n\nGeorge goes to the doctor for the results of his test and he learns that the medicine has been working and that there aren't any traces of the disease in his blood, but there is a possibility that it could resurface. Ira is happy with the news, while George is unsure of what to do with his life. He ultimately decides that he wants a long-term relationship. He calls Laura, but is unable to tell her about his health. She invites him to visit her in Marin County.\n\nGeorge and Ira go to San Francisco to perform at the Orpheum, and Laura meets them there. George tells Ira to tell Laura that he's better during the intermission between Ira's act and George's act. Ira is puzzled as to why George didn't tell her already, but ultimately agrees to tell her himself. He does so, leaving Laura speechless. Later she confronts George, who tells her that he didn't tell her sooner because he didn't want to jinx it. He and Laura embrace and she invites the two to her house.\n\nGeorge and Ira arrive and spend time with her and her daughters. George and Laura go out to get groceries while Ira watches the kids. George and Laura actually sneak into the guest house to have sex, then Laura talks about possibly leaving Clarke. Ira learns from her two daughters that Laura is still in love with George and Ira tells them that George is better. George and Laura go back into the main house and tell Ira they will just order pizza. Ira, however, easily finds out that they had sex and becomes worried.\n\nWhile they are waiting for the pizza to arrive, Clarke unexpectedly arrives home, leading to an awkward first encounter between George and Clarke and an awkward dinner. Laura asks George and Ira to keep up the faÃƒÂ§ade of George still being sick as Clarke had despised George before learning of his illness and sympathized with him after learning of it and Clarke will suspect something if he learns George is better. George and Ira spend the night in the guest house and watch a game of Aussie Rules Football with Clarke, who is obsessed with it.\nhttp://www.imdb.com/title/tt1201167/\n\nPLEASE SEED AND ENJOY THANKS\n\n\nNOTE\n     Inglourious Basterds PPv next thanks re-ecoded to 700mb\n                                         \n\n","torrent":{"xt":"urn:btih:e79369b15a072a47d5af980ade264a70087869b8","amp;dn":"Funny-People.unrated.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e79369b15a072a47d5af980ade264a70087869b8","infoHashBuffer":{"type":"Buffer","data":[231,147,105,177,90,7,42,71,213,175,152,10,222,38,74,112,8,120,105,184]},"announce":[],"urlList":[]}}