{"title":"Elton John - Electricity","uid":5165249,"size":128688132,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e7bd1142184c4560ba34d09dc958de7a711ce3f7&amp;dn=Elton+John+-+Electricity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258372415,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Electricity&quot; is a song composed by Elton John and Lee Hall for the hugely successful Billy Elliot the Musical. It was John's 63rd UK Top 40 hit, peaking at #4 on the UK Singles Chart. The song was included as a bonus track on the UK re-issue of Elton's album Peachtree Road.\n\nPeachtree Road is the twenty-eighth studio album by British singer/songwriter Elton John, released in 2004. It was named after Peachtree Road, the northern part of Peachtree Street in Atlanta, where one of the singer's four homes is located. This is the only album during his long career Elton produced all by himself.\n\nThe album art on the front cover is a photograph from a railroad crossing near the Atlanta suburb of Douglasville, taken by London photographer Sam Taylor-Wood. Taken in by the American South and given complete artistic freedom, she shot thousands of photos during her week-long trip. The trip included other towns like Unadilla and Forsyth in Georgia. While she also visited Peachtree Road in the Buckhead area of Atlanta, she thought it was too busy for the album's more mellow nature. She picked several photos to present to him, and John made the final selection. Other photos from the shoot appear on the back of the album cover and in the included CD and SACD booklet.The album sold 4,000,000 copies.\n\nSongs from the album debuted at The Tabernacle in Atlanta in early November. John also performed at the November 2004 Country Music Association Awards, televised live from Madison Square Garden, duetting with Dolly Parton on &quot;Turn the Light Out When You Leave&quot;.\n\nDespite its generally positive reviews, Peachtree Road was one of John's leanest-selling contemporary efforts, reaching #17 US upon its release, yet only managing #21 in the UK, making it one his rare albums to miss the Top 10 in his homeland.\n\nThe album was re-released in 2005 with three bonus tracks from Elton John's Billy Elliot the Musical, as well as a DVD featuring nine tracks from the album performed live in Atlanta.\n\nThe song &quot;Electricity&quot; from the musical was also released as a single in June 2005. It rose to #4 in the U.K.\n\nIt was dedicated to the memory of Gus and Sheila Dudgeon.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e7bd1142184c4560ba34d09dc958de7a711ce3f7","amp;dn":"Elton+John+-+Electricity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7bd1142184c4560ba34d09dc958de7a711ce3f7","infoHashBuffer":{"type":"Buffer","data":[231,189,17,66,24,76,69,96,186,52,208,157,201,88,222,122,113,28,227,247]},"announce":[],"urlList":[]}}