{"title":"DIRT Origin of the Species (v1.2) (Latest Version)","uid":6398101,"size":2685927448,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e93dca0eb081a11f6eac3231449d1c2b9439f729&amp;dn=DIRT+Origin+of+the+Species+%28v1.2%29+%28Latest+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FuCtUpPuNk","files":8,"time":1305580312,"description":"INSTALLATION:\nExtract using 7-zip (recommended) or winrar. (www.7-zip.org, it's free full version)\nMount or Burn\nInstall Game\nInstall Patch\nCopy Crack to Installation Directory\n------------\n------------\n------------\n\nFEATURES:\n    Hardcore action meets RPG in this fast-paced 3rd-person adventure\n\n    Present-day conspiracy with military and Sci-Fi enemies; real-world locations\n\n    Rewarding character enhancement system; almost 20 traditional weapons\n\n    Fast, flexible movement system; 10+ special offensive and defensive moves\n\n    Compelling risk vs. reward stakes earn extra information and abilities\n------------------\n------------------\n------------------\n\nAn innocent camping trip into the Nevada desert takes a deadly turn when military black operations test a new viral weapon codename Project G.I.Ants, designed to create battle field infantry by mutating commonly found insects and parasites. When this test run goes horribly wrong the lives of eight friends and a desert community is altered irrevocably.\n\nWaking up in a jail appearing to be in New York the player, an urban girl in her late teens, must remember what happened and set off to find her friends and save them from the madness. There is of course a couple of problems....\n\nThe presence of the virus &quot;Triton-76&quot; used by &quot;Project G.I.Ants&quot; in the surrounding air starts to trigger powerful and frightening mutations in the player and a standard order for the elimination of any witness.\n\nFeatures:\n\n    Hardcore action meets RPG featuring Nu Generation's RPG Lite technology to produce an unobtrusive, straight forward, and ultimately rewarding character enhancement system.\n    RPG Lite &quot;Play as you want&quot; system applies Style Points to the action genre by allowing players to choose the way they want to play each level of the game.\n    Over 10 special offensive and defensive moves to choose. Use these on their own or combine them with traditional blasting to produce wild new emergent game play styles and innovative new combos.\n    Traditional blasting fans will not be disappointed either, with close to 20 traditional weapons from 9mms to S.M.G to R.P.G to Rail Gun, Pheromone gun, and Graviton beam.\n    Fast and flexible movement system tailored for combat game play. The game features compact and dynamic dodge moves as well as traditional jump and double jump.\n    Interact and save the NPCs in the game world with compelling risk vs. reward stakes to earn extra information and abilities.\n    Rigid body dynamics, rag doll, and vehicles are all accounted for in the realistic physics engine that drives the Origin of the Species game world.\n    Introducing a new and exciting main character, Dirt, the urban rock chick, g-string wearing girl, and Mr. Boo, her emotive bear backpack that conveys information about the surrounding game world.\n    Fight a vast array of mutated abominations, as well as Black Op Marines and their arsenal of weapons. \n\nProduct Description\n3rd person action adventure -combines real world locations; present day conspiracy with both military and Sci-Fi enemies to produce a vibrant fast paced game world.For the last four years Nu-Generation Games and thousands of people across the United States and the planet have continued to observe the deliberate application of toxic particles into our atmosphere in order to implement the insidious very highly classified black budget program which has become known as &quot;Project G.I.Ants.&quot;System Requirements: 1 GHz Pentium 3/Athlon or 1.2 GHz Duron or Celeron Processor 64 MB DirectX 9 compatible Graphics card with hardware transform and lighting 32-bit only 256 MB RAM 1.5 Gig Hard Disk space Keyboard and Mouse DirectX 9.0 Windows XP2000/98/MEFormat: WIN 98ME2000XP Genre: ENTERTAINMENT UPC: 183861000119\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:e93dca0eb081a11f6eac3231449d1c2b9439f729","amp;dn":"DIRT+Origin+of+the+Species+%28v1.2%29+%28Latest+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e93dca0eb081a11f6eac3231449d1c2b9439f729","infoHashBuffer":{"type":"Buffer","data":[233,61,202,14,176,129,161,31,110,172,50,49,68,157,28,43,148,57,247,41]},"announce":[],"urlList":[]}}