{"title":"PopChar v 5.2 with [K]","uid":6448818,"size":5514783,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e9d02f542643185ff2868b00836c5bbc527bee92&amp;dn=PopChar+v+5.2+with+%5BK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":2,"time":1307353870,"description":"Official Web Site: &lt;a href=&quot; http://www.ergonis.com/products/popchar/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.ergonis.com/products/popchar/&lt;/a&gt;\n\nPopChar - Easily type umlauts and foreign characters - no need to learn the keyboard combinations\n\nTired of searching and remembering keyboard combinations for umlauts and other special characters? Want to get the most out of your fonts? Then PopChar is the right tool for you.\n\nPopChar makes &quot;typing&quot; of unusual characters easy without having to remember keyboard combos.\n\nWhenever you need a special character, PopChar is there to help. Click the little &quot;P&quot; box to display a table of characters. Select the desired character and it instantly appears in your document.\n\nPopChar X supports Unicode fonts with thousands of characters available in many fonts. If a font contains Unicode characters, just switch PopChar to Unicode to see all of the characters, neatly arranged in the standard Unicode categories.\nWeb designers will especially enjoy the ability to insert HTML symbols.\nWords cannot describe the huge benefits PopChar X offers to you.\n\nMain features\n\n* Inserts special characters right into your document - no font cheat sheet, \n  no copy &amp; paste, no need to remember keyboard combinations.\n\n* Simple to use: Just click the desired character to insert it.\n\n* Search for characters by name as quickly as you type. E.g., show all\n  variations of the letter &quot;E&quot;, all &quot;numbers&quot;, all &quot;arrows&quot;, etc.\n\n* Recent characters view for instant access to your frequently used characters\n\n* Flexible user interface to satisfy the individual needs of different users\n\n* Displays the keystrokes needed to create selected characters\n\n* Automatically detects the current font in many popular applications\n  (including Word, Excel, Illustrator, QuarkXPress, InDesign, FileMaker\n   and BBEdit).\n\n* Optimized font menu that contains only the most recently used fonts,\n  giving quick access to the required font, even with hundreds of fonts\n  installed\n\n* Full Unicode support with different comfortable views and pop-up\n  menu for quick navigation among groups of characters\n\n* Various insertion modes: Insert characters as plain or formatted text\n\n* Inserts HTML symbols\n\n* Automatically starts at login\n\n\nSystem Requirements:\n\nMac OS X.4 up to X.7 DP3 (tested)\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:e9d02f542643185ff2868b00836c5bbc527bee92","amp;dn":"PopChar+v+5.2+with+%5BK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9d02f542643185ff2868b00836c5bbc527bee92","infoHashBuffer":{"type":"Buffer","data":[233,208,47,84,38,67,24,95,242,134,139,0,131,108,91,188,82,123,238,146]},"announce":[],"urlList":[]}}