{"title":"Klaus Kinski - And God Said to Cain (1970)","uid":6425763,"size":4596795392,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:eb1321d545d972835d7951ce1b392f17e838aeed&amp;dn=Klaus+Kinski+-+And+God+Said+to+Cain+%281970%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"oddeven","files":-1,"time":1306461653,"description":"This is a Franco Cleef fan-edit.  To the best of my knowledge it is made up of the German DVD image and a VHS soundtrack.  Although I am far from thoroughly convinced, it appears that some of the actors were speaking English, as the dubbing is at times a near match.  Unfortunately it is clear that it is not Kinski's voice.\n\nThe story goes that Kinski (Gary Hamilton) has been given a presidential pardon after doing ten years of time for a crime he didn't commit. A conveniently scheduled tornado is heading to the town of his misfortune, and he brings a whirlwind of revenge and destruction upon those that done done him wrong.  Does he get out a can of whoop-ass or what...oh yes he does!  A majority of the film, say the entire second half, is taken up with a series of inventive pest removal, sometimes turning said vermin on themselves.\n\nA bunch of Italians with English names make up much of the staff.  The box refers to the director as Anthony Dawson (Antonio Margheriti), and actors Peter Martell and Lee Burton.  There are others: Alan Collins and Michael Coby (probably more). I wonder what Kinski would have been called, were his name not big enough to keep as is. I'll keep my introspection to myself.\n\nThe picture is quite good, in a 16:9 format, and the dubbing is above average for a Spaghetti Western. Even some Mexican accents for authenticity's sake. I'm pretty sure the Italian version was dubbed as well, so I'm not convinced it is of great advantage to seek out the original (which is easier to find, btw).\n\nUncompressed NTSC DVD5 VIDEO_TS files","torrent":{"xt":"urn:btih:eb1321d545d972835d7951ce1b392f17e838aeed","amp;dn":"Klaus+Kinski+-+And+God+Said+to+Cain+%281970%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb1321d545d972835d7951ce1b392f17e838aeed","infoHashBuffer":{"type":"Buffer","data":[235,19,33,213,69,217,114,131,93,121,81,206,27,57,47,23,232,56,174,237]},"announce":[],"urlList":[]}}