{"title":"Taylor Swift - Tim McGraw  (Live)","uid":5106081,"size":137179140,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:eb2cc0b29ec119365da915e917efbb9c5e010f40&amp;dn=Taylor+Swift+-+Tim+McGraw++%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1254371073,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nA live in-studio performance by Taylor Swift - Tim McGraw from the show Unplugged at Studio 330.\n\n\n&quot;Tim McGraw&quot; is the debut single of American country pop artist Taylor Swift. She was sixteen years old when she debuted with the song, which she co-wrote with Liz Rose. The song tells of Taylor's remembrance of a summer love, and how an un-named song by country music artist Tim McGraw (identified later on as &quot;Can't Tell Me Nothin'&quot; from his Live Like You Were Dying album) brings back memories of that love.\n\nSwift has said she wrote the song during math class in high school. The song, she says, is about her and her boyfriend, when he was moving away to go to college, and they would eventually have to break up. Taylor goes on to say, &quot;I started thinking of all the things that reminded me of him.&quot; The music video has been viewed more than 25 million times on\n\nThe song debuted at #60 on the U.S. Billboard Hot Country Songs chart, and spent 26 weeks before reaching a peak of #6. The song also peaked at #40 on the Hot 100 chart, the first of thirteenth consecutive top forty hits as well as the first of her twenty charted hits in the last three years.\n\nThe idea for the song came to Taylor during math class. &quot;The song means so much to me and that's why we wanted it to be the first track on the album,&quot; Swift said. The song, which appears to be centered on a summer romance is actually about her boyfriend who moved away. Sitting in her math class she just started to sing to herself &quot;When you think Tim McGraw&quot; over and over. Soon after she left the classroom and recorded a voice memo about the song. After school she went downtown with her co-writer Liz Rose, sat down at the piano and they had finished the song within 15 minutes.\n\nThe lyrics tell the story of a summer romance that ends with the summer as most summer romances do. The couple in the song appear to have listened to a song by country singer Tim McGraw a lot over the summer. In the verses Swift describes what it was like to lose him and how she wishes things could go back to the way they were. In the Chorus she lists the things that she hopes he will remember when he next hears this song by Tim McGraw. At the end of the song the first few stanzas are repeated.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:eb2cc0b29ec119365da915e917efbb9c5e010f40","amp;dn":"Taylor+Swift+-+Tim+McGraw++%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb2cc0b29ec119365da915e917efbb9c5e010f40","infoHashBuffer":{"type":"Buffer","data":[235,44,192,178,158,193,25,54,93,169,21,233,23,239,187,156,94,1,15,64]},"announce":[],"urlList":[]}}