{"title":"Naruto Uncut BoxSet13 Disk3","uid":5002805,"size":7699631617,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ebc0977d5b3981bbc8e8db52669d0bb8262538cb&amp;dn=Naruto+Uncut+BoxSet13+Disk3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mike80219","files":15,"time":1247594026,"description":"Anime : Comedy : DVD quality : English\nFormat: Animated, Box set, Color, Dubbed, DVD, Subtitled, NTSC \n\nSubtitles: English \n\nAspect Ratio: 1.33:1 \nNumber of discs: 3 \nRating: Unrated \nStudio: Viz Video \nDVD Release Date: April 7, 2009 \nRun Time: 350 minutes \n\nThis set has the final episodes of Naruto and team Gai's mission in the Land Of Birds supposedly to take care of the angry spirit of the previous feudal lord who died, but they soon find out what really happened and what the true agenda of their client really is. After that you'll have another humorous episode of Naruto trying to help his friends from the Ramen restaurant after the owners daughter is kidnapped by rogue ninja trying to perfect their own ninja art of the perfect ninja food. Than you see the start of Naruto's mission with a mixed team of Shino, Ino and the ninja Jonin Anko as they try and solve the mystery of attacks on ships near a land that also holds a mysterious past with Anko during her apprenticeship with Orichimaru before his defection from the Leaf Village. Many fans are waiting for the release of the Naruto Shippuden episodes to come out and that's fine with me, but these filler episodes are great as well as they give you more story lines and show time of the rest of the Naruto cast. While there won't be to many episodes with the Jonin Sensei's of the Konoha 12(The teams added up though it should be called 11 since Sasuke's betrayal) the episodes are still action packed with comedic quirks in them as well. So while we're waiting for the coming of the Naruto Shippuden saga don't pass these great box sets over just yet as you'll probably find more enjoyment in watching these episodes more than you think... ","torrent":{"xt":"urn:btih:ebc0977d5b3981bbc8e8db52669d0bb8262538cb","amp;dn":"Naruto+Uncut+BoxSet13+Disk3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebc0977d5b3981bbc8e8db52669d0bb8262538cb","infoHashBuffer":{"type":"Buffer","data":[235,192,151,125,91,57,129,187,200,232,219,82,102,157,11,184,38,37,56,203]},"announce":[],"urlList":[]}}