{"title":"ColdmaN5 - 3 Faces of July (2009)","uid":4986515,"size":72886411,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ec46d1dad4ecc499f680d6dc045e04a0ec2bb8ae&amp;dn=ColdmaN5+-+3+Faces+of+July+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ColdmaN5","files":12,"time":1246736575,"description":"Think The Residents without the conceptualized brilliance, Wesley Willis without the heart, and Mr. Bungle without the talent, and you've come dangerously close to describing ColdmaN5, a duo that aptly describe themselves as &quot;The Worst Band in the World.&quot;\n\nBlending good music (all courtesy of pre-made and readily available music loops) with horribly off-key vocals and inane (not to mention often nonsensical) lyrics, the duo, comprised of members known only as Earthworm in Cowboy Hat and CheeseCoat McTafferson, have nevertheless churned out fifteen &quot;studio&quot; albums in their four-year career.\n\nIn 2008, the duo released &quot;Hard Granite: The Extra Perrestrial,&quot; a non-award winning collection of tracks. Following this, the band would go on their typical brief hiatus, during which time they pursue projects actually worth pursuing. However, a short while later, Earthworm in Cowboy Hat re-entered the studio, cutting several new tracks that would eventually become &quot;3 Faces of July&quot;, while CheeseCoat McTafferson was away tending to geese somewhere near the Adirondacks.\n\nSo in the end, &quot;3 Faces&quot; isn't so much a ColdmaN5 album as it is an Earthworm in Cowboy Hat solo project. And this release, along with the forthcoming &quot;The Induction of Levi's Dining Doves&quot;, sees the band heading toward a more-accessible sound. As in, a more accessible sound &quot;for this band&quot;. But the band's trademark style and unpredictability is still featured here in full force, making it required listening to all those that dub themselves &quot;ColdFans&quot;.\n\n&quot;3 Faces of July&quot; Track Listing:\n1.) B.Y.O.Bob (9:04)\n2.) Have a Flapjack, Walter Kronkite (2:01)\n3.) A Typical UPS Afternoon (2:48)\n4.) Penis Boobie Fart Poop (3:02)\n5.) 1 2 3 Ur Dead (2:19)\n6.) There's a Li'l Irish Guy in my Soup (2:25)\n7.) Swamp Fire Tales (2:27)\n8.) Ass Buffington (2:31)\n9.) Louie Anderson and Me (5:20)\n10.) We Broke Up on(3:26)\n11.) There's My Bobber! (2:30)\n\nLyrics and more:\nhttp://www.reverbnation.com/ColdmaN5\n","torrent":{"xt":"urn:btih:ec46d1dad4ecc499f680d6dc045e04a0ec2bb8ae","amp;dn":"ColdmaN5+-+3+Faces+of+July+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec46d1dad4ecc499f680d6dc045e04a0ec2bb8ae","infoHashBuffer":{"type":"Buffer","data":[236,70,209,218,212,236,196,153,246,128,214,220,4,94,4,160,236,43,184,174]},"announce":[],"urlList":[]}}