{"title":"Blade And Sword Portable - [Espera]","uid":6404301,"size":520955408,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ee258783359c4c48d1507ad8ed71c83fdd6c4633&amp;dn=Blade+And+Sword+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"witwiw02","files":2,"time":1305758274,"description":"\n    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Blade And Sword 1 Click.exe&quot;\n3.Enjoy.\n\nWarning this is a PORTABLE version of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work under Windows 7 x64, only on the x86 version.\n\nBlade and Sword is a Diablo-style action role-playing game set in China. It has a heavy emphasis on fighting-game elements such as combos, special attacks, and blocking. The game actually pulls off these aspects really well and can be exciting at times. Unfortunately, a poor translation, very repetitive gameplay, and a lack of any multiplayer features mar what otherwise could have been an excellent take on this type of game.\n\nBlade and Sword takes place 3,000 years in the past, albeit in an alternate past. It's difficult to make out exactly what is happening in the story, though, due to a poor English translation from the original Chinese. There's something about emperors and wars, but all you really need to know is that there's an evil wizard that you need to stop. Wizard Wen has opened rifts between three realms, and so creatures from the human, beast, and demon realms can now mingle freely. As such, all sorts of foul monsters have come to terrorize humankind, and it's up to you to figure out exactly what's wrong and how to fix it. Rather, it's up to you to kill a whole bunch of monsters single-handedly. \n\nYou can choose one of three heroes to step up to the task. The three heroes aren't created equal though. The long-swordsman is the average, balanced character. He can stun a group of enemies and move in for the attack, so he is the easiest to play as. The twin-blades heroine is fast and agile, and while she isn't as powerful as the other two heroes, she does have a secondary kick attack. The great-blade warrior is very strong, but he isn't as coordinated as his fellow comrades. The latter two heroes are more difficult to play as because you have to put forth more effort to control them due to their abilities and skill sets. Each hero has a unique set of skills, which are divided into four categories, and each category has a progression of three skills, followed by a super skill. Each skill (except for the super skills) can be upgraded twice to make it more powerful. As with similar games with skill tress, you gain one point every level, and you may distribute any accrued points whenever and however you wish. \n\nMinimum System Requirements:\n\nPentium II 266MHz; 128MB RAM; 1400MB Hard Drive Space; Win98/Me/2000/XP; DirectX 8.1 ","torrent":{"xt":"urn:btih:ee258783359c4c48d1507ad8ed71c83fdd6c4633","amp;dn":"Blade+And+Sword+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee258783359c4c48d1507ad8ed71c83fdd6c4633","infoHashBuffer":{"type":"Buffer","data":[238,37,135,131,53,156,76,72,209,80,122,216,237,113,200,63,221,108,70,51]},"announce":[],"urlList":[]}}