{"title":"Markus Schulz,Dakota feat.Grandmaster Mele Mel,Scorpio - Sleepwa","uid":6406972,"size":131129817,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ef259a8e0b446541023a1cbbe20b4beed9ccdcbb&amp;dn=Markus+Schulz%2CDakota+feat.Grandmaster+Mele+Mel%2CScorpio+-+Sleepwa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"robynet22","files":1,"time":1305840376,"description":"He's one of the top DJs and producers across the circuit, and fans worldwide are anticipating Markus Schulz's 2011 Dakota contribution more than anything else. With the original mix of Sinners wetting the appetite back in February, Markus now presents the second single from his upcoming Thoughts Become Things II album, entitled &quot;Sleepwalkers&quot;, and it's a colossal speaker-smackdown.\n\nDebuted during the Prague '11 Release Party in SaSaZu and captured by many fans in the audience, the track became viral on YouTube, despite not having a revealed identity. Following plays at three sold out nights at Club Space in Miami; Sleepwalkers caused insatiable raptures during the ASOT 500 events in Buenos Aires and Den Bosch, causing Markus Schulz to become a worldwide twitter trend. The result: a huge radio-baiting, block-rocking club-tumbler that'll throw open the door to summer 2011!\n\nComplimenting Sleepwalkers is a pair of remixes exploring different dimensions of Sinners. Medellin's Khomha has been earmarked by Markus as one of the names to watch in 2011, notably for his contribution to Prague '11 in the form of Rainy in the Night. His remix of Sinners caused dancefloor madness during Markus' latest residency appearance at Marquee in Las Vegas, as well as tearing the dancefloor down at the Bal en Blanc extravaganza in Montreal.\n\nAnd making a name in his own right is Nijmegen's Aerofoil; about to make his bow on Coldharbour Recordings with his Caress 2 Impress EP, he gives Sinners a dark and twisted treatment, and one which has been frequently supported both in the clubs and on Global DJ Broadcast.\n\nAlive and ruthless, Sleepwalkers takes no prisoners. Just ask anyone who has reacted feverishly to it in the live environment.\n\n","torrent":{"xt":"urn:btih:ef259a8e0b446541023a1cbbe20b4beed9ccdcbb","amp;dn":"Markus+Schulz%2CDakota+feat.Grandmaster+Mele+Mel%2CScorpio+-+Sleepwa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef259a8e0b446541023a1cbbe20b4beed9ccdcbb","infoHashBuffer":{"type":"Buffer","data":[239,37,154,142,11,68,101,65,2,58,28,187,226,11,75,238,217,204,220,187]},"announce":[],"urlList":[]}}