{"title":"Joe Haldeman - The Coming - Unb","uid":4991031,"size":213651996,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f00be35826de3de6150001f3fc39d3b15117bfeb&amp;dn=Joe+Haldeman+-+The+Coming+-+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RamJamSam","files":7,"time":1247043232,"description":"Joe Haldeman - The Coming - Unb\nRead by: Joe Fox\nRuntime: 7 Hours and 24 Minutes\n\n\n\n\nThe story begins on October 1, 2054. Aurora (Rory) Bell, a professor of astrophysics at the University of Florida, has just made the discovery of the century. A sophisticated sensing device called a gamma ray burst detector has picked up a message from somewhere beyond the solar system. The easily decrypted message contains two unambiguous words: We're coming. Subsequent analysis reveals that the source of the message is heading directly toward Earth and is scheduled to arrive on the first day of January 2055. A media circus inevitably ensues, as the citizens of Earth attempt to prepare for a wholly unprecedented event.\n\nFrom this point forward, Haldeman focuses not on the alien spaceship but on the social, political, and environmental conditions of a rapidly deteriorating planet. He envisions a 21st century marked by unpredictable weather patterns and geopolitical chaos, a world in which corruption is an endemic element both of private enterprises and governmental institutions. Controversial -- i.e., gay -- sexual practices have been outlawed. The electoral process has become a joke, ushering in a new generation of leaders who are incompetent and uninformed but intensely photogenic. Most significantly, the nations of Europe are flexing their muscles once again, marshaling their forces for an inevitable -- and catastrophic -- global conflict. \n\nHaldeman's portrait of the century to come is at once familiar and strange, enlivened by a steady flow of imaginative details: automated traffic control systems, virtual reality pornography, designer drugs tailored to the individual DNA. Haldeman shows us this world from the constantly shifting perspective of a variety of characters. Included among them are Rory Bell, whose initial discovery jump-starts the narrative; Norman Bell, a middle-aged composer with a history of &quot;illegal&quot; sexual behavior; Willie Joe Capra, a sadistic bagman with delusions of grandeur; and a nameless &quot;historian,&quot; whose ruminations illuminate the cyclical patterns of violence present throughout recorded history.\n\nAs always, Haldeman writes with clarity, economy, and wit, skillfully moving his extensive cast toward a climactic moment of revelation in which &quot;hope and caution&quot; predominate. The Coming is both a provocative, cleverly conceived entertainment and a compelling meditation on the eternal human propensity for violent solutions. It is speculative fiction of the highest order and reaffirms its author's position as a modern master of the form. \n\n--Bill Sheehan\n\n\nGooD SeeDinG!\n\n\n\n","torrent":{"xt":"urn:btih:f00be35826de3de6150001f3fc39d3b15117bfeb","amp;dn":"Joe+Haldeman+-+The+Coming+-+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f00be35826de3de6150001f3fc39d3b15117bfeb","infoHashBuffer":{"type":"Buffer","data":[240,11,227,88,38,222,61,230,21,0,1,243,252,57,211,177,81,23,191,235]},"announce":[],"urlList":[]}}