{"title":"Voivod - Astronomy Domine","uid":5106133,"size":153012228,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f1a9a0d0d2bfe1675e46acff28dad2fe1b8daf44&amp;dn=Voivod+-+Astronomy+Domine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1254378852,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Astronomy Domine&quot; is a song by British psychedelic rock band Pink Floyd. The song, written and composed by original vocalist/guitarist Syd Barrett, was the first track featured on their debut album, The Piper at the Gates of Dawn (1967). The lead vocal was sung by Barrett and keyboard player Richard Wright. Its working title was &quot;Astronomy DominÃƒÂ© (An Astral Chant)&quot;, although the accented &quot;ÃƒÂ©&quot; is an improper spelling. &quot;Domine&quot; (&quot;Lord&quot; in Latin) is a word frequently quoted in Gregorian chants.\n\nVoivod covered this song in their 1989 album Nothingface with some different lyrics.\n\nVoivod are a Canadian heavy metal band from JonquiÃƒÂ¨re, Quebec, Canada. Their musical style has changed several times since the band's origin in the early 1980s. Starting out as a speed metal band, Voivod have added a mix of progressive metal and thrash metal to try to create their own unique metal style.\n\nSince its debut record in 1984, Voivod have released eleven studio albums as well as one EP, one live album, two compilations, seven demos and one DVD featuring a live concert. The band found mainstream success in the late 1980s with its most successful album Nothingface (1989), which was the first Voivod album to enter the Billboard 200 charts, peaking at number 114. Voivod's most recent studio album is 2009's Infini, which contains songs that were recorded prior to guitarist Piggy's death in 2005.\n\nNothingface is the fifth album by Canadian thrash metal/progressive metal band Voivod. It was released by Mechanic/MCA Records on October 13, 1989. The album marked a change for the band, expanding their sound and exploring more progressive sounds.\n\nThe band's most successful album to date, Nothingface is regarded by many as Voivod's best release. Nothingface was also the band's first album to enter the Billboard 200 charts, peaking at number 114. The album's third track, &quot;Astronomy Domine&quot;, which is a cover of Pink Floyd, was made as a music video and received airplay on MTV's Headbangers Ball.\n\nIt has been speculated that the rock band from Washington, D.C. Nothingface was named after this album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f1a9a0d0d2bfe1675e46acff28dad2fe1b8daf44","amp;dn":"Voivod+-+Astronomy+Domine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1a9a0d0d2bfe1675e46acff28dad2fe1b8daf44","infoHashBuffer":{"type":"Buffer","data":[241,169,160,208,210,191,225,103,94,70,172,255,40,218,210,254,27,141,175,68]},"announce":[],"urlList":[]}}