{"title":"riddimtion","uid":5003752,"size":151097782,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f1eb3b9a5e99d1cc0260e74bf76bab840d3bb1ea&amp;dn=riddimtion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lilcark","files":10,"time":1247635607,"description":"FORTHCOMING EVENTS\n\nSaturday 18th July\nRiddimtion meets Unitone\n@ The Everyone Centre\nBroadfield Rd, Sheffield\n10pm til Late\nÃ‚Â£6 on the door\nFood Available\nPre Bar @the Vine Inn\n7pm til close\n\nSaturday 25th July\nRiddimtion/Dubcentral/Feedback\n@the Earl\n10pm til Late\nFREE!\n\n\nMUCH MORE COMING SOON!!!\n\nfacebook and myspace \njust search reddimtion\n\nWHAT IS A SOUNDSYSTEM?\n\nA Sound System is a group of DJs, engineers, MCs and promoters playing music. The Sound System concept first became popular in the 1950s, in the ghettos of Kingston. DJs would load up a truck with a generator, turntables, and huge speakers and set up street parties. When Jamaicans immigrated to the United Kingdom, the Sound System culture followed and became firmly rooted there in the 1970s. The word Sound System can be used interchangeably to describe the group of people or the equipment they use.\n\nWHO IS RIDDIMTION?\n\nRiddimtion was founded in 1998 by Georges Guillier (Rootsfella) and Neil Robinson (Scragga Youth) and has grown ever since. It includes D.Js , M.Cs, singers, sound engineers, musicians, graphic artists and promoters. Its current and Resident members are Porl Yarnold (Early P), David Lumley (King David),Georges Guillier (Rootsfella), Philip (Mad dog). Riddimtion has also been helped over the years by people with many of these talents and others. And a very big help has been from the loyal crowd!!!\n\nWHAT IS RIDDIMTION?\n\nBased at the Stag Work studios in Sheffield, England, Riddimtion is a Roots, Reggae, and Ragga Sound System. It is a self-sufficient voluntary organisation made of a group of people with different skills whom teach and train each other. Riddimtion is a multicultural organisation including Caribbean, French, English, Australian, Welsh and Portuguese individuals all sharing the same enthusiasm and interest for the international message of conscious Reggae Music. The music brings a diversity of ideas, skills and creativity.\n\nWHAT DOES RIDDIMTION DO?\n\nFor almost a decade, we have been organising, promoting and playing at local, national and international events; in pubs, clubs, parks, festivals, free parties and private functions. Riddimtion Sound system covers a wide range of Reggae from Ska, Revival, Roots, Dancehall, Dub, and Bashment to Jungle. In the past, we have had the opportunity to work with artists such as Daddy Freddy, U-Brown, Roots Manuva, Winston Reedy, Trevor Walters, Zion Train, Dub Dadda and Abelwell Foundation - not forgetting all the DJ's, singers and other Sound SystemS we have played with all around the country and abroad. Riddimtion is not just a Sound System, it also has its own musicians performing live music. Riddimtion used to have its very own band known as The Riddimtion Band, which had the honour of being the backing band for U-Brown, Winston Reedy and Trevor Walters. The Riddimtion Band has since been dissolved and has now manifested into a group called Rebelions. Rebelions is a project involving three singers, King David, Rootsfella and Dawa Lion writing, playing and performing their own material. We are also known for community and social work through DJ, singing and artistry workshops with young people and playing on various local community radio stations\n\nWHAT IS RIDDIMTION'S AIM AND PURPOSE?\n\nRiddimtion's aim will always be to stand up against segregation, racism and oppression through its musical message of Peace, Love, Unity and Understanding. We believe that conscious music is a powerful form of communication to bring together and educate people from different ages, backgrounds and cultures.\n","torrent":{"xt":"urn:btih:f1eb3b9a5e99d1cc0260e74bf76bab840d3bb1ea","amp;dn":"riddimtion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1eb3b9a5e99d1cc0260e74bf76bab840d3bb1ea","infoHashBuffer":{"type":"Buffer","data":[241,235,59,154,94,153,209,204,2,96,231,75,247,107,171,132,13,59,177,234]},"announce":[],"urlList":[]}}