{"title":"Def Leppard - Rocket","uid":5103819,"size":152743940,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f258148316e946a4e28a6460146868249ba1a4aa&amp;dn=Def+Leppard+-+Rocket&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1254212675,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Rocket&quot; is a song recorded by British hard rock band Def Leppard in 1987 from the album Hysteria. It was the sixth (seventh in the US) and final single release, coming out in January 1989 and hitting the Top 15 in the US and UK.\n\nThe song was considered one of the most experimental for hard rock at the time. Most notably, producer Mutt Lange used backmasking effects to feature the line &quot;We're fighting with the gods of war&quot; (from &quot;Gods of War&quot;, also on Hysteria) sung backwards throughout the track. This sample was omitted from the single version of the song. The word &quot;Bites&quot; (from &quot;Love Bites&quot;) is also used as a sonic effect midway throughout the song, in order to replicate the sounds of a rocket launch through musical samples. &quot;Rocket&quot; also features a distinctive drum loop and monk-like chants.\n\nDistinctly heard at the beginning and end of the extended and edited version are samples of audio transcripts from the Apollo 11 Moon landing.\n\nIn its single release, &quot;Rocket&quot; was heavily edited from its original length of 6:43 for radio airplay, but would omit many of the portions that greatly distinguished the track from the rest of the album. At some shows, the album version gets performed at concerts, while at others they play the edited version instead.\n\nIt was used by professional wrestler Flyin' Brian Pillman as his theme music, when he came to NWA/WCW in 1989.\n\nMost Def Leppard hits compilations use the edited version of the song.\n\nThe music video for this song was directed by Nigel Dick.\n\nThe video is noted for being the last of the band with Steve Clark in the lineup. It was filmed in the same warehouse in Holland used nearly two years earlier for the &quot;Women&quot; clip in 1987. Clips of the classic rock names from the lyrics are flashed during the video.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f258148316e946a4e28a6460146868249ba1a4aa","amp;dn":"Def+Leppard+-+Rocket","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f258148316e946a4e28a6460146868249ba1a4aa","infoHashBuffer":{"type":"Buffer","data":[242,88,20,131,22,233,70,164,226,138,100,96,20,104,104,36,155,161,164,170]},"announce":[],"urlList":[]}}