{"title":"Coast to Coast AM - Oct 01 2009 - Alien Abductions &amp; Implants","uid":5108399,"size":56268765,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f264576f8287edf80fddcbfcb41c67a402ebd4ce&amp;dn=Coast+to+Coast+AM+-+Oct+01+2009+-+Alien+Abductions+%26+Implants&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":4,"time":1254528897,"description":"Alien Abductions &amp; Implants\n\nDate: 10-01-09\nHost: George Noory\nGuests: Derrel Sims, Joshua P. Warren\n\nResearcher Derrel Sims discussed the evidence for alien abductions and implants, as well some of the hidden alien agendas. Of the abductees he's studied, some 45% are of Native American or Irish descent, he noted. A number of abductee/contactees may have served as unwitting surrogates for their alien abductors, and he hopes to show through DNA testing, that some of their offspring are not genetically related to either of their parents. This would demonstrate that the aliens are incubating babies or hybrids in certain female abductees, he explained.\n\nJoining Sims in separate segments, were three abductees, all of whom had implants in their bodies. An Arizona therapist named John described frequent encounters with 4-ft. tall 'grey' beings in his home. Around a year ago, he said he actually killed one of the beings with a Samurai sword-- upon the attack, it sprayed out copious amounts of a clear liquid, and then disappeared. Sims said sample fluid that was collected had odd properties in scans, and was undergoing further testing. The beings continue to make visitations, but now they appear behind a wavy field of energy that prevents attack, John continued.\n\nAnother abductee, Jeff, told of being in ill health, and how his condition dramatically improved when he had his implant taken out. Testing on the implant showed it was magnetic, and emitting several different frequencies. Rosie, a contactee from Sao Paolo, Brazil said she's had several implants (including one the size of a Lifesaver in her brain, see photo below). Her contacts with the Nordic aliens (whom she described as tall blonde humanoids with cat-like eyes) informed her that the implants were used like cameras.\n\nSims also shared an account of a remarkable mass abduction event in which 8 people were taken to a huge craft that was 600 miles across. One of them was shown a 3D map, and a Nordic explained it was a kind of timeline for their &quot;program&quot; involving humanity. The witness estimated that the timeline represented some 6,000 years and had just 100 years left on it.\n\nDeveloping Psychic Abilities\n\nLast hour guest, paranormal investigator Joshua P. Warren shared ways in which people can develop psychic abilities. As a way of getting started, he described how to become aware of one's own energy or electrostatic field: First rub your palms together until they're warm, then put your hands together as close as they can be without touching. Then move your palms about six inches apart, then back close together without touching. Repeat this process until you begin to feel a kind of energy flow between your hands. For more, see this related article, Are You Telekinetic? Warren also shared a technique to open up your &quot;third eye&quot; using a wand or wooden stick.\n\nWebsite(s):\nalienhunter.org\njoshuapwarren.com\n\nBook(s):\nAlien Hunter: The Evidence in Light\nAlien Hunter: Evidence &amp; Truth About Alien Implants\nThe Secret Wisdom of Kukulkan\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224\t","torrent":{"xt":"urn:btih:f264576f8287edf80fddcbfcb41c67a402ebd4ce","amp;dn":"Coast+to+Coast+AM+-+Oct+01+2009+-+Alien+Abductions+%26+Implants","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f264576f8287edf80fddcbfcb41c67a402ebd4ce","infoHashBuffer":{"type":"Buffer","data":[242,100,87,111,130,135,237,248,15,221,203,252,180,28,103,164,2,235,212,206]},"announce":[],"urlList":[]}}