{"title":"Coast.to.Coast.AM.July.09.2009-komie","uid":4995453,"size":55411789,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f276b4acfdc9cef46690837f634728368879da9a&amp;dn=Coast.to.Coast.AM.July.09.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":5,"time":1247254938,"description":"Paranormal Update\n\n\n\nDate:\n07-09-09\n\nHost:\nGeorge Noory\n\nGuests:\nDamien Broderick, Tom Cryer, Joshua P. Warren\n\n\nAppearing in the latter half of the show, paranormal investigator Joshua P. Warren shared updates on a number of different topics. He was able to successfully extract recordings from a mysterious Cold War-era spy watch, and heard a group of men in Texas talking about creating a new aircraft. He also discussed some of the latest experiments taking place at his lab including observing waves of energy, using a special optical system known as Schlieren Imaging.\n\nWarren talked about the usage of a psychomanteum (as developed by Raymond Moody)-- a darkened room with a mirror, that can foster communication with the deceased, as well as a &quot;Devil's Toy Box,&quot; six square mirrors that form a cube. Growling and other weird noises have been heard coming from such a box, and he speculated that the mirrors could be creating a kind of back and forth energy loop. He also touched on new video footage that shows orange blob-like aerial objects that morph between shapes. He's going to try and emulate this phenomenon in the lab.\n\nTax Protest Update\n\nFirst hour guest, attorney Tom Cryer discussed the conviction of tax protesters Ed &amp; Elaine Brown, who were found guilty of amassing weapons and plotting to kill federal agents during their nine-month standoff in 2007. Cryer said he's now focusing his efforts on Tea Party Squared, a political protest movement against the &quot;IRS's fraudulent misapplication of the income tax.&quot;\n\nPSI Research\n\n\nIn the second hour, Australian author, futurist, and critical theorist Damien Broderick talked about psi research and his interest in the paranormal. While skeptical of some reported UFO phenomena, he does believe there is evidence for the validity of psi or ESP, such as demonstrated in the US military's former Remote Viewing program. The idea of multiple universes is explicated in powerful theories, such as Super String, yet there is no evidence/phenomena to back it up. It is just the opposite with psi, which has phenomena, but no central theory to explain it, he commented.\nWebsite(s):\n# panterraweb.com\n# truthattack.org\n# teapartysquared.com\n# joshuapwarren.com\n# lemurlabresearch.com\nBook(s):\n# Outside the Gates of Science: Why It's Time for the Paranormal to Come in from the Cold\n# Pet Ghosts: Animal Encounters from Beyond the Grave\n# How to Hunt Ghosts\n# Haunted Asheville","torrent":{"xt":"urn:btih:f276b4acfdc9cef46690837f634728368879da9a","amp;dn":"Coast.to.Coast.AM.July.09.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f276b4acfdc9cef46690837f634728368879da9a","infoHashBuffer":{"type":"Buffer","data":[242,118,180,172,253,201,206,244,102,144,131,127,99,71,40,54,136,121,218,154]},"announce":[],"urlList":[]}}