{"title":"SORDID LIVES THE SERIES DISC_3","uid":6446782,"size":4232681472,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f2d4831ea858c8e8ca1ea23893e8ba3501af9ac9&amp;dn=SORDID+LIVES+THE+SERIES+DISC_3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"bobbers602","files":55,"time":1307294739,"description":"Sordid Lives: The Series A black comedy about white trash! The world's first DVD release of the first twelve episodes of the high-profile TV series with a stellar cast and guest is presented in its rarely seen Uncensored and Uncut format and includes 80+ minutes of behind-the-scenes DVD Extras including bloopers, five Olivia Newton-John song performances, deleted scenes and photo galleries. Based on the quirky cult movie of the same name, the TV adaptation of Sordid Lives, is hilariously written and directed by creator Del Shores (Queer as Folk, Dharma &amp; Greg, Touched by an Angel). Becoming the highest rated series on MTV/Viacom's Logo network, this off-beat and edgy prequel to the hit film, about crazy Texas women and slightly-less-than-crazy gay men, features a cavalcade of high profile camp icons including Rue McClanahan (The Golden Girls), music and screen legend Olivia Newton-John, Leslie Jordan (Will &amp; Grace), Caroline Rhea (Sabrina, The Teenage Witch), Beth Grant (No Country for Old Men), comedian Margaret Cho, Bonnie Bedelia (Die Hard), Carson Kressley (Queer Eye for the Straight Guy), Candis Cayne (Dirty Sexy Money), and Dale Dickey (My Name is Earl). A huge hit and avid following since debuting on Logo in the US and Super Channel in Canada that triggered on-line petitions and the 14,000+ member Facebook group &quot;Save Sordid Lives&quot;, devoted to getting the first season released on DVD and also bringing Sordid Lives back for a second season. Equal parts Desperate Housewives, Mama's Family, Soap and Will &amp; Grace, Sordid Lives is the outrageous Southern Fried comedy that depicts the saga of bible-thumping Baptists, chain-smoking bar trash, an institutionalized drag queen, his Valium popping sisters, and everyone in between in a small Texas town, contrasted with the appearance-driven world of Hollywood and the hysterical travesty and tender poignancy that come from learning to be yourself and love the family you have instead of the family you want.","torrent":{"xt":"urn:btih:f2d4831ea858c8e8ca1ea23893e8ba3501af9ac9","amp;dn":"SORDID+LIVES+THE+SERIES+DISC_3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2d4831ea858c8e8ca1ea23893e8ba3501af9ac9","infoHashBuffer":{"type":"Buffer","data":[242,212,131,30,168,88,200,232,202,30,162,56,147,232,186,53,1,175,154,201]},"announce":[],"urlList":[]}}