{"title":"Inundacion The Flood Miniserie Completa DVB Spanish","uid":5152958,"size":1469707850,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f3dbfa5147a63d9eb15d1810e2740df1f80d5b6e&amp;dn=Inundacion+The+Flood+Miniserie+Completa+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":4,"time":1257678809,"description":"SuperproducciÃƒÂ³n InundaciÃƒÂ³n, una miniserie inglesa de dos episodios heredera de los mejores ejemplos del cine de catÃƒÂ¡strofes. Producida por Power, relata la lucha contrarreloj de tres ingenieros para evitar que una pavorosa inundaciÃƒÂ³n asole Londres.Robert Carlysle (Full Monty, Trainspotting), Jessalyn Gilsig (Ley y Orden, Prison Break) y Tom Courtenay (dos veces nominado a los Oscar) componen el trÃƒÂ­o protagonista de esta trepidante aventura que utiliza espectaculares efectos especiales.\n\nTodo empieza con una inusual tormenta tropical, producida por el deshielo de los Polos, que llega a Londres y provoca una enorme inundaciÃƒÂ³n que asola la ciudad del TÃƒÂ¡mesis.\n\nEl pÃƒÂºblico britÃƒÂ¡nico acogiÃƒÂ³ con entusiasmo esta producciÃƒÂ³n que especula con la nada descabellada posibilidad de que el mar acabe arrasando Inglaterra por el gran entrante natural que tiene la isla, el Estuario del TÃƒÂ¡mesis. El origen de este desastre serÃƒÂ­a un devastador huracÃƒÂ¡n, iniciado en Florida, que llega hasta las costas inglesas provocando escepticismo, primero, y pÃƒÂ¡nico, despuÃƒÂ©s, en las autoridades y en la poblaciÃƒÂ³n.\n\nComo fondo de la historia, planean las tormentosas relaciones entre el protagonista, Rob Morrison (Carlysle), un ingeniero que dirige una empresa de mantenimiento, su ex mujer Sam (Gilsig), directora de operaciones del complejo de contenciÃƒÂ³n Barrera del TÃƒÂ¡mesis, y el padre de Rob, el profesor Leonard Morrison, cuyas teorÃƒÂ­as poniendo en duda la eficacia de la Barrera provocaron la ruptura con su hijo dos dÃƒÂ©cadas atrÃƒÂ¡s. Los tres deberÃƒÂ¡n dejar a un lado sus diferencias para resolver una situaciÃƒÂ³n que acabarÃƒÂ­a con la vida de millones de londinenses. ","torrent":{"xt":"urn:btih:f3dbfa5147a63d9eb15d1810e2740df1f80d5b6e","amp;dn":"Inundacion+The+Flood+Miniserie+Completa+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3dbfa5147a63d9eb15d1810e2740df1f80d5b6e","infoHashBuffer":{"type":"Buffer","data":[243,219,250,81,71,166,61,158,177,93,24,16,226,116,13,241,248,13,91,110]},"announce":[],"urlList":[]}}