{"title":"Coast to Coast AM - Apr 27 2011 - Psychology of High School","uid":6361459,"size":55532703,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f52efcac061fd7363a7cec9ff05b1ea019f1b0e1&amp;dn=Coast+to+Coast+AM+-+Apr+27+2011+-+Psychology+of+High+School&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mscowlove","files":5,"time":1304341917,"description":"Date: 04-27-11\nHost: George Noory\nGuests: Alexandra Robbins, Glynis McCants\n\nInvestigative journalist Alexandra Robbins talked about the world of high school and how those who thrive in it are not necessarily the ones who end up successful in life. Being an outsider in high school has been viewed negatively especially since the Columbine shootings, but just because students don't conform or aren't popular doesn't make them bad people, she noted. In her new book, The Geeks Shall Inherit the Earth, she followed the lives of seven real students whom she broke down into different categories. In the case of the 'Popular Girl,' ironically she was not that well liked. Further, Robbins reported that the &quot;popular&quot; kids tended to be more conformist, did less well in school, and were more likely to be involved in incidents of aggression.\n\nOther students she profiled included the 'Weird Girl,' the 'Gamer,' and the 'Nerd.' If schools were to celebrate the sciences the same way they do athletics, a lot more students might go into the sciences, and nerds wouldn't be shunned, Robbins commented. Students are foisted with a lot of labels now like &quot;emo&quot; and &quot;indie&quot; which refer to what you are, rather than the older labels (jock, greaser etc.) that referred to what you do, she observed.\n\nRobbins defined what she called Quirk Theory: &quot;Many of the differences that cause a student to be excluded in school are the same qualities or real world skills that others are going to admire...in adulthood and outside the school environment.&quot; She also reviewed her earlier investigation into Skull and Bones, the secret society based at Yale. An initiation ceremony for new members involves other members dressing as the Devil, a skeleton, and the Pope, being given a blind tour of 'The Tomb' (club headquarters), and drinking blood from a skull, she revealed.\nNumbers in the News\n\nFirst hour guest, numerologist Glynis McCants talked about the numbers in current events, such as for Kate Middleton &amp; Prince William. The Royal couple &quot;are extremely compatible. They share the number 3, which is all about humor and laughter,&quot; she said, adding that their marriage date of the 29th is a &quot;1&quot; day, which bodes well for them as a couple.\n\nNews segment guest: Joseph Farah, Richard C. Hoagland\nWebsite(s):\n\nalexandrarobbins.com\nnumberslady.com\n\nBook(s):\n\nThe Geeks Shall Inherit The Earth\nSecrets of the Tomb\nThe Overachievers: The Secret Lives of Driven Kids\nLove by the Numbers\nGlynis Has Your Number\n","torrent":{"xt":"urn:btih:f52efcac061fd7363a7cec9ff05b1ea019f1b0e1","amp;dn":"Coast+to+Coast+AM+-+Apr+27+2011+-+Psychology+of+High+School","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f52efcac061fd7363a7cec9ff05b1ea019f1b0e1","infoHashBuffer":{"type":"Buffer","data":[245,46,252,172,6,31,215,54,58,124,236,159,240,91,30,160,25,241,176,225]},"announce":[],"urlList":[]}}