{"title":"Pictures of all sort of sodomy","uid":6422758,"size":1667972848,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:f5595c70b34a27607a5739e2a17cfd68e0bc5742&amp;dn=Pictures+of+all+sort+of+sodomy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kerrantel","files":7074,"time":1306356628,"description":"This collection consist:\n\n7073 pictures. \n\nDTP (Dragon TyPes) - 1695 pics. There is all sort of characters associated with scalies: dragons, nagas, dinosaurs, snakes, lizards, iguanas, crocodiles, etc.\n\nHTP (Horse TyPes) - 2494 pics. There is all sort of characters associated with hooves: horses, donkeys, zebras, giraffes, cows, centaurs, minotaurs, taurens, gazelles, draeneis, bulls, goats, unicorns, elephants, deers, etc.\n\nDTP (Random TyPes) - 2884 pics. There is all sort of characters associated with any other species: foxes, wolfs, dogs, fennecs, sharks, dolphins, orcas, lions, cats, rabbits, pandas, sphinks, hyenas, birds, gryphons, bats, racoons, bears, tigers, lemurs, roos, chimeras, ferrets, humans-like creatures, sergals, pokemorphs, squirrels, etc.\n\nOn the pictures you can see: M (Male),F (Female),H (Hermaphrodite) in all possible positions, furry, anal, fisting, bdsm, milking, vore, unbirth, micro/macro, cooking, incest, bondage, liking,  tentacles, inflation, egglaying, big breasts, interspecies, dicknipples,  transformations, pregnant, hypnosis, hentai, guro, rape, and other sort of sodomy.\n\nThanks to all artists of the world for the creating their wonderful drawings pleasurable to many millions.\n\nNote:\nThis collection does not contain any viruses. Collection may contain some duplicates and images, does not matching to the description. The author of this collection is not liable for possible violations of the psyche of users of the collection. All rights to images belong to their respective owners.\n\nThe difference this torrent from http://thepiratebay.se/torrent/6154089/7800__pictures_of_all_sort_of_sodomy. : left the hottest pictures, deleted most of the duplicates, the picture is now more consistent with the description, some pictures were replaced with pictures with great quality, supplemented and corrected description.\n\nEnjoy!  \t","torrent":{"xt":"urn:btih:f5595c70b34a27607a5739e2a17cfd68e0bc5742","amp;dn":"Pictures+of+all+sort+of+sodomy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5595c70b34a27607a5739e2a17cfd68e0bc5742","infoHashBuffer":{"type":"Buffer","data":[245,89,92,112,179,74,39,96,122,87,57,226,161,124,253,104,224,188,87,66]},"announce":[],"urlList":[]}}