{"title":"Dawn of the Dead - Extended Version - 1978","uid":5016014,"size":4681972098,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f5a4fd2fa762a1ed5735d8b0f3298c290623f48f&amp;dn=Dawn+of+the+Dead+-+Extended+Version+-+1978&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EvilTSAngel","files":-1,"time":1248216861,"description":"Director George A. Romero's epic sequel to his legendary Night of the Living Dead has firmly established itself as the equal of its ground-breaking predecessor. Though shot in 1978 -- ten years after the first films' release -- Dawn's story begins as if the events in Night had happened only a few months before: after shambling armies of the recently-dead take over every major city -- seeking warm human flesh for food -- the U.S. government imposes a state of martial law, sending in special National Guard units to attack and destroy zombie infestation where they find it. Two members of one such unit, Peter (Ken Foree) and Roger (Scott Reiniger) have been tasked to overthrow a nest of zombies in a Pittsburgh housing project (one of the film's most explicitly gory scenes). When the job turns ugly and Peter is forced to terminate his own berserk, racist commanding officer, the pair decide to split the outfit with the help of his friend Stephen (David Emge), a traffic pilot for WGON-TV, and the station's floor manager, Stephen's girlfriend Frances (Gaylen Ross). Together they steal the station's helicopter and head for less-populated areas, but after some narrow scrapes with flesh-hungry redneck ghouls in the country outside Harrisburg, they opt for a more secure hideout. Eventually they find the perfect solution: a massive, sprawling shopping mall. After the lengthy process of purging the building of zombies is complete, the four secure themselves snugly in the miniature city, consigned to live out their lives in a dull but cushy consumer's paradise... but the arrival of a menacing gang of nomadic bikers proves that this is not to be. With their survival instincts weakened by a mallful of toys and trinkets, the crew are again forced to face grim reality as they face both living and undead foes in a final battle. Romero's excellent, multi-layered story combines high-adventure heroics, three-dimensional characters and explicit gore (by the always masterful Tom Savini, who plays a small role as a leering biker) to excellent effect. The subtext comparing the glassy-eyed behavior patterns of the ghouls to those of American consumers is clear, but not overdone: &quot;It's some kind of instinct,&quot; Stephen comments, observing the zombies' attraction to the mall; &quot;This was an important place in their lives.&quot; Despite the glimmer of hope offered by the film's closing scene, the outlook for humankind is grim. Perhaps it is Frannie who best expresses Dawn's outlook for humanity: &quot;We're not gonna make it, are we?&quot; Several versions of this film are available on video, including a faster-paced European version edited by overseas distributor Dario Argento and a &quot;Director's Cut&quot; with a great deal of exposition restored (though Romero is quoted as having preferred the unrated cut released initially to U.S. theaters). The shooting script also contains a more downbeat ending, which was never filmed. ~ Cavett Binion, All Movie Guide\n\n\n\nComplete Cast:\nScott Reiniger - Roger\nDavid Emge - Stephen\nTom Savini - Motorcycle Raider\nTony Buba - Motorcycle Raider\nPan Chatfield - Lead Zombie\nDavid Crawford - Dr. Foster\nDaniel Dietrich - Givens\nChristine Forrest - TV Producer (uncredited)\nRandy Kovitz - Officer at Police Dock\nClayton McKinnon - Officer in Project Apt\nRod Stouffer - Young Officer on Roof\nScott H. Reinger\nFred Baker - Commander\nGeorge A. Romero - TV Director\nJohn Harrison - Screwdriver Zombie\nJohn Rice - Officer in Project Apt\nKen Foree - Peter\nGaylen Ross - Francine\nTed Bank - Officer at Police Dock\nSharon Ceccatti - Lead Zombie\nJim Christopher - Lead Zombie\nJese del Gre - Old Priest\nDavid Earle - Mr. Berman\nRichard France - Scientist\nPatrick McCloskey - Officer at Police Dock\nHoward K. Smith - TV Commentator\nJay Stover - Lead Zombie\nJames A. Baffico - Wooley\nPasquale A. Buba - Motorcycle Raider\nTaso N. Stavrakis - Motorcycle Raider\nMarty Schiff - Motorcycle Raider\n\n\nDirector(s):George A. Romero\nWriter(s):George A. Romero\nProducer(s):Donna Siegal, Richard P. Rubinstein\nTheatrical MPAA Rating: NR(Gore, Not For Children, Violence, Adult Language)\nCategories:Horror\n\nFormat: DVD\nRelease Date: 09/07/2004\nMPAA Rating: NR\nNumber of Discs: 1\n  Closed Caption \nView special edition features\nExtended Version:\nWidescreen presentation (1.85:1) enhanced for 16 x 9 TVs \nAudio commentary with producer Richard P. Rubinstein (moderated by DVD producer Perry Martin)\nMonroeville Mall commercial\nBehind-the-scenes photo gallery\nMemorabilia gallery\nProduction stills\nPresented in original Mono\n\n\nThis is an EvilTSAngel Original DVDRip!\n\nOriginal Menu's and Extra's included!\n\nEnjoy and Seed!","torrent":{"xt":"urn:btih:f5a4fd2fa762a1ed5735d8b0f3298c290623f48f","amp;dn":"Dawn+of+the+Dead+-+Extended+Version+-+1978","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5a4fd2fa762a1ed5735d8b0f3298c290623f48f","infoHashBuffer":{"type":"Buffer","data":[245,164,253,47,167,98,161,237,87,53,216,176,243,41,140,41,6,35,244,143]},"announce":[],"urlList":[]}}