{"title":"Web Calendar Pad 2011.5.1-CORE","uid":6445306,"size":16603569,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f62f284dabba9f5e27769b56d1f9f99582975cc2&amp;dn=Web+Calendar+Pad+2011.5.1-CORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1307116781,"description":"Web Calendar Pad 2011.5.1\n\nThe Web Calendar Pad is a program that you can use to create illustrated monthly calendars, that can look like wall calendars and be published automatically to your website, a file, or be printed.Perfect for businesses, schools, churches, clubs, organizations and personal calendars.\n\nWeb Calendar Pad helps you create an HTML illustrated calendar. Web Calendar Pad makes it easy for some one with zero knowledge of HTML to create, publish, and update online event calendars, in mere minutes. No need to battle html code ever again , you can choose the look of your calendar from a large list of defined styles, or easily create your own custom look that can include photos, backgrounds, and custom fonts.\n\nHere are some key features of &quot;Web Calendar Pad&quot;:\n- Create Web Calendars that can include photos, backgrouns, and custom fonts\n- Easy to use and quick to publish\n- Lets you keep data in a separate calendar for each subject, but selectivly merge when publishing\n- Supports the FTP protocol of file transfer, that makes it easy to publish your calendars on the internet\n- Supports Macros, that let you use short-cut key words and then replace them with full text allowing you to reduce the amount of typing\n- Built in wizard, lets you define the look of your calendar, or choose from predefined theme\n- Lets you add custom headers and footers to you html calendar\n\nHome Page - http://www.calendarpad.com\n\n","torrent":{"xt":"urn:btih:f62f284dabba9f5e27769b56d1f9f99582975cc2","amp;dn":"Web+Calendar+Pad+2011.5.1-CORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f62f284dabba9f5e27769b56d1f9f99582975cc2","infoHashBuffer":{"type":"Buffer","data":[246,47,40,77,171,186,159,94,39,118,155,86,209,249,249,149,130,151,92,194]},"announce":[],"urlList":[]}}