{"title":"Jet - Black Hearts (On Fire)  (2nafish)","uid":5190525,"size":128333828,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f646a0ae4011a3b946b4768e80e4fa22ea1cae32&amp;dn=Jet+-+Black+Hearts+%28On+Fire%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1259667544,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Black Hearts (On Fire)&quot; is a song by Australian rock band Jet and is the second single taken from their third album Shaka Rock. Like She's a Genius which was the first single from the album, the song debuted at a secret show in Melbourne in November 2008 and was later included as a track on the album. The single was released on iTunes on November 2.\n\nShaka Rock is the third studio album by Australian rock band Jet, released on the 21st of August, 2009.\n\nIn an interview with MTV's Ruby Rose on Channel 10's 7pm Project, it was said two unnamed tracks were recorded in Australia, one in Melbourne and one in Sydney.\n\nThe album was posted on August 20, 2009 on the band's MySpace page.\n\nThe record has been made 'Entertainment Weekly's Picks of The Week' for August the 23rd. \n\nAlthough not confirmed as an official single, the song &quot;K.I.A. (Killed in Action)&quot; was uploaded to the band's official website. The first single from the album was confirmed to be the track &quot;She's a Genius&quot;, which went to radio on 22 June and was available for free download at AOL Music on the same day for 24 hours. Black Hearts (On Fire) has been confirmed to be the second single from the album and a music video is currently being made for the single.\n\nThe band have been in the studio since 2008 working on the album. After touring was completed for their previous album, Shine On, the band took a short break. The album was originally thought to be released in late 2008 but a secret show was played in Melbourne in December 2008 only to debut new material. Various tracks that are featured on the album were played at this concert including the first single &quot;She's a Genius&quot;.\n\nThe track &quot;K.I.A (Killed in Action)&quot; was added to Jet's website in early April 2009. Altsounds.com first reported on the album in late April 2009 - drawing on information from the leaked press kit and providing the image of the album cover.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f646a0ae4011a3b946b4768e80e4fa22ea1cae32","amp;dn":"Jet+-+Black+Hearts+%28On+Fire%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f646a0ae4011a3b946b4768e80e4fa22ea1cae32","infoHashBuffer":{"type":"Buffer","data":[246,70,160,174,64,17,163,185,70,180,118,142,128,228,250,34,234,28,174,50]},"announce":[],"urlList":[]}}