{"title":"TwistedBrush Pro Studio 18.04","uid":6426432,"size":23140154,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f6dd62bcbd267e65433cc77f2e6776acf1974d5b&amp;dn=TwistedBrush+Pro+Studio+18.04&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1306493379,"description":"TwistedBrush Pro Studio 18.04\n\nTwistedBrush - digital paint software with complete natural art tools - oils, acrylics, pastel, charcoal etc. Software for artists without the complexity of other art programs. TwistedBrush - creating art the way it should be, simple and fun! Simplicity without sacrifice, powerful enough for the professional artist yet simply enough for the novice. TwistedBrush has one of the most versatile and powerful brush engines in existence, yet it was designed from day one to be easy to use. Over 2000 brushes, layers, realistic media, photo cloning, tracing, masks, particles, filters, script recording, scripts to AVI, drawing tablet support, brush shapes, patterns, textures, integrated scanner support, image brushes, drawing guides, reference image views, dirty brushes, scratch layer, dynamic palettes and much more!\n\nSimplicity without sacrifice, powerful enough for the professional artist yet simple enough for the novice. TwistedBrush Pro Studio has one of the most versatile and powerful brush engines in existence, yet it was designed from day one to be easy to use. TwistedBrush Pro Studio has more than 5,000 brushes, along with all the features that artists love to use: layers, realistic media, photo cloning, tracing, masks, particles, filters, script recording, scripts to AVI, drawing tablet support, brush shapes, patterns, textures, integrated scanner support, image brushes, drawing guides, reference image views, dirty brushes, scratch layer, dynamic palettes and a whole lot more.\n\nTwistedBrush Pro Studio runs on all versions of the Windows operating system and is designed for all realms of digital art including natural media fine art, photo retouching, photo composition, photo cloning to turn your photos into the look of hand painted artwork, mandala art, patterns, manga, even 3D like painting with the incredible blob modeling tools.\n\nHome Page - http://www.pixarra.com/\n\n\n","torrent":{"xt":"urn:btih:f6dd62bcbd267e65433cc77f2e6776acf1974d5b","amp;dn":"TwistedBrush+Pro+Studio+18.04","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6dd62bcbd267e65433cc77f2e6776acf1974d5b","infoHashBuffer":{"type":"Buffer","data":[246,221,98,188,189,38,126,101,67,60,199,127,46,103,118,172,241,151,77,91]},"announce":[],"urlList":[]}}