{"title":"Big Ass Truck - Complete Discography","uid":5183521,"size":547964570,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f7ddb58c15c45bba5e054fbae50317204a3c82b1&amp;dn=Big+Ass+Truck+-+Complete+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"seanhanley1978","files":97,"time":1259358736,"description":"Big Ass Truck was an American rock band from Memphis, Tennessee incorporating elements of hip-hop, rock and funk with a heavy psychedelic influence. This was a full band, with the creative addition of DJ spinning records, providing beats, loops, and samples.\n\nLineup\n\nThe founding members of Big Ass Truck included drummer Robert Barnett, DJ Colin Butler, bassist Joe Boone, keyboardist Alex Greene, singer/guitarist Robby Grant and singer/guitarist Steve Selvidge. the line-up changed here and there throughout the 90s. This included many bass players such as Lucero's own John C. Stubblefield, Grayson Grant and Dros Liposack, as well as keyboard player Chris Parker. Sometimes, the band also included producer Ross Rice.\n[edit] Releases\n\nIn 1995, Big Ass Truck's self-titled debut hit the shelves. Soon, frequent touring with the band 311 would increase the bands popularity before their follow-up release in 1996 titled Kent. The band would continue on to release an E.P. and two more albums. Under the name &quot;Big Angelic Truck&quot; the band recorded two Christmas songs, &quot;Do You Hear What I Hear&quot; and &quot;Holly Jolly Christmas&quot; for a local charity. They later released these songs on a limited edition 7&quot; single.\n[edit] Hiatus\n\nShortly after their most recent release in 2001, the largely instrumental The Rug, Big Ass Truck has since been on hiatus. The future of the band is still uncertain. Bandmates are not commenting on when or even if the band will ever get back together. According to the band's myspace page, they no longer exist.\n[edit] Current Projects\n\nToday, Robby Grant plays in a solo project under the name Vending Machine. He also plays guitar in another band, Mouserocket, with former Big Ass Truck bandmate Robert Barnett and guitarist/vocalist/songwriter Alicja Trout of The Lost Sounds and River City Tanlines. Steve Selvidge recorded and toured with The Bloodthirsty Lovers along with Dave Shouse who is the former member of Memphis lo-fi rockers The Grifters and Those Bastard Souls. In 2006, Selvidge produced, co-wrote, and released &quot;The Service is Spectacular&quot; by The Secret Service. He is currently recording and touring with Amy Lavere. Joe Boone owns Other Door Studio in Birmingham, AL.\n[edit] Discography\n\n    * Big Ass Truck 1995 Upstart\n    * Kent 1996 Upstart\n    * Sack Lunch 1997 Yep Roc\n    * Who Let You in Here? 1998 Peabody\n    * The Rug 2001 Terminus\n\nCompilations\n\n    * On Air: Live Music From The WEVL Archives 1996 SCV\n","torrent":{"xt":"urn:btih:f7ddb58c15c45bba5e054fbae50317204a3c82b1","amp;dn":"Big+Ass+Truck+-+Complete+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7ddb58c15c45bba5e054fbae50317204a3c82b1","infoHashBuffer":{"type":"Buffer","data":[247,221,181,140,21,196,91,186,94,5,79,186,229,3,23,32,74,60,130,177]},"announce":[],"urlList":[]}}