{"title":"Lamb Of God - Ruin","uid":5165156,"size":146509828,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f89c82753acc0d7c4cf141e617b0607e71e9d6f5&amp;dn=Lamb+Of+God+-+Ruin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1258366089,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nAs the Palaces Burn is the third studio album by American heavy metal band Lamb of God, released under Prosthetic Records in 2003. As the Palaces Burn received considerably more airplay than their previous effort, with three singles. The album was produced by Chris Adler, Mark Morton, Shaun Thingvold and Devin Townsend. The album has sold over 200,000 copies in the United States.\n\nLamb of God is an American heavy metal band from Richmond, Virginia, formed in 1994. The band was originally known as Burn the Priest, but changed their name shortly after the release of their self-titled debut album in 1998. Lamb of God consists of vocalist Randy Blythe, guitarists Mark Morton and Willie Adler, bassist John Campbell, and drummer Chris Adler and is a member of the New Wave of American Heavy Metal.\n\nSince its formation, Lamb of God has released six studio albums, one live album, and three DVDs. The band's cumulative sales equal almost two million in the United States. In 2007 the band received a Grammy nomination for their 2006 album Sacrament. Lamb of God has toured with the Ozzfest twice and appeared on Slayer's The Unholy Alliance Tour in 2006. They have also played at many other major festivals around the world including Download Festival and Sonisphere Festival in the UK, Soundwave Festival and Gigantour.\n\nLamb of God toured for two years before releasing its third studio album, As the Palaces Burn, on May 6, 2003. Kirk Miller of Rolling Stone gave the album three out of five stars, writing that &quot;unlike many of their overreaching, Slipknot-influenced contemporaries, Lamb of God deliver a meticulously crafted metal assault.&quot; The album was voted the number one album of 2003 by both Revolver Magazine and Metal Hammer. The band toured on the first Headbangers Ball tour, where they recorded a DVD including live performances and a documentary, titled Terror and Hubris. The DVD was a success, debuting at number 31 on the Billboard Top Music Videos chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f89c82753acc0d7c4cf141e617b0607e71e9d6f5","amp;dn":"Lamb+Of+God+-+Ruin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f89c82753acc0d7c4cf141e617b0607e71e9d6f5","infoHashBuffer":{"type":"Buffer","data":[248,156,130,117,58,204,13,124,76,241,65,230,23,176,96,126,113,233,214,245]},"announce":[],"urlList":[]}}