{"title":"Supercanyeras [DVDRIP][Spanish][2009]","uid":5138014,"size":730337280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f8cf9a2137f6d3c5635be55378bce7c9e1cc0481&amp;dn=Supercanyeras+%5BDVDRIP%5D%5BSpanish%5D%5B2009%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zurera","files":1,"time":1256661437,"description":"\n\nTÃƒÂ­tulo: SupercaÃƒÂ±eras: el internado puede ser una fiesta\n\nTÃƒÂ­tulo original: St. Trinian's\n\nDirecciÃƒÂ³n: Oliver Parker, Barnaby Thompson\n\nPaÃƒÂ­s: El Reino Unido\n\nAÃƒÂ±o: 2007\n\nFecha de estreno: 24/06/2009\n\nDuraciÃƒÂ³n: 97 min.\n\nGÃƒÂ©nero: Comedia\n\nReparto: Talulah Riley, Rupert Everett, Jodie Whittaker, Gemma Arterton, Kathryn Drysdale, Juno Temple, Antonia Bernath, Amara Karan, Tamsin Egerton, Lily Cole\n\nWeb: www.sttriniansmovie.co.uk\n\nDistribuidora: Filmax\n\nProductora: Ealing Studios, Fragile Films\nSt. Trinian's, la famosa escuela para seÃƒÂ±oritas, se enfrenta de nuevo a una crisis econÃƒÂ³mica. El banco amenaza a la directora, Camilla Fritton (Rupert Everett), con clausurar el centro. Mientras, su poco ortodoxa doctrina de libre expresiÃƒÂ³n y enriquecimiento personal tambiÃƒÂ©n se encuentra en peligro por el nombramiento del nuevo ministro de EducaciÃƒÂ³n, Geoffrey Thwaites.\n\nAunque fue un antiguo amor de Camilla, en la actualidad el polÃƒÂ­tico estÃƒÂ¡ decidido a llevar la disciplina y el orden a la anÃƒÂ¡rquica academia. Pero las chicas de St. Trinian's juegan en su propia liga; son listas, no le temen a nada y estÃƒÂ¡n dispuestas a defender la escuela que aman a muerte. Los clanes de chicas que hasta ahora estaban enfrentados deberÃƒÂ¡n unirse y conseguir dinero rÃƒÂ¡pido.\n\nLa llamativa Kelly (Gemma Arterton), una de las cabecillas, une esfuerzos con la reciÃƒÂ©n llegada Annabelle (Talulah Riley) para juntar a un variopinto grupo de profesores, el diabÃƒÂ³licamente encantador Flash Harry y las resolutivas e implacables alumnas para cometer el robo del siglo.\n\nPlanean llevarse el famoso cuadro &quot;La joven de la perla&quot; del Museo Nacional delante de las narices de las autoridades. Pero, Ã‚Â¿podrÃƒÂ¡n sus artes femeninas y su mayÃƒÂºsculo descaro salirse con la suya el dÃƒÂ­a antes de que las autoridades desalojen la escuela para siempre? Todas las divertidas travesuras y la acciÃƒÂ³n a lo &quot;girl power&quot; de St. Trinian's, una de las instituciones mÃƒÂ¡s populares para el pÃƒÂºblico britÃƒÂ¡nico e internacional, regresan a la gran pantalla.\n","torrent":{"xt":"urn:btih:f8cf9a2137f6d3c5635be55378bce7c9e1cc0481","amp;dn":"Supercanyeras+%5BDVDRIP%5D%5BSpanish%5D%5B2009%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8cf9a2137f6d3c5635be55378bce7c9e1cc0481","infoHashBuffer":{"type":"Buffer","data":[248,207,154,33,55,246,211,197,99,91,229,83,120,188,231,201,225,204,4,129]},"announce":[],"urlList":[]}}