{"title":"Fairstars Recorder v3.27","uid":5150221,"size":4305251,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:f93fbf17857488e8efaee30d25e508f518a4ec08&amp;dn=Fairstars+Recorder+v3.27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fcjunkie","files":4,"time":1257516267,"description":"FairStars Recorder is a real-time audio recorder, offering professional recording features with full support for WMA, MP3, OGG, APE, FLAC and WAV formats. It allows you to record sound directly from your sound card, including from a microphone or a line-in jack at high quality. It can be used to grab any sound, including music, dialogs from movies, game sounds, streaming audio or anything else. The captured sound can be saved directly to WMA, MP3, OGG, APE or WAV format, without the need for temporary files. In addition, the program includes a ID3 tag editor and recording schedule. Additional features include silent skip (Silence Detector), file size limits, recording wizard, audio cutter and more.\n\nMain features:\n Record audio from sound card directly to WMA, MP3, OGG, APE, FLAC or WAV format with high quality.\n Record sound directly from plackback device (only for Vista).\n Real-time sound monitor before recording, easy to select record device and adjust the volume.\n Skip silent passages, stop recording or record to a new file automatically after a set time silence (Silent Detector).\n Stop recording or record to a new file automatically when reaching a set file length, size or time (File Limitation).\n Add files to File List automatially (File Append).\n Remove environmental noise automatically with the option Filters Setting.\n Support writing of ID3 tag when recording and showing when playback.\n Support ID3 tag view, import, edit, or transfer to the file in File List with TAG Editor and Tag Option.\n Recording Schedule for automatic recordings.\n Audio Cutter for cuting audio files.\n Easy Set feature for silent sensitivity.\n Recording Wizard for beginner.\n Easy-to-use user-friendly interface, and skin support.\n Record control with hotkeys","torrent":{"xt":"urn:btih:f93fbf17857488e8efaee30d25e508f518a4ec08","amp;dn":"Fairstars+Recorder+v3.27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f93fbf17857488e8efaee30d25e508f518a4ec08","infoHashBuffer":{"type":"Buffer","data":[249,63,191,23,133,116,136,232,239,174,227,13,37,229,8,245,24,164,236,8]},"announce":[],"urlList":[]}}