{"title":"The Dr Dunnegan tapes; New World Order of Barbarians","uid":5156045,"size":485819166,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fa3d5d0546dc3e631ef04a91c257926320158b7f&amp;dn=The+Dr+Dunnegan+tapes%3B+New+World+Order+of+Barbarians&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"john41q","files":1,"time":1257859673,"description":"Here is the full audio of the testimony of Dr Lawrence Dunnegan on the secret plans by the elite to exert worlwide population control.\nThe transcript of these audio files can be found at http://www.sweetliberty.org/nobarbarians1.htm\n\nDr Dunnegan was a paediatrician attending the 1969 spring session of the Pittsburgh Pediatric Society, which holds 4 meetings a year.\n\nAfter completing dinner, a lecture took place given by Dr Day, Chairman of the Department of Pediatrics at the University of Pittsburgh, who subsequently went to fill the position of Medical Director of Planned Parenthood Federation of America.\n\nTo the surprise of Dr Dunnegan, Dr Day began by asking nobody took notes or record the conversation, and that he wasn't to be quoted on anything he was about to reveal.\n\nThis was no medical subject, as one was accustomed at these reunions.\n\nThe subject was the survival of western civilisation, and the measures that would take place as to curve the population charts.\n\nDr Day explained he was infringing on the policy of keeping these measures secret, due in one part that the circumstances had reached a state nobody could prevent them ocurring, and due to the need of doctors not to be confused by the difficulties they were about to experience and for which they weren't trained.\n\nAt the same time Dr Dunnegan felt the speaker was having difficulties to come to terms with his future actions and was almost apologetic about it.\n\nIntrigued, he managed to take notes on napkins. \n\nIn his own words: \n&quot;The speaker did not speak in terms of retrospect, but rather predicting changes that would be brought about in the future. The speaker was not looking from the outside in, thinking that he saw conspiracy, rather, he was on the inside, admitting that, indeed, there was an organized power, force, group of men, who wielded enough influence to determine major events involving countries around the world. And he predicted, or rather expounded on, changes that were planned for the remainder of this century. &quot;\n\nAs the years would go by, he would realise a lot of things predicted that day , as strange as they appeared then, were taking place.\n\nHe thus decided to make a testimony to radio host Randy Engel, National Director, US Coalition for Life, in 1988.\n\nThere are four audio files ( high quality mp4, 400 kbs/sec); the first two are a monologue by Dr Dunnegan of his recolections.\n\nThe third is a conversation between him and Randy, the host of the show ( quality is a little problematic; i included a transcript for those needing it).\n\nThe fouth file is a Dr Dunnegan interview by Stanley Monteith lasting 55 min.\n\nEnjoy and disseminate far and wide.","torrent":{"xt":"urn:btih:fa3d5d0546dc3e631ef04a91c257926320158b7f","amp;dn":"The+Dr+Dunnegan+tapes%3B+New+World+Order+of+Barbarians","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa3d5d0546dc3e631ef04a91c257926320158b7f","infoHashBuffer":{"type":"Buffer","data":[250,61,93,5,70,220,62,99,30,240,74,145,194,87,146,99,32,21,139,127]},"announce":[],"urlList":[]}}