{"title":"Confessions-of-a-Shopaholic.2009.DVDrip[vice]","uid":5151054,"size":698610140,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fab96d6eeeeb16acf16366c40de962aaaabed832&amp;dn=Confessions-of-a-Shopaholic.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1257557205,"description":"COMEDY\nCONFESSIONS OF A SHOPAHOLIC DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 01:44:13\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCast\n\n* Isla Fisher as Rebecca Bloomwood\n* Hugh Dancy as Luke Brandon\n* Krysten Ritter as Suze Cleath-Stuart\n* John Goodman as Graham Bloomwood\n* Joan Cusack as Jane Bloomwood\n* John Lithgow as Edgar West\n* Kristin Scott Thomas as Alette Naylor\n* Leslie Bibb as Alicia Billington\n* Robert Stanton as Derek Smeathe\n* Lynn Redgrave as a Drunken Lady at Party\n* Julie Hagerty as Haley\n* Nick Cornish as Tarkie\n* Fred Armisen as Ryan Koenig\n* Wendie Malick as Miss Korch\n* John Salley as a D. Freak\nPlot\n\nA childhood memory begins the film, as Rebecca's mother buys her brown shoes that will last forever but aren't fashionable, while other girls get cute fashionable shoes. They laugh at her mundane shoes, and Rebecca feels unworthy. She sees a lady using a credit card and is fascinated by them, coveting one.\n\nNow, Rebecca Bloomwood (Isla Fisher), living with her best friend Suze Cleath-Stuart (Krysten Ritter), has moved to Manhattan to get involved in the New York City magazine world. She has several credit cards, and a shopping addiction. She's a journalist for a gardening magazine but her dream is to join the fashion magazine &quot;Alette&quot;. Unfortunately, when Rebecca gets to her &quot;Alette&quot; interview the male receptionist informs her that the job has been filled by Alicia Billington. He advises her to join another of several other magazines owned by the corporation, Dantay West and make her way up to &quot;Alette&quot; since the company likes to promote from within. He tells her there are interviews being held at Successful Savings.\n\nOn the way to her second interview, she is distracted by a Denny &amp; George sale, eventually buying a green scarf. Her credit card is declined and sale items cannot be held so Rebecca races to the nearest hot dog stand offering to buy all the hot dogs if the seller gives her back change in cash. Rebecca lies, saying its a gift for her sick Aunt Ermintrude. Finally a man offers her $20. When she interviews with Luke Brandon (Hugh Dancy), the editor of Successful Saving, she realises he is the man from who loaned her $20. Whilst he talks on the phone, she hides her scarf in a cubicle outside his office. The interview doesn't go well, when he asks her why she chose to learn Finnish fluently and about the current fiscal crisis. She tries to distract him without any success. Luke's assistant Hayley comes into the room and tells Rebecca that she dropped her scarf. Rebecca knows her game is up and leaves the interview.\n\nFrustrated by her lack of success, she and Suze write drunken letters to Alette and Successful Saving, but she posts each to the wrong magazine. Nevertheless, Luke Brandon hires her. Then, rather than completing a work assignment, she goes to a clothing sale. When examining an expensive cashmere coat, it gives her inspiration for her column, calling herself &quot;the Girl in the Green Scarf&quot;. Impressed Luke invites her to a conference in Miami and an important ball. At a restaurant Alicia (Leslie Bibb), asks Luke to the ball, leaving Rebecca feeling dejected. In Miami, Rebecca says her credit collector, Derek Smeath is actually her stalker when he attempts to reach her throughout the film.\n\nRebecca returns home to confrontations with Smeath, so her roommate Suze makes her join Shopaholics Anonymous. The class leader, Miss Korch (Wendie Malick), forces her to sell all the clothes she just bought, including her maid of honor dress for Suze's wedding and a dress she purchased for a TV show interview for her now famous columns as &quot;The Girl in the Green Scarf&quot;. She offers to buy back both dresses from the charity store she was forced to donate to, but can only afford one, and chooses the TV interview dress. During her live TV interview, Rebecca is publicly outed and accused of not paying her debts by Derek Smeath, and consequently loses her job.Luke also breaks up with her after he finds out that she lied to him this whole time. Suze is also angry when she finds out that Rebecca sold her bridesmaid dress, and doesn't let her back into the apartment.\n\nRebecca is then back at her parents house when Allette herself appears to offer her a position at the fashion magazine as a new columnist, writing about bargain sales. While this had been Rebecca's initial plan, she says that she'd be making another mistake by influencing women to keep shopping for high-end clothes. She rejects the offer, and then decides to sell most of her wardrobe in an auction-style format to pay off her debts. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1093908/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1093908/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:fab96d6eeeeb16acf16366c40de962aaaabed832","amp;dn":"Confessions-of-a-Shopaholic.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fab96d6eeeeb16acf16366c40de962aaaabed832","infoHashBuffer":{"type":"Buffer","data":[250,185,109,110,238,235,22,172,241,99,102,196,13,233,98,170,170,190,216,50]},"announce":[],"urlList":[]}}