{"title":"Muller-November-Revolution 1918(how Germans lost WW1)(1978)","uid":4994987,"size":215925,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb1d944a7c2aacd1ec474a97f6f9cb53abf9a621&amp;dn=Muller-November-Revolution+1918%28how+Germans+lost+WW1%29%281978%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"red_gonzo","files":1,"time":1247235902,"description":"For english-only speaking:\nThis book is in german language. English title would be: November revolution 1918 - Betrayal or a legend of betrayal? (1978). Did the Germans loose World War 1 because of inside revolutionary forces instigated a gigantic betrayal or was it all just a myth as it taught in schools? Gerhard Muller puts history back to facts as he explains how the revolutionaries inside Germany managed to force the Wehrmacht to lay down their weapons and face the humilliating defeat and Versailles treaty. Called the November revolution 1918 it created the necessary atmosphere that later led straight to World war 2. Find out the hidden history behind the German defeat in World war 1. 55 pages.\n\nFur Deutschsprachige:\n60 Jahre nach der Revolution in Deutschland am Ende des 1. Weltkrieges am 9.11.1918 wird in den Schulen der Bundesrepublik Deutschland nach wie vor den SchÃƒÂ¼lern im Unterricht gelehrt, der angebliche &quot;DolchstoÃƒÅ¸&quot; in den RÃƒÂ¼cken des deutschen Heeres im November 1918 sei eine bloÃƒÅ¸e Legende. Ist dies richtig oder wird hier die Geschichte falsch dargestellt? Wurde der 1. Weltkrieg (1914-1918) von Deutschland und seinen VerbÃƒÂ¼ndeten deswegen verloren, weil revolutionÃƒÂ¤re KrÃƒÂ¤fte in der Heimat dem kÃƒÂ¤mpfenden Heer in den RÃƒÂ¼cken gefallen waren und dadurch dem Heer die Waffen aus der Hand geschlagen und so die Voraussetzungen fÃƒÂ¼r das Diktat von Versailles (Versailler Friedensvertrag vom 28. 6. 1919) geschaffen hatten - Ansicht der Vertreter des &quot;DolchstoÃƒÅ¸es&quot; - oder war die Revolution vom 9.11.1918 nur die Folge und nicht die Ursache des militÃƒÂ¤risch verlorenen Krieges - Ansicht der Vertreter der &quot;DolchstoÃƒÅ¸legende&quot;? Diese Frage, die in der Weimarer Republik zu heftigen Auseinandersetzungen innerhalb der Parteien fÃƒÂ¼hrte und durch die die junge Republik stark erschÃƒÂ¼ttert wurde, ja die eine der Todesursachen der Weimarer Republik ist, soll hier an Hand von Selbstzeugnissen fÃƒÂ¼hrender PersÃƒÂ¶nlichkeiten der damaligen Zeit, von Berichten und Tatsachen untersucht werden. Da die Revolution vom November 1918 untrennbar mit dem 1. Weltkrieg verbunden ist, muÃƒÅ¸ hier auch auf die Vorgeschichte und damit auf die Ursachen bzw. die Urheber des 1. Weltkrieges nÃƒÂ¤her eingegangen werden, damit der Leser die Frage des &quot;DolchstoÃƒÅ¸es&quot; bzw. der &quot;DolchstoÃƒÅ¸legende&quot; richtig beurteilen kann. Bekanntlich vergiften nichts so sehr das VerhÃƒÂ¤ltnis der VÃƒÂ¶lker untereinander und gefÃƒÂ¤hrden den Frieden mehr als Lug und Trug! 55 Seiten.\n","torrent":{"xt":"urn:btih:fb1d944a7c2aacd1ec474a97f6f9cb53abf9a621","amp;dn":"Muller-November-Revolution+1918%28how+Germans+lost+WW1%29%281978%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb1d944a7c2aacd1ec474a97f6f9cb53abf9a621","infoHashBuffer":{"type":"Buffer","data":[251,29,148,74,124,42,172,209,236,71,74,151,246,249,203,83,171,249,166,33]},"announce":[],"urlList":[]}}