{"title":"Rebuttal of Geert Wilders' FITNA - Fitna of Conte","uid":5142407,"size":152892019,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:fcc2616d04144c02595ee956b636527cdaf52025&amp;dn=Rebuttal+of+Geert+Wilders%5C%27+FITNA+-+Fitna+of+Conte&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ramlibin","files":1,"time":1257018051,"description":"Dutch politician Geert Wilders in his movie FITNA, quoted Quran out of its historical context to label it as a book of violence. Any person bearing common sense can understand the covert deceit of Geert Wilders.\n\nFITNA cites 5 Quranic verses out of context and synchronously shows terrorist attacks, which meant at misleading the viewer that terror attacks are obsessed by Quran. \n\n'The Rebuttal of Fitna' is the precise refutation of Geert's FITNA. \n\nIt has got 3 parts; the first part refutes the accusations regarding Quran, the whole explanation of the first part was given by Muhaddith.org, later it was video edited with an extra clarification about the Arab Child, who was shown in FITNA, calling Jews as Pigs and Apes.\n\nSecond part shows biblical incitation of violence and hatred toward non-Jews; it also shows the instilled hatred of Jews and Christians against Muslims. \n\nThird part shows the atrocities against Muslims throughout the Globe; the tortured death of Muslims in the name of establishing peace.\n\n\nNote: No single video in this film was personally shot; everything was taken from the popular documentaries and videos.\n","torrent":{"xt":"urn:btih:fcc2616d04144c02595ee956b636527cdaf52025","amp;dn":"Rebuttal+of+Geert+Wilders%5C%27+FITNA+-+Fitna+of+Conte","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcc2616d04144c02595ee956b636527cdaf52025","infoHashBuffer":{"type":"Buffer","data":[252,194,97,109,4,20,76,2,89,94,233,86,182,54,82,124,218,245,32,37]},"announce":[],"urlList":[]}}