{"title":"Incognito-RELOADED","uid":6431917,"size":1977351126,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fd98d1832a103c0ca12ce73626b878a89ec7fe42&amp;dn=Incognito-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":42,"time":1306684393,"description":"\n          Incognito Complete Bundle (c) Magrathean Technologies\n\n\n\n     05/2011 :..... RELEASE.DATE .. PROTECTION .......: Activation\n\n           1 :.......... DISC(S) .. GAME.TYPE ........: Indie/Misc.\n\n\n\n\n\nIncognito: Episode 1\n\n\n\nJohn Smith (generic name, you can choose your own) is a man in trouble. He's\n\nlost everything he has in the Stock Market, his house is in danger of being\n\nwashed away due to erosion. All he has is a life insurance policy. Depressed\n\nand despondent, he decides to end it all. Climbing to the top of his office\n\nbuilding. A split second before he hits the ground, a wormhole opens up, and\n\nhe vanishes! John awakens in a strange place. It's clearly a high-tech\n\nworld, but he can't read any of the writing or understand the language he's\n\nhearing. What's going on; is he dead and in Hell\n\n\n\nIncognito is meant to deliver simplified versions of gameplay from different\n\ngenres and bring them together into a game that's epic in scale and requires\n\ndifferent genre skills but is easy for the average hardcore gamer to jump\n\ninto and play from beginning to end.\n\n\n\nThese genres change at each &quot;zoom level&quot; of the game:\n\n\n\n* When you're on foot, it's a First-Person Shooter with RPG elements\n\n* When you're in your ship, it's a Space Trading/Combat Simulation\n\n* When you're in low orbit of a planet, it's a Simple Real-Time Strategy\n\n Game\n\n* When you're in your hovertank, it's a Tank Combat Game\n\n\n\nIn order to progess through each Episode, you'll have to conquer challenges\n\nat each level, gathering information on foot, exploring in your ship,\n\nlanding onuninhabited planets and establishing bases, and on hostile\n\nplanets, invading a planet's surface defenses in the hovertank.\n\n\n\n\n\nIncognito: Episode 2\n\n\n\nAt the beginning of Episode Two, we recap up to the point where Nick the\n\nNose is about to shoot John (the player). The turrets quickly dispatch the\n\nartificial life from of Nick the Nose. If John decides to help HEIDI, she\n\ninforms him that she's hiding in the wake of a black hole to avoid detection\n\nfrom her several enemies. This requires access to a rare element, but when\n\nJohn gets to a planet carrying it, EVERY planet carrying it, he gets an\n\nautomatic e-mail message from a man called Drequexius.\n\n\n\nDreque proposes to the player (John) that maybe, they are not on the right\n\nside. He tells them that HEIDI is a living war; she's all four horsemen in\n\none. Dreque then offers a face to face conversation aboard his private\n\nwarship, giving the needed coordinates. HEIDI instantly replies and tells\n\nthe player the direct opposite and that Dreque is a betrayer, a liar, and a\n\ncoward. If they want to see the real truth of her history, go to and\n\ninfiltrate the Sector 42 Alliance Data Record Banks.\n\n\n\nSo, at this point, John can visit Dreque, try to kill him or join him, go to\n\nget the historical data and the SuperTank blueprints, or try to muscle his\n\nway passed Dreque's defenses without the SuperTanks, through sheer numbers\n\nor by superior strategy. If John believes HEIDI, he has to go to the Sector\n\n42 Alliance records building; he can either fight his way inside, or sneak\n\nin.\n\n\n\n* If John agrees to join him, he'll tell John to pretend to continue helping\n\n her, so that he can plant another EMP inside HEIDI, as it is her only true\n\n     weakness.\n\n* This requires access to a rare element, but when John gets to a planet\n\n carrying it, EVERY planet carrying it, he gets an automatic e-mail message\n\n from a man called Drequexius.\n\n* The most well-developed political alliance at the time, the Sector 42\n\n Alliance, fought her on the grounds that she was breaking Prime Directive\n\n     non-interference laws.\n\n\n\n\n\nIncognito: Episode 3\n\n\n\nThe Incognito story continues in Episode 3!\n\n\n\nThe old man has been taken prisoner and HEIDI the artificial intelligence\n\nthat brought him to Sector 42 is assumed destroyed. All of this is because\n\nof the relentless Sector 42 Alliance refusing to step down from well\n\nestablished seats of power. A rescue attempt is being staged as we speak,\n\nbut by whom  Contract killers and mercenaries from all sectors flock at the\n\nopportunity as news spreads about a job to go against the alliance itself.\n\nThe Alliance knew this would happen, and is already transporting the\n\nearthling to one of their most secure prison ships for questioning about\n\nhis involvement with the AI known as HEIDI. The race is on, who will you\n\nchoose to rescue the old man  Will you sneak in  Or will you blast your way\n\nin  You decide!\n\n\n\nIncognito is meant to deliver simplified versions of gameplay from different\n\ngenres and bring them together into a game that's epic in scale and requires\n\ndifferent genre skills but is easy for the average hardcore gamer to jump\n\ninto and play from beginning to end.\n\n\n\nIn order to progress through each Episode, you'll have to conquer challenges\n\nat each level, gathering information on foot, exploring in your ship,\n\nlanding on uninhabited planets and establishing bases, and on hostile\n\nplanets, invading a planet's surface defenses in the hover-tank.\n\n\n\n\n\n1. Unrar.\n\n2. Burn or mount the image.\n\n3. Install the game.\n\n4. Check the /Crack dir on the DVD.\n\n5. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:fd98d1832a103c0ca12ce73626b878a89ec7fe42","amp;dn":"Incognito-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd98d1832a103c0ca12ce73626b878a89ec7fe42","infoHashBuffer":{"type":"Buffer","data":[253,152,209,131,42,16,60,12,161,44,231,54,38,184,120,168,158,199,254,66]},"announce":[],"urlList":[]}}