{"title":"DRAG-ME-TO-HELL.2009.DVDrip[vice]","uid":5138360,"size":672085141,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fd9a2323546deaac28d9a04d633b8de9367b35d8&amp;dn=DRAG-ME-TO-HELL.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vicerock","files":-1,"time":1256682839,"description":"DRAG ME TO HELL DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 720x480[full screen]\nruntime 98:51mins\nvideo bitrate 768\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\ncast\n\nAlison Lohman\nJustin Long\nLorna Raver\nDileep Rao\nAdriana Barraza\nDavid Paymer\nReggie Lee\n\nPlot\n\nIn 1969, Pasadena, California, a young couple rush to the mansion of wealthy medium Shaun San Dena (Flor de Maria Chahua). Their son had stolen a necklace from a wagon of gypsies three days prior, and has been complaining about seeing and hearing creatures. San Dena tries to help the boy in a seance, but she and the boy's parents are attacked by an unseen force, leading to the death of the boy. The boy is grabbed by several demons and pulled right into hell in front of San Dena.\n\nIn Los Angeles, California, in 2009, loan officer Christine Brown (Alison Lohman) hopes to be promoted to assistant manager over her co-worker Stu Rubin (Reggie Lee). Her boss, Mr. Jacks (David Paymer) advises her to demonstrate that she can make tough decisions to get this job. Christine is constantly thwarted by Stu, who attempts to show Christine as incompetent to Mr. Jacks. Christine is later visited at the bank by Sylvia Ganush (Lorna Raver) who asks for a third extension on her mortgage. To prove herself to Mr. Jacks, Christine denies Ganush the extension. Ganush resorts to begging for help when Christine calls for security. Security guards escort Ganush out with Mr. Jacks complimenting Christine on how she handled the situation.\n\nUpon leaving the bank, Christine is attacked in her car by Ganush. After a violent struggle, Ganush removes a button from Christine's jacket and uses it to place a curse on Christine. Later, Christine's boyfriend, Clay Dalton (Justin Long), tries to comfort her. They pass a fortune teller's store, where they meet the fortune teller Rham Jas (Dileep Rao), who tells Christine that she is being haunted by an evil spirit. Alone at home, Christine is attacked by the dark spirit causing minor injuries. and has dreams about Mrs.Ganush attacking her in bed. At work the next day, she has a nosebleed, soaking Mr. Jacks in blood. Fleeing work, Christine tries to find Ganush at the home of her granddaughter Ilenka (Bojana Novakovic). Christine learns that Ganush died the previous night, and Ilenka is in the process of holding a memorial service for her. Christine returns to Rham Jas, who explains that the spirit haunting her is a powerful demon called the Lamia that will torment for three days before taking her to Hell. Rham Jas suggests a sacrifice to appease the demon, which leads to Christine killing her pet kitten. At a dinner party with Clay and his parents, Christine is still tormented by the Lamia, which frightens the Daltons.\n\nFurther attacks from Ganush persist, which lead to Christine and Clay deciding to pay $10,000 to enlist the help of the powerful medium Shaun San Dena (Adriana Barraza). San Dena prepares a sÃƒÂ©ance, to trap the Lamia's spirit in a goat and kill it, vanquishing the spirit. This plan fails as the Lamia attacks Rham Jas and Christine vowing that it will not rest until it takes Christine's soul to Hell. San Dena banishes the Lamia from the seance, but dies in the process. Rham Jas then tells Christine the only way to get rid of the curse is to give the cursed item to someone as a gift, thereby passing the curse on to that person. Christine seals the button in an envelope but during a car journey with Clay she mixes it up, accidentally, with a number of other letters before managing to retrieve it. Trying to find a recipient, Christine eventually decides to give the button to Ganush. Christine drives to the cemetery where she digs up Ganush's grave. In a torrential downpour, Christine jams the envelope in Ganush's mouth. The next day, Christine goes to Los Angeles Union Station to meet Clay, where they plan to spend a weekend in Santa Barbara. As the train approaches, Clay gives her the envelope with the button in it saying she had dropped it in his car. Christine then realises she mixed up envelopes in the car the night before. Horrified, Christine falls on the train tracks as a train barrels towards her. Before the train hits her, demonic hands rise from a fiery hole in the ground. Clay watches in horror as she is dragged beneath the train, to hell.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1127180/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1127180/&lt;/a&gt;\n\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:fd9a2323546deaac28d9a04d633b8de9367b35d8","amp;dn":"DRAG-ME-TO-HELL.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd9a2323546deaac28d9a04d633b8de9367b35d8","infoHashBuffer":{"type":"Buffer","data":[253,154,35,35,84,109,234,172,40,217,160,77,99,59,141,233,54,123,53,216]},"announce":[],"urlList":[]}}