{"title":"Ghost(1990)DVDRip.AC3(ENG)-DROCK","uid":6355099,"size":733197888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:febf03555c7b76e026f3bf066e8d2cca0f860288&amp;dn=Ghost%281990%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1304125254,"description":"An interesting hybrid of popular film genres, Ghost showcases the talents of its entire cast. While out on the town one evening, New York couple Sam (Patrick Swayze) and Molly (Demi Moore) are confronted by a mugger. After submitting to his demands, Sam is murdered anyway. He then finds himself a disembodied spirit, invisible to the living world, wandering without hope until he finds a spiteful spirit aboard the subway (Vincent Schiavelli) who gives him some helpful pointers on how to co-exist. Soon Sam comes back into contact with those he knew in life, and he begins to learn piece-by-piece of his close friend and co-worker Carl's (Tony Goldwyn) embezzling plot which caused his death; the apparent mugging was, in fact, a premeditated murder. In the meantime, Carl has designs on Molly, and Sam is determined to extract revenge. He contacts a psychic (Whoopi Goldberg), and together, the two set out to serve justice and stop the maniacal Carl from getting to Molly. Blending comedy, romance, action, and horror, Ghost was a box-office smash and managed to garner five Academy Award nominations, including &quot;Best Picture,&quot; &quot;Best Supporting Actress&quot; (Goldberg), &quot;Best Original Screenplay,&quot; &quot;Best Editing,&quot; and &quot;Best Score&quot;; Goldberg won her first Oscar.\n\nRipped with Handbrake.\n\nLength: 2 Hours 6 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:febf03555c7b76e026f3bf066e8d2cca0f860288","amp;dn":"Ghost%281990%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"febf03555c7b76e026f3bf066e8d2cca0f860288","infoHashBuffer":{"type":"Buffer","data":[254,191,3,85,92,123,118,224,38,243,191,6,110,141,44,202,15,134,2,136]},"announce":[],"urlList":[]}}