{"title":"Arrancame La Vida DVDRip Spanish-Latino 2008","uid":4994777,"size":903648545,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ff050d9823f1db8063e044d06199e6e1bf413c8a&amp;dn=Arrancame+La+Vida+DVDRip+Spanish-Latino+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":3,"time":1247226067,"description":"Entre un mundo de polÃƒÂ­tica, corrupciÃƒÂ³n, adulterio, asesinato y amor se desarrolla ArrÃƒÂ¡ncame la vida. Es la historia de AndrÃƒÂ©s Ascencio y Catalina GuzmÃƒÂ¡n, de su relaciÃƒÂ³n amorosa, de las relaciones y el poder entre hombres y mujeres, de los cÃƒÂ³mplices del poder.\n\nEs la historia de una mujer que busca la libertad en una Puebla machista de 1930. Catalina encuentra en AndrÃƒÂ©s, un hombre simpÃƒÂ¡tico y poderoso, una vÃƒÂ­a para salir de su pequeÃƒÂ±o mundo, de acceder a cosas mÃƒÂ¡s a la medida de su curiosidad y sus ganas de vivir. Pero muy pronto descubre que al haber ligado su vida a la de AndrÃƒÂ©s, tambiÃƒÂ©n estÃƒÂ¡ perdiendo su libertad. Y en AndrÃƒÂ©s encuentra un difÃƒÂ­cil adversario, sobre todo porque AndrÃƒÂ©s es en todo momento seductor, generoso y protector. Catalina tiene que vencer antes que nada su propia fascinaciÃƒÂ³n por el personaje que es AndrÃƒÂ©s, por todo lo que le trae a su vida.\n\nPero Catalina ha dejado de estar feliz con AndrÃƒÂ©s. EstÃƒÂ¡ creciendo, descubriendo el mundo y de pronto se da cuenta de que no es libre, de que quiere serlo. Pero liberarse de ese hombre tan poderoso en el MÃƒÂ©xico de 1930 es poco menos que imposible. Cuando Catalina trata de huir, AndrÃƒÂ©s le impide llevarse a sus hijos, la hace seguir. Catalina se da cuenta de su impotencia ante AndrÃƒÂ©s. Catalina empieza a vivir como mujer cuando entra al Palacio de Bellas Artes y conoce al director de la orquesta, Carlos Vives. Vives es la contraparte de AndrÃƒÂ©s. Vives es moral, casi idealista, joven, guapo, aunque tambiÃƒÂ©n ambicioso. Y Vives trata a Catalina como un igual. Catalina ve con ÃƒÂ©l lo que pudo haber sido su vida, lo que aÃƒÂºn podrÃƒÂ­a ser. Pero Vives tambiÃƒÂ©n quiere el poder, aunque lo quiera por causas legÃƒÂ­timas. AndrÃƒÂ©s descubre en Vives a un rival (tanto en lo polÃƒÂ­tico como con su mujer), y lo manda matar sin aspavientos, como se deshace de todo aquel que le estorba. Y no es hasta que Catalina sufre en carne propia las consecuencias de ese poder arrollador, que decide que no puede seguir siendo cÃƒÂ³mplice y vÃƒÂ­ctima de ese poder.  ","torrent":{"xt":"urn:btih:ff050d9823f1db8063e044d06199e6e1bf413c8a","amp;dn":"Arrancame+La+Vida+DVDRip+Spanish-Latino+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff050d9823f1db8063e044d06199e6e1bf413c8a","infoHashBuffer":{"type":"Buffer","data":[255,5,13,152,35,241,219,128,99,224,68,208,97,153,230,225,191,65,60,138]},"announce":[],"urlList":[]}}