{"title":"3 Don Bluth Laserdisc Arcade Games with Daphne 1.0.0-PC","uid":4992452,"size":4550610944,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ff3781831e9cd6ce1fa4fc353172baa3a698db0e&amp;dn=3+Don+Bluth+Laserdisc+Arcade+Games+with+Daphne+1.0.0-PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"BioNerd17","files":1,"time":1247110978,"description":"This torrent is for those of you who want to play the 1980's Don Bluth laserdisc arcade games, emulated on your PC.  The three games included are Dragon's Lair, Space Ace, and Dragon's Lair II: Time Warp.\n\nThis DVD .iso image contains The Daphne emulator (version 1.0.0), encoded audio/video for all 3 games, and some quick batch files that are ready to run to get you going fast.  This means you don't have to worry about downloading the audio and video from Digital Leisure (which you can do legally with Daphne if you've bought their products).  It also means you don't have to worry about converting and encoding the video yourself from other sources using some of the freebie tools out there.  This has already been done using the NTSC 20th Anniversary DVD-video boxed set.  All you have to do is run Daphne!\n\nFor each game there are both windowed and fullscreen batch files.  Each game uses the most recent ROM images as released by Cinematronics/Starcom/Leland.  In addition, for Dragon's Lair and Space Ace, an optional &quot;enhanced&quot; version of the game is available which changes the game a little bit for a whole new gaming experience.  Hidden, extended, and reordered scenes are available for play if you use those ROMs.\n\nTo use:\n\n1.  Burn the .iso file to a DVD using the burning software of your choice (Nero recommended).  Alternately, mount the .iso image as a virtual drive using Daemon Tools or similar software.\n\n2.  Run any of the .bat files at the root of the disc.  The chosen game will boot.  Be patient, it takes a minute or two to reach the attact mode so you can start adding credits.\n\n3.  Press 5 to add credits (put coins in the machine).  Press 1 or 2 to start the game.\n\n4.  If you're playing Space Ace, Use /, *, and - on the keypad to choose cadet, captain, or ace skill levels after starting the game (while it's beeping).\n\n5.  Once the game starts, use the arrow keys and the left Ctrl key to move and use your weapon.\n\n6.  If you are dying a lot, you can find move lists online.  When in doubt, follow the flashes!\n\n7.  If you're playing Dragon's Lair II, hold the sword button and press the 9 key to enter the diagnostic menus.\n\n8.  Press ESC to quit the emulator.  It takes a minute for it to completely close, be patient.\n\nIf you are having problems with the video playing smoothly, don't play the games from your physical DVD drive.  Copy the files to your local hard drive and run it from there instead.  You'll probably want to do that anyway if you plan on tweaking the dipswitch settings and whatnot.  You can mount the .iso as a virtual drive with Daemon Tools or similar software and that works great, too. \n\nPLEASE DO NOT POST HERE FOR HELP GETTING THIS TO WORK.  It works for me, and that's all I care about.  I spent a lot of time figuring out how to use Daphne and getting all the audio/video into the right format.  Your mileage may vary.  Google your problem.  Read the help files.  Experiment.  Just leave me alone.\n\nThis download takes a long time, doesn't it?  So please seed when you are done downloading.  This is a large file.  And if you truly enjoy these games, please purchase them from Digital Leisure, they are worth every penny and all of them are now available in hi-def Blu-Ray too!\n\n[If you have audio and video files for other laserdisc games that work with Daphne, please upload...]\n","torrent":{"xt":"urn:btih:ff3781831e9cd6ce1fa4fc353172baa3a698db0e","amp;dn":"3+Don+Bluth+Laserdisc+Arcade+Games+with+Daphne+1.0.0-PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff3781831e9cd6ce1fa4fc353172baa3a698db0e","infoHashBuffer":{"type":"Buffer","data":[255,55,129,131,30,156,214,206,31,164,252,53,49,114,186,163,166,152,219,14]},"announce":[],"urlList":[]}}