{"title":"Lets Talk (2002)","uid":5165909,"size":1464399194,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ffc0a1c12d50f6ecdcda2677b8b1524bf0066098&amp;dn=Lets+Talk+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"arthoheen","files":1,"time":1258402765,"description":"Radhika Sareen is 33, married and pregnant with a baby that is not her husband's. When she imagines telling that to her husband Nikhil, there are eight possible emotions he could go through:\n \nPain: After nearly eight years of being married, losing a baby and raising another, Nikhil would have discovered his wife is having an affair with their interior decorator Krish. Their world now in pieces, all the hurt and love in the past does not exist anymore. Nikhil would cry for what is lost and what  could have been.      \n\nDisbelief: She could not possibly be having an affair with Krish. He is 'short;' has an accent. It is unimaginable that his wife could be having an affair with such a man.\n\nDenial: His wife having an affair? Can't be be true. She is 33, a bored housewife watching too many soaps; she must be making it all up. She can't 'prove' she is having an affair, so she probably isn't. In fact, he would suggest that she have the baby, get a DNA test and prove that he has been right all along: his wife is bored and deluded.\n\nHumour: Maybe he could meet some underworld guy and put a supari out on the interior decorator. Meeting the bhais would be fun. Always quick to make his wife laugh, Nikhil would possibly do a take-off on his rendezvous with the Bhai.\n\nJealousy: Why would his wife want to have an affair? No one can be better than him, especially in bed. And that is what he will prove to her. He will also not be beyond making up absurd stories of him having an affair with her sister\n\nIrrationality: Maybe he would ask her what she wants in the future and then try to convince her that Krish is not the right choice because he is not jumping to marry her immediately.\n\nUnderstanding: Now that their marriage has fallen apart, maybe Nikhil would understand. He could try to talk to her, convince her to not walk out, give it another chance and urge her to think of old times like when he used to sing to her.\n\nAnger: She brings the worst out in him. She turns him into the devil himself. And that rage could culminate in physical violence against her.  \n\nLike the different rasas or the moods in classical Indian dance, Let's Talk explores different emotions in response to a single situation. The difference here is that all are played out only in Radhika's mind.  \n\nThe structure: Let's Talk does not have a story. Its structure is inspired from another of the art forms, the thumri where a single line is sung over and over again in a different moods and emotions. In Let's Talk the different renditions of a single line, Balamwa tum kya jano preet (O my beloved, what do you know of love?) punctuate each reaction in Radhika's imagination.  Digitally shot in two rooms, it has just two characters. It only seeks to explore Radhika's mind in a particular scenario.  \n\nThe verdict:  Let's Talk explores the limits of Indian cinema. It experiments with everything -- the structure, performances, technique and plot.  It twists almost every rule of conventional filmmaking and churns out a funny yet emotional story, despite not having one in the first place.\n\nRip specs:\n\nFile Name .........................................: Lets.Talk.2002.~2CD.XviD.AC3.DDR.avi\nFile Size (in bytes) ............................: 1,464,399,194 bytes\nRuntime ............................................: 1:33:55\n\nVideo Codec ...................................: XviD ISO MPEG-4\nFrame Size ......................................: 704x384 (AR: 1.833)\nFPS .................................................: 25.000\nVideo Bitrate ...................................: 1695 kb/s\nBits per Pixel ...................................: 0.251 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x2000 (Dolby AC3) AC3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 384 kb/s [6 channel(s)] CBR\nNo. of audio streams .......................: 1 \n\nThanks to the original ripper.","torrent":{"xt":"urn:btih:ffc0a1c12d50f6ecdcda2677b8b1524bf0066098","amp;dn":"Lets+Talk+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffc0a1c12d50f6ecdcda2677b8b1524bf0066098","infoHashBuffer":{"type":"Buffer","data":[255,192,161,193,45,80,246,236,220,218,38,119,184,177,82,75,240,6,96,152]},"announce":[],"urlList":[]}}